[{"slug":"client-services-manager-stuttgart-246920","company_name":"eFLY Marketplace Services GmbH","title":"Client Services Manager (m\/w\/d)","description":"In the role of Client Services Manager, you will drive the Amazon advertising strategies of tomorrow together with our customers. As a rapidly growing Amazon marketing agency in the heart of Stuttgart, we are looking for individuals who take on responsibility and want to become the best in their field. The rapid development of our company gives you a lot of freedom to help shape structures, develop new processes and significantly advance our company. You are the contact person and strategic advisor to the outside world and your commitment ensures maximum customer satisfaction. Internally, you will develop marketing strategies together with the team and take care of their implementation. We are looking for ambitious individuals who would like to get started with us. Sounds good? Then read on now!TasksYou are the central contact person for customers from different industriesDevelopment and implementation of innovative advertising strategies for various Amazon retailersConception and monitoring of the advertising presence of our existing customers on AmazonIn addition to your work with customers, you also contribute to optimizing internal processes and further developing eFlyYou are in Regular exchange with our performance team, with whom you will develop new marketing strategies together. Participation in events and trade fairs. Qualifications. Very good communication skills. Experience in this professional field, ideally in connection with Amazon Further training on Amazon advertising strategies High interest in working in a young, dynamic team Very good knowledge of spoken and written GermanBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation: https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz : https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com \/moritz\\_\\_heller\/We look forward to seeing you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/client-services-manager-stuttgart-246920","tags":["Marketing and Communication"],"job_types":["Traineeship"],"location":"Stuttgart","created_at":1702684143000,"original_language":"deu"},{"slug":"praktikum-digital-marketing-manager-stuttgart-423446","company_name":"eFLY Marketplace Services GmbH","title":"Praktikum Digital Marketing Manager (m\/w\/d)","description":"In the role of Digital Marketing Manager, you calculate and control our customers' advertising budgets. The goal is to achieve the best possible visibility within a given budget. In order to communicate the progress of the work to the customer, evaluations are created regularly. The positioning of the products in the desired advertising spaces also plays a major role here. Tasks Development of SEA strategies with our account managers and control and expansion of the advertising potential of Amazon Keyword research and on- and off-page analysis and optimization Optimal exploitation of campaign potential Creation of analyzes and derivation of measures for Further development of campaigns using analysis tools Development of reports to document the results for the customer Dealing with Amazon Seller Central Optimization of PPC prices taking into account previously defined strategies Qualification Independent work High comprehension and quick familiarization with new subject areas Team and communication skills Analytical understanding and affinity for numbers Structured in written and oral CommunicationVery good knowledge of Excel and PowerPointBenefitsWe are looking for people who take responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/praktikum-digital-marketing-manager-stuttgart-423446","tags":["Marketing and Communication"],"job_types":["Internship"],"location":"Stuttgart","created_at":1702684143000,"original_language":"deu"},{"slug":"praktikum-marketing-performance-manager-stuttgart-95616","company_name":"eFLY Marketplace Services GmbH","title":"Praktikum Marketing Performance Manager (m\/w\/d)","description":"In the role of Marketing Performance Manager, you calculate and control our customers' advertising budgets. The goal is to achieve the best possible visibility within a given budget. In order to communicate the progress of the work to the customer, evaluations are created regularly. The positioning of the products in the desired advertising spaces also plays a major role here. Tasks Development of SEA strategies with our account managers and control and expansion of the advertising potential of Amazon Keyword research and on- and off-page analysis and optimization Optimal exploitation of campaign potential Creation of analyzes and derivation of measures for Further development of campaigns using analysis tools Development of reports to document the results for the customer Dealing with Amazon Seller Central Optimization of PPC prices taking into account previously defined strategies Qualification Independent work High comprehension and quick familiarization with new subject areas Team and communication skills Analytical understanding and affinity for numbers Structured in written and oral CommunicationVery good knowledge of Excel and PowerPointBenefitsWe are looking for people who take responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/praktikum-marketing-performance-manager-stuttgart-95616","tags":["Marketing and Communication"],"job_types":["Internship"],"location":"Stuttgart","created_at":1702684143000,"original_language":"deu"},{"slug":"praktikum-performance-marketing-manager-stuttgart-175617","company_name":"eFLY Marketplace Services GmbH","title":"Praktikum Performance Marketing Manager (m\/w\/d)","description":"In the role of Performance Marketing Manager, you calculate and control our customers' advertising budgets. The goal is to achieve the best possible visibility within a given budget. In order to communicate the progress of the work to the customer, evaluations are created regularly. The positioning of the products in the desired advertising spaces also plays a major role here. Tasks Development of SEA strategies with our account managers and control and expansion of the advertising potential of Amazon Keyword research and on- and off-page analysis and optimization Optimal exploitation of campaign potential Creation of analyzes and derivation of measures for Further development of campaigns using analysis tools Development of reports to document the results for the customer Dealing with Amazon Seller Central Optimization of PPC prices taking into account previously defined strategies Qualification Independent work High comprehension and quick familiarization with new subject areas Team and communication skills Analytical understanding and affinity for numbers Structured in written and oral CommunicationVery good knowledge of Excel and PowerPointBenefitsWe are looking for people who take responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/praktikum-performance-marketing-manager-stuttgart-175617","tags":["Marketing and Communication"],"job_types":["Internship"],"location":"Stuttgart","created_at":1702684143000,"original_language":"deu"},{"slug":"dualer-studienplatz-bwl-dienstleistungsmanagement-stuttgart-120506","company_name":"eFLY Marketplace Services GmbH","title":"Dualer Studienplatz BWL - Dienstleistungsmanagement","description":"Wir bieten dir fr deinen dualen Studienplatz an der DHBW einene Stelle an, bei der dir erfahrene Mentoren zur Seite stehen und dir helfen dein Wissen in die Praxis umzusetzten. Die eFly-amz bietet dir flache Hierachien, ein junges und freundliches Team und die Mglichkeit nach dem Studium direkt bei uns einzusteigen.AufgabenKeywordrecherche und On- und Offpage Analyse und OptimierungOptimierung von PPC-Preisen unter Bercksichtigung zuvor festgelegter StrategienEntwicklung und Einsteuerung von innovativen Werbestrategien fr diverse Amazon HndlerDu bist Ansprechpartner fr Kunden aus unterschiedlichen BranchenUmgang mit dem Amazon Seller CentralQualifikationSelbststndiges ArbeitenHohe Auffassungsgabe und schnelles Einarbeiten in neue ThemengebieteTeam- und KommunikationsfhigkeitAnalytisches Verstndnis und Affinitt zu ZahlenStrukturiertheit in schriftlicher und mndlicher KommunikationSehr gute Kenntnisse mit Excel und PowerPointBenefitsWir suchen Personlichkeiten, die Verantwortung ubernehmen und in ihrem Bereich die Besten werden wollen. Bringst du diese Einstellung mit, bekommst du von uns die Chance uber dich hinaus zu wachsen. Auf der einen Seite werden wir viel von dir verlangen, auf der anderen Seite werden wir dir allerdings auch sehr viel bieten: Ein berdurchschnittlich motiviertes und familiares Team, die Moglichkeit zur personlichen und professionellen Weiterentwicklung und ein Umfeld, das deine Leistung wertschtzt.berzeuge dich selbst und mache einen Abstecher zu unserer letzten Workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHier geht's zu unseren Social Media Accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/Wir freuen uns auf Dich!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/dualer-studienplatz-bwl-dienstleistungsmanagement-stuttgart-120506","tags":["Online Marketing"],"job_types":["Dual studies"],"location":"Stuttgart","created_at":1702684143000,"original_language":"eng"},{"slug":"account-manager-stuttgart-76397","company_name":"eFLY Marketplace Services GmbH","title":"Account Manager (m\/w\/d)","description":"In the role of Account Manager, you will drive the Amazon advertising strategies of tomorrow together with our customers. As a rapidly growing Amazon marketing agency in the heart of Stuttgart, we are looking for personalities who take responsibility and want to become the best in their field. The rapid development of our company gives you a lot of freedom to help shape structures, develop new processes and significantly advance our company. You are the contact person and strategic advisor to the outside world and your commitment ensures maximum customer satisfaction. Internally, you will develop marketing strategies together with the team and take care of their implementation. We are looking for ambitious individuals who would like to get started with us. Sounds good? Then read on now!TasksYou are the central contact person for customers from different industriesDevelopment and implementation of innovative advertising strategies for various Amazon retailersConception and monitoring of the advertising presence of our existing customers on AmazonIn addition to your work with customers, you also contribute to optimizing internal processes and further developing eFlyYou are in Regular exchange with our performance team, with whom you will develop new marketing strategies together. Participation in events and trade fairs. Qualifications. Very good communication skills. Experience in this professional field, ideally in connection with Amazon Further training on Amazon advertising strategies High interest in working in a young, dynamic team Very good knowledge of spoken and written GermanBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz : https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com \/moritz\\_\\_heller\/We look forward to seeing you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/account-manager-stuttgart-76397","tags":["Marketing and Communication"],"job_types":["Traineeship"],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"online-marketing-manager-stuttgart-166781","company_name":"eFLY Marketplace Services GmbH","title":"Online Marketing Manager (m\/w\/d)","description":"In the role of Online Marketing Manager, you calculate and control our customers' advertising budgets. The goal is to achieve the best possible visibility within a given budget. In order to communicate the progress of the work to the customer, evaluations are created regularly. The positioning of the products in the desired advertising spaces also plays a major role here. Tasks Development of SEA strategies with our account managers and control and expansion of the advertising potential of Amazon Keyword research and on- and off-page analysis and optimization Optimal exploitation of campaign potential Creation of analyzes and derivation of measures for Further development of campaigns using analysis tools Development of reports to document the results for the customer Dealing with Amazon Seller Central Optimization of PPC prices taking into account previously defined strategies Qualification You have already completed commercial training (at best as a businessman for e-commerce or...) Independent work High level of comprehension and quick familiarization with new subject areas Team and communication skills Analytical understanding and affinity for numbers Structured in written and oral communication Very good knowledge of Excel and PowerPoint Benefits We are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/online-marketing-manager-stuttgart-166781","tags":["Marketing Manager"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"social-media-manager-stuttgart-46488","company_name":"eFLY Marketplace Services GmbH","title":"Social Media Manager (m\/w\/d)","description":"We are Germany's leading Amazon PPC agency in the heart of Stuttgart with a real start-up flair. Our customers include established brands, large online retailers, but also numerous start-ups. We are looking for people who take responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: a young and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. Tasks WHAT DO YOU DO US?You take over the operational management of eFly's social media presenceYou shape our appearance on social media through your ideasYou use and manage our social media channels (LinkedIn, blogs, newsletters, etc.)You write content such as headlines, press releases, captions, social media contributions etc.You help us find out which measures work and adapt our strategy accordingly together with usQualificationsWHAT SHOULD YOU BRING?Interest in online marketing or in AmazonCreativity in terms of attractive postingsGood use of the Adobe Creative SuiteVery good knowledge of spoken and written GermanAnalysis skills in relation to optimal posting times, posting frequency, etc. Ideally, you have already managed the social media presence of companies. You are interested in learning new things and contributing with creative ideas. You are a team PlayerBenefits Cool, young and dynamic team Flexible working hours based on trust Bro in a central location and very good connections Via public transportAbility to take part in internal and external workshops and seminarsInsight into numerous business areas of our start-upYou get access to our network and can make valuable contacts in the German start-up sceneTeam activities also outside of the workplaceConvince yourself and take a detour to our last workation :https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www. linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/ WE LOOK FORWARD TO YOU!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/social-media-manager-stuttgart-46488","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"sales-manager-stuttgart-128188","company_name":"eFLY Marketplace Services GmbH","title":"Sales Manager (m\/w\/d)","description":"In your role as a sales representative, you will drive the Amazon advertising strategy of tomorrow together with our customers and act as both a contact person and a strategic advisor to the outside world. Internally, you will take care of the implementation of discussed strategies and ensure maximum customer satisfaction with your commitment.TasksDevelopment and implementation of innovative advertising strategies for various Amazon retailersConception and monitoring of the advertising presence on Amazon of existing customersCollaboration and coordination with the performanceResponsibility as a contact person for customersQualificationsVery good communication skillsProfessional experience in SalesExtroverted demeanor with a hands-on mentalityQuick comprehension and the willingness to tackle the subject areas independently and to continuously educate themselves on the subject of Amazon advertising strategiesHigh interest in working in a young, dynamic teamVery good knowledge of German, spoken and writtenBenefitsWe are looking for people who take on responsibility and in theirs Want to become the best in the field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/sales-manager-stuttgart-128188","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"finanz-und-office-manager-stuttgart-78527","company_name":"eFLY Marketplace Services GmbH","title":"Finance and Office Manager (m\/f\/d)","description":"As a rapidly growing Amazon marketing agency in the heart of Stuttgart, we are looking for a real all-rounder who not only impresses organizationally and strategically, but also excels in the areas of financial accounting, contracts and financial controlling. Due to the rapid development of our company, you still have a lot of freedom to help shape structures, develop new processes and significantly advance our company. You are the person in the background who holds everything together together with the back office team. Responsibilities You take on the management of internal and external business projects and actively contribute to the further development of the company. You maintain numbers and KPIs in controlling and ensure that everyone is picked up in terms of achieving current goals.You are in close contact with tax advisors, lawyers and other stakeholders.You are jointly responsible for human resources management and maintain all important master data and changes in our internal management tool.You are actively involved in both internal and external contract management with.You are the master of numbers. From bookkeeping to accounting, you keep an eye on our finances and ensure transparency.You ensure that everyday office work runs smoothly and are the first point of contact for the team and management.QualificationsYou love bringing order to chaos and can handle things under pressure the overview.You can communicate clearly and convincingly, both internally and with external partners.Numbers are your thing and you ideally already have experience in accounting or controlling.You are loyal, take personal responsibility and can be relied on at any timeYou have Good time management and how best to set your prioritiesYou recognize the emotional value of a decision but still think rationally and in the interests of the company.You are ready to work in a dynamic environment and have the necessary flexibility and commitment.BenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/youtu.be\/dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/ \/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_ \\_heller\/We look forward to seeing you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/finanz-und-office-manager-stuttgart-78527","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"verwaltungsmanager-stuttgart-471458","company_name":"eFLY Marketplace Services GmbH","title":"Administrative manager (m\/f\/d)","description":"As a rapidly growing Amazon marketing agency in the heart of Stuttgart, we are looking for a real all-rounder who not only impresses organizationally and strategically, but also excels in the areas of financial accounting, contracts and financial controlling. Due to the rapid development of our company, you still have a lot of freedom to help shape structures, develop new processes and significantly advance our company. You are the person in the background who holds everything together together with the back office team. Responsibilities You take on the management of internal and external business projects and actively contribute to the further development of the company. You maintain numbers and KPIs in controlling and ensure that everyone is picked up in terms of achieving current goals.You are in close contact with tax advisors, lawyers and other stakeholders.You are jointly responsible for human resources management and maintain all important master data and changes in our internal management tool.You are actively involved in both internal and external contract management with.You are the master of numbers. From bookkeeping to accounting, you keep an eye on our finances and ensure transparency.You ensure that everyday office work runs smoothly and are the first point of contact for the team and management.QualificationsYou love bringing order to chaos and can handle things under pressure the overview.You can communicate clearly and convincingly, both internally and with external partners.Numbers are your thing and you ideally already have experience in accounting or controlling.You are loyal, take personal responsibility and can be relied on at any timeYou have Good time management and how best to set your prioritiesYou recognize the emotional value of a decision but still think rationally and in the interests of the company.You are ready to work in a dynamic environment and have the necessary flexibility and commitment.BenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/youtu.be\/dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/ \/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_ \\_heller\/We look forward to seeing you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/verwaltungsmanager-stuttgart-471458","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"organisationsmanager-stuttgart-329835","company_name":"eFLY Marketplace Services GmbH","title":"Organisationsmanager (m\/w\/d)","description":"As a rapidly growing Amazon marketing agency in the heart of Stuttgart, we are looking for a real all-rounder who not only impresses organizationally and strategically, but also excels in the areas of financial accounting, contracts and financial controlling. Due to the rapid development of our company, you still have a lot of freedom to help shape structures, develop new processes and significantly advance our company. You are the person in the background who holds everything together together with the back office team. Responsibilities You take on the management of internal and external business projects and actively contribute to the further development of the company. You maintain numbers and KPIs in controlling and ensure that everyone is picked up in terms of achieving current goals.You are in close contact with tax advisors, lawyers and other stakeholders.You are jointly responsible for human resources management and maintain all important master data and changes in our internal management tool.You are actively involved in both internal and external contract management with.You are the master of numbers. From bookkeeping to accounting, you keep an eye on our finances and ensure transparency.You ensure that everyday office work runs smoothly and are the first point of contact for the team and management.QualificationsYou love bringing order to chaos and can handle things under pressure the overview.You can communicate clearly and convincingly, both internally and with external partners.Numbers are your thing and you ideally already have experience in accounting or controlling.You are loyal, take personal responsibility and can be relied on at any timeYou have Good time management and how best to set your prioritiesYou recognize the emotional value of a decision but still think rationally and in the interests of the company.You are ready to work in a dynamic environment and have the necessary flexibility and commitment.BenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/youtu.be\/dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/ \/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_ \\_heller\/We look forward to seeing you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/organisationsmanager-stuttgart-329835","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"performance-marketing-manager-stuttgart-118596","company_name":"eFLY Marketplace Services GmbH","title":"Performance Marketing Manager (m\/w\/d)","description":"In the role of Performance Marketing Manager, you calculate and control our customers' advertising budgets. The goal is to achieve the best possible visibility within a given budget. In order to communicate the progress of the work to the customer, evaluations are created regularly. The positioning of the products in the desired advertising spaces also plays a major role here. Tasks Development of SEA strategies with our account managers and control and expansion of the advertising potential of Amazon Keyword research and on- and off-page analysis and optimization Optimal exploitation of campaign potential Creation of analyzes and derivation of measures for Further development of campaigns using analysis tools Development of reports to document the results for the customer Dealing with Amazon Seller Central Optimization of PPC prices taking into account previously defined strategies Qualification You have already completed commercial training (at best as a businessman for e-commerce or...) Independent work High level of comprehension and quick familiarization with new subject areas Team and communication skills Analytical understanding and affinity for numbers Structured in written and oral communication Very good knowledge of Excel and PowerPoint Benefits We are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/performance-marketing-manager-stuttgart-118596","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"digital-marketing-manager-stuttgart-8352","company_name":"eFLY Marketplace Services GmbH","title":"Digital Marketing Manager (m\/w\/d)","description":"In the role of Digital Marketing Manager, you calculate and control our customers' advertising budgets. The goal is to achieve the best possible visibility within a given budget. In order to communicate the progress of the work to the customer, evaluations are created regularly. The positioning of the products in the desired advertising spaces also plays a major role here. Tasks Development of SEA strategies with our account managers and control and expansion of the advertising potential of Amazon Keyword research and on- and off-page analysis and optimization Optimal exploitation of campaign potential Creation of analyzes and derivation of measures for Further development of campaigns using analysis tools Development of reports to document the results for the customer Dealing with Amazon Seller Central Optimization of PPC prices taking into account previously defined strategies Qualification You have already completed commercial training (at best as a businessman for e-commerce or...) Independent work High level of comprehension and quick familiarization with new subject areas Team and communication skills Analytical understanding and affinity for numbers Structured in written and oral communication Very good knowledge of Excel and PowerPoint Benefits We are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/digital-marketing-manager-stuttgart-8352","tags":["Marketing Manager"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"online-advertising-manager-stuttgart-74982","company_name":"eFLY Marketplace Services GmbH","title":"Online Advertising Manager (m\/w\/d)","description":"In the role of Online Advertising Manager, you calculate and control our customers' advertising budgets. The goal is to achieve the best possible visibility within a given budget. In order to communicate the progress of the work to the customer, evaluations are created regularly. The positioning of the products in the desired advertising spaces also plays a major role here. Tasks Development of SEA strategies with our account managers and control and expansion of the advertising potential of Amazon Keyword research and on- and off-page analysis and optimization Optimal exploitation of campaign potential Creation of analyzes and derivation of measures for Further development of campaigns using analysis tools Development of reports to document the results for the customer Dealing with Amazon Seller Central Optimization of PPC prices taking into account previously defined strategies Qualification You have already completed commercial training (at best as a businessman for e-commerce or...) Independent work High level of comprehension and quick familiarization with new subject areasTeam and communication skillsAnalytical understanding and affinity for numbersStructuredness in written and oral communicationVery good knowledge of Excel and PowerPointVery good written and oral German skillsBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/online-advertising-manager-stuttgart-74982","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"praktikum-human-ressources-stuttgart-351642","company_name":"eFLY Marketplace Services GmbH","title":"Praktikum Human Ressources (m\/w\/d)","description":"Jedes Geschft ist ein Peoples Business, deswegen wird der HR Manager berall gebraucht. Als HR Manager fhrst du Bewerbungsgesprche,organisierst Bewerbungsverfahren um neue Mitarbeiter zu werben, bist Ansprechpartner fr Mitarbeiter und kmmerst dich um die Weiterbildung innerhalb des Unternehmens. Zu den tglichen Aufgaben gehrt die Pflege von Personalakten, das Schreiben von Arbeitszeugnissen und die Planung von Personal.AufgabenDu trgst die Verantwortung fr den gesamten Recruiting Prozess, von der Personalauswahl, bis zur Mitarbeit an der Vertragserstellung und dem Onboarding am ersten ArbeitstagDu begleitest den gesamten Lebenszyklus unserer Mitarbeiter von Einstellung und Einarbeitung ber das Vertragsmanagement, der Bezahlung bis hin zur WeiterbildungDabei bist du immer der erste Ansprechpartner fr die Mitarbeiter und untersttzt sie in allen HR-FragenDu findest die besten Kandidaten ber unterschiedliche Kanle und begeistert diese fr unser UnternehmenDu planst mit den jeweiligen Teamleitern unsere PersonalstrategieDu hilfst unserem Unternehmen weiter zu wachsen und skalierbar zu bleibenQualifikationAls proaktive Persnlichkeit mit hands-on Mentalitt bringst DuLeidenschaft und Begeisterungsfhigkeit fr den HR-Bereich und Talent Acquisition mitDir macht es Spa, Dinge ganz neu aufzubauen und nachhaltige Prozesse, Strukturen und Tools zu implementierenSelbststndige, eigenverantwortliche und zuverlssige ArbeitsweiseSehr gute Deutschkenntnisse in Wort und SchriftBenefitsWir suchen Personlichkeiten, die Verantwortung ubernehmen und inihrem Bereich die Besten werden wollen. Bringst du diese Einstellungmit, bekommst du von uns die Chance, uber dich hinaus zu wachsen. Auf der einen Seite werden wir viel von dir verlangen, auf der anderen Seite werden wir dir allerdings auch sehr viel bieten: Ein berdurchschnittlich motiviertes und familiares Team, die Moglichkeit zur personlichen und professionellen Weiterentwicklung und ein Umfeld, das deine Leistung wertschtzt.berzeuge dich selbst und mache einen Abstecher zu unserer letzten Workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHier geht's zu unseren Social Media Accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/Wir freuen uns auf Dich! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/praktikum-human-ressources-stuttgart-351642","tags":["HR"],"job_types":["Internship"],"location":"Stuttgart","created_at":1702680543000,"original_language":"eng"},{"slug":"content-marketing-manager-stuttgart-289780","company_name":"eFLY Marketplace Services GmbH","title":"Content Marketing Manager (m\/w\/d)","description":"We are Germany's leading Amazon PPC agency in the heart of Stuttgart with a real start-up flair. Our customers include established brands, large online retailers, but also numerous start-ups. We are looking for people who take responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: a young and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. Tasks: You take over the operational management of eFLY's social media presence. You shape our appearance on social media through your ideas. You use and manage our social media channels (LinkedIn, blogs, newsletters, etc.). You write content such as headlines, press releases, captions, social media posts etc.You help us find out which measures work and adapt our strategy accordingly together with usQualificationsInterest in online marketing or AmazonCreativity in terms of attractive postingsGood use of the Adobe Creative SuiteVery good knowledge of German, both spoken and writtenAnalysis skills in relation to optimal posting times, posting frequency, etc. Ideally, you have already managed the social media presence of companies. You are interested in learning new things and contributing with creative ideas. You are a team player. Benefits. Cool, young and dynamic team. Flexible working hours based on trust. Bro in a central location and very good connections via public transport Workshops and seminarsInsight into numerous business areas of our start-upAccess to our network and can make valuable contacts in the German start-up sceneTeam activities also outside the workplace. See for yourself and take a detour to our last workation: https:\/\/www.youtube. com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller -ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/We look forward to seeing you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/content-marketing-manager-stuttgart-289780","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"customer-account-manager-stuttgart-74248","company_name":"eFLY Marketplace Services GmbH","title":"Customer Account Manager (m\/w\/d)","description":"In the role of Customer Account Manager, you will drive the Amazon advertising strategies of tomorrow together with our customers. As a rapidly growing Amazon marketing agency in the heart of Stuttgart, we are looking for individuals who take responsibility and want to become the best in their field. The rapid development of our company gives you a lot of freedom to help shape structures, develop new processes and significantly advance our company. You are the contact person and strategic advisor to the outside world and your commitment ensures maximum customer satisfaction. Internally, you will develop marketing strategies together with the team and take care of their implementation. We are looking for ambitious individuals who would like to get started with us. Sounds good? Then read on now!TasksYou are the central contact person for customers from different industriesDevelopment and implementation of innovative advertising strategies for various Amazon retailersConception and monitoring of the advertising presence of our existing customers on AmazonIn addition to your work with customers, you also contribute to optimizing internal processes and further developing eFlyYou are in Regular exchange with our performance team, with whom you will develop new marketing strategies together. Participation in events and trade fairs. Qualifications. Very good communication skills. Experience in this professional field, ideally in connection with Amazon Further training on Amazon advertising strategies High interest in working in a young, dynamic team Very good knowledge of spoken and written GermanBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/customer-account-manager-stuttgart-74248","tags":["Marketing and Communication"],"job_types":["Traineeship"],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"werkstudent-im-multimedia-design-stuttgart-404715","company_name":"eFLY Marketplace Services GmbH","title":"Werkstudent im Multimedia-Design (m\/w\/d)","description":"We're no longer in the mood for polished job descriptions, which is why you should definitely read them First of all: Yes, we have a fruit basket, free coffee, a table football table and lots of plants. Everyone says that in their ad, but it's taken for granted now, isn't it? What do you think? So, let's get into detail! Why shouldn't you miss this opportunity? Because with us you can use your creativity to advance an area that still has enormous potential. Because with us you have the opportunity to play a decisive role in shaping a young company. Because you With us, you support experienced companies in their online presence and learn a lot in direct contact with them. As a graphic designer, you take on tasks for our customers, from the conception of the content strategy to market and product analysis to customer-oriented design. This means you play a highly relevant role in their online presence on Amazon. Tasks Analysis of the market, the target group and the product to be marketed Development of the content strategy taking into account target groups, positioning on the market and trends in coordination with the project manager Design of Amazon content formats: product images , A+ content, Amazon stores of the highest quality and the corporate designs specified or created by us. Creation of corporate designs, social media creatives, flyers or other graphic content. When developing your projects, we expect a high degree of independence, with the entire team always helping you at your sideA discussion and interest in the Amazon marketplace and how it works is a prerequisite for successful content marketingQualificationYou are an enrolled studentConfident use of the Adobe Creative SuiteGood conceptual skills and a strong sense of design, layout and typographyHigh creative potential and feel for trends and aestheticsDesign- Affinity and high attention to detailFlexibility, resilience and an independent, results-oriented way of workingHigh ability to work in a teamVery good knowledge of spoken and written GermanBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/werkstudent-im-multimedia-design-stuttgart-404715","tags":["Marketing and Communication"],"job_types":["Working student"],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"praktikum-marketing-analyst-stuttgart-346862","company_name":"eFLY Marketplace Services GmbH","title":"Praktikum Marketing Analyst (m\/w\/d)","description":"As a marketing analyst in our team, you are responsible for calculating and controlling our customers' advertising budgets. Your main goal is to achieve the best possible visibility within the given budget. One of your key tasks is to regularly create detailed evaluations in order to keep the customer informed about the progress and success of our marketing measures. In addition to budget management, the strategic positioning of the products in the desired advertising spaces is also an essential part of your role. You will ensure that our customers can present their products where they have the greatest impact. In this position, you will play an important role in our team by making data-driven decisions that help optimize our marketing strategies. Responsibilities Development of SEA strategies with our account managers and control and expansion of the advertising potential of AmazonKeyword research and on- and off-page analysis and optimizationOptimal exploitation of the campaign potentialCreation of analyzes and derivation of measures to further develop the campaigns using analysis toolsDevelopment of reports to document the results for customer dealings with Amazon Seller CentralOptimization of PPC prices taking into account previously defined strategiesQualificationsIndependent workHigh level of comprehension and quick familiarization with new subject areasTeamwork and communication skillsAnalytical understanding and affinity for numbersStructuredness in written and oral communicationVery good knowledge of Excel and PowerPointBenefitsWe are looking for people who take responsibility and are the best in their field want to be. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/praktikum-marketing-analyst-stuttgart-346862","tags":["Marketing and Communication"],"job_types":["Internship"],"location":"Stuttgart","created_at":1702680543000,"original_language":"afr"},{"slug":"marketing-performance-improvement-specialist-stuttgart-469741","company_name":"eFLY Marketplace Services GmbH","title":"Marketing Performance Improvement Specialist (m\/w\/d)","description":"Als Marketing Performance Improvement Specialist in unserem Team bist du entscheidend dafr verantwortlich, die Werbebudgets unserer Kunden effizient zu verwalten und zu steuern. Dein Hauptziel ist es, die bestmgliche Sichtbarkeit innerhalb des festgelegten Budgets zu erreichen. Du spielst eine wichtige Rolle in der Analyse und Optimierung unserer Werbekampagnen, um sicherzustellen, dass jedes Budget optimal eingesetzt wird.Zu deinen Aufgaben gehrt auch, regelmig detaillierte Auswertungen zu erstellen, um unsere Kunden transparent ber die Fortschritte und Erfolge unserer Werbestrategien zu informieren. Darber hinaus bist du verantwortlich fr die strategische Platzierung der Produkte an den effektivsten Werbepltzen, um eine optimale Sichtbarkeit und Leistung zu gewhrleisten.In dieser Rolle bist du ein Schlsselelement unseres Teams und trgst mageblich dazu bei, durchdachte und ergebnisorientierte Marketinglsungen zu liefern.AufgabenErarbeitung von SEA-Strategien mit unseren Account Managern und Steuerung und Ausbau der Werbepotentiale von AmazonKeywordrecherche und On- und Offpage Analyse und OptimierungOptimale Ausschpfung des Kampagnen PotenzialsErstellung von Analysen und Ableitung von Manahmen zur Weiterentwicklung der Kampagnen mittels Analyse-ToolsAufbau von Reportings zur Dokumentation der Ergebnisse fr den KundenUmgang mit dem Amazon Seller CentralOptimierung von PPC-Preisen unter Bercksichtigung zuvor festgelegter StrategienQualifikationDu hast bereits eine kaufmnnische Ausbildung abgeschlossen (bestenfalls Kaufmann\/-frau fr E-Commerce o..)Selbststndiges ArbeitenHohe Auffassungsgabe und schnelles Einarbeiten in neue ThemengebieteTeam- und KommunikationsfhigkeitAnalytisches Verstndnis und Affinitt zu ZahlenStrukturiertheit in schriftlicher und mndlicher KommunikationSehr gute Kenntnisse mit Excel und PowerPointBenefitsWir suchen Personlichkeiten, die Verantwortung ubernehmen und in ihrem Bereich die Besten werden wollen. Bringst du diese Einstellung mit, bekommst du von uns die Chance, uber dich hinaus zu wachsen. Auf der einen Seite werden wir viel von dir verlangen, auf der anderen Seite werden wir dir allerdings auch sehr viel bieten: Ein berdurchschnittlich motiviertes und familiares Team, die Moglichkeit zur personlichen und professionellen Weiterentwicklung und ein Umfeld, das deine Leistung wertschtzt.berzeuge dich selbst und mache einen Abstecher zu unserer letzten Workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHier geht's zu unseren Social Media Accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/Wir freuen uns auf Dich! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/marketing-performance-improvement-specialist-stuttgart-469741","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"eng"},{"slug":"marketing-performance-specialist-stuttgart-449385","company_name":"eFLY Marketplace Services GmbH","title":"Marketing Performance Specialist (m\/w\/d)","description":"Als Marketing Performance Specialist in unserem Team bist du entscheidend dafr verantwortlich, die Werbebudgets unserer Kunden effizient zu verwalten und zu steuern. Dein Hauptziel ist es, die bestmgliche Sichtbarkeit innerhalb des festgelegten Budgets zu erreichen. Du spielst eine wichtige Rolle in der Analyse und Optimierung unserer Werbekampagnen, um sicherzustellen, dass jedes Budget optimal eingesetzt wird.Zu deinen Aufgaben gehrt auch, regelmig detaillierte Auswertungen zu erstellen, um unsere Kunden transparent ber die Fortschritte und Erfolge unserer Werbestrategien zu informieren. Darber hinaus bist du verantwortlich fr die strategische Platzierung der Produkte an den effektivsten Werbepltzen, um eine optimale Sichtbarkeit und Leistung zu gewhrleisten.In dieser Rolle bist du ein Schlsselelement unseres Teams und trgst mageblich dazu bei, durchdachte und ergebnisorientierte Marketinglsungen zu liefern.AufgabenErarbeitung von SEA-Strategien mit unseren Account Managern und Steuerung und Ausbau der Werbepotentiale von AmazonKeywordrecherche und On- und Offpage Analyse und OptimierungOptimale Ausschpfung des Kampagnen PotenzialsErstellung von Analysen und Ableitung von Manahmen zur Weiterentwicklung der Kampagnen mittels Analyse-ToolsAufbau von Reportings zur Dokumentation der Ergebnisse fr den KundenUmgang mit dem Amazon Seller CentralOptimierung von PPC-Preisen unter Bercksichtigung zuvor festgelegter StrategienQualifikationDu hast bereits eine kaufmnnische Ausbildung abgeschlossen (bestenfalls Kaufmann\/-frau fr eCommerce o..)Selbststndiges ArbeitenHohe Auffassungsgabe und schnelles Einarbeiten in neue ThemengebieteTeam- und KommunikationsfhigkeitAnalytisches Verstndnis und Affinitt zu ZahlenStrukturiertheit in schriftlicher und mndlicher KommunikationSehr gute Kenntnisse mit Excel und PowerPointBenefitsWir suchen Personlichkeiten, die Verantwortung ubernehmen und in ihrem Bereich die Besten werden wollen. Bringst du diese Einstellung mit, bekommst du von uns die Chance, uber dich hinaus zu wachsen. Auf der einen Seite werden wir viel von dir verlangen, auf der anderen Seite werden wir dir allerdings auch sehr viel bieten: Ein berdurchschnittlich motiviertes und familiares Team, die Moglichkeit zur personlichen und professionellen Weiterentwicklung und ein Umfeld, das deine Leistung wertschtzt.berzeuge dich selbst und mache einen Abstecher zu unserer letzten Workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHier geht's zu unseren Social Media Accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/Wir freuen uns auf Dich! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/marketing-performance-specialist-stuttgart-449385","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"eng"},{"slug":"videograf-cutter-fur-short-form-content-tiktok-reels-berlin-103706","company_name":"ReelStudio","title":"Videograf \/ Cutter für Short-Form-Content (TikTok \/ Reels) (m\/w\/d)","description":"BER UNS:Wir sind Reelstudio - eine fhrende Content-Marketing-Agentur mit Sitz in Berlin, spezialisiert auf die Erstellung von TikToks & Reels \/ Short Form Content fr die grten E-Commerce-Marken in DACH. Unser junges und dynamisches Team lebt die Leidenschaft fr kreative Inhalte und setzt sich dafr ein, innovative Videos zu entwickeln, die unsere Kunden zum individuellen Erfolg fhren.Bei uns findest du ein inspirierendes Umfeld, in dem Ideen geschtzt und gefrdert werden.Wir bieten ein attraktives Gehaltspaket, zustzliche Benefits und die Mglichkeit, Teil eines wachsenden Unternehmens zu sein, das die Welt des TikTok-Marketings fr E-Commerce Brands prgt.Wir freuen uns darauf, von dir zu hren und dich in einem persnlichen Gesprch kennenzulernen.AufgabenWAS DICH ERWARTETAls Videograf in unserem dynamischen Team spielst Du eine entscheidende Rolle bei der Produktion und Post-Produktion von ansprechenden und konvertierenden TikToks fr unsere E-Commerce-Kunden.  DEIN INDIVIDUELLER BENEFIT FR DIESE STELLE:Du trgst zum Erfolg der Social Media Kanle unserer Kunden bei. Dein zutun entscheidet, wie diese sich von der Konkurrenz abheben und ihre Ziele erreichen.  DEIN OUTPUT:Innerhalb der ersten 30 Tage:Du bist in der Lage Short-Form-Viodes aus zugelieferten Material zu entwickeln, das sofort das Interesse der Zielgruppen unserer Kunden zu wecken.Du wirst bei Produktionen untersttzen, dabei erstellst und editierst Du das Videomaterial.Nach der Einarbeitungszeit:Du wirst eng mit unserem kreativen Team zusammenarbeiten, um innovative Ideen zu entwickeln und diese erfolgreich umzusetzen.Du sprichst die Sprache unserer Kunden.Du bist hauptverantwortlich fr die TikTok-Videos ausgewhlter Kunden und stellst ein konstantes Wachstum sicher.QualifikationDAS KANNST DU:Du bist TikTok-Native und hast idealerweise neben dem privaten Konsum auch bereits berufliche Berhrungspunkte mit TikTok gehabtDu bringst Erfahrung in der Videoproduktion und im Schnitt von digitalen Inhalten mit, idealerweise mit Schwerpunkt auf Short-Form-Videos auf Social-Media-Plattformen.Du beherrschst die Arbeit mit einer professionellen Kamera- und Schnitt-Software, idealerweise mit Premiere Pro, Final Cut oder CapCut.Du hast ein Auge fr visuelle sthetik und Social-Media Trends.Du besitzt ein hohes Ma an Eigeninitiative, Teamgeist und Verantwortungsbewusstsein.Du kommunizierst klar und berzeugend und kannst deine Ideen prsentieren.Du kennst die wichtigsten KPIs im Marketing.Du sprichst flieend deutsch in Schrift und WortBenefitsSCHNELLE AUFSTIEGSCHANCENWir belohnen gutes und erfolgreiches Engagement sofort mit Verantwortung und schnellem Aufstieg.FLEXIBLE ARBEITSZEITENArbeite wann es fr dich am besten ist. Solange dein Workflow nicht leidet, sind wir mit allem happy.FLACHE HIERARCHIENSelbsterklrend, und dennoch muss es gesagt werden: Wir verzichten auf strenge Hierarchieebenen. Transparenz und offene Kommunikation sind uns wichtig.DIE VIELFALT DES ECOMMERCE KENNENLERNENDurch unsere Kunden erhltst Du einen einmaligen Einblick in eine Vielfalt von unterschiedlichen ECommere-Marken.OFFENES OHRWir schtzen jeden Beitrag, von jedem. Deine Ideen und Anmerkungen finden bei uns immer Anklang.IMPORTANT TO KNOWWir bieten ein hybrides Arbeitsmodell an - da unser Hauptstandort Berlin ist und wir hufiger Produktionen vor Ort haben wre es wnschenswert, wenn Du in Berlin lebstDiese Stelle soll zuerst als Werkstudenten-Stelle besetzt, anschlieend in eine unbefristete Vollzeitstelle erweitert werden.Wir freuen uns auf deine Bewerbung!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/reelstudio\/videograf-cutter-fur-short-form-content-tiktok-reels-berlin-103706","tags":["Social Media Manager"],"job_types":["Working student"],"location":"Berlin","created_at":1702680543000,"original_language":"eng"},{"slug":"performance-marketing-specialist-stuttgart-93543","company_name":"eFLY Marketplace Services GmbH","title":"Performance Marketing Specialist (m\/w\/d)","description":"Als Performance Marketing Specialist in unserem Team bist du entscheidend dafr verantwortlich, die Werbebudgets unserer Kunden effizient zu verwalten und zu steuern. Dein Hauptziel ist es, die bestmgliche Sichtbarkeit innerhalb des festgelegten Budgets zu erreichen. Du spielst eine wichtige Rolle in der Analyse und Optimierung unserer Werbekampagnen, um sicherzustellen, dass jedes Budget optimal eingesetzt wird.Zu deinen Aufgaben gehrt auch, regelmig detaillierte Auswertungen zu erstellen, um unsere Kunden transparent ber die Fortschritte und Erfolge unserer Werbestrategien zu informieren. Darber hinaus bist du verantwortlich fr die strategische Platzierung der Produkte an den effektivsten Werbepltzen, um eine optimale Sichtbarkeit und Leistung zu gewhrleisten.In dieser Rolle bist du ein Schlsselelement unseres Teams und trgst mageblich dazu bei, durchdachte und ergebnisorientierte Marketinglsungen zu liefern.AufgabenUntersttzung des Programmatic Advertising TeamsErfolgreiches Aufsetzen eigener Kampagnen in der Amazon DSPbernahme der Kontrolle, Analyse und des Reportings der Kampagnen anhand relevanter KPIsStetige Optimierung der programmatischen Kampagnen innerhalb der Amazon DSPEinbringen eigener Ideen zur Kampagnenstrategie unserer KundenLernen und Weiterentwicklung der Fhigkeiten im Programmatic AdvertisingQualifikationAbgeschlossene Kaufmnnische Ausbildung oder Uni\/Hochschulabschluss (z.B. BWL, E-Commerce, Marketing o. .).Interesse an Online-Marketing, Advertising oder E-Commerce-Themen (Erfahrungen in einem dieser Bereiche von Vorteil)Freude am Lernen und Erweitern des eigenen Know-howsAnalytisches, qualitts- und kundenorientiertes DenkenHands-On MentalittSelbststndige Priorisierung von Aufgaben und hohes Engagement + Verantwortung fr eigene Projekte tragenKenntnisse in MS Office Tools wie Excel und PowerPointGute schriftliche und mndliche Deutsch- und EnglischkenntnisseBenefitsWir suchen Personlichkeiten, die Verantwortung ubernehmen und in ihrem Bereich die Besten werden wollen. Bringst du diese Einstellung mit, bekommst du von uns die Chance, uber dich hinaus zu wachsen. Auf der einen Seite werden wir viel von dir verlangen, auf der anderen Seite werden wir dir allerdings auch sehr viel bieten: Ein berdurchschnittlich motiviertes und familiares Team, die Moglichkeit zur personlichen und professionellen Weiterentwicklung und ein Umfeld, das deine Leistung wertschtzt.berzeuge dich selbst und mache einen Abstecher zu unserer letzten Workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHier geht's zu unseren Social Media Accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/Wir freuen uns auf Dich! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/performance-marketing-specialist-stuttgart-93543","tags":["Marketing Manager"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"eng"},{"slug":"junior-account-manager-stuttgart-57378","company_name":"eFLY Marketplace Services GmbH","title":"Junior Account Manager (m\/w\/d)","description":"As part of our dynamic team in an up-and-coming Amazon marketing agency in the center of Stuttgart, we are looking for a Junior Account Manager who is ready to actively shape the Amazon advertising landscape of tomorrow. In this role, you will work closely with our customers to develop and implement innovative advertising strategies. In our rapidly developing agency, we offer you a lot of creative freedom to shape structures and implement new processes that will significantly advance our agency. As a Junior Account Manager, you are the primary contact for our customers, act as a strategic advisor and are responsible for them Customer satisfaction. Internally, you will work with our team to design effective marketing strategies and oversee their execution. We are looking for passionate individuals who are ready to reach new heights with us. Interested? Then find out more about this exciting opportunity!TasksYou are the central contact person for customers from different industriesDevelopment and implementation of innovative advertising strategies for various Amazon retailersConception and monitoring of the advertising presence of our existing customers on AmazonIn addition to your work with customers, you also contribute to optimizing internal processes and the eFly You are in regular contact with our performance team, with whom you develop new marketing strategies together. Participation in events and trade fairs. Qualifications. Very good communication skills. Experience in this professional field, ideally in connection with Amazon Continuously educate yourself on the subject of Amazon advertising strategies High interest in working in a young, dynamic team Very good knowledge of spoken and written GermanBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/junior-account-manager-stuttgart-57378","tags":["Marketing and Communication"],"job_types":["Traineeship"],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"junior-account-development-manager-stuttgart-354320","company_name":"eFLY Marketplace Services GmbH","title":"Junior Account Development Manager (m\/w\/d)","description":"As part of our dynamic team in an up-and-coming Amazon marketing agency in the center of Stuttgart, we are looking for a Junior Account Development Manager who is ready to actively shape the Amazon advertising landscape of tomorrow. In this role, you will work closely with our customers to develop and implement innovative advertising strategies. In our rapidly developing agency, we offer you a lot of creative freedom to shape structures and implement new processes that will significantly advance our agency. As a Junior Account Development Manager, you are the primary contact for our customers, act as a strategic advisor and are responsible for customer satisfaction. Internally, you will work with our team to design effective marketing strategies and oversee their execution. We are looking for passionate individuals who are ready to reach new heights with us. Interested? Then find out more about this exciting opportunity!TasksYou are the central contact person for customers from different industriesDevelopment and implementation of innovative advertising strategies for various Amazon retailersConception and monitoring of the advertising presence of our existing customers on AmazonIn addition to your work with customers, you also contribute to optimizing internal processes and the eFly You are in regular contact with our performance team, with whom you develop new marketing strategies together. Participation in events and trade fairs. Qualifications. Very good communication skills. Experience in this professional field, ideally in connection with Amazon Continuously educate yourself on the subject of Amazon advertising strategies High interest in working in a young, dynamic team Very good knowledge of spoken and written GermanBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal: https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/junior-account-development-manager-stuttgart-354320","tags":["Marketing and Communication"],"job_types":["Traineeship"],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"office-support-assistent-stuttgart-231202","company_name":"eFLY Marketplace Services GmbH","title":"Office Support Assistent (m\/w\/d)","description":"Als dynamisch expandierende Amazon Marketing Agentur im Zentrum Stuttgarts suchen wir einen vielseitig begabte Assistentenz. Deine Rolle erfordert sowohl organisatorische als auch strategische Fhigkeiten, wobei du auch in Bereichen wie Finanzbuchhaltung, Vertragsmanagement und Financial Controlling hervorstechen solltest. In unserer schnelllebigen Unternehmensumgebung hast du die Gelegenheit, aktiv an der Gestaltung von Strukturen und der Entwicklung neuer Prozesse mitzuwirken, um einen wesentlichen Beitrag zum Fortschritt unserer Firma zu leisten. Als Schlsselfigur im Hintergrund arbeitest du eng mit dem Back Office Team zusammen, um den reibungslosen Ablauf unserer Geschfte sicherzustellen.AufgabenDu bernimmst die Verwaltung von internen und externen Geschftsvorhaben und trgst aktiv zur Weiterentwicklung der Firma bei.Du pflegst Zahlen und KPIs im Controlling und sorgst dafr, dass alle abgeholt werden, was die Erreichung der aktuellen Ziele angeht.Du stehst in engem Kontakt mit Steuerberatern, Anwlten und anderen Stakeholdern.Du bist mitverantwortlich fr die Personalverwaltung und pflegst alle wichtigen Stammdaten und nderungen in unserem internen Management Tool.Du wirkst aktiv sowohl am internen und externen Vertragswesen mit.Du bist der Meister der Zahlen. Von der Buchfhrung bis zum Rechnungswesen  du hltst unsere Finanzen im Blick und sorgst fr Transparenz.Du sorgst fr einen reibungslosen Ablauf im Broalltag und bist die erste Anlaufstelle fr Team und Management.QualifikationDu liebst es, Ordnung in das Chaos zu bringen und behltst auch unter Druck den berblick.Du kannst klar und berzeugend kommunizieren, sowohl intern als auch mit externen Partnern.Zahlen sind dein Ding und du hast idealerweise bereits Erfahrung in der Buchhaltung oder im Controlling.Du bist loyal, bernimmst Eigenverantwortung und man kann sich jederzeit auf dich verlassenDu hast ein gutes Zeitmanagement und weit, wie du am besten deine Prioritten setztDu erkennst sowohl den emotionalen Wert einer Entscheidung denkst aber trotzdem rational und im Sinne des Unternehmens.Du bist bereit, in einem dynamischen Umfeld zu arbeiten und bringst die ntige Flexibilitt und Einsatzbereitschaft mit.BenefitsWir suchen Personlichkeiten, die Verantwortung ubernehmen und in ihrem Bereich die Besten werden wollen. Bringst du diese Einstellung mit, bekommst du von uns die Chance, uber dich hinaus zu wachsen. Auf der einen Seite werden wir viel von dir verlangen, auf der anderen Seite werden wir dir allerdings auch sehr viel bieten:Ein berdurchschnittlich motiviertes und familiares Team, die Moglichkeit zur personlichen und professionellen Weiterentwicklung und ein Umfeld, das deine Leistung wertschtzt.berzeuge dich selbst und mache einen Abstecher zu unserer letzten Workation in Portugal:https:\/\/youtu.be\/dXcSIfU1zKwHier geht's zu unseren Social Media Accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/Wir freuen uns auf Dich!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/office-support-assistent-stuttgart-231202","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"eng"},{"slug":"eigenmarketingmanager-stuttgart-184224","company_name":"eFLY Marketplace Services GmbH","title":"Eigenmarketingmanager (m\/w\/d)","description":"We are Germany's leading Amazon PPC agency in the heart of Stuttgart with a real start-up flair. Our customers include established brands, large online retailers, but also numerous start-ups. We are looking for people who take responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: a young and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. Tasks WHAT DO YOU DO US?You take over the operational management of eFLY's social media presenceYou shape our appearance on social media with your ideas and graphicsYou use and manage our social media channels (LinkedIn, blogs, newsletters, etc.)You write content such as headlines, press releases, captions , social media posts etc. You will help us find out which measures work and adapt our strategy accordingly together with usQualificationsInterest in online marketing or AmazonCreativity regarding attractive postingsVery good knowledge of spoken and written GermanGood knowledge of Adobe PhotoshopAnalytical skills in relation to optimal posting times and posting frequency etc. Ideally, you have already managed the social media presence of a company. You are interested in learning new things and getting involved with creative ideas. You are a team player. Benefits Cool, young and dynamic team. Flexible working hours based on trust. Bro in a central location and very good connections via public transport. and external workshops and seminarsInsight into numerous business areas of our start-upAccess to our network and can make valuable contacts in the German start-up sceneTeam activities also outside the workplace. See for yourself and take a detour to our last workation: https:\/\/www. youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz -heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/WE LOOK FORWARD TO SEEING YOU!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/eigenmarketingmanager-stuttgart-184224","tags":["Online Marketing"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"grafikdesigner-stuttgart-473923","company_name":"eFLY Marketplace Services GmbH","title":"Graphic designer (m\/f\/d)","description":"We're no longer in the mood for polished job descriptions, which is why you should definitely read them. First of all: Yes, we have a fruit basket, free coffee, a foosball table and lots of plants. Everyone says that in their ad, but it's taken for granted now, isn't it? What do you think? So, let's get into detail! Why shouldn't you miss this opportunity? Because with us you can use your creativity to advance an area that still has enormous potential. Because with us you have the opportunity to play a decisive role in shaping a young company. Because you With us, you support experienced companies in their online presence and learn a lot in direct contact with them. As a graphic designer, you take on tasks for our customers, from the conception of the content strategy to market and product analysis to customer-oriented design. This means you play a highly relevant role in their online presence on Amazon. Tasks Analysis of the market, the target group and the product to be marketed Development of the content strategy taking into account target groups, positioning on the market and trends in coordination with the project manager Design of Amazon content formats: product images , A+ content, Amazon stores of the highest quality and the corporate designs specified or created by us. Creation of corporate designs, social media creatives, flyers or other graphic content. When developing your projects, we expect a high degree of independence, with the entire team always helping you at your sideA discussion and interest in the Amazon marketplace and how it works is a prerequisite for successful content marketingQualificationGood conceptual skills and a strong sense of design, layout and typographyHigh creative potential and feel for trends and aestheticsDesign affinity and high attention to detailFlexibility, resilience and an independent , results-oriented way of working, high level of teamwork ability, very good knowledge of spoken and written German, confident use of the Adobe Creative SuiteBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/grafikdesigner-stuttgart-473923","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"werkstudent-im-bereich-bild-und-videogestaltung-stuttgart-290652","company_name":"eFLY Marketplace Services GmbH","title":"Working student in the field of image and video design (m\/f\/d)","description":"We're no longer in the mood for polished job descriptions, which is why you should definitely read them First of all: Yes, we have a fruit basket, free coffee, a table football table and lots of plants. Everyone says that in their ad, but it's taken for granted now, isn't it? What do you think?So, let's get into detail!Why shouldn't you miss this opportunity?Because with us you can use your creativity to advance an area that still has enormous potential.Because with us you get the opportunity to start a young company Because with us you support experienced companies in their online presence and learn a lot in direct contact with them. As a working student in the field of image and video design, you take on product shoots for our customers and thus play a highly relevant role in their online presence on Amazon .TasksYou take care of the planning and organization of shootings and video shootsYou create, edit and edit product videos and product photos for our customersYou always have an overview of ongoing projects and their processing progressYou create increased interest in the products you manage through your workYou are responsible for the implementation of the Video projects in self-marketing (podcast, event aftermovies, etc.) You will be responsible for the conception and implementation of Reels as well as the supervision of our podcastsQualificationComprehensive knowledge and experience with Adobe Premiere \/ Adobe After Effects or similar video editing programsExperience in the areas of film, animation, editing, typography, sound and storytelling \/ Dramaturgy (especially promo and brand)Basic knowledge of event planning for lifestyle shootingsKnowledge and experience in using the Adobe Creative CloudPlanning and organizational talentBenefitsWe are looking for people who take responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company \/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/ www.instagram.com\/moritz\\_\\_heller\/WE LOOK FORWARD TO YOU!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/werkstudent-im-bereich-bild-und-videogestaltung-stuttgart-290652","tags":["Marketing and Communication"],"job_types":["Working student"],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"praktikum-online-marketing-manager-stuttgart-451432","company_name":"eFLY Marketplace Services GmbH","title":"Praktikum Online Marketing Manager (m\/w\/d)","description":"In the role of Online Marketing Manager, you calculate and control our customers' advertising budgets. The goal is to achieve the best possible visibility within a given budget. In order to communicate the progress of the work to the customer, evaluations are created regularly. The positioning of the products in the desired advertising spaces also plays a major role here. Tasks Development of SEA strategies with our account managers and control and expansion of the advertising potential of Amazon Keyword research and on- and off-page analysis and optimization Optimal exploitation of campaign potential Creation of analyzes and derivation of measures for Further development of campaigns using analysis tools Development of reports to document the results for the customer Dealing with Amazon Seller Central Optimization of PPC prices taking into account previously defined strategies Qualification Independent work High comprehension and quick familiarization with new subject areas Team and communication skills Analytical understanding and affinity for numbers Structured in written and oral CommunicationVery good knowledge of Excel and PowerPointBenefitsWe are looking for people who take responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/praktikum-online-marketing-manager-stuttgart-451432","tags":["Marketing and Communication"],"job_types":["Internship"],"location":"Stuttgart","created_at":1702680543000,"original_language":"deu"},{"slug":"digital-performance-marketing-analyst-stuttgart-37085","company_name":"eFLY Marketplace Services GmbH","title":"Digital Performance Marketing Analyst (m\/w\/d)","description":"As a Digital Performance Marketing Analyst in our team, you are responsible for calculating and controlling our customers' advertising budgets. Your main goal is to achieve the best possible visibility within the given budget. One of your key tasks is to regularly create detailed evaluations in order to keep the customer informed about the progress and success of our marketing measures. In addition to budget management, the strategic positioning of the products in the desired advertising spaces is also an essential part of your role. You will ensure that our customers can present their products where they have the greatest impact. In this position, you will play an important role in our team by making data-driven decisions that help optimize our marketing strategies. Responsibilities Development of SEA strategies with our account managers and control and expansion of the advertising potential of AmazonKeyword research and on- and off-page analysis and optimizationOptimal exploitation of the campaign potentialCreation of analyzes and derivation of measures to further develop the campaigns using analysis toolsDevelopment of reports to document the results for customer dealings with Amazon Seller CentralOptimization of PPC prices taking into account previously defined strategiesQualificationYou have already completed commercial training (preferably as a businessman for e-commerce or...)Independent workHigh level of comprehension and quick familiarization with new subject areasTeam and communication skillsAnalytical understanding and affinity for numbersStructured in writing and oral communicationVery good knowledge of Excel and PowerPointBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/digital-performance-marketing-analyst-stuttgart-37085","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"afr"},{"slug":"performance-optimization-analyst-stuttgart-88859","company_name":"eFLY Marketplace Services GmbH","title":"Performance Optimization Analyst (m\/w\/d)","description":"Als Performance Optimization Analyst in unserem Team bist du fr die Kalkulation und Steuerung der Werbebudgets unserer Kunden zustndig. Dein Hauptziel dabei ist es, die bestmgliche Sichtbarkeit innerhalb des vorgegebenen Budgetrahmens zu erzielen. Eine deiner Schlsselaufgaben ist es, regelmig detaillierte Auswertungen zu erstellen, um den Kunden ber die Fortschritte und Erfolge unserer Marketingmanahmen auf dem Laufenden zu halten.Neben der Budgetverwaltung ist auch die strategische Positionierung der Produkte an den gewnschten Werbepltzen ein wesentlicher Teil deiner Rolle. Du sorgst dafr, dass unsere Kunden ihre Produkte dort prsentieren knnen, wo sie die grte Wirkung erzielen.In dieser Position spielst du eine wichtige Rolle in unserem Team, indem du datengesttzte Entscheidungen triffst, die zur Optimierung unserer Marketingstrategien beitragen.AufgabenErarbeitung von SEA-Strategien mit unseren Account Managern und Steuerung und Ausbau der Werbepotentiale von AmazonKeywordrecherche und On- und Offpage Analyse und OptimierungOptimale Ausschpfung des Kampagnen PotenzialsErstellung von Analysen und Ableitung von Manahmen zur Weiterentwicklung der Kampagnen mittels Analyse-ToolsAufbau von Reportings zur Dokumentation der Ergebnisse fr den KundenUmgang mit dem Amazon Seller CentralOptimierung von PPC-Preisen unter Bercksichtigung zuvor festgelegter StrategienQualifikationDu hast bereits eine kaufmnnische Ausbildung abgeschlossen (bestenfalls Kaufmann\/-frau fr E-Commerce o..)Selbststndiges ArbeitenHohe Auffassungsgabe und schnelles Einarbeiten in neue ThemengebieteTeam- und KommunikationsfhigkeitAnalytisches Verstndnis und Affinitt zu ZahlenStrukturiertheit in schriftlicher und mndlicher KommunikationSehr gute Kenntnisse mit Excel und PowerPointSehr gute schriftliche und mndliche DeutschkenntnisseBenefitsWir suchen Personlichkeiten, die Verantwortung ubernehmen und in ihrem Bereich die Besten werden wollen. Bringst du diese Einstellung mit, bekommst du von uns die Chance, uber dich hinaus zu wachsen. Auf der einen Seite werden wir viel von dir verlangen, auf der anderen Seite werden wir dir allerdings auch sehr viel bieten: Ein berdurchschnittlich motiviertes und familiares Team, die Moglichkeit zur personlichen und professionellen Weiterentwicklung und ein Umfeld, das deine Leistung wertschtzt.berzeuge dich selbst und mache einen Abstecher zu unserer letzten Workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHier geht's zu unseren Social Media Accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/Wir freuen uns auf Dich!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/performance-optimization-analyst-stuttgart-88859","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"eng"},{"slug":"marketing-performance-analyst-stuttgart-226718","company_name":"eFLY Marketplace Services GmbH","title":"Marketing Performance Analyst (m\/w\/d)","description":"As a marketing performance analyst in our team, you are responsible for calculating and controlling our customers' advertising budgets. Your main goal is to achieve the best possible visibility within the given budget. One of your key tasks is to regularly create detailed evaluations in order to keep the customer informed about the progress and success of our marketing measures. In addition to budget management, the strategic positioning of the products in the desired advertising spaces is also an essential part of your role. You will ensure that our customers can present their products where they have the greatest impact. In this position, you will play an important role in our team by making data-driven decisions that help optimize our marketing strategies. Responsibilities Development of SEA strategies with our account managers and control and expansion of the advertising potential of AmazonKeyword research and on- and off-page analysis and optimizationOptimal exploitation of the campaign potentialCreation of analyzes and derivation of measures to further develop the campaigns using analysis toolsDevelopment of reports to document the results for customer dealings with Amazon Seller CentralOptimization of PPC prices taking into account previously defined strategiesQualificationYou have already completed commercial training (preferably as a businessman for e-commerce or...)Independent workHigh level of comprehension and quick familiarization with new subject areasTeam and communication skillsAnalytical understanding and affinity for numbersStructured in writing and oral communicationVery good knowledge of Excel and PowerPointVery good written and oral German skillsBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/marketing-performance-analyst-stuttgart-226718","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"afr"},{"slug":"account-development-manager-stuttgart-415402","company_name":"eFLY Marketplace Services GmbH","title":"Account Development Manager (m\/w\/d)","description":"In der Rolle des Account Development Managers treibst du zusammen mit unseren Kunden die Amazon-Werbestrategien von Morgen voran.Als stark wachsende Amazon Marketing Agentur im Herzen von Stuttgart suchen wir Persnlichkeiten, die Verantwortung bernehmen und in ihrem Bereich die besten werden wollen. Durch die schnelle Entwicklung unseres Unternehmens bietet sich dir viel Freiraum, um Strukturen mitzugestalten, neue Prozesse zu entwickeln und unser Unternehmen entscheidend voranzubringen.Du bist Ansprechpartner sowie strategischer Berater nach auen und sorgst mit deinem Einsatz fr maximale Kundenzufriedenheit. Intern erarbeitest du zusammen mit dem Team Marketingstrategien und kmmerst dich um deren Umsetzung.Wir suchen ambitionierte Persnlichkeiten, die Lust haben, zusammen mit uns durchzustarten. Klingt gut? Dann lies jetzt weiter!AufgabenDu bist zentraler Ansprechpartner fr Kunden aus unterschiedlichen BranchenEntwicklung und Einsteuerung von innovativen Werbestrategien fr diverse Amazon HndlerKonzeption und Monitoring des Werbeauftritts unserer Bestandskunden auf AmazonNeben deiner Arbeit am Kunden trgst du ebenfalls dazu bei interne Prozesse zu optimieren und die eFly weiterzuentwickelnDu bist im regelmigem Austausch mit unserem Performance-Team, mit welchem du gemeinsam neue Marketingstrategien entwickelstTeilnahme an Veranstaltungen und MessenQualifikationSehr gute KommunikationsfhigkeitErfahrung in diesem Berufsfeld, bestenfalls im Zusammenhang mit AmazonExtravertiertes Auftreten mit einer Hands-On MentalittSchnelle Auffassungsgabe und die Bereitschaft sich neuen Themenfeldern eigenstndig anzunehmen sowie sich fortlaufend im Thema Amazon Werbestrategien weiterzubildenHohes Interesse an der Mitarbeit in einem jungen dynamischen TeamSehr gute Deutschkenntnisse in Wort und SchriftBenefitsWir suchen Personlichkeiten, die Verantwortung ubernehmen und in ihrem Bereich die Besten werden wollen. Bringst du diese Einstellung mit, bekommst du von uns die Chance uber dich hinaus zu wachsen. Auf der einen Seite werden wir viel von dir verlangen, auf der anderen Seite werden wir dir allerdings auch sehr viel bieten: Ein berdurchschnittlich motiviertes und familiares Team, die Moglichkeit zur personlichen und professionellen Weiterentwicklung und ein Umfeld, das deine Leistung wertschtzt.berzeuge dich selbst und mache einen Abstecher zu unserer letzten Workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHier geht's zu unseren Social Media Accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram.com\/moritz\\_\\_heller\/Wir freuen uns auf Dich! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/account-development-manager-stuttgart-415402","tags":["Marketing and Communication"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"eng"},{"slug":"marketing-analyst-stuttgart-223912","company_name":"eFLY Marketplace Services GmbH","title":"Marketing Analyst (m\/w\/d)","description":"As a marketing analyst in our team, you are responsible for calculating and controlling our customers' advertising budgets. Your main goal is to achieve the best possible visibility within the given budget. One of your key tasks is to regularly create detailed evaluations in order to keep the customer informed about the progress and success of our marketing measures. In addition to budget management, the strategic positioning of the products in the desired advertising spaces is also an essential part of your role. You will ensure that our customers can present their products where they have the greatest impact. In this position, you will play an important role in our team by making data-driven decisions that help optimize our marketing strategies. Responsibilities Development of SEA strategies with our account managers and control and expansion of the advertising potential of AmazonKeyword research and on- and off-page analysis and optimizationOptimal exploitation of the campaign potentialCreation of analyzes and derivation of measures to further develop the campaigns using analysis toolsDevelopment of reports to document the results for customer dealings with Amazon Seller CentralOptimization of PPC prices taking into account previously defined strategiesQualificationYou have already completed commercial training (preferably as a businessman for e-commerce or...)Independent workHigh level of comprehension and quick familiarization with new subject areasTeam and communication skillsAnalytical understanding and affinity for numbersStructured in writing and oral communicationVery good knowledge of Excel and PowerPointBenefitsWe are looking for people who take on responsibility and want to become the best in their field. If you bring this attitude with you, we will give you the chance to grow beyond yourself. On the one hand, we will demand a lot from you, but on the other hand, we will also offer you a lot: an above-average motivated and familiar team, the opportunity for personal and professional development and an environment that values ​​your performance. See for yourself and take a detour to our last workation in Portugal:https:\/\/www.youtube.com\/watch?v=dXcSIfU1zKwHere you can find our social media accounts:LinkedIn eFLY: https:\/\/www.linkedin.com\/company\/66918950\/ LinkedIn Moritz: https:\/\/www.linkedin.com\/in\/moritz-heller-ab1310183\/Instagram eFLY: https:\/\/www.instagram.com\/efly\\_marketplace\\_services\/Instagram Moritz: https:\/\/www.instagram .com\/moritz\\_\\_heller\/We look forward to seeing you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/efly-marketplace-services-gmbh\/marketing-analyst-stuttgart-223912","tags":["Marketing Manager"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"afr"},{"slug":"sachbearbeiter-finanzen-munich-482972","company_name":"MY Humancapital GmbH","title":"Clerk (m\/f\/d) Finance","description":"Are you looking for a reliable partner to help you find a job? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer in Munich, we are looking for you as a finance clerk (m\/f\/d) as soon as possible. Tasks As a finance clerk (m\/f\/d), you are responsible for the preparation of Responsible for requirements and cost lists You are responsible for preparing the documents for examination by public donors and auditors. You also support the monitoring of finances as part of research projects. You combine data from various sources and integrate the information into one document. Finally, you manage financial transactions. Qualification You bring a successfully completed Vocational training in the commercial sector (e.g. tax clerk (m\/f\/d), office clerk (m\/f\/d), clerk for office management (m\/f\/d), ) or a comparable qualification with quick comprehension as well as teamwork and service orientation characterize you You also impress with your careful and reliable way of working coupled with a good understanding of numbers. A confident use of MS Office, especially Excel, rounds off your profile. Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/sachbearbeiter-finanzen-munich-482972","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"datenbankadministrator-munich-108139","company_name":"MY Humancapital GmbH","title":"Datenbankadministrator (m\/w\/d)","description":"Are you looking for a reliable partner to help you find a job in Munich? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer, we are looking for you as a database administrator (m\/f\/d) as soon as possible. Tasks As a database administrator (m\/f\/d), you will be responsible for the operation and administration of DB2 database systems (Linux \/ Unix \/ Windows) You will take care of maintaining and ensuring the availability and recoverability of the database systems. You will also create and maintain the necessary operating manuals. You will advise and support the application developers in the specialist areas. You will also work with service providers from the backup and security sector. Qualifications You have successfully completed training in the IT sector (e.g. as an IT specialist (m\/f\/d) for system integration, clerk (m\/f\/d) for IT system management, IT systems clerk (m\/f\/d), )Alternatively, have You would also like to have a degree in the IT sector. You have in-depth specialist knowledge in the operation and administration of databases. You have a strong analytical mindset and impress with your independent, precise and solution-oriented way of working. Very good knowledge of German and good English complete your profile. You will find the job profile Interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Andrej Oberdrfer on 089 954 287 112.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/datenbankadministrator-munich-108139","tags":["System and Network Administration"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"quereinstieg-telefonische-kundenbetreuung-fur-die-sparkasse-bremen-357642","company_name":"S-Kundenservice","title":"Lateral entry in telephone customer service (m\/f\/d) for Sparkasse Bremen","description":"As a subsidiary of Sparkasse Bremen AG, we are responsible for customer service. Our goal is to always give people friendly and competent advice and to help them as individually as possible with questions and problems. Responsibilities You are the first telephone contact person for Sparkasse Bremen customers and support them with concerns and questions about the various products and Services (e.g. online banking, card products, payment transactions, and much more).If necessary, you provide information on various topics (e.g. account and branch information).You make customers aware of the advantages of various Sparkasse Bremen services at the appropriate point Optimize the customer experienceYou refer topics that require expert advice to the relevant colleagues in the branches or arrange appointments with them on site \/ by telephone \/ via video chatQualificationYou impress with a friendly and professional demeanor and enjoy customer contactYou You have very good language skills in German as well as good verbal and written expressiveness. You have an affinity for dealing with digital media. Are you currently \"at home\" in a completely different industry\/activity and would you like to try something new? Then we look forward to receiving your application! Because your personality is far more important to us than a \"formal fit\"!BenefitsYou can expect a flat hierarchy with a \"you\" culture, transparency and appreciation - also in terms of remuneration: we offer you an attractive salary model. You will receive individual 1:1 mentoring during your training, so that you are given all the necessary knowledge. You can organize your working hours flexibly within the framework of our core working hours from Monday to Friday, 8:00 a.m. - 8:00 p.m. After successful training, you have the opportunity to partially work remotely from home. You benefit from a company pension plan, Capital-forming benefits, a job bike and many other social benefits. You work in a crisis-proof environment with 27 days of vacation (Christmas & New Year's Eve also free). Your contact person is Joyce Pool (Team Assistant Recruiting). If you have any questions, please contact them by phone: +49 173 179 0167. We look forward to receiving your application! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/s-kundenservice\/quereinstieg-telefonische-kundenbetreuung-fur-die-sparkasse-bremen-357642","tags":["Marketing and Communication"],"job_types":["berufserfahren"],"location":"Bremen","created_at":1702680543000,"original_language":"deu"},{"slug":"testprozess-berater-testmanager-nuremberg-33680","company_name":"isento GmbH","title":"Test process consultant \/ test manager (m\/f\/d)","description":"Software testers don't destroy code, they destroy illusions about the code! (after James Bach)**Do you see it the same way? Then we are looking for you as a test process consultant\/test manager (m\/f\/d).We testers at isento are realists; analysts; anarchists; creative; systematic; intuitive; curious; skeptical; methodical; communicative; always available for a pairing; beliefs and qualities; lifelong learners; technically fascinated; professionally interested; professional and above all: in a good mood because we love what we do! We are isento (Portuguese: free) and implement software projects from conception to rollout. As a test process consultant\/test manager (m\/f\/d), you support our projects with valuable and early feedback, sustainable test solutions and methodological excellence. If you have experience with test management tasks and a passion for test process improvement, then we should get to know each other !TasksYour job at isentoDevelopment of test strategies and test concepts (agile and classic)Taking on operational test management tasksWorkshops and coaching for test process improvement in project teamsQualificationWhat you bring with youSeveral years of project experience as a tester, test manager or test consultantKnowledge of Scrum & Kanban as well as classic process modelsIdeally basic knowledge of ITIL and ISO29119Experience in the planning and implementation of workshops, interviews or assessmentsIdeally experience with test maturity models (e.g. TPI, TMap or TestSPICE)ISTQB: at least foundation level, advanced level test management would be idealBenefitsThis is isentoFlat hierarchies, flexible working hours and home office are no longer a unique selling point, For us, they are part of a modern working culture. What else you can look forward to with us: We work as a team on equal terms. We practice open exchange, bring in our own initiative, new ideas and also constructive criticism. We learn from and with each other, develop together and celebrate together on our roof terrace. No matter whether it's beef or seitan steak, a couch potato or an adrenaline junkie, with a family, a cat or a cockatoo, we are a colorful team, we are isento! Join our team and bring in your individuality. We look forward to seeing you! What else do we offer? Visit our website or send us your application documents and we will get to know each other!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/testprozess-berater-testmanager-nuremberg-33680","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680543000,"original_language":"deu"},{"slug":"debitorenbuchhalter-munich-54263","company_name":"MY Humancapital GmbH","title":"Debitorenbuchhalter (m\/w\/d)","description":"Unser Partnerunternehmen sucht Sie als Debitorenbuchhalter (m\/w\/d) fr das Headquarter in Mnchen. Dabei handelt es sich um einen marktfhrenden Konzern aus der Immobilienbranche. In den vergangen Wochen und Monaten haben sie ein starkes Wachstum hingelegt, sodass das Team weiteren Zuwachs sucht. Wichtig ist, dass es neben der fachlichen Komponente auch zwischenmenschlich matched - schlielich mchten sie langfristig mit Ihnen planen.AufgabenAls Debitorenbuchhalter (m\/w\/d) sind Sie fr das Forderungsmanagement zustndigDabei buchen und kontieren Sie Ausgangrechnungen und ZahlungseingngeSie berwachen und klren offene PostenZudem fhren Sie das Mahnwesen schriftlich und telefonisch durchDarber hinaus wirken Sie bei der Erstellung von Monats-, Quartals- und Jahresabschlssen mitQualifikationIdealerweise bringen Sie erste Erfahrungen im Bereich der Buchhaltung mitZustzlich haben Sie eine abgeschlossene kaufmnnische Ausbildung, wie bspw. als Brokauffrau (m\/w\/d), Kauffrau fr Brokommunikation (m\/w\/d), Industriekauffrau (m\/w\/d) oder Gro- und Auenhandelskauffrau (m\/w\/d)Sie berzeugen Sie durch Ihre strukturierte Art sowie Ihrer selbststndigen und zuverlssigen ArbeitsweiseErste Kenntnisse mit einem der gngigen Buchhaltungssysteme sind von VorteilBenefitsModerner Arbeitgeber: Das Unternehmen erhielt bereits zahlreiche Auszeichnungen als attraktiver ArbeitgeberWork Life: Ihnen werden Familienfreundliche Arbeitsbedingungen garantiert, sodass Sie Beruf und Karriere und einen Hut bringenOnboarding: Sie erwartet eine professionelle Einarbeitung von den Experten der AbteilungEntwicklung: Firmenintern gibt es zahlreiche WeiterbildungsmglichkeitenGesundheit: Mobilen Massage-Service, Betriebssportgruppen sowie hhenverstellbare Schreibtische sorgen fr Ihr WohlSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/debitorenbuchhalter-munich-54263","tags":["Accounts Receivable"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"eng"},{"slug":"trainee-fur-die-baukoordination-start-2024-kassel-236837","company_name":"Deutscher Bauservice GmbH","title":"Trainee for construction coordination (m\/f\/d) - start 2024","description":"Do you have training in civil engineering or construction electrical engineering and have you already gained some professional experience? Are you bored at your current job, your Chev is annoying you or you want to develop yourself further and take on responsibility? Do you superficially know the typical processes on construction sites, but would like to deepen your knowledge? Then you've come to the right place at the German Construction Service! Apply today and join our team!TasksSupport from experienced colleagues (m\/f\/d)Performing the quality, timely and budget-oriented provision of construction supervision in the area of ​​fiber optic expansionGeneral documentation, e.g. documenting the correct installation depthParticipation in construction meetingsChecking the general. Construction operations based on company checklistsQualificationYou have completed training in the field of civil engineering, e.g. as a foreman (m\/f\/d), civil engineering construction technician (m\/f\/d), as a construction electrician (m\/f\/d) or comparable qualificationIndependent and responsible way of workingDriving license class BReadiness to Long-term supra-regional deploymentBenefitsTrustful working hoursCompany pension schemeBicycle leasingCompany fitness programThe opportunity to develop and develop professionallyAttractive fixed salary and expensesCompany car that can also be used privatelyThe opportunity to take responsibility for the areaFlat hierarchies and short decisionsProfessional and personal development is encouragedMany joint events and happeningsCompany with start-up flairWe are happy us on YOU!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deutscher-bauservice-gmbh\/trainee-fur-die-baukoordination-start-2024-kassel-236837","tags":["Training","Development"],"job_types":["hilfstätigkeit \/ student"],"location":"Kassel","created_at":1702680543000,"original_language":"deu"},{"slug":"sachbearbeiter-bank-munich-466763","company_name":"MY Humancapital GmbH","title":"Clerk (m\/f\/d) - Bank","description":"Are you looking for a reliable partner to help you find a job in Munich? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer, we are looking for you as a bank clerk (m\/f\/d) as soon as possible. Tasks As a bank clerk (m\/f\/d) you will be responsible for recording, maintaining and processing customer master data You are responsible for the processing and control of all payment flows. You are responsible for processing transactions according to standardized correspondence. Documenting cases is also part of your area of ​​responsibility. You also work with other financial service providers and authorities. Qualifications: You have successfully completed professional training in the commercial sector (e.g. bank clerk (m\/ f\/d), tax clerk (m\/f\/d), office clerk (m\/f\/d), office management clerk (m\/f\/d), ) or a comparable qualification with In addition, you have initial experience as a commercial clerk (m\/f\/d), bank clerk (m\/f\/d) or a similar area. You will also impress with your careful and reliable way of working coupled with a good understanding of numbers. A confident use of MS Office completes your profile. Benefits Work Life: A lot is expected from the employer It is important to balance private life and career (e.g. Flexitime, home office option, etc.) Further training: If you rest, you rust. Accordingly, great importance is placed on the development of employeesTeam spirit: Friendly colleagues, flat hierarchies and numerous employee eventsInduction: You can expect individual and detailed training from experienced employeesDo you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/sachbearbeiter-bank-munich-466763","tags":["Private Banking"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"bankkaufmann-munich-360984","company_name":"MY Humancapital GmbH","title":"Bank clerk (m\/f\/d)","description":"Are you looking for a reliable partner to help you find a job in Munich? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer, we are looking for you as a bank clerk (m\/f\/d) as soon as possible. Tasks As a bank clerk (m\/f\/d) in customer advice, you will act as a contact person in investment, Insurance and credit businessYou inspire customers with our products and services as well as those of our cooperation partners. In addition, you always advise our customers holistically and in line with their needs. In doing so, you secure existing customer business and strive for new customers. Finally, you are responsible for the follow-up and documentation of customer conversations. Qualifications You have successfully completed training Bank clerk (m\/f\/d), insurance clerk (m\/f\/d), merchant (m\/f\/d) for insurance and finance or a comparable qualification. Ideally, you already have initial professional experience as a customer advisor (m\/f\/d). You can collect banking skillsEmpathy and communication skills are among your strengthsYou are open to further training programs such as seminars and sales trainingWhen interacting with customers, you are always friendly and service-orientedBenefitsYou can combine your private life and career perfectly through flexible working time modelsYou have the opportunity to actively participate in future projectsEmployee benefits such as job tickets, You value fitness and coaching. You want varied and interesting activities in which you can take on responsibility. You can also expect fair remuneration with 13 monthly salaries and a company pension plan. Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/bankkaufmann-munich-360984","tags":["Asset","Fonds Management"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"senior-manager-it-berlin-304408","company_name":"Capital Bay Group","title":"Senior Manager IT (m\/w\/d)","description":"The Capital Bay Group is an internationally active investment, asset, property and facility manager as well as a project developer for real estate of all types of use, integrated at all levels of the value chain. As a recognized business partner with an international network of relationships, the company acts for both large institutional investors and private investors and covers the entire value chain relating to real estate. We are now looking for a new colleague as a senior manager for our German headquarters in Berlin IT.TasksSystem and application support for Windows and Linux-based ERP environmentsSupport of open source applications for project planning, ticket control, content servicesConfiguration and administration of property management and financial accounting systemsDesign and further development of infrastructure servers in the various environments (AD, LDAP, oAuth) as well as databases (PostgreSQL and others) Administration of Windows and Linux operating systems Management of the operating environment with our own servers as well as in private and public cloud environments (including Microsoft 365) Operation of test and integration environments Instructions for providers in release management of applications Migration of Citrix OnPremise IT applications and infrastructure in the cloudExpansion of automation IaC (Infrastructure as Code)Team leadershipQualificationCompleted degree in computer science or a comparable qualificationExperience in setting up and developing IT service structuresExtensive experience in IT service management, ideally with a certification in ITIL communication skills, paired with a High customer orientation and the ability to build relationships with internal and external stakeholders Analytical and solution-oriented thinking and acting Strong implementation skills and results orientation In addition to in-depth knowledge of complex IT landscapes and the development of shared services structures, you have reliable experience in the management of medium-sized IT projects Very good knowledge of English and Willingness to take occasional business tripsBenefitsExciting tasks, freedom and exciting projects with direct responsibilityResponsibility and demanding work with a long-term perspectiveFlexible working hours and the possibility of a mobile officeWorking in a committed team30 days of vacation and various special vacation daysYour birthday is a day to celebrate and for you a day offCompany pension planVarious Company and team events as well as a modern working environment. Discounted company rate for the Penta Hotel Group. Are you missing something here? Then tell us! We look forward to receiving your application including the earliest possible starting date and your salary expectations: You can find out more about us at: capitalbay(dot) deFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/capital-bay-group\/senior-manager-it-berlin-304408","tags":["IT"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702680543000,"original_language":"deu"},{"slug":"junior-projektmanager-fur-erneuerbare-energien-molbergen-304285","company_name":"Deutscher Bauservice GmbH","title":"Junior Project Manager for Renewable Energy (m\/f\/d)","description":"We are currently developing rapidly into a leading provider of services for engineering offices and civil engineering companies. In order to further expand our existing projects or project areas, we are looking for support. Are you interested in helping to plan large, Germany-wide projects? Are you practical and able to keep an overview even in stressful situations? Would you like to be part of an agile project team and develop with us? Then you've come to the right place! Apply today and support our team! Tasks Execution of projects and all related activities Operational planning, organization and monitoring of several construction projects in the field of renewables EnergyPreparation and follow-up of meetings including documentation of the resultsResponsibility for the successful completion of the project in compliance with the time and budget requirementsOngoing project communication with all those responsible and institutions involvedQualificationCompleted technical and business studies, e.g. industrial engineering with a focus on project management, civil engineering, energy and environmental technology or one Completed commercial training or... with appropriate professional experienceFirst experience in renewable energy projects\/internships would be an advantageAffinity for technical and commercial topicsYou work in a solution-oriented manner and can set prioritiesHigh communication and team skills as well as organizational talentBenefitsA trusting and appreciative collaboration with great development potentialCompany bike leasingCompany fitness programThe opportunity to get involved and continue to grow the company develop an open and honest feedback culture, flexible working hours\/trusted working hours and the possibility of working on the move, company pension provision, flat hierarchies, professional and personal development is encouraged. Depending on the professional field, a company car (including private use) is provided )We look forward to hearing from you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deutscher-bauservice-gmbh\/junior-projektmanager-fur-erneuerbare-energien-molbergen-304285","tags":["Power Engineering and Environmental Engineering"],"job_types":[],"location":"Molbergen","created_at":1702680543000,"original_language":"deu"},{"slug":"senior-softwareentwickler-java-nuremberg-402260","company_name":"isento GmbH","title":"(Senior) Softwareentwickler Java (m\/w\/d)","description":"Werde Teil unseres Teams!Experience is the name everyone gives to their mistakes.  Oscar WildeDu suchst eine Stelle in Nrnberg, bei der du Verantwortung bernimmst und die Mglichkeit hast Neues zu lernen und Dich weiterzuentwickeln. ein Unternehmen, das auf Langfristigkeit ausgerichtet ist, Kommunikation auf Augenhhe frdert, und wo Wertschtzung und offener Austausch einen hohen Stellenwert haben. ein offenes Umfeld, in dem Du Ideen einbringen und aktiv mitgestalten kannst, um positive Vernderungen voranzutreiben.YES zu Exzellenz und Leidenschaft!Wir sind isento (portugiesisch: frei) und realisieren IT-Projekte in Nrnberg von der Konzeption bis zum Rollout. Als Software Developer bringst du dich bei der Entwicklung mageschneiderter Lsungen fr die Herausforderungen unserer namhaften Kunden ein. Dabei leben wir Teamwork, Austausch und das permanente von- und miteinander Lernen. So entwickeln wir Software und auch uns selbst stets weiter.AufgabenDein Job bei isentoIn einem crossfunktionalen Projektteam entwickelst du hochwertige Softwarelsungen mit Java, Spring Boot und aktuellen Webtechnologien wie AngularDabei bernimmst du eine Schlsselrolle bei der Gestaltung und Umsetzung von Projekten fr lokale Kunden und unsere hauseigene Produktentwicklung.Mit deinem Knowhow untersttzt du deine Teammitglieder und leitest weniger erfahrenen Kolleg:innen an, um deren technische Fhigkeiten zu frdern und zu entwickelnDu identifizierst technischen Herausforderungen und entwickelst effektive LsungsstrategienDu gestaltest isento mit deinen Ideen aktiv mitQualifikationDas bringst Du mitDu hast eine Leidenschaft fr Softwareentwicklung, teilst dein Wissen gerne und mchtest stetig dazu lernenDu hast langjhrige Erfahrung in der Softwareentwicklung und konntest in unterschiedlichen Projekten Erfahrungen sammeln, Fehler machen und daraus lernenDu l(i)ebst hohe Qualitt  Clean Code, Unit Tests, Code Reviews und smarte Architekturen sind fr dich selbstverstndlichDu hast umfassende Kenntnisse in Java und bist sicher im Umgang mit Datenbanken, Webtechnologien, Versionsverwaltungen, Buildsystemen, DevOps und MicroservicesDu kommunizierst offen, gibst konstruktive Kritik und nimmst Feedback anGute Deutschkenntnisse (mind. B2) erleichtern dir und uns die Kommunikation miteinanderBenefitsDas ist isentoFlache Hierarchen, flexible Arbeitszeiten und Home Office sind schon lange kein Alleinstellungsmerkmal mehr, sondern gehren fr uns zu einer modernen Arbeitskultur. Auf was Du Dich bei uns also sonst noch freuen kannst:Wir arbeiten als Team auf Augenhhe. Wir leben den offenen Austausch, bringen Eigeninitiative, neue Ideen, aber auch konstruktive Kritik ein. Wir lernen von- und miteinander, entwickeln uns zusammen weiter und feiern gemeinsam auf unserer Dachterrasse. Egal ob Rinder- oder Seitansteak, Couchpotato oder Adrenalinjunkie, mit Familie, Katze oder Kakadu  wir sind ein buntgemischtes Team, wir sind isento! Komm in unser Team und bringe Deine Individualitt ein. Wir freuen uns auf Dich!Was wir sonst noch bieten? Besuche unsere Website oder schicke uns Deine Bewerbungsunterlagen und wir lernen uns kennen!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/senior-softwareentwickler-java-nuremberg-402260","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680543000,"original_language":"eng"},{"slug":"personalsachbearbeiter-in-voll-und-teilzeit-munich-416168","company_name":"MY Humancapital GmbH","title":"Human resources administrator (m\/f\/d) full-time and part-time","description":"Our partner company is looking for you as a “human resources clerk (m\/f\/d)” full-time and part-time for the company headquarters in Munich. This is a future-oriented public service company. As a leading administrative organization in the field of research, they make an important contribution to society as a whole. If you are looking for meaningful work and describe yourself as an organizational talent and team player, this position is exactly the right one for you! Responsibilities As a human resources administrator (m\/f\/d), you will take on all administrative tasks in the onboarding process as well as employee support You will provide the recruitment documents and contract adjustments. You will also be the contact person for all HR-related issues. You will accompany important HR projects and take on HR reporting. You will also be involved in optimizing HR processes, particularly in onboarding. Qualifications You have completed training as a clerk (m\/f\/d) , bro assistant (m\/f\/d), medical assistant (m\/f\/d), assistant (m\/f\/d) in healthcare or comparable training with Ideally you have already worked as an assistant (m\/f\/d), secretary ( m\/f\/d) or worked in a similar positionYou are an organizational talent with a hands-on mentality and a structured way of workingYou enjoy what you do and do your job with passionGood MS Office skills round off your profileBenefitsFlexibility: Enjoy the freedom through flexible working hours and the option to work from homeWork Life: You are guaranteed family-friendly working conditions, so that you can combine your job and career with a hatModern office: In the heart of Munich you can expect modern office spaces with the latest technical equipmentTeam spirit: Collegial and motivating working atmosphere with flat hierarchiesFurther training: your personal Development is promoted through training and seminars. Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Franziska Wild on 089 954 287 104.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/personalsachbearbeiter-in-voll-und-teilzeit-munich-416168","tags":["Administration"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"nds"},{"slug":"marketing-manager-flintbek-246344","company_name":"UniverCell Holding GmbH","title":"Marketing Manager (m\/w\/d)","description":"Would you like to play a significant role in driving forward the energy transition and would you like to support this by contributing your experience and creative ideas? Then we are looking for you to join our motivated team in Flintbek near Kiel! UniverCell develops and produces electrodes and battery cells in Germany based on lithium-ion technology and operates one of the largest electrode and cell production facilities in Europe for innovative premium applications. With everything we do, we harness sustainable energy and develop energy storage systems with the highest quality, innovative technology and maximum performance. Our products are used in aerospace, medical technology and other areas where the highest quality and performance are required. Tasks Conception, implementation and control of online marketing projects Independent and creative planning and implementation of social media -Strategy of UniverCell Formulation of creative and appealing texts for websites, social media, press, campaigns, case studies, company presentations Creation of graphic content and associated texts for storytelling Content preparation of events, e.g. B. Creation of presentations Possibly accompanying some events on site Development of marketing materials together with the team Development, planning and implementation of further agile projects Direct coordination of marketing measures with the team and management Support in the implementation of employer branding measures (interface to HR department) Qualifications Completed studies with a focus on marketing or comparable training Several years of experience in marketing You have already designed projects independently and promoted them in a structured manner. An independent, careful and solution-oriented way of working is a given for you. You enjoy entrepreneurial thinking and have outstanding organizational skills. Good project management skills. Skills and good time management High communication and team skills as well as cross-functional thinking Fluent German and English knowledge Knowledge of MS Office First experience in Adobe Creative Cloud (InDesign, Photoshop, Illustrator) Benefits Modern personnel management as a crucial part of our corporate philosophy Security and the possibility of Company to grow Freedom and space for your own ideas Further development opportunities for your personal and professional development A dynamic and motivated team in which everyone is an important part of our success and is valued accordingly Varied tasks in an exciting market environment We look forward to receiving your application! The information at Collection of personal data in accordance with Art. 13 GDPR can be found on our homepage.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univercell-holding-gmbh\/marketing-manager-flintbek-246344","tags":["Marketing and Communication"],"job_types":[],"location":"Flintbek","created_at":1702680543000,"original_language":"deu"},{"slug":"personalreferent-munich-29335","company_name":"MY Humancapital GmbH","title":"Personalreferent (m\/w\/d)","description":"Are you looking for a reliable partner to help you find a job? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing. Numerous applications. Together we will find your dream job and it's completely free of charge! On behalf of our customer in Munich, we are looking for you as a \"Human Resources Officer (m\/f\/d)\" as soon as possible. Tasks As a Human Resources Officer (m\/f\/d), you will control the entire recruiting process Advise and support the managers as part of the selection processYou look after the employees from the day of onboarding right up to the time they leaveIn addition, you create contractual documents and certificates and also keep correspondence with health insurance companies and authorities. Creating evaluations and statistics is also part of your area of ​​responsibilityQualificationIdeally, you have professional experience in the human resources sector with or have further training in the area of ​​human resources (e.g. payroll accounting, human resources administration, human resources management, etc.) You have completed commercial vocational training (e.g. human resources specialist (m\/f\/d), clerk (m\/f\/d) in office management, industrial clerk ( m\/f\/d), ) or have completed a degree in business administration with a focus on human resources. Personally, you are characterized by your high level of social skills, strong communication skills and a friendly demeanor. You also impress with a reliable, precise and discreet way of working, which is rounded off by your confident use of Microsoft Office Your profile fromBenefitsModern employer: The company has already received numerous awards as an attractive employerWork Life: You are guaranteed family-friendly working conditions so that you can reconcile family and careerFurther training: Your personal development is promoted through training courses and seminarsBenefits: childcare subsidy, free drinks and discounted lunchSecurity: A future-proof job awaits you. Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/personalreferent-munich-29335","tags":["Personnel Specialist"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"data-engineer-8963-berlin-460432","company_name":"alphacoders","title":"Data Engineer (m\/w\/d) #8963","description":"Unser Partner mit HQ in Houston (USA) ist auf das gezielte und datengetriebene Investieren in Energiemrkte spezialisiert. Dies beinhaltet sowohl kommerzielle als auch nachhaltige Ressourcen, mit dem Fokus nach und nach ganzheitlich auf das Investieren in erneuerbare Energien umzusteigen.AufgabenDu bist fr das Generieren und Modifizieren der Daten verantwortlich. Dabei arbeitest du mit Python und PostgreSQL Datenbanken. Falls du im Bereich der Datenvisualisierung auch schon erste Erfahrungen mit R oder Frontend Programmiersprachen wie JavaScript oder TypeScript gesammelt hast, ist dies von Vorteil, aber kein Muss! Wenn du dich auerdem gerne mit dem Thema Finanzmrkte auseinandersetzt und Interesse an der Energiewirtschaft mitbringst, ist dies ebenfalls sehr hilfreich.Qualifikationabgeschlossenes Studium im Bereich Informatik, Data Science, Mathematik, o..Erfahrung mit Python und postgreSQL DatenbankenErste Erfahrung mit R, JavaScript oder TypeScript von VorteilStandort: Berlin, Homeoffice mglichHast du Interesse mehr ber diese Position zu erfahren? Sende uns deine Bewerbung und falls mglich deinen aktuellen Lebenslauf und weitere ntzlich Links wie Xing, LinkedIn oder Github.Wir werden uns schnellstmglich mit dir in Verbindung setzen.Dieser Job ist nichts fr dich? Schau dir gerne unsere anderen Positionen an. Wir suchen immer nach neuen Talenten, Beruferfahrenen und digitalen Experten.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/alphacoders\/data-engineer-8963-berlin-460432","tags":["Data Scientist"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702680543000,"original_language":"eng"},{"slug":"testautomatisierer-nuremberg-289898","company_name":"isento GmbH","title":"Test automation engineer (m\/f\/d)","description":"Software testers don't destroy code, they destroy illusions about the code! (after James Bach)**Do you see it the same way? Then we are looking for you as a test automation engineer (m\/f\/d).We testers at isento are realists; analysts; anarchists; creative; systematic; intuitive; curious; skeptical; methodical; communicative; always available for a pairing; beliefs and qualities; lifelong learners; technically fascinated; professionally interested; professional and above all: in a good mood because we love what we do! We are isento (Portuguese: free) and implement software projects from conception to rollout. As a test automation engineer (m\/f\/d), you support our projects with valuable and early feedback, sustainable test solutions and methodological and technical excellence.TasksYour job at isentoConception, introduction and maintenance of automation solutionsDefinition and coordination of automation strategies and automation architecturesImplementation and implementation of automated TestsWorking in agile teams (Scrum, Kanban)QualificationsWhat you bringSeveral years of experience in software testing and test automationKnowledge of automation frameworks (e.g. Robot Framework, Cucumber), automation architectures (e.g. Keyword-Driven Testing, Data-Driven Testing, POM), CI\/CDExperience with common automation solutions (e.g. Selenium, Playwright, Postman) Knowledge of object-oriented languages ​​(Java, C#), databases, web services and testing tools (e.g. SoapUI, ReadyAPI) At least ISTQB Certified Tester Foundation Level Very good knowledge of German (at least B2) Benefits This is isento Flat hierarchies, flexible working hours and home Office is no longer a unique selling point, but is part of a modern work culture for us. What else you can look forward to with us: We work as a team on equal terms. We practice open exchange, bring in our own initiative, new ideas and also constructive criticism. We learn from and with each other, develop together and celebrate together on our roof terrace. No matter whether it's beef or seitan steak, a couch potato or an adrenaline junkie, with a family, a cat or a cockatoo, we are a colorful team, we are isento! Join our team and bring in your individuality. We look forward to seeing you! What else do we offer? Visit our website or send us your application documents and we will get to know each other!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/testautomatisierer-nuremberg-289898","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680543000,"original_language":"deu"},{"slug":"werkstudent-in-in-der-it-brandenburg-6281","company_name":"Oxford PV Germany GmbH","title":"Werkstudent\/in in der IT (m\/w\/d)","description":"Oxford PV is one of the world's technological leaders and most promising companies in the field of renewable energy. With the installation of a production line at the Brandenburg an der Havel location, we are starting the commercial production of solar cells with world record efficiency. In this way, we are making a valuable contribution to the CO2-free energy supply for future generations. Become part of our rapidly growing team and support us in driving forward the green energy transition. As soon as possible, we are looking for a working student (m\/f\/d) in Brandenburg an der Havel to support our IT. Tasks Support activities for general administrative and organizational tasks Help with the structuring of cabling Support with the introduction of new tools Collaboration in improving our systems Support with the inventory and maintenance of the hardware on site as well as regular control of the existing rental devices, Teams devices and the hardware inventory Qualification Study in the field of business informatics or computer science Knowledge in the area of ​​PC administration and Network technology is an advantage Confident use of common MS Office applications (Excel, Outlook, Word, PowerPoint) Strong problem-solving skills, quick comprehension and hands-on mentality Independence, reliability and team spirit Very good knowledge of spoken and written German, knowledge of English is an advantage Benefits An exciting working environment in a growing international companyAn attractive hourly wageA modern, equipped workplaceFlexible working hoursIn-house English lessonsTeam events30 days vacation \/ yearOxford PV is an employer that pays attention to equal opportunities and welcomes applications from suitably qualified and suitable applicants regardless of gender, origin, disability, age, sexual orientation , transgender status, religion or belief, marital status or pregnancy and motherhood are expressly desired. Have we aroused your interest? Then we look forward to receiving your detailed application.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/oxford-pv-germany-gmbh\/werkstudent-in-in-der-it-brandenburg-6281","tags":["IT"],"job_types":["Working student"],"location":"Brandenburg","created_at":1702680543000,"original_language":"deu"},{"slug":"baukoordinator-glasfaserausbau-hoyerswerda-376228","company_name":"Deutscher Bauservice GmbH","title":"Construction coordinator (m\/f\/d) - Fiber optic installation","description":"Are you no stranger to safety on construction sites and in road traffic? Is participating in construction meetings and inspections part of your daily business? You can immediately recognize when construction sites are not properly secured and specifications have not been adhered to? Then you have come to the right place! We are successful because we act as a team in a solution-oriented and innovative manner. Become part of our motivated team and get started with us!TasksControl and monitoring of the construction projects in the fiber optic expansionCoordination and support of the activities on site both with regard to your own employees and the service providersRegular exchange with the responsible authorities and managersEnsuring quality and documentation standardsInterface between customers , contractors and the companyGeneral documentation and construction acceptance, as well as participation in construction meetingsQualificationA completed degree or training in the technical field or in construction electrical engineering or in civil engineering or road construction is an advantage or experience as a construction technician (m\/f\/d)First experience as Construction manager\/foreman (m\/f\/d) in the field of fiber optic or cable construction. Independent way of working, a high level of commitment and assertiveness. Driver's license class B. Willingness to travel throughout Germany. Benefits. Company pension plan. Trusted working hours. Bicycle leasing. Company fitness program. Attractive fixed salary and expenses. Company car that can also be used privately. Professional and personal development is encouraged Area to take overFlat hierarchies and short decisionsThe opportunity to develop professionallyMany joint events and eventsCompany with start-up flairWe look forward to YOU!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deutscher-bauservice-gmbh\/baukoordinator-glasfaserausbau-hoyerswerda-376228","tags":["Engineering"],"job_types":[],"location":"Hoyerswerda","created_at":1702680543000,"original_language":"deu"},{"slug":"assistenz-controlling-munich-171508","company_name":"MY Humancapital GmbH","title":"Assistenz (m\/w\/d) - Controlling","description":"Unser Partnerunternehmen sucht Sie als \"Assistenz (m\/w\/d) im Controlling \" fr ihr Headquarter in Mnchen. Dabei handelt sich um ein zukunftsorientiertes Wirtschaftsunternehmen aus dem ffentlichen Dienst, die weitere Fachkrfte fr die wirtschaftliche Betreuung der Groprojekte suchen. Wenn Sie sich selbst als Zahlenaffin und Teamplayer beschreiben, ist die Stelle genau die richtige fr Sie!AufgabenAls Assistenz (m\/w\/d) im Controlling sind Sie zustndig fr die Durchfhrung von Soll\/Ist AnalysenDabei sind Sie fr die Vorbereitung und Erstellung von Budgetplne sowie Reportings zustndigSie wirken bei der berprfung von Unternehmenszahlen mitIhr fundiertes Wissen setzen Sie gekonnt bei der Vorbereitung der Jahresabschlsse einZudem wirken Sie aktiv bei der Optimierung der vorhandenen Instrumente und Prozesse mitQualifikationSie verfgen ber ein erfolgreich abgeschlossenes betriebswirtschaftliches Studium mit Schwerpunkt Rechnungswesen\/Controlling\/Finanzen (z.B. BWL, Finanzmanagement, Rechnungs- und Steuerwesen, )  Alternativ haben sie eine erfolgreich abgeschlossene Ausbildung im kaufmnnischen Bereich (z.B. Brokaufmann (m\/w\/d), Kaufmann (m\/w\/d) fr Bromanagement, Industriekaufmann (m\/w\/d), ) Idealerweise haben Sie bereits erste Erfahrung innerhalb des Controllings gesammelt oder bringen eine Weiterbildung zum Controller (m\/w\/d) mit Eine eigenstndige, strukturierte sowie lsungs- und ergebnisorientierte Arbeitsweise zeichnet Sie aus Ein sicherer Umgang mit MS-Office, insbesondere mit Excel, rundet Ihr Profil abBenefitsModerner Arbeitgeber: Das Unternehmen erhielt bereits zahlreiche Auszeichnungen als attraktiver ArbeitgeberWork Life: Ihnen werden Familienfreundliche Arbeitsbedingungen garantiert, sodass Sie Beruf und Karriere und einen Hut bringenFlexibilitt: Genieen Sie die Freiheit durch flexible Arbeitszeiten sowie die Mglichkeit zum HomeofficeVerpflegung: Ihre ausgewogene Ernhrung ist dank des firmeninternen Restaurants gesichertGesundheit: Neben hhenverstellbaren Schreibtischen, gibt es ein breites Sportangebot sowie kostenfreies ObstSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/assistenz-controlling-munich-171508","tags":["Controlling"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"eng"},{"slug":"baukoordinator-glasfaserausbau-hann-munden-201208","company_name":"Deutscher Bauservice GmbH","title":"Construction coordinator (m\/f\/d) - Fiber optic installation","description":"Are you no stranger to safety on construction sites and in road traffic? Is participating in construction meetings and inspections part of your daily business? You can immediately recognize when construction sites are not properly secured and specifications have not been adhered to? Then you have come to the right place! We are successful because we act as a team in a solution-oriented and innovative manner. Become part of our motivated team and get started with us!TasksControl and monitoring of the construction projects in the fiber optic expansionCoordination and support of the activities on site both with regard to your own employees and the service providersRegular exchange with the responsible authorities and managersEnsuring quality and documentation standardsInterface between customers , contractors and the companyGeneral documentation and construction acceptance, as well as participation in construction meetingsQualificationA completed degree or training in the technical field or in construction electrical engineering or in civil engineering or road construction is an advantage or experience as a construction technician (m\/f\/d)First experience as Construction manager\/foreman (m\/f\/d) in the field of fiber optic or cable construction. Independent way of working, a high level of commitment and assertiveness. Driver's license class B. Willingness to travel throughout Germany. Benefits. Company pension plan. Trusted working hours. Bicycle leasing. Company fitness program. Attractive fixed salary and expenses. Company car that can also be used privately. Professional and personal development is encouraged Area to take overFlat hierarchies and short decisionsThe opportunity to develop professionallyMany joint events and eventsCompany with start-up flairWe look forward to YOU!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deutscher-bauservice-gmbh\/baukoordinator-glasfaserausbau-hann-munden-201208","tags":["Engineering"],"job_types":[],"location":"Hann. Münden","created_at":1702680543000,"original_language":"deu"},{"slug":"junior-softwaretester-fur-java-applikationen-nuremberg-100041","company_name":"isento GmbH","title":"Junior software tester (m\/f\/d) for Java applications","description":"Software testers don't destroy code, they destroy illusions about the code! (after James Bach)**Do you see it the same way? Then we are looking for you as a junior software tester (m\/f\/d) for Java applications. We testers at isento are realists; analysts; anarchists; creative; systematic; intuitive; curious; skeptical; methodical; communicative; always available for a pairing; beliefs and qualities; lifelong learners; technically fascinated; professionally interested; professional and above all: in a good mood because we love what we do! We are isento (Portuguese: free) and implement software projects from conception to rollout. As a junior software tester (m\/f\/d) for Java applications, you support our projects with valuable and early feedback, sustainable test solutions and methodological excellence. We learn from each other and exchange ideas regularly in various formats. So we look forward to what you bring with you and support you in developing yourself further as a tester. Tasks Your job at isento Creation of test cases based on the system specification Execution (manual and automated) of test cases Analysis and documentation of test executions Creation and maintenance of Unit testsTreatment of errors in a tracking system (bug tracking)Working in agile teams (Scrum, Kanban)QualificationsWhat you bring with youCompleted degree in (business) information technology, comparable training or talent as a career changer:inYou live IT affinity, feel yourself in one agile environment at home and have the desire to continually develop professionally and personally. You have already gained insights into software projects. Initial practical experience in software testing (e.g. test automation, exploratory tests, unit\/integration or system tests - with common testing tools). Basic knowledge of object-oriented Languages ​​(Java, C#) and common software testing toolsIdeally ISTQB Certified Tester Foundation LevelVery good knowledge of German (at least B2)BenefitsThis is isentoFlat hierarchies, flexible working hours and home office are no longer a unique selling point, but are part of a modern working culture for us. What else you can look forward to with us: We work as a team on equal terms. We practice open exchange, bring in our own initiative, new ideas and also constructive criticism. We learn from and with each other, develop together and celebrate together on our roof terrace. No matter whether it's beef or seitan steak, a couch potato or an adrenaline junkie, with a family, a cat or a cockatoo, we are a colorful team, we are isento! Join our team and bring in your individuality. We look forward to seeing you! What else do we offer? Visit our website or send us your application documents and we will get to know each other!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/junior-softwaretester-fur-java-applikationen-nuremberg-100041","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680543000,"original_language":"deu"},{"slug":"baukoordinator-glasfaserausbau-halle-saale-316220","company_name":"Deutscher Bauservice GmbH","title":"Construction coordinator (m\/f\/d) - Fiber optic installation","description":"Are you no stranger to safety on construction sites and in road traffic? Is participating in construction meetings and inspections part of your daily business? You can immediately recognize when construction sites are not properly secured and specifications have not been adhered to? Then you have come to the right place! We are successful because we act as a team in a solution-oriented and innovative manner. Become part of our motivated team and get started with us!TasksControl and monitoring of the construction projects in the fiber optic expansionCoordination and support of the activities on site both with regard to your own employees and the service providersRegular exchange with the responsible authorities and managersEnsuring quality and documentation standardsInterface between customers , contractors and the companyGeneral documentation and construction acceptance, as well as participation in construction meetingsQualificationA completed degree or training in the technical field or in construction electrical engineering or in civil engineering or road construction is an advantage or experience as a construction technician (m\/f\/d)First experience as Construction manager\/foreman (m\/f\/d) in the field of fiber optic or cable construction. Independent way of working, a high level of commitment and assertiveness. Driver's license class B. Willingness to travel throughout Germany. Benefits. Company pension plan. Trusted working hours. Bicycle leasing. Company fitness program. Attractive fixed salary and expenses. Company car that can also be used privately. Professional and personal development is encouraged Area to take overFlat hierarchies and short decisionsThe opportunity to develop professionallyMany joint events and eventsCompany with start-up flairWe look forward to YOU!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deutscher-bauservice-gmbh\/baukoordinator-glasfaserausbau-halle-saale-316220","tags":["Engineering"],"job_types":[],"location":"Halle (Saale)","created_at":1702680543000,"original_language":"deu"},{"slug":"baukoordinator-glasfaserausbau-erfurt-360809","company_name":"Deutscher Bauservice GmbH","title":"Construction coordinator (m\/f\/d) - Fiber optic installation","description":"Are you no stranger to safety on construction sites and in road traffic? Is participating in construction meetings and inspections part of your daily business? You can immediately recognize when construction sites are not properly secured and specifications have not been adhered to? Then you have come to the right place! We are successful because we act as a team in a solution-oriented and innovative manner. Become part of our motivated team and get started with us!TasksControl and monitoring of the construction projects in the fiber optic expansionCoordination and support of the activities on site both with regard to your own employees and the service providersRegular exchange with the responsible authorities and managersEnsuring quality and documentation standardsInterface between customers , contractors and the companyGeneral documentation and construction acceptance, as well as participation in construction meetingsQualificationA completed degree or training in the technical field or in construction electrical engineering or in civil engineering or road construction is an advantage or experience as a construction technician (m\/f\/d)First experience as Construction manager\/foreman (m\/f\/d) in the field of fiber optic or cable construction. Independent way of working, a high level of commitment and assertiveness. Driver's license class B. Willingness to travel throughout Germany. Benefits. Company pension plan. Trusted working hours. Bicycle leasing. Company fitness program. Attractive fixed salary and expenses. Company car that can also be used privately. Professional and personal development is encouraged Area to take overFlat hierarchies and short decisionsThe opportunity to develop professionallyMany joint events and activitiesCompany with start-up flairWe look forward to YOU!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deutscher-bauservice-gmbh\/baukoordinator-glasfaserausbau-erfurt-360809","tags":["Engineering"],"job_types":[],"location":"Erfurt","created_at":1702680543000,"original_language":"deu"},{"slug":"buchhalter-im-osten-von-munchen-vaterstetten-322667","company_name":"MY Humancapital GmbH","title":"Accountant (m\/f\/d) in the east of Munich","description":"Our partner company is looking for you as an “accountant (m\/f\/d)” for their headquarters in Munich. This is a future-oriented public service company. Due to the considerable growth in recent years, they are looking for more specialists in accounting. Are you looking for a crisis-proof job with varied activities? Then this position is exactly the right one for you! Tasks As an accountant (m\/f\/d) you will book and account for debtors, creditors as well as the bank and cash register. You will be responsible for the account reconciliation and clarification of open items. You will check, account and post incoming invoices and keep them up to date Keep an eye on outgoing payments Supporting VAT advance returns is also part of your area of ​​responsibility. You will also support the further development of processes and workflows in financial accountingQualificationYou have successfully completed training as a financial accountant (m\/f\/d), accounting specialist (m\/f\/d) or Tax clerk (m\/f\/d). Alternatively, you have training in the commercial sector (e.g. (industrial clerk (m\/f\/d), office clerk (m\/f\/d), ) Ideally, you have professional experience as an accounts payable accountant (m\/f\/d) or accounts receivable accountant (m\/f \/d) Personally, you are characterized by your organized and structured way of working, your high level of communication skills and your friendly demeanor. A confident use of MS Office completes your profile. Benefits Modern employer: The company has already received numerous awards as an attractive employer. Work Life: You are guaranteed family-friendly working conditions, so that You bring work and career together with a hatFlexibility: Enjoy the freedom through flexible working hours and the opportunity to work from homeFood: Your balanced diet is guaranteed thanks to the company's in-house restaurantHealth: In addition to height-adjustable desks, there is a wide range of sports and free fruitDo you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/buchhalter-im-osten-von-munchen-vaterstetten-322667","tags":["Finance"],"job_types":[],"location":"Vaterstetten","created_at":1702680543000,"original_language":"deu"},{"slug":"wirtschaftsprufungsassistent-munich-107972","company_name":"MY Humancapital GmbH","title":"Audit assistant (m\/f\/d)","description":"Are you looking for a reliable partner to help you find a job? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer in Munich, we are looking for you as an audit assistant (m\/f\/d) as soon as possible. Tasks As an audit assistant (m\/f\/d), you will be responsible for the coordination of audits You will be responsible for the entire exam preparation. You will also advise the departments on tax and business management issues. You will independently create audit reports and reports. You will also coordinate and monitor ongoing audits. Qualifications You will have successfully completed vocational training in the commercial sector (e.g. tax clerk (m\/f\/d), office clerk (m\/f \/d), clerk for office management (m\/f\/d), ) or a comparable qualification with Ideally, you have already been able to gain experience in the field of auditing. You are characterized by a quick comprehension and an analytical way of thinking. You also impress with your careful and reliable way of working A good understanding of numbersA confident use of MS Office, especially Excel, rounds off your profile. Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/wirtschaftsprufungsassistent-munich-107972","tags":["Auditor"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"baukoordinator-glasfaserausbau-aschaffenburg-327274","company_name":"Deutscher Bauservice GmbH","title":"Construction coordinator (m\/f\/d) - Fiber optic installation","description":"Are you no stranger to safety on construction sites and in road traffic? Is participating in construction meetings and inspections part of your daily business? You can immediately recognize when construction sites are not properly secured and specifications have not been adhered to? Then you have come to the right place! We are successful because we act as a team in a solution-oriented and innovative manner. Become part of our motivated team and get started with us!TasksControl and monitoring of the construction projects in the fiber optic expansionCoordination and support of the activities on site both with regard to your own employees and the service providersRegular exchange with the responsible authorities and managersEnsuring quality and documentation standardsInterface between customers , contractors and the companyGeneral documentation and construction acceptance, as well as participation in construction meetingsQualificationA completed degree or training in the technical field or in construction electrical engineering or in civil engineering or road construction is an advantage or experience as a construction technician (m\/f\/d)First experience as Construction manager\/foreman (m\/f\/d) in the field of fiber optic or cable construction. Independent way of working, a high level of commitment and assertiveness. Driver's license class B. Willingness to travel throughout Germany. Benefits. Company pension plan. Trusted working hours. Bicycle leasing. Company fitness program. Attractive fixed salary and expenses. Company car that can also be used privately. Professional and personal development is encouraged Area to take overFlat hierarchies and short decisionsThe opportunity to develop professionallyMany joint events and activitiesCompany with start-up flairWe look forward to YOU!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deutscher-bauservice-gmbh\/baukoordinator-glasfaserausbau-aschaffenburg-327274","tags":["Engineering"],"job_types":[],"location":"Aschaffenburg","created_at":1702680543000,"original_language":"deu"},{"slug":"ausbildung-zum-kaufmann-fur-buromanagement-schwerpunkt-personalwesen-2024-molbergen-419713","company_name":"Deutscher Bauservice GmbH","title":"Training to become an office management clerk (m\/f\/d) - focus on human resources 2024","description":"Are you outgoing, communicative and enjoy working with people? Would you like to actively shape the working world of tomorrow? Training in office management, with a focus on human resources, is exactly the right job for you. We are looking for YOU to start training on August 1st, 2024! Boredom is a foreign word for us! As a trainee (m\/f\/d), you are integrated into our team from the very first minute. Apply now and join our team!TasksGo through various departments with a focus on human resources, e.g. recruiting, personnel development, HR service and onboarding, but also marketing, sales and accounting. Contribution of your ideas to exciting projects and participation in events. Familiarization with tasks such as creating presentations , communication with internal and external service providers, appointment coordination and database maintenanceEmployee support and administration from entry to exitMaintenance of personnel master data and digital personnel files as well as the creation of job references Taking over organizational tasks and appointment coordinationQualificationIntermediate school leaving certificate (at least a good degree), commercial school diploma or high school diploma at the technical high school for business or .General university entrance qualificationEnjoy organization and coordinationInterest in commercial issuesOpen, friendly demeanor and team spiritUsing MS Office is no problem for youYou are flexible and feel comfortable in a dynamic, creative environmentBenefitsThe opportunity to \"get a taste of it\" with us during an internship before starting your trainingBest Chances of being taken on after training, taking into account which area you would like to specialize in. At the start you will get a Samsung Z Flip, otherwise your workplace will be modern and well equipped. Friendly company culture: we are on a first-name basis with flat hierarchies and always open doors. Training shortened to 2, 5 years possible Support for exam preparation, we are happy to pay the preparatory course Subsidy travel costs, be it to the vocational school or to our company headquarters Personal and professional development through regular feedback discussions and further training measures \/ Excellent development and career prospects Active job rotation Many joint events and occasions, your commitment and that of your team The DBS is only possible - that can and must be celebratedCompany with startup flairYou also have a buddy at your side who will support you with advice and supportCompany fitness program \"Hansefit\"We look forward to seeing you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deutscher-bauservice-gmbh\/ausbildung-zum-kaufmann-fur-buromanagement-schwerpunkt-personalwesen-2024-molbergen-419713","tags":["Administration and Secretariat"],"job_types":["Apprenticeship"],"location":"Molbergen","created_at":1702680543000,"original_language":"deu"},{"slug":"projektcontroller-munich-321863","company_name":"MY Humancapital GmbH","title":"Projektcontroller (m\/w\/d)","description":"Our partner company is looking for you as a “Project Controller (m\/f\/d)” for their headquarters in Munich. This is a future-oriented commercial company from the public sector that is looking for additional specialists for the economic support of large projects. If you describe yourself as a financial expert and team player, the position is exactly the right one for you! Responsibilities As a project controller (m\/f\/d), you will be responsible for all commercial support for controlling selected projects. You will analyze and support projects in close collaboration with project managers. You will lead Invoices, inventory valuations and financial planning through In addition, you will create ad hoc analyzes and reports. You will also take on a wide range of organizational tasks in your area of ​​work. Qualifications You have successfully completed a business degree with a focus on finance\/controlling or commercial training with relevant experience in controlling. Ideally, you already have experience in the area of ​​project controllingYou have a high level of affinity for numbersYou also have an independent and precise way of workingYou have extensive knowledge of MS Office and ideally have already worked with SAPBenefitsModern employer: The company has already received numerous awards as an attractive employerWork Life: You are guaranteed family-friendly working conditions, so that You bring work and career together with a hatFlexibility: Enjoy the freedom through flexible working hours and the opportunity to work from homeFood: Your balanced diet is guaranteed thanks to the company's in-house restaurantHealth: In addition to height-adjustable desks, there is a wide range of sports and free fruitDo you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Andrej Oberdrfer on 089 954 287 112.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/projektcontroller-munich-321863","tags":["Controlling"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"anwendungsberater-systembetreuer-kis-in-vollzeit-berlin-301732","company_name":"serviceline PERSONAL-MANAGEMENT GmbH & Co.KG","title":"Application consultant \/ system administrator KIS (m\/f\/d) full-time","description":"Our client is one of the leading European providers in the areas of medical rehabilitation and mental health. With more than 120 rehabilitation facilities throughout Germany, the company offers a dynamic and innovative environment for employees in a wide variety of treatment areas with a wide range of entry and development opportunities. Your expertise is needed at the company headquarters in Berlin and we are happy to be your first point of contact!TasksAdministration, maintenance and documentation of the hospital information systemProcess analysis and development of project-related concepts as well as the establishment of customer-specific adjustmentsAnalysis of the causes of errors and the development of solutions as part of user support in collaboration with other service unitsParticipate in IT projectsTraining of usersQualificationCompleted professional training in the field of IT or career changer (m\/f\/d) with relevant professional experienceIdeally experience with hospital software (CGM REHA, NEXUS)Fluent in GermanBenefitsThe security of a large group and the flexibility of a modern service provider in the healthcare industryAn open-minded team with fun at workResponsible and multi-faceted activitiesMany further development opportunities within the department up to specialization in selected subject areasExternal and internal training opportunities via the company's own academy as well as support with in-service training Company pension scheme with employer subsidy, corporate benefits, free drinks, regular fresh fruit in the office as well as company celebrations and team eventsMobile offer Work and a high degree of flexible working hoursA modern and barrier-free, ergonomically equipped workplace with very good U\/S-Bahn and bus connections, lockable bicycle parking spaces and free parking spaces in the area in the centrally located office in Berlin-CharlottenburgAnd do you want to change your career? and would like to contribute and position your expertise in a new way? Then we look forward to receiving your CV as a full-time application consultant \/ KIS system administrator (m\/f\/d) quoting the reference number B-AR-15122023. If you have any questions, please do not hesitate to call us at 030\/8846980. We guarantee you will receive feedback within 3 working days. We look forward to hearing from you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/serviceline-personal-management-gmbh-cokg\/anwendungsberater-systembetreuer-kis-in-vollzeit-berlin-301732","tags":["System and Network Administration"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702680543000,"original_language":"deu"},{"slug":"bilanzbuchhalter-50-60k-dreieich-430502","company_name":"Riverstate Premium Recruiting","title":"Accountant 50-60k (m\/f\/d)","description":"Experience the freedom to organize your working day, take an active part in internal company processes and enjoy the warm and humorous working atmosphere. If you have experience in financial accounting according to the German Commercial Code (HGB) and in accounts receivable accounting, all of this awaits you. Join a growing team in an established company that not only acts as a future-oriented employer, but also offers space for creative participation in work processes. The company aims to become the market leader for fiber optic expansion in southern Germany, which means long-term security and development opportunities. Apply now as an accountant 50-60k (m\/f\/d) Tasks You will be responsible for posting current business transactions in the subsidiary ledgers and in the general ledger. You will be involved in the timely preparation of the monthly, quarterly and annual financial statements in accordance with the German Commercial Code (HGB). You will take on special tasks and work in You are involved in projects, e.g. in the further development of the accounting processes of the company's own ERP system. You are the contact person for auditors, auditors and tax consultants. You prepare the VAT return. You work on controlling. Qualifications: You have completed commercial training, a business degree or comparable. You have at least 3 years of professional experience in accounts receivable accounting Good MS Office skillsYou have a very good command of spoken and written GermanBenefitsFlexibility: Thanks to flexitime, you enjoy the freedom to organize your working day according to your needs. There is also the option of working from home by arrangement. Friendly team: You will be part of a dynamic and diverse team that is always open and supportive. You have the opportunity to actively participate in building the team, introduce new structures and thereby take on exciting responsibilities within the company. Security in the company: In the midst of digitalization, fiber optic expansion is a rapidly growing industry in Germany. This means that your job is secured in the long term. The company also belongs to a large group of companies that has many years of experience in this area. It's best to apply now. We will then contact you by telephone and accompany you competently and reliably through the entire application process. Our advice is completely free of charge for you. If you have any questions, you can reach your personal contact person Dennis Markmann on +49 157 580 762 25 Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riverstate-premium-recruiting\/bilanzbuchhalter-50-60k-dreieich-430502","tags":["Accounts Receivable"],"job_types":["berufserfahren"],"location":"Dreieich","created_at":1702680543000,"original_language":"deu"},{"slug":"mietenbuchhalter-munich-264470","company_name":"MY Humancapital GmbH","title":"Rent accountant (m\/f\/d)","description":"Are you looking for a reliable partner to help you find a job in Munich? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer, we are looking for you as a rent accountant (m\/f\/d) as soon as possible. Tasks As a rent accountant (m\/f\/d), you will process and monitor rent accounting. You will also handle payment transactions and the dunning process. You are also responsible for preparing heating and utility bills. You handle correspondence with tenants, authorities and lawyers. You also take care of the billing and payment of rental deposits. Qualifications: You have completed commercial training. Ideally, you already have experience in accounting or receivables management You have an affinity for numbers and enjoy contact with customers You work independently, structured and solution-oriented You are confident in using MS Office and ideally you already have experience with SAP Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Lukas Boss on 089 954 287 247.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/mietenbuchhalter-munich-264470","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"debitorenbuchhalter-50-60k-dreieich-55302","company_name":"Riverstate Premium Recruiting","title":"Accounts receivable accountant 50-60k (m\/f\/d)","description":"Experience the freedom to organize your working day according to your ideas, actively participate in internal company processes and enjoy the warm and humorous working atmosphere. If you have experience in financial accounting according to the German Commercial Code (HGB) and in accounts receivable accounting, you will find all of this. Join a growing team within an established company. This company not only stands out as a future-oriented employer, but also offers plenty of scope for creative participation in work processes. In addition, the company aims to become the market leader in fiber optic expansion in southern Germany, which promises long-term security and development prospects. Apply now as an accounts receivable accountant 50-60k (m\/f\/d)TasksYou will be responsible for posting current business transactions in the subsidiary ledgers and in the general ledger. You will be involved in the timely preparation of the monthly, quarterly and annual financial statements in accordance with the German Commercial Code (HGB). You will take on special tasks and work in You are involved in projects, e.g. in the further development of the accounting processes of the company's own ERP system. You are the contact person for auditors, auditors and tax consultants. You prepare the VAT return. You work on controlling. Qualifications: You have completed commercial training, a business degree or comparable. You have at least 3 years of professional experience in accounts receivable accounting Good MS Office skillsYou have a very good command of spoken and written GermanBenefitsFlexibility: Thanks to modern flextime regulations, you have the freedom to organize your working day according to your individual requirements. You also have the opportunity to work from home by prior arrangement. Friendly team: You will become part of a lively and diverse team that is always open-minded and helpful. Here you have the opportunity to actively participate in team building, introduce new organizational structures and thus take on fascinating new areas of responsibility in the company. Security in the company: In a time of digital change, fiber optic expansion is a rapidly expanding industry in Germany. Therefore, you can count on long-term job security. In addition, your employer is part of a renowned group of companies with extensive experience in this field. It's best to apply now. We will then contact you by telephone and accompany you competently and reliably through the entire application process. Our advice is completely free of charge for you. If you have any questions, you can reach your personal contact person Dennis Markmann on +49 157 580 762 25.# Financial accounting # Balance sheet accounting # Financial accountant # Payroll accountant # Balance sheet accountant # Accounting specialist # Accounting # Accounting # Accounting specialist # Receivables management # Accounting # Dunning # Annual financial statements AccountingFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riverstate-premium-recruiting\/debitorenbuchhalter-50-60k-dreieich-55302","tags":["Accounts Receivable"],"job_types":["berufserfahren"],"location":"Dreieich","created_at":1702680543000,"original_language":"deu"},{"slug":"anwendungsberater-implementierungsberater-atoss-in-vollzeit-berlin-358081","company_name":"serviceline PERSONAL-MANAGEMENT GmbH & Co.KG","title":"Application consultant \/ implementation consultant ATOSS (m\/f\/d) full-time","description":"Our client is a leading European provider in the field of medical rehabilitation and mental health. More than 29,000 employees look after well over 200,000 patients in 430 clinics and facilities in Germany, Great Britain and Spain. The company offers a dynamic and innovative environment for employees in a wide variety of treatment areas with a variety of entry and development opportunities. Your expertise is needed at the company headquarters in Berlin and we are happy to be your first point of contact here!TasksProject support with the introduction of the ATOSS time management system or individual modules in the group's facilitiesSupport for internal users via the helpdesk ticket systemSystem maintenance with a focus on process digitalization and data harmonization in the Clinic clientsImplementation of further developments and change needs, e.g. due to new legal requirementsConducting user-related online trainingCreation of training videos for the internal academyQualificationExperience in dealing with duty scheduling programs, if necessary with ATOSSIdeally practical experience with rollout projects as part of a software introductionHigh IT affinity as well as structured, Independent and result-oriented work with a high hands-on mentalityKnowledge of the Working Hours ActYou are also familiar with the interpretation of collective agreements and company agreementsVery good knowledge of spoken and written German and experienced use of common MS Office applications, especially ExcelBenefitsA permanent employment relationship with competitive remunerationAn exciting and responsible position all in one dynamically growing company with a lot of creative freedomA friendly and technically experienced teamFlat hierarchies, short decision-making processes and an open corporate cultureComprehensive and individual trainingMobile and flexible working from home or the headquarters in Berlin including trust-based working hours, notebook and mobile phone for the optimal balance of family and workIndividual further training and further development opportunities within the department up to specialization in selected subject areasLearning at the company's own academyCompany pension scheme with employer subsidy, corporate benefits, free drinks and regular fresh fruit in the officeA modern and barrier-free ergonomically equipped workplace in the centrally located office in Berlin-Charlottenburg with very good U\/ S-Bahn and bus connections, lockable bicycle parking spaces and free parking spaces in the area, company celebrations and team events. Would you like to change your career and would like to contribute and position your expertise in a new way? Then we look forward to receiving your CV as a full-time application consultant \/ implementation consultant ATOSS (m\/f\/d) quoting the reference number B-AR-17122023. If you have any questions, please do not hesitate to call us at 030\/8846980. We guarantee you will receive feedback within 3 working days. We look forward to hearing from you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/serviceline-personal-management-gmbh-cokg\/anwendungsberater-implementierungsberater-atoss-in-vollzeit-berlin-358081","tags":["Applications Administration"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702680543000,"original_language":"deu"},{"slug":"beteiligungscontroller-munich-181164","company_name":"MY Humancapital GmbH","title":"Investment controller (m\/f\/d)","description":"Are you looking for a reliable partner to help you find a job in Munich? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer in Munich, we are looking for you as an investment controller (m\/f\/d) as soon as possible. Tasks As a controller (m\/f\/d), you are responsible for the preparation of monthly reports You will support and coordinate the budget and forecast process. You will create and analyze evaluations for the management. You will also analyze and optimize the operational controlling processes. You will also act as an internal and external contact person for all controlling topics. Qualifications You have completed commercial training, e.g. as a bank clerk (m\/f\/d ), office clerk (m\/f\/d), tax assistant (m\/f\/d) or have a degree in economics. Ideally, you have initial professional experience as a junior controller (m\/f\/d) or accountant (m\/f\/d). A process-oriented one and analytical thinking paired with strong communication skills are what set you apart. First experience with SAP is an advantage. Confident handling of MS Office packages rounds off your profile. Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/beteiligungscontroller-munich-181164","tags":["Controlling"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"bilanzbuchhalter-50-60k-darmstadt-130020","company_name":"Riverstate Premium Recruiting","title":"Accountant 50-60k (m\/f\/d)","description":"Experience the freedom to organize your working day, take an active part in internal company processes and enjoy the warm and humorous working atmosphere. If you have experience in financial accounting according to the German Commercial Code (HGB) and in accounts receivable accounting, all of this awaits you. Join a growing team in an established company that not only acts as a future-oriented employer, but also offers space for creative participation in work processes. The company aims to become the market leader for fiber optic expansion in southern Germany, which means long-term security and development opportunities. Apply now as an accountant 50-60k (m\/f\/d) Tasks You will be responsible for posting current business transactions in the subsidiary ledgers and in the general ledger. You will be involved in the timely preparation of the monthly, quarterly and annual financial statements in accordance with the German Commercial Code (HGB). You will take on special tasks and work in You are involved in projects, e.g. in the further development of the accounting processes of the company's own ERP system. You are the contact person for auditors, auditors and tax consultants. You prepare the VAT return. You work on controlling. Qualifications: You have completed commercial training, a business degree or comparable. You have at least 3 years of professional experience in accounts receivable accounting Good MS Office skillsYou have a very good command of spoken and written GermanBenefitsFlexibility: Thanks to flexitime, you enjoy the freedom to organize your working day according to your needs. There is also the option of working from home by arrangement. Friendly team: You will be part of a dynamic and diverse team that is always open and supportive. You have the opportunity to actively participate in building the team, introduce new structures and thereby take on exciting responsibilities within the company. Security in the company: In the midst of digitalization, fiber optic expansion is a rapidly growing industry in Germany. This means that your job is secured in the long term. The company also belongs to a large group of companies that has many years of experience in this area. It's best to apply now. We will then contact you by telephone and accompany you competently and reliably through the entire application process. Our advice is completely free of charge for you. If you have any questions, you can reach your personal contact person Dennis Markmann on +49 157 580 762 25 Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riverstate-premium-recruiting\/bilanzbuchhalter-50-60k-darmstadt-130020","tags":["Accounts Receivable"],"job_types":["berufserfahren"],"location":"Darmstadt","created_at":1702680543000,"original_language":"deu"},{"slug":"buchhalter-steuerkanzlei-munich-470171","company_name":"MY Humancapital GmbH","title":"Accountant (m\/f\/d) - tax office","description":"Are you looking for a reliable partner to help you find a job? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer in Munich, we are looking for you as an accountant (m\/f\/d) in a tax office as soon as possible. Tasks As an accountant (m\/f\/d) in a tax office, you will support us Management of ongoing financial accounting for clients. You are responsible for processing the account assignment and posting of all relevant business transactions. You are involved in the execution of bank bookings and account reconciliations. In addition, you communicate and conduct correspondence with tax authorities in tax matters. You will also be involved in the preparation of annual financial statements in accordance with commercial law and tax regulations with qualificationsYou have completed commercial training, for example as a tax clerk (m\/f\/d), accounting specialist (m\/f\/d) or ideally have a comparable qualification, for example as an accountant (m\/f\/d). You already have professional experience as an accountant (m\/f\/d), tax specialist (m\/f\/d) or accountant (m\/f\/d). Your understanding of digital accounting processes and technologies, coupled with your quick comprehension, sets you apart. You are also convincing Your independent, structured and reliable way of working. Confident use of common accounting software (e.g. Datev or SAP) round off your profileBenefitsA professional onboarding to pick you up from day one and support you individuallyA hybrid working model because you know best where and how to work effectivelyAn excellent employer and an appreciative company culture because you like to work in a friendly and cooperative environment Working environmentA rich selection of culinary dishes, such as fruits, snacks and drinks, because your holistic well-being countsA varied range of tasks in a flexible working environment so that you are satisfied with your position in the long termAn agile company in a future-proof industry because you should be protected for the future Excellent further training measures so that you can grow personally and professionally. Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Johanna Artmann on 089 954 287 106.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/buchhalter-steuerkanzlei-munich-470171","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702680543000,"original_language":"deu"},{"slug":"progress-entwickler-kis-30-40h-woche-berlin-235223","company_name":"serviceline PERSONAL-MANAGEMENT GmbH & Co.KG","title":"Progress Developer KIS (m\/f\/d) 30-40h\/week","description":"Our client is one of the leading European providers in the areas of medical rehabilitation and mental health. With more than 120 rehabilitation facilities throughout Germany, the company offers a dynamic and innovative environment for employees in a wide variety of treatment areas with a wide range of entry and development opportunities. Your expertise is needed at the company headquarters in Berlin and we are happy to be your first point of contact!TasksApplication development with Progress OpenEdge \/ C# for the hospital environmentPatient management \/ patient billingElectronic data transfer according to 301 IV SGBInterfaces to SAP BI and SAP FITelematics infrastructureProactive error analysis and elimination to ensure the best possible Software qualityQualificationCompleted studies in the field of business informatics, business administration, mathematics (MINT subjects) or a comparable IT trainingProfessional experience in healthcare \/ HIS systems desirableGood to very good knowledge of German (at least C1 level)BenefitsAn exciting and responsible position in a dynamically growing company great scope for creativityA friendly and technically experienced teamFlat hierarchies, short decision-making processes and an open corporate cultureComprehensive and individual trainingMobile and flexible working from home or the headquarters in Berlin including trusted working hours, notebook and mobile phone for an optimal balance of family and workIndividual further training and development opportunities within the Department up to specialization in selected subject areasInternal and external training opportunities via the company's own academy and support with in-service training Company pension scheme with employer subsidy, corporate benefits, free drinks and regular fresh fruit in the officeA modern and barrier-free ergonomically equipped workplace with a very good subway\/subway station - and bus connection, there are lockable bicycle parking spaces and free parking spaces in the area in the centrally located office in Berlin-Charlottenburg, company celebrations and team events. Would you like to change your career and would like to contribute and position your expertise in a new way? Then we look forward to receiving your CV as a Progress Developer KIS (m\/f\/d) 30-40h\/week, quoting the reference number B-AR-16122023. If you have any questions, please do not hesitate to call us at 030\/8846980. We guarantee you will receive feedback within 3 working days. We look forward to hearing from you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/serviceline-personal-management-gmbh-cokg\/progress-entwickler-kis-30-40h-woche-berlin-235223","tags":["Process Management"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702680543000,"original_language":"deu"},{"slug":"bilanzbuchhalter-50-60k-frankfurt-51143","company_name":"Riverstate Premium Recruiting","title":"Accountant 50-60k (m\/f\/d)","description":"Experience the freedom to organize your working day, take an active part in internal company processes and enjoy the warm and humorous working atmosphere. If you have experience in financial accounting according to the German Commercial Code (HGB) and in accounts receivable accounting, all of this awaits you. Join a growing team in an established company that not only acts as a future-oriented employer, but also offers space for creative participation in work processes. The company aims to become the market leader for fiber optic expansion in southern Germany, which means long-term security and development opportunities. Apply now as an accountant 50-60k (m\/f\/d) Tasks You will be responsible for posting current business transactions in the subsidiary ledgers and in the general ledger. You will be involved in the timely preparation of the monthly, quarterly and annual financial statements in accordance with the German Commercial Code (HGB). You will take on special tasks and work in You are involved in projects, e.g. in the further development of the accounting processes of the company's own ERP system. You are the contact person for auditors, auditors and tax consultants. You prepare the VAT return. You work on controlling. Qualifications: You have completed commercial training, a business degree or comparable. You have at least 3 years of professional experience in accounts receivable accounting Good MS Office skillsYou have a very good command of spoken and written GermanBenefitsFlexibility: Thanks to flexitime, you enjoy the freedom to organize your working day according to your needs. There is also the option of working from home by arrangement. Friendly team: You will be part of a dynamic and diverse team that is always open and supportive. You have the opportunity to actively participate in building the team, introduce new structures and thereby take on exciting responsibilities within the company. Security in the company: In the midst of digitalization, fiber optic expansion is a rapidly growing industry in Germany. This means that your job is secured in the long term. The company also belongs to a large group of companies that has many years of experience in this area. It's best to apply now. We will then contact you by telephone and accompany you competently and reliably through the entire application process. Our advice is completely free of charge for you. If you have any questions, you can reach your personal contact person Dennis Markmann on +49 157 580 762 25 Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riverstate-premium-recruiting\/bilanzbuchhalter-50-60k-frankfurt-51143","tags":["Accounts Receivable"],"job_types":["berufserfahren"],"location":"Frankfurt","created_at":1702680543000,"original_language":"deu"},{"slug":"leiter-kundenservice-rostock-172282","company_name":"MY Humancapital GmbH","title":"Head of Customer Service (m\/f\/d)","description":"Are you looking for a reliable partner to help you find a job? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer in Burghausen, we are looking for you as Head of Customer Service (m\/f\/d) as soon as possible. Tasks As Head of Customer Service (m\/f\/d), you will take on leadership as well as in Development of a newly merged department. You are responsible for the planning and implementation of email, process and hotline processing. In addition, you are involved in the development of ideas and strategies and are responsible for optimizing the processes. You are also responsible for the procedural contract processing of contract conclusion. Create your own analyzes and help them in the implementation of measures with qualificationsYou have completed commercial training, for example as an office clerk (m\/f\/d), business clerk (m\/f\/d) in dialogue marketing or comparable studies. Ideally, you have already had professional experience in a managerial position as a sales representative (m \/f\/d), service consultant (m\/f\/d) or similar. Your resistance to stress combined with your organizational talent is what sets you apart. You also impress with your independent, structured and reliable way of working. A confident use of common MS Office applications completes your profile. Benefits Flexibility: Career and work can be ideally combined thanks to the flexible working hours and home office option upon consultation. Professional onboarding: You can expect a structured induction plan as well as further training tailored to your individual needs. Further training: If you rest, you rust. Accordingly, great importance is placed on developing team spirit: you can expect a friendly and collegial corporate culture as well as flat hierarchies. Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Anna-Maria Holz on 089 954 287 105.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/leiter-kundenservice-rostock-172282","tags":["Management","Team Leader"],"job_types":[],"location":"Rostock","created_at":1702680543000,"original_language":"deu"},{"slug":"debitorenbuchhalter-50-60k-darmstadt-54377","company_name":"Riverstate Premium Recruiting","title":"Accounts receivable accountant 50-60k (m\/f\/d)","description":"Experience the freedom to organize your working day according to your ideas, actively participate in internal company processes and enjoy the warm and humorous working atmosphere. If you have experience in financial accounting according to the German Commercial Code (HGB) and in accounts receivable accounting, you will find all of this. Join a growing team within an established company. This company not only stands out as a future-oriented employer, but also offers plenty of scope for creative participation in work processes. In addition, the company aims to become the market leader in fiber optic expansion in southern Germany, which promises long-term security and development prospects. Apply now as an accounts receivable accountant 50-60k (m\/f\/d)TasksYou will be responsible for posting current business transactions in the subsidiary ledgers and in the general ledger. You will be involved in the timely preparation of the monthly, quarterly and annual financial statements in accordance with the German Commercial Code (HGB). You will take on special tasks and work in You are involved in projects, e.g. in the further development of the accounting processes of the company's own ERP system. You are the contact person for auditors, auditors and tax consultants. You prepare the VAT return. You work on controlling. Qualifications: You have completed commercial training, a business degree or comparable. You have at least 3 years of professional experience in accounts receivable accounting Good MS Office skillsYou have a very good command of spoken and written GermanBenefitsFlexibility: Thanks to modern flextime regulations, you have the freedom to organize your working day according to your individual requirements. You also have the opportunity to work from home by prior arrangement. Friendly team: You will become part of a lively and diverse team that is always open-minded and helpful. Here you have the opportunity to actively participate in team building, introduce new organizational structures and thus take on fascinating new areas of responsibility in the company. Security in the company: In a time of digital change, fiber optic expansion is a rapidly expanding industry in Germany. Therefore, you can count on long-term job security. In addition, your employer is part of a renowned group of companies with extensive experience in this field. It's best to apply now. We will then contact you by telephone and accompany you competently and reliably through the entire application process. Our advice is completely free of charge for you. If you have any questions, you can reach your personal contact person Dennis Markmann on +49 157 580 762 25 Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riverstate-premium-recruiting\/debitorenbuchhalter-50-60k-darmstadt-54377","tags":["Accounts Receivable"],"job_types":["berufserfahren"],"location":"Darmstadt","created_at":1702680543000,"original_language":"deu"},{"slug":"maschinenbauingenieur-fur-montageplanung-lenggries-395861","company_name":"Zeel GmbH","title":"Mechanical engineer (m\/f\/d) for assembly planning","description":"__Looking for your professional home? Then this job offer could be interesting for you.__We are looking for a mechanical engineer (m\/f\/d) for assembly planning in Lenggries. Would you like to take the next career step, work in a friendly and appreciative environment and develop yourself personally and professionally? Then you are exactly right here. Your new employer has been the number one contact when it comes to setting up hygiene roads for manufacturing companies for more than 20 years. The family business delivers overall concepts for its customers and is known for this beyond Germany's borders. If you would like to work in a friendly, small team, then take advantage of your chance and apply. As a recruiting company, we help our customers find reinforcements for their team. This means that we support the company in its search and you will receive the permanent employment contract directly from our customer. This is what you have to do. You are an important part of the team and coordinate service and assembly operations for internal service technicians as well as external subcontractors. You calculate assembly and are the contact person for our customersYou manage and develop preventative maintenance - including contract drafting and appointment monitoring - New specialist and service partners are found and coordinated by youYou check and handle warranty casesYou support your colleagues from sales in the technical and electrical engineering areasThis is what you bring with youYou have yours You have successfully completed your studies in the field of mechanical engineering or mechtronics or have a comparable qualification - preferably also in the field of electrical engineering. You already have knowledge of the coordination and planning of service and assembly operations. You already work with the common MS Office applications. You work in a customer-oriented and independent manner and you have no problems servicing your customers in English. Do you recognize yourself? Even if not all of the points apply to you, we look forward to getting to know you and talking about the possibility of working with you! Basics & GoodiesSecurity: Permanent employment with an attractive salary package, in a crisis-proof industry. Would you like a little more? For example, a business bike or an Aral fuel card...Really relax with a 30-day vacationMore work-life balance: flexible working hours, working time account and the possibility of working remotelyStay on the ball professionally and personally: training and further development are encouraged here.Quick up Coming to flying heights: Your team colleagues will take over the training so that you quickly feel safe in your work area. Atmosphere of well-being: Here you work in flat hierarchies with short decision-making processes. Team spirit and cohesion: are promoted, not least through Christmas parties and team events. No more traffic jams and searching for a parking space: you no longer have to Commute to the big city every day & Parking spaces in front of the house await youCome as you are: There is no dress code here, because WELL-BEING is a top priority hereYour advantages with ZeelYou are looking for a job and want something like a fairy godmother by your side who can give you tips Is the right career step for you? Someone who will help you prepare your application documents optimally and prepare you for your interview. Maybe someone who knows how high you can set your salary? Then you are exactly right with us. We ensure that you present yourself optimally to your desired employer and that you have the best chance of being successful. Our promise to youYou want to change? This stays between us! Your application will be treated with the utmost discretion. From the first application step to the signing of the contract, we are at your side and will advise you throughout the entire recruitment process - free of charge at any time, of course. Do you have any questions? Then pick up the phone or write us an email.__Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/zeel-gmbh\/maschinenbauingenieur-fur-montageplanung-lenggries-395861","tags":["Engineering"],"job_types":[],"location":"Lenggries","created_at":1702680543000,"original_language":"deu"},{"slug":"debitorenbuchhalter-50-60k-frankfurt-256496","company_name":"Riverstate Premium Recruiting","title":"Accounts receivable accountant 50-60k (m\/f\/d)","description":"Experience the freedom to organize your working day according to your ideas, actively participate in internal company processes and enjoy the warm and humorous working atmosphere. If you have experience in financial accounting according to the German Commercial Code (HGB) and in accounts receivable accounting, you will find all of this. Join a growing team within an established company. This company not only stands out as a future-oriented employer, but also offers plenty of scope for creative participation in work processes. In addition, the company aims to become the market leader in fiber optic expansion in southern Germany, which promises long-term security and development prospects. Apply now as an accounts receivable accountant 50-60k (m\/f\/d)TasksYou will be responsible for posting current business transactions in the subsidiary ledgers and in the general ledger. You will be involved in the timely preparation of the monthly, quarterly and annual financial statements in accordance with the German Commercial Code (HGB). You will take on special tasks and work in You are involved in projects, e.g. in the further development of the accounting processes of the company's own ERP system. You are the contact person for auditors, auditors and tax consultants. You prepare the VAT return. You work on controlling. Qualifications: You have completed commercial training, a business degree or comparable. You have at least 3 years of professional experience in accounts receivable accounting Good MS Office skillsYou have a very good command of spoken and written GermanBenefitsFlexibility: Thanks to modern flextime regulations, you have the freedom to organize your working day according to your individual requirements. You also have the opportunity to work from home by prior arrangement. Friendly team: You will become part of a lively and diverse team that is always open-minded and helpful. Here you have the opportunity to actively participate in team building, introduce new organizational structures and thus take on fascinating new areas of responsibility in the company. Security in the company: In a time of digital change, fiber optic expansion is a rapidly expanding industry in Germany. Therefore, you can count on long-term job security. In addition, your employer is part of a renowned group of companies with extensive experience in this field. It's best to apply now. We will then contact you by telephone and accompany you competently and reliably through the entire application process. Our advice is completely free of charge for you. If you have any questions, you can reach your personal contact person Dennis Markmann on +49 157 580 762 25 Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riverstate-premium-recruiting\/debitorenbuchhalter-50-60k-frankfurt-256496","tags":["Accounts Receivable"],"job_types":["berufserfahren"],"location":"Frankfurt","created_at":1702680543000,"original_language":"deu"},{"slug":"personalsachbearbeiter-mit-englisch-refnr-j8478-rheinbreitbach-366437","company_name":"Heyduck Personalservice","title":"Human resources clerk (m\/f\/d) with English Ref no. J8478","description":"For a research and manufacturing company in Rhineland-Palatinate on the border with North Rhine-Westphalia, we are looking for a full-time clerk (m\/f\/d) in the human resources department. Tasks Creation of employment contracts, references and certificates Correspondence with applicants Administration of time management Support with recruiting Administration and maintenance of the Personnel files and master data Company integration management Coordination and documentation of occupational medical examinations Data entry in IT qualifications Completed commercial vocational training or a comparable qualification First professional experience Happy to return to MS Office knowledge Very good knowledge of German and English Computer skills Team skills, hands-on mentality Independent work style and quick comprehension Benefits Attractive remuneration Company pension scheme Pleasant modern working environmentLunch buffetAccess to sporting activitiesCompany events and Family day Thomas Frst would be happy to receive your application via email. Simply call us via landline at 02242-9134715 or at +4915735352279. Your documents (resume, certificates, photo) will reach us particularly quickly using our contact form. We are of course also happy to receive your application an email from you to us, stating the reference number J8478 with your documents. Our placement service is of course always free of charge for you as an applicant. Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/heyduck-personalservice\/personalsachbearbeiter-mit-englisch-refnr-j8478-rheinbreitbach-366437","tags":["HR"],"job_types":[],"location":"Rheinbreitbach","created_at":1702680543000,"original_language":"deu"},{"slug":"3d-produktdesignerin-cologne-94446","company_name":"MOUTH Propaganda GmbH","title":"3D product designer","description":"We are looking for you!Are you a freelancer and looking for a new challenge?Are you creative and have technical understanding and are you keen on ice cream?We are looking for reinforcements in the team for individual ice cream moulds!TasksThe scope of tasks per month is approx. 5 projectsThese include:Product sketching3D modelingPreparation for Processing in 3D printing RenderingThe scope of the task depends on the project and can be completed within a time window of approx. 1 1\/2 weeks.SVG files and\/or sketches including precise dimensions will be available to you.QualificationYou are familiar with 3D printing preparationWork with programs such as: Blender, ZBrush, Cinema4DBis communicative in the consultation for respective projectsWe look forward to receiving your application with your very own ice cream idea!Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/mouth-propaganda-gmbh\/3d-produktdesignerin-cologne-94446","tags":["Remote","Product Design","Industrial Design"],"job_types":["Freelance"],"location":"Cologne","created_at":1702680543000,"original_language":"deu"},{"slug":"personalplaner-automotive-affalterbach-308125","company_name":"univativ GmbH","title":"Personalplaner (m\/w\/d) Automotive","description":"As soon as possible, 1 year, with option to extend | 40 hours per week | Affalterbach | Automotive industry | Career starter, experienced professional | 60,000 to 72,000 per year | Project ID A202345185_1Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Would you like to gain experience in the human resources department of an international company and already have initial knowledge of the HR environment? Then apply now as a personnel planner (m\/f\/d) for our customer project and help shape the future of the HR department in a dynamic team! Our customer, a global player from the automotive industry, is currently looking for project-based reinforcement. A wide range of tasks and a friendly working atmosphere await you. Does that sound interesting to you? Then become a part of univativ and turn your dreams into reality! Tasks You will be responsible for the evaluation, controlling and preparation of personnel data and personnel planning. The preparation and preparation of personnel measures and concepts is your area of ​​responsibility. You will carry out the operational personnel planning process and analyze the personnel requirements. and action planning You will be actively involved in the creation and (further) development of standard and ad hoc reports. You will also be responsible for carrying out monthly reporting. Qualifications You have successfully completed your degree in business administration or a comparable course of study. You are convincing with your experience in the areas of personnel planning or personnel controlling usYou have a high affinity for numbersYour strong conceptual thinking skills as well as your communication and integration skills set you apartYour German language skills are at least business fluentBenefitsAn annual salary between 60,000 and 72,000 With us you will gain experience and build up your professional network with various customers through various projectsYour personal talent coach will support you, who is there for you as your central contact and career companion. We train you to become an expert and offer you a variety of further training opportunities on and off the job (e.g. various certifications, univativ-academy and individual further training) Take advantage of your chance to win an attractive bonus of up to 2,000 euros for our Recruit a Friend program. We will give you feedback on your application within 48 hours. We were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/personalplaner-automotive-affalterbach-308125","tags":["HR"],"job_types":[],"location":"Affalterbach","created_at":1702680543000,"original_language":"nds"},{"slug":"junior-prozessplaner-motormontage-berlin-406341","company_name":"univativ GmbH","title":"(Junior) Process Planner (m\/f\/d) Engine assembly","description":"As soon as possible, 12 months, with option to extend, with option to take over | 35 hours per week | Berlin | Automotive industry | Career starter, experienced professional | 57,000 to 60,700 per year | Project ID A202344240_2Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Are you organized and interested in planning processes? Are you technically skilled and want to get started in the field of assembly planning? Then we are looking for you as a (junior) process planner (m\/f\/d) in engine assembly for our current project. You will carry out product tests and analyzes and create assembly plans and designs. Our customer, a global player in the automotive industry, is currently looking for project-based reinforcement. A wide range of tasks and a friendly working atmosphere await you. Does that sound interesting to you? Then become a part of univativ and turn your dreams into reality!TasksImplementation of planning tasks using working methods and processes as well as cost, capacity and investment planning and production resourcesPlanning of processes according to work management, production technology and business management knowledgeCollaboration with other departments in coordination and determination and representation of relevant planning factorsPlanning and implementation control for new construction, integration and innovation projectsEnsuring right-first-time and implementation of the projectsQualificationA successfully completed degree in industrial engineering, mechanical engineering or manufacturing technologyFirst practical experience in the planning and execution of new projects in the area of ​​engine or assembly lines or mechanical ManufacturingIn-depth knowledge of manufacturing technology, construction or component developmentIdeally experience in project and planning workFluent in German and fluent written and spoken EnglishA solution-oriented and precise way of workingBenefitsAn annual salary between 57,000 and 60,700 The possibility of working remotely from homeVarious further training opportunities in our e-AcademyIndividual coaching as preparation for the presentation to the customerUp to 2,000 bonus for recommending to friendsWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-prozessplaner-motormontage-berlin-406341","tags":["Engineering"],"job_types":[],"location":"Berlin","created_at":1702680543000,"original_language":"nds"},{"slug":"junior-it-netzwerkadministrator-hanover-272324","company_name":"univativ GmbH","title":"(Junior) IT Network Administrator (m\/f\/d)","description":"As soon as possible, 1 year, with option to take over | 40 hours per week | Hanover | IT industry | Career starter, experienced professional | 42,000 to 50,000 per year | Project ID A202344552_3Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you have a degree in (business) information technology or comparable training and have you already gained initial experience in configuring switches and managing firewalls? Do you also have in-depth knowledge of Windows servers and Linux operating systems? Then we have the right job for you! As a (junior) network administrator (m\/f\/d), you will be responsible, among other things, for the administration and monitoring of the central IT infrastructure components, carry out disruption analyzes and advise customers on various systems. Our customer is, among other things, a strategic IT partner for the region as well as municipal companies and provides support there, for example, in the areas of digitalization, customer management and application provision. The Competence Center for Data Center and Networks now needs support in the area of ​​network services, firewall and monitoring. Do you feel addressed and would you like to take the next step in your career? Then don't wait long and apply today! Tasks Management and monitoring of the infrastructure components, e.g. LAN, WAN, VPN, firewall taking over the lifecycle management of the components including patch management Working in technical support as well as carrying out error and problem analyses, advising customers on technical requirements and System settingsCreation of documentation for systems and servicesExecution of projectsQualificationA completed degree in computer science, business informatics or training as an IT specialist or comparableFirst practical experience in configuring switches and managing firewallsIn-depth knowledge of Windows servers and Linux operating systems and ideally knowledge of ACLs and 802.1xFluent German skills, spoken and written, on-call duties, strong organizational skills, an eye for the big picture and a high degree of communication strengthBenefitsAn annual salary between 42,000 and 50,000 Diverse further training opportunities in our e-AcademyUp to 2,000 bonus for recommending to friendsExclusive employee offers through corporate shoppingFlexible working hours and 30 days of vacation We were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-it-netzwerkadministrator-hanover-272324","tags":["IT"],"job_types":[],"location":"Hanover","created_at":1702680543000,"original_language":"deu"},{"slug":"werkstudent-prozessautomatisierung-hanover-200846","company_name":"univativ GmbH","title":"Working student (m\/f\/d) process automation","description":"As soon as possible, 6 months, with option to extend | 20 hours per week | Hanover | Automotive industry | Career starter, experienced professional | 16 to 18 a year | Project ID W202345175_2Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Have you completed your computer science studies and are you looking to start your career in the automotive industry? Are you also enthusiastic about process automation and impress with your always solution-oriented way of working? Then we are looking for you as a working student (m\/f\/d) as soon as possible. Together with your team, you will develop an application for processing production data and take care of the constant optimization of this. Our well-known customer from the automotive industry is looking for support in the area of ​​process automation. You will be part of an innovative team right from the start and work on complex tasks. If you are looking for a job with great opportunities for development, then apply to univativ now and benefit from our many years of experience! Tasks Development of a tool for tracking and editing production data using MS Power Automate Collection of data and building a database in MS SharePoint Execution of functional tests Continuous Optimization and adaptation of the application after regular consultation with the project documentationQualificationA completed degree in (business) computer science or a comparable fieldFirst practical experience in the development environmentA confident use of MS Power Apps and Power AutomateProfound knowledge in the use of MS SharePointA solution-oriented and careful way of workingBenefitsAn annual salary between 16 and 18 Diverse training opportunities in our e-AcademyIndividual coaching as preparation for the presentation to the customerUp to 2,000 bonus for recommending to friendsPersonal project supportWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/werkstudent-prozessautomatisierung-hanover-200846","tags":["IT"],"job_types":[],"location":"Hanover","created_at":1702680543000,"original_language":"nds"},{"slug":"software-developer-wurzburg-53909","company_name":"Infosim GmbH & Co. KG","title":"Software Developer (m\/f\/d)","description":"Infosim is an IT company based in Wrzburg, Germany. Our core product is a network management solution called StableNet.In your role as software developer (m\/f\/d), you will work on software integration projects in accordance with our customers' requirements in a team of five people.We're looking to hire 1-2 people full- or part-time as soon as possible.TasksAs a developer (m\/f\/d) at Infosim, you will...implement customer specific software requirements in agile projects, working closely with our global clientele,assess and manage customer requirements,use your command of Java (ideally JEE) and\/or Angular to implement new and enhance existing features of StableNet, andengage in agile software development projects (Kanban), leveraging cutting-edge technologies to drive the evolution of StableNet.RequirementsYour expertise is more important to us than any specific degree or years of experience. If you know the ins and outs of large IT networks, i. e. are familiar with IPv6 or SNMP, and arent averse to speaking to clients, you should not miss out on this opportunity!Many of our clients are based in Germany, but if you only speak English, that is not a problem either: Our international customer base is very accommodating.BenefitsWork from anywhere  we offer up to 90 % remote work!The hours fit your schedule  work when you can!Workation, sabbatical, 4-day-workweek: (almost) anything is possible!High-end company laptop - work with the OS of your choice!30 days of paid vacation per year 50\/mo tax free benefits + additional employee discountsNaturally, we are happy to pay for any training you need and provide extensive onboarding ourselves.Many more benefits can be made available to you depending on your situation (e. g. location, terms of employment, etc.)We cant wait to hear from you and look forward to your application! If you have any questions, our HR manager Thommy will be happy to help at +49 931-20592295.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/infosim-gmbh-co-kg\/software-developer-wurzburg-53909","tags":["IT"],"job_types":[],"location":"Würzburg","created_at":1702680543000,"original_language":"eng "},{"slug":"internship-online-marketing-at-meet5-belgium-frankfurt-345494","company_name":"Meet5 GmbH","title":"Internship Online Marketing at Meet5 Belgium","description":"You speak French at a native level and want to gain experiences in online marketing and community management? You want to learn a lot but also bring in your own ideas? You want to be part of an open, relaxed, and highly productive team and help us expand into another country?Nous sommes heureux de nous tendre  la Belgique! Apply to become an intern for our Online Marketing team for Belgium!Meet5 is the largest leisure community for people over 40. For every region where we launch our app, we passionately build a community. Adter successfully expanding into the Netherlands earlier this year, we have now set sails for Belgium. To make this a success, you'll create and localise region-specific content, help us find volunteer supporters (Community Captains), and come up with new strategies to grow the community in Belgium.Your creativity knows no bounds. In our office in the heart of Frankfurt, you'll work closely with the other community managers for Germany, the Netherlands and of course Belgium.A steep learning curve, interesting tasks, and lots of fun are guaranteed! Your internship with us could be the stepping stone to a permanent position or a working student job with us.TasksContent creation for newsletters, blog, website, social media and our own appLocalisation of already existing content Community managementRecruiting and managing the local community captains (volunteer supporters of Meet5)Assistance in supportRequirementsExcellent knowledge of French: As you will be creating content and managing the local communities, you must have excellent language skillsBe motivated: You should be especially motivated and ready to take responsibility from day one and have the desire to learn new things.Contribute your own ideas: You are welcome to contribute your own ideas and implement them independently together with the team.BenefitsApart from our dynamic team and our mission to bring people together, there are a variety of benefits that make Meet5 a great place to work:Impact: Meet5 brings together hundreds of thousands of members, who meet new people and form meaninful connections thanks to us.Working at the eye level: Flat hierarchies, short decision-making processes, direct line to the founders and a relaxed approach to each other. We work productively and have fun while doing itHybrid model: Find your best way of working! 3+ days in the office, and up to 2 days remotely.Start-up flair: nice and spacious office in Frankfurt's Eastend, unlimited coffee, drinks and snacksTeambuilding: Monthly team events such as lasertag tournaments, office parties and drinking hut tours ensure a happy togethernessWork-life balance: 28 days paid holiday, birthdays and December 24th and 31th are automatically off for all of us.Curious? Send us your CV and answer our questions of motivation and we'll make sure to be in touch soon!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/meet5-gmbh\/internship-online-marketing-at-meet5-belgium-frankfurt-345494","tags":["Marketing and Communication"],"job_types":["Internship"],"location":"Frankfurt","created_at":1702680543000,"original_language":"eng"},{"slug":"it-projektleiter-telematikinfrastruktur-oder-junior-it-projektleiter-bei-der-itcos-magdeburg-408869","company_name":"interim Group - interim Group Leipzig GmbH","title":"IT project manager (m\/f\/d) \/ (telematics infrastructure) or junior IT project manager (m\/f\/d) at ITCOS","description":"HASOMED is a medium-sized and internationally operating family business from Magdeburg in the field of practice software and medical technology. The New Work idea is actively lived, with HASOMED relying on employees to work independently and on a cultural change in companies away from dusty hierarchies and towards openness and transparency. The newly founded subsidiary ITCOS offers simple and secure IT solutions for the entire healthcare system . Through efficient rollout packages, outpatient service providers are connected to the telematics infrastructure, from installation to maintenance at ITCOS, customers get everything from a single source! Together we are now looking for new team players as IT project managers (m\/f\/d) ( Telematics infrastructure) or Junior IT project manager (m\/f\/d) at the Magdeburg location, full-time, hybrid tasks As an IT project manager (m\/f\/d) or junior IT project manager (m\/f\/d) at ITCOS, you take on a key role in the further development of our digital product world and contribute to the transformation of the way psychotherapists and doctors experience digital products. Your tasks include: You lead the successful implementation of IT projects in the area of ​​telematics infrastructure and ensure their continuous development and smooth integration into existing healthcare systems. You work closely with cross-functional teams to develop customer-centric solutions and solve customer problems. You design prototypes, interact with customers and implement direct feedback into innovative solutions. You monitor and document project progress and identify risks. For you, market analyzes and industry trends are more than just buzzwords - you actively implement them and are always up to date. You create and maintain networks with stakeholders and partners to ensure the market penetration of our products. You accompany product launches and ensure successful market positioning.QualificationsProven experience in managing IT projects, ideally in the healthcare or telematics sector. As junior IT project managers (m\/f\/d), we also warmly welcome career starters! Knowledge of project management methods and tools. A passion for designing, testing and further developing products for the benefit of our customers. Convincing communication skills and the ability to convey complex ideas in an understandable manner. Self-organization skills and the willingness to work in a networked environment. Team spirit, flexibility, creativity, outstanding project management skills and an extra dose of self-confidence. German language skills at least B2 level.BenefitsModern building with open spaces for creative work, mobile workstations, fitness room and the company's own HASO-KIDS daycare center as well as other places that invite you to explore.Enjoy flexibility & work within or outside HASOMED wherever you likeThe focus is on constant learning - feel free to develop yourself further, HASOMED supports you with individual further training opportunities #holiday #leisure at HASOMED even up to 32 days of vacation per year possible Work on an equal footing with great colleagues in cross-departmental, interdisciplinary circles, of course on a first-name basis Stay fresh & happy free drinks (from cold to hot), fruit, a Msli bar and delicious food in the company's own canteen Be fit, healthy & well-being through HASOFit & team events Four-legged friends are also welcome at HASOMED #Dogs(at)WorkIf you're ready for that If you are on the adventure of a lifetime and are looking for the opportunity to take your career to the next level, then apply now. ITCOS not only offers you a job, but also a mission that is changing the healthcare industry. I look forward to your application! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/interim-group-interim-group-leipzig-gmbh\/it-projektleiter-telematikinfrastruktur-oder-junior-it-projektleiter-bei-der-itcos-magdeburg-408869","tags":["Project Management"],"job_types":["berufserfahren"],"location":"Magdeburg","created_at":1702680543000,"original_language":"deu"},{"slug":"mechatronics-systems-expert-stuttgart-431036","company_name":"Karriere.Now - Jobportal","title":"Mechatronics Systems Expert (m\/f\/d)","description":"Would you like to work in a highly promising industry in the energy sector and shape the economy of tomorrow in cooperation with big players? As a specialist in assembly systems, our customer is shaping the international electrical and semiconductor industry. They work in the area of advanced engineering on disruptive solutions and develop as well as build machines that help their customers create unique products. Support their team now as Mechatronics Systems Expert (mIfId) in Radfeld, Tyrol.TasksYour main focus will be on Advanced Die Attach technologies and customer roadmaps. This includes the following:You create conceptual mechanical designs for mechatronic systems You will design the interaction between mechanics, electronics, control technology and software You model and optimise modules with a focus on functional and dynamic behaviour (FEM) You work in multidisciplinary project teams to support and develop mechatronic modules and systems with a focus on mechanical architecture, dynamics and vibration dampingTo ensure quality, you plan and interpret functional tests on modules and machines You take care of documentation and reporting to keep everyone involved informedAs you will be working on future technologies, you will regularly liaise with system architects and process specialists to define new goals You will also expand the project teams at times as a consultant and coach You will also work with system architects, process and image processing specialists on metrological tasks You will regularly liaise with product marketing to gain the best possible understanding of customer requirementsRequirementsThe skills you learnt in your Master's degree in Mechanical Engineering or Mechatronics are an asset to our customers. Knowledge from comparable degree programmes is also ideal. Instead of a suitable degree programme, you can also impress with many years of professional experience. As their business language is English, business fluent English skills are required. Previous experience with the FEM method in the mechanical field as well as knowledge in the areas of sensor technology and electronics are a big plus for you, but not a must-have.BenefitsYou can expect a position with exciting, challenging tasks. We can therefore advertise the position with a minimum salary of 4,000 gross. The more professional experience you have, the higher your salary range. Health is a top priority - your company doctor takes care of your well-being every month.Great team spirit, where many events are initiated by employees and every colleague is very welcome In addition to the initiatives taken by employees themselves, there are also numerous team events organised by the company. From ski days and barbecues to social company runs, everything is included.You can realise your full potential and develop yourself further - you will be provided with the financial means to do so. The team attaches great importance to making everyone feel comfortable. It therefore goes without saying that you are on first-name terms at all levels. Free time management is important to you? Great - for them too. Really good work also requires the necessary equipment - so your hardware and software is always up to date. Onboarding new employees is the foundation for a successful and long-lasting professional relationship. That's why your buddy will accompany you during the initial period and ensure that you settle in well at the company.Your lunch is also taken care of - in addition to a meal allowance, you will receive free drinks and snacks. Do you prefer to cook yourself? No problem, you can use their kitchen. Really good work also requires necessary breaks - you can spend these with your colleagues in social and break rooms. Sport is your life? Perfect! Our own fitness room and other sports facilities are waiting for you. If you come to work by car, there's a free car park waiting for you. Do you prefer cycling? No problem, they give you the opportunity to lease bikes with tax benefits.Social projects are important to you? Great! With them you have the opportunity to support them and have a say in the choice of project.Are you interested in working in a company and shaping the future in cooperation with big players? Then apply now!We'll give you all the details in an initial phone call Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/karrierenow-jobportal\/mechatronics-systems-expert-stuttgart-431036","tags":["Mechatronic Engineering"],"job_types":[],"location":"Stuttgart","created_at":1702680543000,"original_language":"eng"},{"slug":"mechatronics-systems-expert-frankfurt-445883","company_name":"Karriere.Now - Jobportal","title":"Mechatronics Systems Expert (m\/f\/d)","description":"Would you like to work in a highly promising industry in the energy sector and shape the economy of tomorrow in cooperation with big players? As a specialist in assembly systems, our customer is shaping the international electrical and semiconductor industry. They work in the area of advanced engineering on disruptive solutions and develop as well as build machines that help their customers create unique products. Support their team now as Mechatronics Systems Expert (mIfId) in Radfeld, Tyrol.TasksYour main focus will be on Advanced Die Attach technologies and customer roadmaps. This includes the following:You create conceptual mechanical designs for mechatronic systems You will design the interaction between mechanics, electronics, control technology and software You model and optimise modules with a focus on functional and dynamic behaviour (FEM) You work in multidisciplinary project teams to support and develop mechatronic modules and systems with a focus on mechanical architecture, dynamics and vibration dampingTo ensure quality, you plan and interpret functional tests on modules and machines You take care of documentation and reporting to keep everyone involved informedAs you will be working on future technologies, you will regularly liaise with system architects and process specialists to define new goals You will also expand the project teams at times as a consultant and coach You will also work with system architects, process and image processing specialists on metrological tasks You will regularly liaise with product marketing to gain the best possible understanding of customer requirementsRequirementsThe skills you learnt in your Master's degree in Mechanical Engineering or Mechatronics are an asset to our customers. Knowledge from comparable degree programmes is also ideal. Instead of a suitable degree programme, you can also impress with many years of professional experience. As their business language is English, business fluent English skills are required. Previous experience with the FEM method in the mechanical field as well as knowledge in the areas of sensor technology and electronics are a big plus for you, but not a must-have.BenefitsYou can expect a position with exciting, challenging tasks. We can therefore advertise the position with a minimum salary of 4,000 gross. The more professional experience you have, the higher your salary range. Health is a top priority - your company doctor takes care of your well-being every month.Great team spirit, where many events are initiated by employees and every colleague is very welcome In addition to the initiatives taken by employees themselves, there are also numerous team events organised by the company. From ski days and barbecues to social company runs, everything is included.You can realise your full potential and develop yourself further - you will be provided with the financial means to do so. The team attaches great importance to making everyone feel comfortable. It therefore goes without saying that you are on first-name terms at all levels. Free time management is important to you? Great - for them too. Really good work also requires the necessary equipment - so your hardware and software is always up to date. Onboarding new employees is the foundation for a successful and long-lasting professional relationship. That's why your buddy will accompany you during the initial period and ensure that you settle in well at the company.Your lunch is also taken care of - in addition to a meal allowance, you will receive free drinks and snacks. Do you prefer to cook yourself? No problem, you can use their kitchen. Really good work also requires necessary breaks - you can spend these with your colleagues in social and break rooms. Sport is your life? Perfect! Our own fitness room and other sports facilities are waiting for you. If you come to work by car, there's a free car park waiting for you. Do you prefer cycling? No problem, they give you the opportunity to lease bikes with tax benefits.Social projects are important to you? Great! With them you have the opportunity to support them and have a say in the choice of project.Are you interested in working in a company and shaping the future in cooperation with big players? Then apply now!We'll give you all the details in an initial phone call Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/karrierenow-jobportal\/mechatronics-systems-expert-frankfurt-445883","tags":["Mechatronic Engineering"],"job_types":[],"location":"Frankfurt","created_at":1702680543000,"original_language":"eng"},{"slug":"personalsachbearbeiter-langenhagen-134647","company_name":"expert Warenvertrieb GmbH","title":"Human Resources Administrator (m\/f\/d)","description":"At our expert headquarters in Hanover-Langenhagen, over 500 future colleagues are looking forward to meeting you. From here we control all activities related to purchasing\/sales, marketing, e-commerce and logistics. Together we support our stores in carrying out their daily business. From the creation of contracts and certificates to monthly payroll accounting, our PA service center currently has a team of 6, supporting around 1,800 employees in 10 companies and assisting them with all human resources issues. We are looking for reinforcements because our PA Service Center is growing and together we want to achieve new successes! We are looking for you as a human resources clerk (m\/f\/d).TasksMonthly payroll: with your team you will carry out the monthly payroll for companies in the expert groupAdministrative activities: From the creation of the employment contract to the certificate, you will accompany employees through the employment relationship. You will also be responsible for the electronic reporting and certification system. Statistics and evaluations: You will create HR-relevant evaluations using Excel. Process optimization: You will bring in new ideas to optimize processes. Qualifications. Completed commercial training, ideally with further training in the area of ​​human resources. Very good knowledge of payroll accounting (first professional experience in payroll accounting and Personnel administration) Good knowledge of labor law Very good MS Office knowledge (Outlook, Word, Excel, PowerPoint) Secure command of correspondence in human resources Strong service orientation and a great sense of responsibility Benefits Permanent employment contract Fixed 13th salary (holiday and Christmas bonus) Annual bonus payment Subsidy for the Germany ticket Company pension scheme & capital-forming Services 30 days vacationFlexible working hours between 7:00 a.m. and 8:00 p.m. Mobile working within Germany (up to 80%)Structured training Personnel purchasing: buy at a reduced price in the expert worldLeasing offers for your bicycle or e-bikeDiscounts on event and leisure activities, products , travel and servicesInsurance service: have existing insurance checked and benefit from special conditionsDrinks flat rate: you get water, coffee and tea free of charge. Your technology expert next door for over 60 years. everywhere in Germany. To be more precise, at 396 locations with 199 independent entrepreneurs who run their electronics stores there. And apparently so well that we can call ourselves Germany's most successful specialist retail cooperation. Would you like to become part of the expert family and strengthen our team with your skills? Then we look forward to receiving your online application stating your salary expectations. If you do not want to apply online, here is our postal address for applications: expert Warenvertrieb GmbHBayernstrae 430855 LangenhagenFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/expert-warenvertrieb-gmbh\/personalsachbearbeiter-langenhagen-134647","tags":["HR"],"job_types":[],"location":"Langenhagen","created_at":1702680543000,"original_language":"deu"},{"slug":"erste-aufnahmeleitung-maz-berlin-181310","company_name":"Space Cabana GmbH","title":"Erste Aufnahmeleitung MAZ (m\/w\/d)","description":"Die SPACE CABANA entwickelt und produziert Audio- sowie Videoformate fr die junge Zielgruppe. Zur Verstrkung unseres Produktionsteams suchen wir zum 01.03.2024 ein:e Erste Aufnahmeleitung MAZen\/Einspieler (m\/w\/d) mit dem Schwerpunkt Entertainment Show in Berlin.AufgabenVerantwortung fr MAZ- und EinspielerdrehsErstellung von Stablisten, Gesamt-, Tages-, und Fahrdispositionen sowie TagesberichtenBuchung, Organisation und Abrechnung der CrewBeantragung von Genehmigungen sowie Einholung erfolderlicher Auflagen fr Dreharbeitenberprfung von Belegen und vorbereitende BuchhaltungReisekoordinationQualifikationeinschlgige Berufserfahrung als Aufnahmeleitung sowie in der Produktionsvorbereitung und DurchfhrungKreativitt, Engagement und Verhandlungsgeschickausgeprgtes Organisationstalent, strukturierte Arbeitsweise und ein hohes Ma an EigenverantwortungTeamfhigkeit, Kommunikationsstrke und Freude an der Arbeit mit PersnlichkeitenSicherheit im Umgang mit MS Office und technische KompetenzBenefitsKreative Gestaltungsspielrume und persnliche Entwicklungsmglichkeiteneinen interessanten Arbeitsplatz mit einer abwechslungsreichen und attraktiven Ttigkeit im Herzen Berlinsein junges, engagiertes und sympathisches TeamHomeoffice-MglichkeitenModerne Hardwareguten Kaffee & Getrnke, Sweets & frisches ObstKlingt gut? Dann werde Teil unseres Teams!Sende uns deine aussagekrftige Bewerbung mit Anschreiben, Lebenslauf und unter Angabe deiner Gehaltsvorstellung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/space-cabana-gmbh\/erste-aufnahmeleitung-maz-berlin-181310","tags":["Marketing and Communication"],"job_types":["Contract"],"location":"Berlin","created_at":1702680543000,"original_language":"eng "},{"slug":"praktikum-communication-digital-marketing-management-berlin-135838","company_name":"Juvigo GmbH","title":"Praktikum Communication & Digital Marketing Management","description":"Juvigo ist Europas grte Buchungsplattform fr Feriencamps, Jugendreisen und Sprachreisen sowie eines der am schnellsten wachsenden touristischen Unternehmen Europas. Unter der Marke Famango betreibt die Juvigo GmbH eine Buchungsplattform fr Familienreisen. Unser internationales Team sitzt in Berlin-Kreuzberg.AufgabenB2B Kommunikation: Suche nach neuen Kooperationspartnern und KontaktaufnahmeB2C Kommunikation: Untersttzung unseres Teams in der KundenberatungOnline-Marketing: Du schreibst SEO-optimierte Texte fr unser Online-MagazinDu pflegst die erstellten Inhalte selbststndig in unser internes Content Management System sowie in Wordpress einContent-Management: Du erstellst und pflegst wertvollen Content zu unseren Familienreisen (Beschreibung, Landingpages, Bebilderung) in unserer DatenbankProjektmanagement: Du untersttzt ein erfahrenes Team bei der Aufbau einer neuen Online-Buchungsplattform (OTA) fr FamilienreisenEvent Management: Gemeinsam mit unserem Team planst du Events und nimmst an Fachmessen (z.B. ITB Berlin im Mrz) teil, auf denen du mit unseren Partnern in personlichen Kontakt kommst und dein Netzwerk ausbaustQualifikationDu hast idealerweise einen touristischen, wirtschaftswissenschaftlichen, journalistischen oder geisteswissenschaftlichen Hintergrund bzw. StudiengangDu arbeitest strukturiert, zielorientiert und beharrlich an einer AufgabeDu bist motiviert und hast Lust, unser Produkt bekannt zu machen und bringst eigene Ideen einDu bist ein zuverlssiger Ansprechpartner und hltst dich an Absprachen und TermineDu schreibst gern und in fehlerfreiem DeutschDu suchst ein freiwilliges Praktikum mit einer Dauer von 3 Monaten oder ein PflichtpraktikumBenefitsGesunde Work-Life Balance (voller berstundenausgleich, Gleitzeit)Junges, internationales Team und ein Bro im Herzen von BerlinRegelmiges Feedback und hohe Mitarbeiterzufriedenheit (Kununu Score von 4,8)Duz-Kultur - sowohl unter Kollegen als auch mit Geschftspartnern Grndliche Einarbeitung und strukturiertes Arbeiten ab Tag 1 fr eine steile LernkurveDie Mglichkeit, deine eigenen Ideen einzubringenVielfltige Entwicklungsmglichkeiten in einem stark wachsenden UnternehmenModerne Broausstattung mit Apple-TechnologieHaben wir dein Interesse geweckt? Dann freuen wir uns auf deine Bewerbung!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/juvigo-gmbh\/praktikum-communication-digital-marketing-management-berlin-135838","tags":["Marketing and Communication"],"job_types":["Internship","teamleitung"],"location":"Berlin","created_at":1702680543000,"original_language":"eng"},{"slug":"senior-controller-mit-teamverantwortung-offenbach-200314","company_name":"sparkm","title":"Senior Controller (m\/f\/d) with team responsibility","description":"Our customer is an integral part of the renowned world of tangible investments. As an established medium-sized company that operates across Europe, with its flat hierarchies and professional and friendly working atmosphere, it offers the ideal meeting for an employer with future prospects. We are looking for a team leader (m\/f\/d) Controlling for the German headquarters in the Frankfurt area as soon as possible in order to complete the newly created position in the department.TasksYou lead a small team, with which you continue to expand controlling internally and modernize the departmentYou work closely with the commercial management and the CFOYou are responsible for various projects, including with controlling -side introduction of an ERP and BIsYou are actively involved in day-to-day operations, with your focus on sales and planning controlling, as well as reporting. In addition to controlling, you also manage human resources management. You are the contact person for the team, the location's employees, management and external partners work proactively in the implementation of area-related goalsQualificationsYou have successfully completed a business degreeYou ideally come from the banking environment and want to develop furtherYou have several years of experience as a controller and have already gained initial leadership experienceYou see yourself as a progressive doer with tact and strong communication with the stakeholders in change managementYou impress with your analytical and structured way of thinking and your professional, friendly demeanorA dynamic and agile way of working round off your profileBenefitsYou can expect an attractive salary as well as capital-forming benefits including BAVYou are given the option of flexible working hours (mobile working\/flexible working hours). You can look forward to various employee conditions, as well as a wide range of offers and discounts. You will receive intensive training in an appreciative and open corporate culture. Variety guaranteed: insights into different areas and great team events. We also enjoy spending time together outside of work. We look forward to receiving your application !Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sparkm\/senior-controller-mit-teamverantwortung-offenbach-200314","tags":["Controlling"],"job_types":["berufserfahren"],"location":"Offenbach","created_at":1702680543000,"original_language":"deu"},{"slug":"softwaretester-fur-java-applikationen-nuremberg-380835","company_name":"isento GmbH","title":"Software tester (m\/f\/d) for Java applications","description":"Software testers don't destroy code, they destroy illusions about the code! (after James Bach)**Do you see it the same way? Then we are looking for you as a software tester (m\/f\/d) for Java applications. We testers at isento are realists; analysts; anarchists; creative; systematic; intuitive; curious; skeptical; methodical; communicative; always available for a pairing; beliefs and qualities; lifelong learners; technically fascinated; professionally interested; professional and above all: in a good mood because we love what we do! We are isento (Portuguese: free) and implement software projects from conception to rollout. As a software tester (m\/f\/d) for Java applications, you support our projects with valuable and early feedback, sustainable test solutions and methodical excellence.TasksYour job at isentoConception and implementation of test cases that test the functionality and integration of the entire system as well as the system behaviorSupport in the optimization of test environments and test automation toolsSupport in the creation and implementation of test strategies (agile and classic)Creation and maintenance of unit testsAnalysis and documentation of test executionsTreatment of errors in a tracking system (bug tracking)Working in agile teams (Scrum, Kanban)QualificationThis is what you bring withCompleted studies in (business) informatics, comparable training or talent as a career changer: you have an IT affinity, feel at home in an agile environment and are committed to continuous professional and personal development. Min. 2-3 years of project experiencePractical experience in software testing and test automation (e.g. functional regression testing, load & performance testing, integration or E2E testing - with common testing tools and test design methods) Knowledge of object-oriented languages ​​(Java, C#), databases, web services and software testing toolsISTQB Certified Tester Foundation LevelVery good knowledge of German (at least B2)BenefitsThis is isentoFlat hierarchies, flexible working hours and home office are no longer a unique selling point, but are part of a modern working culture for us. What else you can look forward to with us: We work as a team on equal terms. We practice open exchange, bring in our own initiative, new ideas and also constructive criticism. We learn from and with each other, develop together and celebrate together on our roof terrace. No matter whether it's beef or seitan steak, a couch potato or an adrenaline junkie, with a family, a cat or a cockatoo, we are a colorful team, we are isento! Join our team and bring in your individuality. We look forward to seeing you! What else do we offer? Visit our website or send us your application documents and we will get to know each other!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/softwaretester-fur-java-applikationen-nuremberg-380835","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680543000,"original_language":"deu"},{"slug":"senior-spezialist-payroll-offenbach-419587","company_name":"sparkm","title":"Senior Specialist (m\/f\/d) PayRoll","description":"Our customer is an innovative service company that stages brands, products and messages as an experience - live, digital or hybrid. With their passion and commitment, our more than 800 employees ensure sustainable marketing solutions worldwide - from conception to implementation. To ensure sustainable and value-creating human resources work for the group, we are filling the position of \"Specialist (m\/f\/d) payroll accounting \/ PayRoll\", who not only provides operational support for payroll accounting, but also wants to further develop existing processes and structures. Tasks You are responsible for the independent and Timely execution of monthly payroll accountingYou are a competent contact person for employees as well as specialists and managers in all accounting-related issuesYou manage and maintain the personnel master data and the digital personnel filesYou support with operational and payroll tax auditsYou contribute your professional expertise to HR projects and support you from your specialist area in the implementationQualificationYou have completed commercial training, ideally with a focus on human resources.You have relevant experience in payroll accounting and knowledge of payroll tax and social security law.You are proficient in using MS Office (Excel, Word) and payroll accounting systems (e.g. HR Works) You are characterized by a high service spirit, are a team player and discreet. You are characterized by a reliable, careful, structured and independent way of working. This is an important position for our customer! You can expect varied and exciting tasks, as well as the opportunity to help shape and support a successful company with your knowledge and expertise. You will find an open, team-oriented and positive working atmosphere. Have we aroused your interest? Then we look forward to receiving your application.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sparkm\/senior-spezialist-payroll-offenbach-419587","tags":["HR"],"job_types":["berufserfahren"],"location":"Offenbach","created_at":1702680543000,"original_language":"deu"},{"slug":"personalsachbearbeiter-in-kaufleute-f-personalmanagement-humanistische-vereinigung-nuremberg-64702","company_name":"Humanistische Vereinigung K.d.ö.R.","title":"Human resources clerk, clerk for human resources management (m\/f\/d) Humanist Association","description":"To strengthen our human resources team at the Humanist Association K.d..R. In Nuremberg we are looking for a human resources clerk (m\/f\/d) from March 1st, 2024 or as soon as possible, part-time\/full-time 35 to 39 hours\/week. About us: The Humanist Association (HV) is a humanistic worldview community and an independent social provider of various educational institutions. We currently employ a total of 320 people in the HV and our subsidiaries Humanistische Sozialwerk Bayern gGmbH and Philoscience gGmbH. We accompany people through life with various event formats, celebrations (such as the youth or naming ceremony) and advisory services. It currently runs 21 daycare centers with a total of around 1,000 childcare places as an independent social sponsor, as well as two dormitories for students and a special education residential group for young people. Through philoscience gGmbH, the HV is involved in science communication through further training, educational offerings, various event formats and the turmdersinne, a science-educational experience museum in Nuremberg and the Disgusting Food Museum Berlin. Tasks as a human resources clerk: Monthly payroll accounting, taking legal requirements into account, drawing up contract documents, implementing the In-house collective agreement as part of billing and contract creationContact person for social insurance institutions and the tax office as well as the facility management of our daycare centersSupport with external audits, e.g. upcoming social security audits, tax audits with questions from auditors, compilation of documents for the auditPreparation of evaluations and projectionsAbsence managementQualificationRelevant professional training to become an HR clerk *in or comparable activities (e.g. HR employee, HR specialist, HR administrator, HR administrative assistant, HR management clerk, HR services clerk (m\/f\/d)) Several years of professional experience in the area of ​​payroll accounting and AdministrationYou have excellent computer skills in Word and Excel and specialist software, preferably Datev\/LodasYou are a team player and resilientBenefitsThis is what we offer you:Payment within the framework of our company collective agreement GEW (similar to TVD) Company pension scheme and capital-forming benefitsAnnual special payment30 days of annual leave, plus one regeneration day per year in accordance with applicable regulations Company collective agreementFlexible working hoursWorking in the home office is sometimes possibleCompany cell phoneCompany further trainingCompany doctorFree drinksEmployee discountThe position is initially limited to one year, the aim is to continue the employment beyond the fixed-term period.The office is based in Nuremberg\/Mgeldorf.Please send your detailed application by post or by email to: (Please include your CV, professional qualifications, further training certificates and, if applicable, job references, thank you very much!)Humanistic Association Public BodyKinkelstrae 1290482 Nuremberg Email: Please use the \"Application\" button, which contains our contact details . Thank you very much! We look forward to seeing you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/humanistische-vereinigung-kdor\/personalsachbearbeiter-in-kaufleute-f-personalmanagement-humanistische-vereinigung-nuremberg-64702","tags":["Recruitment and Selection"],"job_types":["berufserfahren"],"location":"Nuremberg","created_at":1702680543000,"original_language":"ces"},{"slug":"product-manager-full-time-cologne-347903","company_name":"United Manufacturing Hub","title":"Product Manager (Full-Time) (m\/f\/d)","description":"At United Manufacturing Hub, we make the world of computers and factories one - by putting the most powerful IT & OT tools into the hands of the engineer.  In today's factories, millions of data points are produced every second. Meanwhile, industrial companies face unprecedented pressure to produce with the highest productivity while also keeping sustainability in mind. With UMH, you can connect all data sources on the shop floor with applications and systems with ease, enabling straightforward analytics, leveraging cloud tools, and supercharging your manufacturing with AI.   Future-proofing the production of goods we use and consume daily is a task so immense that no single company can handle it alone. This is why we have made the United Manufacturing Hub and our knowledge open source, creating a caring community to reach that future - united!TasksAs a Product Manager at United Manufacturing Hub, you will deliver business impact by marshaling UMHs resources to identify and solve the most impactful customer problems.  Develop comprehensive plans for upcoming UMH features, incorporating relevant information from various sources.Maintain oversight of the feature plan, balancing ideas, wishes, requirements, customer feedback, and technical considerations from multiple departments.Craft user journeys for product features based on how our user would interact with it, addressing potential issues such as technical constraints, time frame limitations, and managing postponed ideas.Possess a general understanding of technical aspects related to the products.Define and track requirements for each step of product development, ensuring program functionality meets specified criteria.Monitor the implementation of requirements and steps, replacing or deprecating outdated elements.Collect all necessary information for feature implementation.Create designs for software programs, ranging from initial sketches to complete mockups.RequirementsMinimum Bachelor's degree in Business, Engineering, or a related field (we welcome all disciplines who bring the passion and skills for this role).Ideally 1-2 years of experience in product management.Familiarity with Figma and Github.A collaborative team player with a proactive approach.Eager to learn and adaptive, with the ability to juggle multiple tasks.Structured, hands-on work approach, strong ownership and independence.Strong written and oral communication skills in English and German.Customer-focused mindset and ability to empathize with user needs.Knowledge in the area of industrial IoT would be an advantage.BenefitsProfessional Growth: You will be actively involved in exciting projects and have 100% ownership and responsibility for your tasks. A steep learning curve is guaranteed through our regular feedback sessions.Dynamic start-up atmosphere! This means: fast communication and decision-making channels, flat hierarchies, a talented and motivated team, lots of fun during and after work.Flexibility at Work: Customize your working hours to suit your needs and enjoy the option to work remotely from time to time.Value your Work: Recognition and rewarding of your work with competitive salary packages, company participation (VSOP) and subsidized memberships (e.g. Urban Sports Club, EGYM Wellpass).Modern Workspace: Work in a well-equipped, modern office located in the heart of Ehrenfeld (Cologne) with our company barista during your working day.Do you want to make a difference with us? Then we look forward to receiving your application!   United Manufacturing Hub is an equal-opportunity employer and welcomes applications from all qualified individuals regardless of ethnicity, sex, disability, religion\/belief, sexual orientation, or age.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/united-manufacturing-hub\/product-manager-full-time-cologne-347903","tags":["Product Management"],"job_types":["professional \/ experienced"],"location":"Cologne","created_at":1702680543000,"original_language":"eng "},{"slug":"systemadministrator-linux-isp-virtualisierung-karlsruhe-36308","company_name":"audius SE","title":"System Administrator (m\/f\/d) Linux \/ ISP \/ Virtualization","description":"Are you looking for a new challenge and would like to develop personally and professionally? Then you've come to the right place. ILK Internet GmbH is part of the Audius Group and offers full-service Internet-related services. We connect our customers securely and stably to the global data network and ensure that they You can fully utilize the advantages of online communication for your business.TasksYou perform classic tasks in the area of ​​system administration in the ISP environmentYou are responsible for the administration of Linux-based systems (Debian)You design and optimize administration processesYou create documentationYou are part of the team On-call qualificationsYou have successfully completed an IT degree or comparable training as an IT specialist combined with several years of professional experienceKnowledge of directory services (OpenLDAP, Active Directory), Debian package management and common Internet protocolsExperience in the conception, setup and operation of complex server systems in heterogeneous networksVery Good knowledge of the administration of Linux and MS Windows serversKnowledge of virtualization of servers and storage as well as configuration management (ansible)You have good knowledge of as many of the following areas as possible: Mail (e.g. Postfix, Dovecot), databases (e.g. PostgreSQL, MySQL, MariaDB), web servers and proxies (e.g. apache, nginx)Very good knowledge of spoken and written German and good EnglishCar driving license is an advantageYou are resilient, flexible, committed, a team player and a strong communicatorBenefitsWe welcome you You in an innovative environment with flat hierarchies, short decision-making processes and a long-term perspective with the opportunity to develop further within our company.Owner-managed (since 1991)Balancing family and careerInternal training and further education opportunities as well as e-learning offersaudius private health insuranceBike leasingUrban Sports ClubCorporate BenefitsVaried Company eventsFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/audius-se\/systemadministrator-linux-isp-virtualisierung-karlsruhe-36308","tags":["Applications Administration"],"job_types":["berufserfahren"],"location":"Karlsruhe","created_at":1702680543000,"original_language":"deu"},{"slug":"ausbildung-zum-fachinformatiker-fur-systemintegration-schwerpunkt-infrastructure-hanover-130734","company_name":"Hornetsecurity","title":"Training as an IT specialist for system integration (m\/f\/d), focus on infrastructure","description":"Are you interested in technology and IT, things like defending against spam and viruses as well as cloud computing and would you like to get to know us? Then apply now and become part of Hornetsecurity! In addition to internal and external training opportunities, we offer you constructive support from experienced trainers as well as a broad insight into our operational processes. We are looking for motivated trainees as IT specialists for system integration (m\/f\/d) for our location in Hanover (List) from August 2024! Tasks You support our administration in planning and expanding the internal company IT. You help to maintain and configure networks maintain.You support both internal and external projects.You have the opportunity to expand your expertise in various technical areas.QualificationsYou have a (technical) college entrance qualification or a secondary school diploma with a good grade point average.You have extraordinary enthusiasm for IT. Initial practical experience with, for example, programming languages ​​and Unix operating systems is an advantage.You are not deterred by new challenges, you always keep a cool head and always have all the balls in the air.You have very good knowledge of German and English.You work reliably and efficiently - and results-oriented.You are open, curious and a team player.BenefitsYou will be given responsibility early on and have the opportunity to implement your own projects independently.During your training, you will gain insights into several departments, so that you will have a broad impression of the company's processes and the practical principles of yours You can come to work in the clothes that you feel comfortable in. No matter whether it's a hoodie or a shirt, we don't have a dress code. Do you go to the gym regularly or are you active in a club? The Be-Active Bonus will support you with up to 350 per year. Parking spaces are available free of charge in front of the door. If you use the ffis, we will cover up to 50% of the cost of a GVH JobCard\/Germany ticket. As a non-smoker, you benefit from our non-smoking bonus of 50 per month. Team events such as laser tag, escape room or get together at our own legendary beer truck in Hanover let yourself be surprised.And after your training? No worries! Thanks to our acceptance rate of 99%, you have excellent chances of getting a permanent position with us after your training. If you take on a permanent position, you can also expect other cool benefits, such as the Temporary Employee Exchange Program. We will support you in our global office. Locations to work and explore the world (e.g. Malta, Madrid, Montral, Washington). If this appeals to you and you would like to help the growth and success of Hornetsecurity, then apply now! Simply upload your CV, cover letter and certificates (as a PDF ) via our online application form. We look forward to seeing you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hornetsecurity\/ausbildung-zum-fachinformatiker-fur-systemintegration-schwerpunkt-infrastructure-hanover-130734","tags":["IT"],"job_types":["Apprenticeship"],"location":"Hanover","created_at":1702680543000,"original_language":"deu"},{"slug":"sales-engineer-solution-engineer-gn-hamburg-416583","company_name":"nuvo","title":"Sales Engineer \/ Solution Engineer (gn)","description":"Millions of businesses painfully restructure data daily. As of now, 80% of enterprise data will be unstructured by 2025. Doesn't sound like the world of data exchange and communication has entered the innovation phase, right? We free them from this painstaking process by utilizing AI technology to import file-based data effortlessly - regardless of the input format.Join our mission to offer clean and usable file data instantly. We successfully raised our seed round from A+ VCs and are looking for a Sales Engineer to build and grow our sales engineering department. Tasks What will you doSupport us in developing the leading data onboarding SaaS startup in Europe. We are developing a suite of tools with significant scaling potential to serve a vast market.You will be a real innovator in the B2B SaaS space, working closely with the engineering & sales teams to actively shape and coordinate our client's journey from the technical onboarding to their technical implementation efforts to empower thousands of companies to break free from messy spreadsheets and loads of admin work.In this role, you will:Actively leading implementation sessions to educate and convert our clients as well as understand our customers needs first-handYou are the product expert during the sales process in regard to our product, integrations and platformsTake responsibility for how users experience our product with all its touchpoints and ensure it's up to the high standard we set for ourselvesProvide comprehensive customer support for testing prospects, implementing clients, and maintaining ongoing client relationships, ensuring a seamless and positive experience at every stage of the customer journeyResponsible for technical pre-sales design recommendations and justificationsConsistently and cogently address our prospect's needs through astute verbal and written communication skillsRequirements  What are we looking for?You have a deep passion for SaaS business models and, ideally, bring 3+ years of experience in sales engineering and technical customer success in an early-stage start-up or high-performance environment to the tableFundamental JavaScript and\/or TypeScript knowledgeUnderstanding the concept of well-known web development frameworks (e.g. React, Angular or Vue)Advanced communication skills, analytical and conceptual thinking skills and fluent business English to communicate with our customers and to understand their use cases and problemsYou have a bachelor's or master's degree in business, computer science or a related fieldIdeally, you are based in Hamburg or willing to relocate (not a must)Proficiency in German and English, enabling effective communication with a diverse range of clientsYou have already performed sales engineering for an interface- and frontend-based product, ideally a software libraryBenefits  What we have in store for youMission-driven: Be part of a mission to disrupt the B2B landscape by empowering businesses with operational excellence through innovative SaaS solutionsCompetitive compensation: Enjoy a competitive and fair compensation package incl. VSOP, making sure that you can focus on building a fulfilling career at our companyAttractive office location: Work in the heart of Hamburg at the TOG am Domplatz, with free coffee, tea, and fruits and a vibrant, casual work environmentModern IT infrastructureFlexible home office and workation regulationsUrban Sports Club membership includedQuarterly offsites: We arrange quarterly offsite gatherings where all nuvo members will convene in Hamburg or a different location for a week of workshops and team-building activities Would you like to get in touch? We are excited to receive your application:Apply via Join. We will get back to you as quickly as possible.Check-in meeting (15 min): In our first call, we want to exchange expectations and clarify your most urgent questions.Get to know each other (30 min): In our second meeting, we will go more into depth. Talking about previous experiences, answering all questions, and explaining nuvos products, our mission\/vision and how it is to work at nuvo!Hard Facts and Case Study (75 min): In case we see a good fit from our first calls, we will share a very brief case study for you to look at. In the following call, we will discuss your ideas in a casual setup to generate trust while checking your skills. On the other side, you get a feeling of what it is to work with us.Offer! We will make sure to run through the entire process within three to four weeks.  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/nuvo\/sales-engineer-solution-engineer-gn-hamburg-416583","tags":["Sales Engineer"],"job_types":["professional \/ experienced"],"location":"Hamburg","created_at":1702680543000,"original_language":"eng"}]