[{"slug":"burokaufmann-rechnungsprufung-potsdam-79931","company_name":"Workstation Customer Care","title":"Office Clerk Auditing (m\/f\/d)","description":"On behalf of our customer we are looking for an office worker (m\/f\/d) for invoice verification. Our customer is based in the culture and art sector and is one of the city's first addresses when it comes to museum collections. Your area of ​​responsibility: Checking incoming invoices and credit notes for factual and mathematical accuracy. Clarification of differences and ambiguities with the appropriate internal contacts. Checking and determining Account assignments Support for day-to-day administrative business Your profile: Completed commercial vocational training First professional experience in the area of ​​invoice auditing Necessary Good understanding of numbers First experience in posting data in SAP We look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-rechnungsprufung-potsdam-79931","tags":["Business Operations"],"job_types":[],"location":"Potsdam","created_at":1702799343000,"original_language":"nds"},{"slug":"user-helpdesk-marktplatz-zur-geldanlage-berlin-54175","company_name":"Workstation Customer Care","title":"User Helpdesk Marketplace for investing","description":"Our client is a well-known marketplace for investing and offers profitable investment opportunities and other investments at favorable conditions. One focus is on the security of the investments, another on the ease of use of the website. The latter is where you (m\/f\/d) come into play: Not every investor is familiar with modern Internet functionalities and therefore needs support when operating on the company website or has general questions about products and services. Typical questions that you (m\/f\/ d) will answer in your new job: Do the EU directives on national deposit insurance apply? Are there custody costs for shares \/ precious metals? What formalities are necessary for an investment abroad? Are the necessary documents also available in German? What is the difference between Fixed-term deposits and flexible deposits?How do I get a certificate for withholding tax?How does the identity check work?Can I cancel my investment early?About you (m\/f\/d):You do not need any commercial training as you do not provide investment advice.You are willing to learn and will follow suit Understand how modern banking works during a training course. You take every customer seriously and address their concerns individually. Customers and interested parties usually contact you by telephone - so telephone calls should be a desired part of your next job. You are flexible in terms of time (the positions are full-time or part-time (from 20 hours \/ week) operating a computer and simple input masks are no challenge for you. A day without laughter is a lost day - do you recognize yourself in this statement? We look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/user-helpdesk-marktplatz-zur-geldanlage-berlin-54175","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702799343000,"original_language":"deu"},{"slug":"kundenservice-im-afterpaybereich-tlw-homeoffice-berlin-444398","company_name":"Workstation Customer Care","title":"Customer service in the Afterpay area - partly home office m\/f\/d","description":"Our client offers different payment methods for the diverse possibilities of online shopping. To ensure that everything runs smoothly, we are looking for convincing personalities (m\/f\/d) who will complement the existing teams as ideally as possible. Our client offers its users the freedom to adapt payments to their individual options. Suspend, increase or reduce monthly installments - all possible without much effort. In order for you to be able to take part in regular coordination rounds and further training, it is necessary that you live in the commuting area around Berlin - even if a large part of your work can be carried out from home (if you wish).Your tasks:You answer inquiries about outstanding paymentsYou explain Customers have options to settle the outstanding amount. To this end, you present suitable alternatives; e.g. installment payments or extensions of deadlines. You look after the customers as long as necessary. If necessary. Make further changes to the payment agreements together with the customer. What you need for this: good comprehension, emotional intelligence, understanding of the individual life situation, ability to persuade customers and charisma. We look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kundenservice-im-afterpaybereich-tlw-homeoffice-berlin-444398","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702799343000,"original_language":"deu"},{"slug":"sachbearbeiter-rechnungs-und-mahnwesen-berlin-349885","company_name":"Workstation Customer Care","title":"Clerk (m\/f\/d) accounting and dunning","description":"We are looking for you as an employee (m\/f\/d) for our customer, a company in the telecommunications sector. This is the commercial team in the area of ​​accounting and dunning.Your tasksOptimal customer advice and support with regard to service and availability, invoice, dunning and debt collection questionsClarification of incoming transfers, incorrect bookingsProcessing of written and telephone customer inquiries\/complaints regarding reminders, invoices, Debt collection questionsCustomer account clarificationChecking monthly invoicingYour strengthsPreferably completed commercial vocational trainingExperience in financial accounting is an advantageVery good communicative skills in speech and writingGood MS Office and Internet skillsHigh empathy and service orientation towards internal and external customersWorking independentlyAbility to resolve conflicts and integrate, resilience and stress resistanceVery good knowledge of German, both verbal and FontWe look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/sachbearbeiter-rechnungs-und-mahnwesen-berlin-349885","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702799343000,"original_language":"deu"},{"slug":"solutions-architect-remote-berlin-383510","company_name":"Otonomee","title":"Solutions Architect (Remote)","description":"Your missionThis is a full-time, remote role based in Portugal.  About the role: The role of the Solutions Architect will report directly to the Chief Technology Officer.  In this role, you will be responsible for in-depth analysis of customer \/ program-specific or organization-wide business needs and the design, development, and delivery of tailored technology solutions to meet those objectives.  Additionally, the Solution Architect will be responsible for supporting Sales organization, product portfolio management and project management during the implementation and continuous improvement activities.  This role is technical and requires experience in multiple technologies and environments.  This is a permanent work from home role so the only commute you will need to worry about is getting to your home desk.   What you'll be doing Requirement gathering and analysis: Understand and dissect complex business requirements, transforming them into actionable technology solutions.Solution Design & Development: Design, develop, and deliver technology solutions that are scalable, reliable, and secure.Continuous Improvement: Drive ongoing enhancements to our existing processes and systems, ensuring we maintain an edge in the ever-evolving BPO and CX landscape.Support Sales Organization: Collaborate with the sales team to provide technical expertise, proposal support, and product demonstrations, ensuring we deliver value to our clients and prospective clients.Product Portfolio Management: Oversee and manage the portfolio of technology products, ensuring they remain relevant and competitive.Project Management: Work closely with implementation teams to ensure projects are executed on time, within scope, and aligned with client expectations.Documentation: Create business and technical documentation for internal and external users to showcase the architecture, functionality and operability of the solution.Stakeholder Communication: Maintain open lines of communication with all stakeholders, including clients, sales teams, and technical teams, ensuring seamless delivery and alignment with objectives.Supporting innovation: Continuously monitor industry trends and emerging technologies related to contact center and digital customer experience (CX). Evaluate new features and capabilities and recommend improvements or enhancements to optimize contact center servicesYour profileProven experience as a Solution Architect with hands-on experience designing and implementing technical solutions.Experience with cloud-based PaaS\/IaaS providers (e.g. Azure, AWS, GCP, OCI)Strong understanding of Cloud Contact Center (CCaaS) technologies. Previous experience with Genesys Cloud is desirable.Strong understanding of omnichannel capabilities, and integration with Third-Party tools and services (CRM, Reporting, etc).Strong project management and organizational skills.Good understanding of IT Security principles.Business awareness and ability to drive out business benefits through the use of technology.Strong leadership skills to support and guide team members.Aptitude for discovering and learning new technologies and concepts.Comfort working in a dynamic, research-oriented team with concurrent projects.Ability to communicate clearly both written and verbalAbility to troubleshoot and problem solve on a regular basisAbility to work in a team as well as your own initiativeWhy us?Fully remote work (based in Portugal)A competitive salaryWFH allowanceMeal AllowanceInternet allowanceContribution toward office desk and chairOnline Gym and Wellbeing Studio.The opportunity for professional growth.Fun company events and team outings.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/otonomee\/solutions-architect-remote-berlin-383510","tags":["Remote","Software Development"],"job_types":["professional \/ experienced"],"location":"Berlin","created_at":1702799343000,"original_language":"eng "},{"slug":"sicherheitsingenieur-fachkraft-fur-arbeitssicherheit-als-freelancer-hamburg-312966","company_name":"HoPa Talents","title":"Safety engineer\/occupational safety specialist (m\/f\/d) as a freelancer","description":"We as HoPa-Talents GmbH and our team are the experts for first-class recruitment of specialists and managers. We are looking for you as an experienced specialist in occupational safety who would like to build up the area of ​​occupational safety with us and help shape it right from the start. As a dynamic company, we offer you the opportunity to contribute your expertise and passion for occupational safety and to develop innovative concepts. Let's work together to create a safe and healthy working environment for companies in a wide range of industries. If you are ready to take on a significant role in a growing company, we look forward to receiving your application at HoPa Talents! #safetyfirstTasksYou will advise our customers in the design of workplaces and work processes, the use of work materials and work equipment as well as the selection of personal skills Protective equipment (PPE). You carry out safety inspections and prepare risk assessments of workplaces, systems, equipment and hazardous substances. You independently carry out operating instructions, safety instructions and risk analyses. You investigate the causes of accidents at work, analyze potential hazards and risks, define and initiate measures for improvement. Your tasks also include maintaining contact with occupational safety authorities and accident insurance providers and analyzing accidents at work to provide safety-related statements on this. You maintain your customer base and strive to expand it independently.QualificationsFurther training as a master\/technician or completed studiesCompleted training as an occupational safety specialistAn extensive network (ideally)Min. 2 years of professional experience as a safety engineer or occupational safety specialist in a service environment. Additional qualifications such as fire protection officer or hazardous goods officer (advantageous). You impress customers with your advisory skills and communication skills and enjoy field service. Driver's license of class BBenefits. Safe workplace in a future industry. 100% home office (Remote) + field serviceVery good earning potentialFlexible and family-friendly working hours (part-time or full-time possible)Personal development opportunitiesA pleasant working atmosphere with a highly motivated teamOpen and appreciative communication within the corporate groupFlat hierarchies, short decision-making processes and a you cultureActive participation in shaping the success story!Here you have the opportunity to... To fully develop your potential. I think a short, non-binding exchange could be a good CHANCE for you to develop professionally. If you have any questions, please contact Ms. Anna Pappe on 0176 470 745 47. We look forward to receiving your application! Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/sicherheitsingenieur-fachkraft-fur-arbeitssicherheit-als-freelancer-hamburg-312966","tags":["Remote","Engineering"],"job_types":["Freelance"],"location":"Hamburg","created_at":1702784942000,"original_language":"deu"},{"slug":"junior-produktmanager-neu-isenburg-119770","company_name":"HoPa Talents","title":"Junior Product Manager (m\/f\/d)","description":"Are you currently looking for a new challenge as a Junior Product Manager in Neu-Isenburg? For a well-known company in the Industry 4.0 sector, we are looking for reinforcements for the next possible start date. The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through his clever strategies, an ingenious master plan and an exclusive coaching concept, he guarantees to get the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative Solutions that are optimally and individually adapted to the respective requirements.TasksOrganization and implementation of training eventsProduct specialistTechnical support for our customers and internal sales teamsConducting application tests and working with robotsSupport with product launches and marketing tasksQualificationCompleted studies in the field of optotechnology, a state-certified further training or comparableVery good German and English skills High technical affinity Ideally, initial programming skills Confident use of MS Office Benefits An integral part of the team from day one Further training opportunities in the internal academy Versatile development and promotion opportunities Managers are filled from our own ranks Transparent salary system Regular bonus payments Permanent employment contract and 30 days of vacation Attractive sports and fitness offers We bring the best to the best - apply now :-) If you have any questions, please do not hesitate to contact Mr. Steffen Frost on 0179 42 777 83. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/junior-produktmanager-neu-isenburg-119770","tags":["Engineering"],"job_types":[],"location":"Neu-Isenburg","created_at":1702784942000,"original_language":"deu"},{"slug":"prozessingenieurin-fur-technik-und-entwicklung-in-norderstedt-453893","company_name":"HoPa Talents","title":"Process engineer (m\/f\/d) for technology and development in Norderstedt","description":"The Hamburg company HoPa Talents and its team are experts in first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees that it gets the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for a process engineer (m\/f\/d) in Norderstedt in a permanent position for a growing company in development. Tasks analysis and continuous Improvement of existing manufacturing processes Development and evaluation of process alternatives as well as monitoring of operational implementation Supervision of projects for process development and optimization in the area of ​​manufacturing Carrying out error analyzes on customer returns and production failures Supporting quality assurance in error and cause analysis Creation of 3D models and drawings Qualification Completed studies in mechanical engineering and process engineering , process technology or other comparable qualificationKnowledge of elastomer processing desirableMin. 2 years of professional experience Good knowledge of spoken and written English Structured and independent way of working Knowledge in the area of ​​CAD (Siemens NX preferred) Initiative, communication skills, independence and creativity Knowledge in the area of ​​lean production desirable Benefits Permanent employment contract Short decision-making channels to contribute ideas Flexible working hours Mobile working possible by arrangement Development opportunities Health management cost sharing for selected Fitness studios, fresh fruit and drinks, company-owned parking spaces and bus stop in front of the door, subsidy for HVV job ticket, opportunity to lease job bike, we bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/prozessingenieurin-fur-technik-und-entwicklung-in-norderstedt-453893","tags":["Process Management"],"job_types":["berufserfahren"],"location":"Norderstedt","created_at":1702784942000,"original_language":"deu"},{"slug":"kfz-mechatroniker-entwicklungsfahrzeuge-wolfsburg-408914","company_name":"HoPa Talents","title":"Automotive mechatronics engineer for development vehicles (m\/f\/d)","description":"The Hamburg company HoPa Talents and its team are experts in first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees that it gets the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for an automotive mechatronics engineer for development vehicles (m\/f\/d) in Wolfsburg in a permanent position for our strong partner. Tasks Support in the commissioning of development vehicles Software Updates to control devices (flash, coding) Carrying out hardware modifications to vehicles Support\/assembly and installation including maintenance of the development vehicle measurement technology Diagnosis and troubleshooting on the control device and the vehicle Qualification Completed training as a vehicle mechatronics technician\/mechanic\/electrician or a similar qualificationGood comprehension, structured and independent workKnowledge in the area of ​​vehicle updatesBenefitsFlexible working in flextime, no shift work and free weekendsIndividual time budget for personal training (2 days per year)A good work-life balance as well as sabbaticalsInternal development and change opportunitiesMonthly team eventsSummer and Christmas partiesUse of modern IT equipmentFree of charge Coffee, fruit, cookies and sweetsFree choice of benefits between fitness, fuel voucher, job bike leasing or other discountsDogs are allowedWarm and open working atmosphere with real team spiritWe bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechatroniker-entwicklungsfahrzeuge-wolfsburg-408914","tags":["Mechatronic Engineering"],"job_types":[],"location":"Wolfsburg","created_at":1702784942000,"original_language":"deu"},{"slug":"kfz-mechatroniker-entwicklungsfahrzeuge-weissach-417119","company_name":"HoPa Talents","title":"Automotive mechatronics engineer for development vehicles (m\/f\/d)","description":"The Hamburg company HoPa Talents and its team are experts in first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees that it gets the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for an automotive mechatronics engineer for development vehicles (m\/f\/d) in Weissach in a permanent position for our strong partner. Tasks Support in the commissioning of development vehicles Software Updates to control devices (flash, coding) Carrying out hardware modifications to vehicles Support\/assembly and installation including maintenance of the development vehicle measurement technology Diagnosis and troubleshooting on the control device and the vehicle Qualification Completed training as a vehicle mechatronics technician\/mechanic\/electrician or a similar qualificationGood comprehension, structured and independent workKnowledge in the area of ​​vehicle updatesBenefitsFlexible working in flextime, no shift work and free weekendsIndividual time budget for personal training (2 days per year)A good work-life balance as well as sabbaticalsInternal development and change opportunitiesMonthly team eventsSummer and Christmas partiesUse of modern IT equipmentFree of charge Coffee, fruit, cookies and sweetsFree choice of benefits between fitness, fuel voucher, job bike leasing or other discountsDogs are allowedWarm and open working atmosphere with real team spiritWe bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechatroniker-entwicklungsfahrzeuge-weissach-417119","tags":["Mechatronic Engineering"],"job_types":[],"location":"Weissach","created_at":1702784942000,"original_language":"deu"},{"slug":"kfz-mechatroniker-entwicklungsfahrzeuge-stuttgart-148373","company_name":"HoPa Talents","title":"Automotive mechatronics engineer for development vehicles (m\/f\/d)","description":"We are currently looking for a vehicle mechatronics engineer for development vehicles (m\/f\/d) in Ingolstadt in a permanent position for our strong partner. The Hamburg company HoPa Talents and its team are the experts for first-class recruitment of specialists and managers. Thanks to its clever strategies An ingenious master plan and an exclusive coaching concept guarantees that we get the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for our strong partner a vehicle mechatronics engineer for development vehicles (m\/f\/d) in Stuttgart in a permanent position. Tasks Support in the commissioning of development vehicles Software updates of control devices (flash, coding) Implementation of hardware modifications to vehicles Support\/assembly and installation including maintenance of the development vehicle -Measuring technologyDiagnostics and troubleshooting on the control unit and on the vehicleQualificationCompleted training as a vehicle mechatronics technician\/mechanic\/electrician or a similar qualificationGood comprehension, structured and independent workKnowledge in the area of ​​vehicle updatesBenefitsFlexible working in flextime, no shift work and free weekendsIndividual time budget for personal further training (2 days per year)A good work-life balance as well as sabbaticalsInternal development and change opportunitiesMonthly team eventsSummer and Christmas partiesUse of modern IT equipmentFree coffee, fruit, cookies and sweetsFree choice of benefits between fitness, fuel voucher, job bike leasing or other discountsDogs are allowedwarm and open working atmosphere with real team spiritWe bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechatroniker-entwicklungsfahrzeuge-stuttgart-148373","tags":["Mechatronic Engineering"],"job_types":[],"location":"Stuttgart","created_at":1702784942000,"original_language":"deu"},{"slug":"kfz-mechatroniker-entwicklungsfahrzeuge-renningen-137041","company_name":"HoPa Talents","title":"Automotive mechatronics engineer for development vehicles (m\/f\/d)","description":"The Hamburg company HoPa Talents and its team are experts in first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees that it gets the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for an automotive mechatronics engineer for development vehicles (m\/f\/d) in Renningen in a permanent position for our strong partner. Tasks Support in the commissioning of development vehicles Software Updates to control devices (flash, coding) Carrying out hardware modifications to vehicles Support\/assembly and installation including maintenance of the development vehicle measurement technology Diagnosis and troubleshooting on the control device and the vehicle Qualification Completed training as a vehicle mechatronics technician\/mechanic\/electrician or a similar qualificationGood comprehension, structured and independent workKnowledge in the area of ​​vehicle updatesBenefitsFlexible working in flextime, no shift work and free weekendsIndividual time budget for personal training (2 days per year)A good work-life balance as well as sabbaticalsInternal development and change opportunitiesMonthly team eventsSummer and Christmas partiesUse of modern IT equipmentFree of charge Coffee, fruit, cookies and sweetsFree choice of benefits between fitness, fuel voucher, job bike leasing or other discountsDogs are allowedWarm and open working atmosphere with real team spiritWe bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechatroniker-entwicklungsfahrzeuge-renningen-137041","tags":["Mechatronic Engineering"],"job_types":[],"location":"Renningen","created_at":1702784942000,"original_language":"deu"},{"slug":"kfz-mechatroniker-entwicklungsfahrzeuge-munich-477624","company_name":"HoPa Talents","title":"Automotive mechatronics engineer for development vehicles (m\/f\/d)","description":"The Hamburg company HoPa Talents and its team are experts in first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees that it gets the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for an automotive mechatronics engineer for development vehicles (m\/f\/d) in Munich in a permanent position for our strong partner. Tasks Support in the commissioning of development vehicles Software Updates to control devices (flash, coding) Carrying out hardware modifications to vehicles Support\/assembly and installation including maintenance of the development vehicle measurement technology Diagnosis and troubleshooting on the control device and the vehicle Qualification Completed training as a vehicle mechatronics technician\/mechanic\/electrician or a similar qualificationGood comprehension, structured and independent workKnowledge in the area of ​​vehicle updatesBenefitsFlexible working in flextime, no shift work and free weekendsIndividual time budget for personal training (2 days per year)A good work-life balance as well as sabbaticalsInternal development and change opportunitiesMonthly team eventsSummer and Christmas partiesUse of modern IT equipmentFree Coffee, fruit, cookies and sweetsFree choice of benefits between fitness, fuel voucher, job bike leasing or other discountsDogs are allowedWarm and open working atmosphere with real team spiritWe bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechatroniker-entwicklungsfahrzeuge-munich-477624","tags":["Mechatronic Engineering"],"job_types":[],"location":"Munich","created_at":1702784942000,"original_language":"deu"},{"slug":"kfz-mechatroniker-entwicklungsfahrzeuge-monsheim-343320","company_name":"HoPa Talents","title":"Automotive mechatronics engineer for development vehicles (m\/f\/d)","description":"We are currently looking for a vehicle mechatronics engineer for development vehicles (m\/f\/d) in Ingolstadt in a permanent position for our strong partner. The Hamburg company HoPa Talents and its team are the experts for first-class recruitment of specialists and managers. Thanks to its clever strategies An ingenious master plan and an exclusive coaching concept guarantees that we get the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for our strong partner a vehicle mechatronics engineer for development vehicles (m\/f\/d) in Mnsheim in a permanent position. Tasks Support in the commissioning of development vehicles Software updates of control devices (flash, coding) Implementation of hardware modifications to vehicles Support\/assembly and installation including maintenance of the development vehicle -Measuring technologyDiagnostics and troubleshooting on the control unit and on the vehicleQualificationCompleted training as a vehicle mechatronics technician\/mechanic\/electrician or a similar qualificationGood comprehension, structured and independent workKnowledge in the area of ​​vehicle updatesBenefitsFlexible working in flextime, no shift work and free weekendsIndividual time budget for personal further training (2 days per year)A good work-life balance as well as sabbaticalsInternal development and change opportunitiesMonthly team eventsSummer and Christmas partiesUse of modern IT equipmentFree coffee, fruit, cookies and sweetsFree choice of benefits between fitness, fuel voucher, job bike leasing or other discountsDogs are allowedWarm and open working atmosphere with real team spiritWe bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechatroniker-entwicklungsfahrzeuge-monsheim-343320","tags":["Mechatronic Engineering"],"job_types":[],"location":"Mönsheim","created_at":1702784942000,"original_language":"deu"},{"slug":"kfz-mechatroniker-entwicklungsfahrzeuge-ingolstadt-270505","company_name":"HoPa Talents","title":"Automotive mechatronics engineer for development vehicles (m\/f\/d)","description":"The Hamburg company HoPa Talents and its team are experts in first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees that it gets the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for an automotive mechatronics engineer for development vehicles (m\/f\/d) in Ingolstadt in a permanent position for our strong partner. Tasks Support in the commissioning of development vehicles Software Updates to control devices (flash, coding) Carrying out hardware modifications to vehicles Support\/assembly and installation including maintenance of the development vehicle measurement technology Diagnosis and troubleshooting on the control device and the vehicle Qualification Completed training as a vehicle mechatronics technician\/mechanic\/electrician or a similar qualificationGood comprehension, structured and independent workKnowledge in the area of ​​vehicle updatesBenefitsFlexible working in flextime, no shift work and free weekendsIndividual time budget for personal training (2 days per year)A good work-life balance as well as sabbaticalsInternal development and change opportunitiesMonthly team eventsSummer and Christmas partiesUse of modern IT equipmentFree Coffee, fruit, cookies and sweetsFree choice of benefits between fitness, fuel voucher, job bike leasing or other discountsDogs are allowedWarm and open working atmosphere with real team spiritWe bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechatroniker-entwicklungsfahrzeuge-ingolstadt-270505","tags":["Mechatronic Engineering"],"job_types":[],"location":"Ingolstadt","created_at":1702784942000,"original_language":"deu"},{"slug":"it-fachkraft-norderstedt-124544","company_name":"HoPa Talents","title":"IT-Fachkraft (m\/w\/d)","description":"The Hamburg company HoPa Talents and its team are experts in first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees that it gets the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for an IT specialist (m\/f\/d) in Norderstedt in a permanent position for our strong partner. Tasks Security and access management Support of the company networks for WAN, LAN, WLAN and VPN Development and implementation of concepts to optimize IT coordination and collaboration with external IT service providers Support of MS Active Directory structures and cloud services Management of the Microsoft server landscape Administration and monitoring of the system landscape Mobile phone support Client support and training in Windows, Office 365 and ERP system Development of solution concepts and technical documentationQualificationsCompleted vocational training in the IT sector or completed studies in the field of computer science or equivalent skills and experience Knowledge of dealing with WAN, LAN, VLAN, Layer2\/3, AD, DNS, DHCP and VPN knowledge in the administration of Windows domains, M365, Azure Services (Azure AD, O365, Teams, Intune MDM) Confident handling of virtualization environments with VMware and Veeam Basic experience with the Linux console and Powershell Business-fluent knowledge of German and good English skills Self-initiative, structured and careful Self-confident and friendly AppearanceBenefitsSecure job in a future-oriented and globally active company Room for your own ideas Short decision-making processesHealth management and sporting eventsFresh fruit and drinksFlexible working hours Mobile working (by arrangement) Personal development opportunities Company-owned parking spaces and good connections to public transportSubsidy for the HVV job ticketJob bike leasing possibleWe bring the best to the best ! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/it-fachkraft-norderstedt-124544","tags":["IT"],"job_types":[],"location":"Norderstedt","created_at":1702784942000,"original_language":"deu"},{"slug":"kfz-mechatroniker-entwicklungsfahrzeuge-garching-75449","company_name":"HoPa Talents","title":"Automotive mechatronics engineer for development vehicles (m\/f\/d)","description":"The Hamburg company HoPa Talents and its team are experts in first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees that it gets the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for an automotive mechatronics engineer for development vehicles (m\/f\/d) in Garching in a permanent position for our strong partner. Tasks Support in the commissioning of development vehicles Software Updates to control devices (flash, coding) Carrying out hardware modifications to vehicles Support\/assembly and installation including maintenance of the development vehicle measurement technology Diagnosis and troubleshooting on the control device and the vehicle Qualification Completed training as a vehicle mechatronics technician\/mechanic\/electrician or a similar qualificationGood comprehension, structured and independent workKnowledge in the area of ​​vehicle updatesBenefitsNo shift work and free weekendsIndividual time budget for personal training (2 days per year)A good work-life balance as well as sabbaticalsInternal development and change opportunitiesMonthly team eventsSummer and Christmas partiesUse of modern IT equipmentFree coffee, fruit , cookies and sweetsFree choice of benefits between fitness, fuel voucher, job bike leasing or other discountsDogs are allowedWarm and open working atmosphere with real team spiritExciting and varied activitiesCareful training and support from the qualified teamSpecific training opportunities13 salaries30 days of vacation and 1 day of special vacation on a birthdayAttractive employee offersCompany pension planInexpensive bike Leasing via JobRadWe bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechatroniker-entwicklungsfahrzeuge-garching-75449","tags":["Mechatronic Engineering"],"job_types":[],"location":"Garching","created_at":1702784942000,"original_language":"deu"},{"slug":"servicetechnikerin-fur-baumaschinen-leonberg-250396","company_name":"HoPa Talents","title":"Service technician for construction machinery (m\/f\/d)","description":"The Hamburg company HoPa Talents and its team are experts in first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees that it gets the maximum out of every employee and employer. HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements. We are currently looking for a service technician for construction machinery as a deputy workshop manager (m\/f\/d) for a leading company in a permanent position in Leonberg. Tasks Execution of repairs as well as revision and maintenance work on construction machinery Equipping new machines according to customer requirements Carrying out measuring, setting and programming work on electronic components Identification and recording of machine damage as well as error reading with spare parts ordering Adjustment and testing work on hydraulic and mechanical components Qualification Completed training as an agricultural and construction machinery mechatronics engineer, Automotive mechatronics technician for commercial vehicles or similarProfessional experienceClass B driving licenseVery good knowledge of electronics, hydraulics and diesel engine technologyIndependent, service-oriented and conscientious way of workingTime flexibility and commitmentIdeally experience with repair and maintenance work on construction machineryBenefitsCareful training in a well-equipped and heated workshop30 days vacation and 1 day special vacation on BirthdayAttractive employee offersSpecific training opportunities13 salariesFlexible working hoursFree laundry service for work clothesWe bring the best to the best! - Apply now. If you have any questions, please contact Ms. Lea Schernikau on 01575 36 98 651. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/servicetechnikerin-fur-baumaschinen-leonberg-250396","tags":["Mechatronic Engineering"],"job_types":[],"location":"Leonberg","created_at":1702784942000,"original_language":"deu"},{"slug":"inhouse-finance-consultant-erp-achstetten-174880","company_name":"HoPa Talents","title":"Inhouse Finance Consultant ERP (m\/w\/d)","description":"Suchst Du gerade eine neue Anstellung als Inhouse Finance Consultant ERP in Achstetten? Wir bieten dir eine unbefristete Anstellung in Vollzeit bei unserem starken Partner in Direktvermittlung.AufgabenVerantwortung als Finance-Berater im Bereich Finanzbuchhaltung in D365 FinanceFhrung von Analysen, Designs und Lsungskonzeptionen von neuen Business Anforderungengemeinsanme Koordinierung des automatic testing mit den Key-UsernVerantwortung des Feature-Managements im Bereich FIBUFhrung der Key-User Schulung in deinem Modul Prozessschulung und Beratung der Key User2nd und 3rd Level Support der bestehenden Dynamics 365 Supply Chain Management UmgebungImplementierung der Geschftsprozesse in den Business UnitsEnge Zusammenarbeit mit unseren Key-Usern in den Business-Units und unserem IT-D365-TeamQualifikationAbgeschlossene betriebswirtschaftliche Ausbildung oder BilanzbuchhaltungKenntnisse im Bereich ProzessberatungSehr gute Deutsch- und Englischkenntnisse in Wort und SchriftErfahrung im Bereich LCS, Azure DevOps, Power-PlattformMindestens 2 Jahre Erfahrung in der Implementierung oder Ausrollung von D365 FinanceSchnelle Auffassungsgabe und analytisches DenkvermgenSelbstndiges Arbeiten mit einer ausgeprgten Hands-on MentalittKommunikationsfhigkeit und TeamfhigkeitOffene PersnlichkeitReisettigkeit in DE und CHBenefitsEin langfristiges Beschftigungsverhltnis mit Perspektive in einem stark wachsenden Unternehmen mit Vision und definierter StrategieEine professionelle Einarbeitung und Untersttzung durch einen motivierten Mentoring-PartnerTeil eines starken Roll-Out-Teams zu seinEinfluss auf den unternehmerischen ErfolgInhabergefhrtes Familienunternehmen mit kurzen Entscheidungswegen und Du KulturKultur der tglichen Verbesserung und EntwicklungMglichkeit zum Homeoffice Attraktive und inspirierende BroumgebungZustzliche Benefits (Veranstaltungen, Vergnstigungen, Sonderurlaub zum Geburtstag)Wir bringen die Besten zu den Besten - Bewirb Dich jetzt :-)Bei Fragen steht Dir Frau Ardijana Hadzovic unter der Telefonnummer: 01575 369 86 89 oder auch per Whatsapp gerne zur Verfgung.Wir freuen uns auf Dich und Deine Bewerbung.Dein HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/inhouse-finance-consultant-erp-achstetten-174880","tags":["Credit Analysis"],"job_types":[],"location":"Achstetten","created_at":1702784942000,"original_language":"eng"},{"slug":"serviceingenieur-technikerin-automatisierung-stockelsdorf-113196","company_name":"HoPa Talents","title":"Serviceingenieur\/- techniker*in Automatisierung (m\/w\/d)","description":"Suchst Du gerade eine neue Anstellung als Serviceingenieuer\/- techniker*in Automatisierung in Stockelsdorf? Wir bieten dir eine spannende und vielfltige Anstellung in Vollzeit bei unserem starken Partner.AufgabenInstallation, Einrichtung und Inbetriebnahme (mit Fokus Automation) industrieller Rntgenanlagen bei unseren KundenFehlersuche und Problemlsung im Bereich Automation bei auftretenden StrungenTelefonische Kundenbetreuung im FehlerfallInternationale, kurztgige ReisettigkeitDurchfhrung von Kundenschulungen und AbnahmenSelbstndige Vor- und Nachbereitung von ServiceeinstzenQualifikationAbgeschlossenes Studium im Bereich Elektrotechnik, Automatisierungstechnik oder Weiterbildung zum Techniker (m\/w\/d) mit mind. 3 Jahren BerufserfahrungBreite Kenntnisse in der Automationstechnik (elektrische Antriebe, HMI, Bussysteme, Sicherheitstechnik\/-richtlinien), Antriebsoptimierung und MotorenkenntnisseProgrammierkenntnisse in LabView von VorteilErfahrungen in der Durchfhrung von Inbetriebnahmen (Sondermaschinenbau)Wnschenswert sind Erfahrungen im TIA PortalSicheres Auftreten vor Kunden und selbststndige OrganisationErfahrungen in der Durchfhrung von Inbetriebnahmen (Sondermaschinenbau)Verhandlungssichere Deutsch  und mindestens gute EnglischkenntnisseBenefitsArbeitszeiten mit Gleitzeit und Home-Office Mglichkeit 28 Tage Urlaub im JahrGehalt bis zu 60k im Jahr + Zulagen bei Auslandseinstzenattraktive WeihnachtssonderzahlungNutzung von FirmenwagenPerspektivenvielfalt durch eine groe Vielzahl an Branchen und KundenInternationales und kollegiales ArbeitsumfeldMglichkeit zur individuellen WeiterbildungVerschiedene Laufbahnmodelle (Fach-, Experten- und\/oder Fhrungslaufbahn) passend zu Ihren individuellen Strken und AmbitionenCorporate Benefits Plattform mit exklusiven Mitarbeiterrabatten fr zahlreiche Shopsergonomische Arbeitspltzewechselnde Angebote durch die betriebliche Gesundheitsfrderungverschiedene FirmensportgruppenZuschsse zur betrieblichen AltersvorsorgeWir bringen die Besten zu den Besten - Bewirb Dich jetzt :-)Bei Fragen steht Dir Frau Ardijana Hadzovic unter der Telefonnummer: 01575 369 86 89 oder auch per Whatsapp gerne zur Verfgung.Wir freuen uns auf Dich und Deine Bewerbung.Dein HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/serviceingenieur-technikerin-automatisierung-stockelsdorf-113196","tags":["Automation Engineering"],"job_types":[],"location":"Stockelsdorf","created_at":1702784942000,"original_language":"eng "},{"slug":"kfz-mechanikerin-oder-mechatronikin-neuss-122886","company_name":"HoPa Talents","title":"Automotive mechanic or mechatronics engineer (m\/f\/d)","description":"Are you currently looking for a new job as a vehicle mechanic or vehicle mechatronics engineer for commercial vehicles, trucks and trailers in Neuss? We offer you a permanent, full-time position with our strong partner in the transport and logistics industry. Career starters are welcome!TasksMaintenance, maintenance and repair of manufacturer-independent commercial vehicles and their bodies, including welding and straightening workFault diagnosis with modern diagnostic devices on various mechanical, electronic, hydraulic and pneumatic systemsAssembly of vehicle parts and usual activities in the workshopQualificationTraining as a vehicle mechanic, mechatronics engineer, - Locksmith or metal worker (preferably with a focus on commercial and agricultural vehicles) or a comparable qualification with professional experience. Career changers are welcome. First experience with commercial vehicles (lorries, trucks, trailers) is desirable. Craftsmanship and basic technical understanding. A good dose of healthy humor :) Benefits. Permanent employment contract after the probationary period. Earnings: Attractive Salary package 30 days of vacation per year Subsidized company pension scheme Referral bonus of up to 3,000 euros Regulated working hours 8 hours a day No Saturday work (depending on location) Future-proof workplace Very good working atmosphere Internal training offers We bring the best to the best - apply now :-) If you have any questions, please contact Ms. Ardijana Hadzovic on the phone number : 01575 369 86 89 or via Whatsapp. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechanikerin-oder-mechatronikin-neuss-122886","tags":["Engineering"],"job_types":[],"location":"Neuss","created_at":1702784942000,"original_language":"deu"},{"slug":"junior-produktmanager-marking-neu-isenburg-145667","company_name":"HoPa Talents","title":"Junior Product Manager (m\/f\/d) Marking","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksProduct specialist for our customersTechnical support for our customers and internal sales teamsConducting application testsOrganizing and conducting training eventsSupport with product launches and commissioningQualificationA state-certified technician , a completed degree or comparableConfidence in using MS OfficeExperience in the field of electrical engineeringVery good knowledge of German and EnglishHigh technical affinityBenefitsFrom day one you will be an integral part of the team with your own tasks. You will be introduced to everyday work by your colleagues and taken by the hand. In our internal ACADEMY, we use the strengths of our employees to improve our daily work and promote collaboration across departmental boundaries. This includes, among other things, correct telephone calls, IT training and also communication coaching. You set the pace: promotions are possible every six months, it can happen very quickly and after 3-4 years you already have the chance for your first management responsibility. We recruit our managers from within our own ranks. This means you have your career in your own hands. Our managing director sets the best example. He still remembers his time as a junior sales manager with a sensor case in Tokyo. You can expect a permanent employment contract with 30 days of vacation per year and special leave for extraordinary life events. We have a transparent salary system so that we are always clear where the journey is going. You determine the amount of the annual salary increase based on your own performance. We bring the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/junior-produktmanager-marking-neu-isenburg-145667","tags":["Engineering"],"job_types":[],"location":"Neu-Isenburg","created_at":1702784942000,"original_language":"deu"},{"slug":"key-account-manager-automotive-100-region-ostschweiz-schweiz-augsburg-456267","company_name":"CONCAPE","title":"Key Account Manager Automotive (m\/w\/d) 100% | Region Ostschweiz, Schweiz","description":"Die CONCAPE ist ein spezialisierter Recruiter und betreut bei dieser Vakanz ein internationales, spezialisiertes Automotiveunternehmen an seinem Headquarter im Raum Rheintal.Das Unternehmen hat dank Produktinnovation & Mitarbeitern (m\/w) seine Entwicklung zu einem renommierten Unternehmen im Automotive ermglicht.Arbeitsort: Rheintal, SchweizPensum: 100%Home Office: 2 Tage (bei wohnhaft Schweiz)AufgabenKey Account Manager (w\/m\/d) - 100%Ihre HerausforderungenEigenverantwortliche Kundenbetreuung im internationalen Umfeld, spezialisiert auf elektrische Fahrzeuge und Anwendungen im Straen- und Nicht-Strassenbereich.Durchfhrung der kommerziellen Abwicklung von Projekten, einschlielich der Verhandlung von Vertrgen und Vereinbarungen.Erkennung und Analyse neuer Technologien, Markttrends und Kundenbedrfnisse im Bereich der Elektromobilitt und deren Integration in die Produktentwicklung und Strategieplanung.Identifikation und Erschlieung neuer Mrkte und Kunden.Vertretung des Unternehmens auf Fachmessen und Durchfhrung von Kundenbesuchen.QualifikationIhre KompetenzenAbschluss in Betriebswirtschaft mit technischer Zusatzqualifikation oder langjhrige Erfahrung in einer hnlichen Position.Mindestens 5 Jahre Erfahrung im Umgang mit internationalen Kunden und Projekten, vorzugsweise in der Automobilindustrie.Starke Vertriebs- und Verhandlungskompetenzen.Strukturierte und genaue Arbeitsweise, hohe Eigeninitiative, organisatorische Fhigkeiten und ausgeprgte Kommunikationsstrke.Bereitschaft zu internationalen Dienstreisen (bis zu 20%).Sehr gute Englischkenntnisse; weitere Sprachkenntnisse sind ein Plus.BenefitsWie geht es weiter:Vorab haben Sie noch Fragen?Wir freuen uns auf den Kontakt mit Ihnen.IhrCONCAPE-TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/concape\/key-account-manager-automotive-100-region-ostschweiz-schweiz-augsburg-456267","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Augsburg","created_at":1702784942000,"original_language":"eng"},{"slug":"key-account-manager-automotive-100-region-ostschweiz-schweiz-freiburg-im-breisgau-96383","company_name":"CONCAPE","title":"Key Account Manager Automotive (m\/w\/d) 100% | Region Ostschweiz, Schweiz","description":"Die CONCAPE ist ein spezialisierter Recruiter und betreut bei dieser Vakanz ein internationales, spezialisiertes Automotiveunternehmen an seinem Headquarter im Raum Rheintal.Das Unternehmen hat dank Produktinnovation & Mitarbeitern (m\/w) seine Entwicklung zu einem renommierten Unternehmen im Automotive ermglicht.Arbeitsort: Rheintal, SchweizPensum: 100%Home Office: 2 Tage (bei wohnhaft Schweiz)AufgabenKey Account Manager (w\/m\/d) - 100%Ihre HerausforderungenEigenverantwortliche Kundenbetreuung im internationalen Umfeld, spezialisiert auf elektrische Fahrzeuge und Anwendungen im Straen- und Nicht-Strassenbereich.Durchfhrung der kommerziellen Abwicklung von Projekten, einschlielich der Verhandlung von Vertrgen und Vereinbarungen.Erkennung und Analyse neuer Technologien, Markttrends und Kundenbedrfnisse im Bereich der Elektromobilitt und deren Integration in die Produktentwicklung und Strategieplanung.Identifikation und Erschlieung neuer Mrkte und Kunden.Vertretung des Unternehmens auf Fachmessen und Durchfhrung von Kundenbesuchen.QualifikationIhre KompetenzenAbschluss in Betriebswirtschaft mit technischer Zusatzqualifikation oder langjhrige Erfahrung in einer hnlichen Position.Mindestens 5 Jahre Erfahrung im Umgang mit internationalen Kunden und Projekten, vorzugsweise in der Automobilindustrie.Starke Vertriebs- und Verhandlungskompetenzen.Strukturierte und genaue Arbeitsweise, hohe Eigeninitiative, organisatorische Fhigkeiten und ausgeprgte Kommunikationsstrke.Bereitschaft zu internationalen Dienstreisen (bis zu 20%).Sehr gute Englischkenntnisse; weitere Sprachkenntnisse sind ein Plus.BenefitsWie geht es weiter:Vorab haben Sie noch Fragen?Wir freuen uns auf den Kontakt mit Ihnen.IhrCONCAPE-TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/concape\/key-account-manager-automotive-100-region-ostschweiz-schweiz-freiburg-im-breisgau-96383","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Freiburg im Breisgau","created_at":1702784942000,"original_language":"eng"},{"slug":"key-account-manager-automotive-100-region-ostschweiz-schweiz-karlsruhe-479131","company_name":"CONCAPE","title":"Key Account Manager Automotive (m\/w\/d) 100% | Region Ostschweiz, Schweiz","description":"Die CONCAPE ist ein spezialisierter Recruiter und betreut bei dieser Vakanz ein internationales, spezialisiertes Automotiveunternehmen an seinem Headquarter im Raum Rheintal.Das Unternehmen hat dank Produktinnovation & Mitarbeitern (m\/w) seine Entwicklung zu einem renommierten Unternehmen im Automotive ermglicht.Arbeitsort: Rheintal, SchweizPensum: 100%Home Office: 2 Tage (bei wohnhaft Schweiz)AufgabenKey Account Manager (w\/m\/d) - 100%Ihre HerausforderungenEigenverantwortliche Kundenbetreuung im internationalen Umfeld, spezialisiert auf elektrische Fahrzeuge und Anwendungen im Straen- und Nicht-Strassenbereich.Durchfhrung der kommerziellen Abwicklung von Projekten, einschlielich der Verhandlung von Vertrgen und Vereinbarungen.Erkennung und Analyse neuer Technologien, Markttrends und Kundenbedrfnisse im Bereich der Elektromobilitt und deren Integration in die Produktentwicklung und Strategieplanung.Identifikation und Erschlieung neuer Mrkte und Kunden.Vertretung des Unternehmens auf Fachmessen und Durchfhrung von Kundenbesuchen.QualifikationIhre KompetenzenAbschluss in Betriebswirtschaft mit technischer Zusatzqualifikation oder langjhrige Erfahrung in einer hnlichen Position.Mindestens 5 Jahre Erfahrung im Umgang mit internationalen Kunden und Projekten, vorzugsweise in der Automobilindustrie.Starke Vertriebs- und Verhandlungskompetenzen.Strukturierte und genaue Arbeitsweise, hohe Eigeninitiative, organisatorische Fhigkeiten und ausgeprgte Kommunikationsstrke.Bereitschaft zu internationalen Dienstreisen (bis zu 20%).Sehr gute Englischkenntnisse; weitere Sprachkenntnisse sind ein Plus.BenefitsWie geht es weiter:Vorab haben Sie noch Fragen?Wir freuen uns auf den Kontakt mit Ihnen.IhrCONCAPE-TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/concape\/key-account-manager-automotive-100-region-ostschweiz-schweiz-karlsruhe-479131","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Karlsruhe","created_at":1702784942000,"original_language":"eng"},{"slug":"key-account-manager-automotive-100-region-ostschweiz-schweiz-ulm-459483","company_name":"CONCAPE","title":"Key Account Manager Automotive (m\/w\/d) 100% | Region Ostschweiz, Schweiz","description":"Die CONCAPE ist ein spezialisierter Recruiter und betreut bei dieser Vakanz ein internationales, spezialisiertes Automotiveunternehmen an seinem Headquarter im Raum Rheintal.Das Unternehmen hat dank Produktinnovation & Mitarbeitern (m\/w) seine Entwicklung zu einem renommierten Unternehmen im Automotive ermglicht.Arbeitsort: Rheintal, SchweizPensum: 100%Home Office: 2 Tage (bei wohnhaft Schweiz)AufgabenKey Account Manager (w\/m\/d) - 100%Ihre HerausforderungenEigenverantwortliche Kundenbetreuung im internationalen Umfeld, spezialisiert auf elektrische Fahrzeuge und Anwendungen im Straen- und Nicht-Strassenbereich.Durchfhrung der kommerziellen Abwicklung von Projekten, einschlielich der Verhandlung von Vertrgen und Vereinbarungen.Erkennung und Analyse neuer Technologien, Markttrends und Kundenbedrfnisse im Bereich der Elektromobilitt und deren Integration in die Produktentwicklung und Strategieplanung.Identifikation und Erschlieung neuer Mrkte und Kunden.Vertretung des Unternehmens auf Fachmessen und Durchfhrung von Kundenbesuchen.QualifikationIhre KompetenzenAbschluss in Betriebswirtschaft mit technischer Zusatzqualifikation oder langjhrige Erfahrung in einer hnlichen Position.Mindestens 5 Jahre Erfahrung im Umgang mit internationalen Kunden und Projekten, vorzugsweise in der Automobilindustrie.Starke Vertriebs- und Verhandlungskompetenzen.Strukturierte und genaue Arbeitsweise, hohe Eigeninitiative, organisatorische Fhigkeiten und ausgeprgte Kommunikationsstrke.Bereitschaft zu internationalen Dienstreisen (bis zu 20%).Sehr gute Englischkenntnisse; weitere Sprachkenntnisse sind ein Plus.BenefitsWie geht es weiter:Vorab haben Sie noch Fragen?Wir freuen uns auf den Kontakt mit Ihnen.IhrCONCAPE-TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/concape\/key-account-manager-automotive-100-region-ostschweiz-schweiz-ulm-459483","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Ulm","created_at":1702784942000,"original_language":"eng"},{"slug":"key-account-manager-automotive-100-region-ostschweiz-schweiz-memmingen-215913","company_name":"CONCAPE","title":"Key Account Manager Automotive (m\/w\/d) 100% | Region Ostschweiz, Schweiz","description":"Die CONCAPE ist ein spezialisierter Recruiter und betreut bei dieser Vakanz ein internationales, spezialisiertes Automotiveunternehmen an seinem Headquarter im Raum Rheintal.Das Unternehmen hat dank Produktinnovation & Mitarbeitern (m\/w) seine Entwicklung zu einem renommierten Unternehmen im Automotive ermglicht.Arbeitsort: Rheintal, SchweizPensum: 100%Home Office: 2 Tage (bei wohnhaft Schweiz)AufgabenKey Account Manager (w\/m\/d) - 100%Ihre HerausforderungenEigenverantwortliche Kundenbetreuung im internationalen Umfeld, spezialisiert auf elektrische Fahrzeuge und Anwendungen im Straen- und Nicht-Strassenbereich.Durchfhrung der kommerziellen Abwicklung von Projekten, einschlielich der Verhandlung von Vertrgen und Vereinbarungen.Erkennung und Analyse neuer Technologien, Markttrends und Kundenbedrfnisse im Bereich der Elektromobilitt und deren Integration in die Produktentwicklung und Strategieplanung.Identifikation und Erschlieung neuer Mrkte und Kunden.Vertretung des Unternehmens auf Fachmessen und Durchfhrung von Kundenbesuchen.QualifikationIhre KompetenzenAbschluss in Betriebswirtschaft mit technischer Zusatzqualifikation oder langjhrige Erfahrung in einer hnlichen Position.Mindestens 5 Jahre Erfahrung im Umgang mit internationalen Kunden und Projekten, vorzugsweise in der Automobilindustrie.Starke Vertriebs- und Verhandlungskompetenzen.Strukturierte und genaue Arbeitsweise, hohe Eigeninitiative, organisatorische Fhigkeiten und ausgeprgte Kommunikationsstrke.Bereitschaft zu internationalen Dienstreisen (bis zu 20%).Sehr gute Englischkenntnisse; weitere Sprachkenntnisse sind ein Plus.BenefitsWie geht es weiter:Vorab haben Sie noch Fragen?Wir freuen uns auf den Kontakt mit Ihnen.IhrCONCAPE-TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/concape\/key-account-manager-automotive-100-region-ostschweiz-schweiz-memmingen-215913","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Memmingen","created_at":1702784942000,"original_language":"eng"},{"slug":"key-account-manager-automotive-100-region-ostschweiz-schweiz-munich-45859","company_name":"CONCAPE","title":"Key Account Manager Automotive (m\/w\/d) 100% | Region Ostschweiz, Schweiz","description":"Die CONCAPE ist ein spezialisierter Recruiter und betreut bei dieser Vakanz ein internationales, spezialisiertes Automotiveunternehmen an seinem Headquarter im Raum Rheintal.Das Unternehmen hat dank Produktinnovation & Mitarbeitern (m\/w) seine Entwicklung zu einem renommierten Unternehmen im Automotive ermglicht.Arbeitsort: Rheintal, SchweizPensum: 100%Home Office: 2 Tage (bei wohnhaft Schweiz)AufgabenKey Account Manager (w\/m\/d) - 100%Ihre HerausforderungenEigenverantwortliche Kundenbetreuung im internationalen Umfeld, spezialisiert auf elektrische Fahrzeuge und Anwendungen im Straen- und Nicht-Strassenbereich.Durchfhrung der kommerziellen Abwicklung von Projekten, einschlielich der Verhandlung von Vertrgen und Vereinbarungen.Erkennung und Analyse neuer Technologien, Markttrends und Kundenbedrfnisse im Bereich der Elektromobilitt und deren Integration in die Produktentwicklung und Strategieplanung.Identifikation und Erschlieung neuer Mrkte und Kunden.Vertretung des Unternehmens auf Fachmessen und Durchfhrung von Kundenbesuchen.QualifikationIhre KompetenzenAbschluss in Betriebswirtschaft mit technischer Zusatzqualifikation oder langjhrige Erfahrung in einer hnlichen Position.Mindestens 5 Jahre Erfahrung im Umgang mit internationalen Kunden und Projekten, vorzugsweise in der Automobilindustrie.Starke Vertriebs- und Verhandlungskompetenzen.Strukturierte und genaue Arbeitsweise, hohe Eigeninitiative, organisatorische Fhigkeiten und ausgeprgte Kommunikationsstrke.Bereitschaft zu internationalen Dienstreisen (bis zu 20%).Sehr gute Englischkenntnisse; weitere Sprachkenntnisse sind ein Plus.BenefitsWie geht es weiter:Vorab haben Sie noch Fragen?Wir freuen uns auf den Kontakt mit Ihnen.IhrCONCAPE-TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/concape\/key-account-manager-automotive-100-region-ostschweiz-schweiz-munich-45859","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Munich","created_at":1702784942000,"original_language":"eng"},{"slug":"key-account-manager-automotive-100-region-ostschweiz-schweiz-stuttgart-105193","company_name":"CONCAPE","title":"Key Account Manager Automotive (m\/w\/d) 100% | Region Ostschweiz, Schweiz","description":"Die CONCAPE ist ein spezialisierter Recruiter und betreut bei dieser Vakanz ein internationales, spezialisiertes Automotiveunternehmen an seinem Headquarter im Raum Rheintal.Das Unternehmen hat dank Produktinnovation & Mitarbeitern (m\/w) seine Entwicklung zu einem renommierten Unternehmen im Automotive ermglicht.Arbeitsort: Rheintal, SchweizPensum: 100%Home Office: 2 Tage (bei wohnhaft Schweiz)AufgabenKey Account Manager (w\/m\/d) - 100%Ihre HerausforderungenEigenverantwortliche Kundenbetreuung im internationalen Umfeld, spezialisiert auf elektrische Fahrzeuge und Anwendungen im Straen- und Nicht-Strassenbereich.Durchfhrung der kommerziellen Abwicklung von Projekten, einschlielich der Verhandlung von Vertrgen und Vereinbarungen.Erkennung und Analyse neuer Technologien, Markttrends und Kundenbedrfnisse im Bereich der Elektromobilitt und deren Integration in die Produktentwicklung und Strategieplanung.Identifikation und Erschlieung neuer Mrkte und Kunden.Vertretung des Unternehmens auf Fachmessen und Durchfhrung von Kundenbesuchen.QualifikationIhre KompetenzenAbschluss in Betriebswirtschaft mit technischer Zusatzqualifikation oder langjhrige Erfahrung in einer hnlichen Position.Mindestens 5 Jahre Erfahrung im Umgang mit internationalen Kunden und Projekten, vorzugsweise in der Automobilindustrie.Starke Vertriebs- und Verhandlungskompetenzen.Strukturierte und genaue Arbeitsweise, hohe Eigeninitiative, organisatorische Fhigkeiten und ausgeprgte Kommunikationsstrke.Bereitschaft zu internationalen Dienstreisen (bis zu 20%).Sehr gute Englischkenntnisse; weitere Sprachkenntnisse sind ein Plus.BenefitsWie geht es weiter:Vorab haben Sie noch Fragen?Wir freuen uns auf den Kontakt mit Ihnen.IhrCONCAPE-TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/concape\/key-account-manager-automotive-100-region-ostschweiz-schweiz-stuttgart-105193","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Stuttgart","created_at":1702784942000,"original_language":"eng"},{"slug":"e-mail-marketing-manager-crm-performance-marketing-klaviyo-teilzeit-berlin-237888","company_name":"Buah GmbH","title":"Email Marketing Manager (m\/f\/d) - CRM \/ Performance Marketing \/ Klaviyo - part-time","description":"To all nutrition-conscious CRM e-commerce managers in Germany. Are you not just into a taste explosion, but also a number explosion? Do you want to make our email marketing explode? If that appeals to you, then get to the keyboard.WHO WE AREAre you just looking for any job? Then we are not for you! We work with purpose and passion so that we can achieve our mission together and scale with you. We are a dynamic, fast-growing company from Munich with innovative products in the healthy snack sector. But we don't sell products, we sell wow moments. You can choose whether you want to support us on-site, hybrid or completely remotely. Tasks YOUR CONTRIBUTION TO THE SUCCESS STORY As a CRM E-Commerce Manager, you will help realize our mission of being integrated into the everyday lives of 1 million families, by ensuring that as many people as possible get to know us with a wow moment and integrate them into their everyday lives. Retention marketing campaigns: You implement creative campaigns across channels (email, WhatsApp, postcards, push notifications) in our Marketing tool Klaviyo.Flows: You manage our Klaviyo flows and optimize theseCustomer surveys: You measure customer satisfaction via NPS and create further surveys so that we understand our customers even better.KPI evaluations: You analyze & optimize the retention KPIs and identify optimization potentialCustomer Journey: You identify new retention touchpoints and develop a strategic customer journey with a focus on CLV qualificationsWHAT YOU HAVE IN YOUR BAGProfessional experience: At least 3-5 years of professional experience CRM E-Commerce Manager. Ideally with our CRM tool Klaviyo.Scaling: You have already scaled email marketing in another companyInternationalization: Ideally, you have already had internationalization behind youAnalytical skills: You have excellent analytical skills and love numbersGoal-oriented: You set yourself realistic but ambitious goalsConscientiously : Compliance with deadlines and punctuality are a given for youPositive Mindset: You have passion and enjoy your workLanguage: You speak German at native levelBenefitsWHAT WE CAN OFFER YOUResponsibility: Your chance to build a start-up and play a decisive role in its rapid growthShort decision-making processes: A young, Dynamic working environment with flat hierarchiesHighly motivated team: We work value-oriented. Our values ​​are: We inspireWe are doers. We are professionals with heart. We are realistic optimists. We are honest & real.Steep learning curve: Your opinion is sought and a steep learning curve is guaranteedQuaterlys: Experience the cohesion of our team at our QuaterlyWe are #lifelonglearners: You receive your own annual budget for workshops\/seminars for further training of your choice worth 1500 buah fruits : worth 100 per monthFull flexibility: Office, Hybrid or RemoteIf the requirements fit and you would like to get started with us, then send us your detailed application documents, including the earliest possible start date and salary expectations.We look forward to getting to know you!Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/buah-gmbh\/e-mail-marketing-manager-crm-performance-marketing-klaviyo-teilzeit-berlin-237888","tags":["Remote","CRM","Direct Marketing"],"job_types":[],"location":"Berlin","created_at":1702784942000,"original_language":"deu"},{"slug":"mitarbeiter-rechnungswesen-und-forderungsmanagement-hamburg-304741","company_name":"jemix GmbH","title":"Employee (m\/f\/d) accounting and receivables management","description":"We are looking for you as a passionate financial expert to advance accounting and receivables management together with us. Jemix has been offering tailored and holistic IT solutions to customers for over 10 years. Our goal is to make the workplace of tomorrow nicer, simpler and more personal. With your specialist knowledge, you ensure that accounting runs smoothly. If you have a passion for accounting and receivables management and would like to support our team in this area, then become part of the Jemix team now! ResponsibilitiesYou are responsible for processing outstanding customer payments. You are responsible for correspondence with customers as part of receivables management and the invoice clarification You support the accounting (e.g. in the preparation of invoices) and create invoices You monitor the incoming payments and carry out appropriate reminders if necessary.QualificationYou have commercial training\/studies or relevant professional experience in administrative tasks, finance or in similar areas.You You are familiar with Microsoft365 and ideally with Datev and PSA systems. You find it easy to communicate with customers and enjoy it, even when things get tricky. You have very good knowledge of German and basic English skills, both spoken and written. You have fun about finding solutions for different challenges and working in a team.BenefitsWe have flat hierarchies, short decision-making processes and a very good working atmosphere. Our annual Mallorca team trip ensures a lot of fun and a supportive and friendly atmosphere in the team. Benefit from a supportive team that is there to help and advise you. Do you need a change of scenery? Then just work from our office in Mallorca and enjoy the sun and the beautiful view of the sea. Do you want a sporty alternative to work every now and then? Then simply use our sports offer (Wellpass) or bike leasing. We also offer you other benefits, such as a company pension plan. We look forward to receiving your application! Find more English Speaking Jobs in Germany on Arbeitsnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jemix-gmbh\/mitarbeiter-rechnungswesen-und-forderungsmanagement-hamburg-304741","tags":["Finance"],"job_types":[],"location":"Hamburg","created_at":1702745342000,"original_language":"deu"},{"slug":"tiktok-reels-content-creator-fur-short-form-video-freelancer-berlin-380212","company_name":"ReelStudio","title":"Tiktok\/ Reels - Content Creator für Short-Form-Video - Freelancer (m\/w\/d)","description":"BER UNS:Wir sind Reelstudio - eine fhrende Content-Marketing-Agentur mit Sitz in Berlin, spezialisiert auf die Erstellung von TikToks & Reels \/ Short Form Content fr die grten E-Commerce-Marken in DACH. Unser junges und dynamisches Team lebt die Leidenschaft fr kreative Inhalte und setzt sich dafr ein, innovative Videos zu entwickeln, die unsere Kunden zum individuellen Erfolg fhren.Bei uns findest du ein inspirierendes Umfeld, in dem Ideen geschtzt und gefrdert werden.Wir freuen uns darauf, von dir zu hren und dich in einem persnlichen Gesprch kennenzulernen.AufgabenWAS DICH ERWARTETAls Content Creator und Manager in unserem dynamischen Team spielst Du eine entscheidende Rolle bei der Produktion von ansprechenden und konvertierenden TikToks fr unsere E-Commerce-Kunden.DEIN INDIVIDUELLER BENEFIT FR DIESE STELLE:Du trgst zum Erfolg der Social Media Kanle unserer Kunden bei. Dein zutun entscheidet, wie diese sich von der Konkurrenz abheben und ihre Ziele erreichen.DEIN OUTPUT:Du bist in der Lage Short-Form-Viodes aus zugelieferten Material aufzunehmen, das sofort das Interesse der Zielgruppen unserer Kunden zu wecken.Du erhltst Briefings & Ideen, an denen Du selbst mitwirken und Deine Kreativitt mit einflieen lassen kannst.Du produzierst die Videos - entweder zu Hause fr Dich, oder gemeinsam mit unserem Film-Team - je nach Kunde.QualifikationDAS KANNST DU:Du bist TikTok-Native und hast idealerweise neben dem privaten Konsum auch bereits berufliche Berhrungspunkte mit TikTok gehabtDu bringst Erfahrung in der Aufnahme (und ggf. im Schnitt von digitalen Inhalten mit, idealerweise mit Schwerpunkt auf Short-Form-Videos auf Social-Media-Plattformen.)Du hast ein Auge fr visuelle sthetik und Social-Media Trends.Du besitzt ein hohes Ma an Eigeninitiative, Teamgeist und Verantwortungsbewusstsein.Du kommunizierst klar und berzeugend und kannst deine Ideen prsentieren.Du sprichst flieend deutsch in Schrift und WortBenefitsFLEXIBLES ARBEITEN: Je nach Kunden hast Du die Mglichkeit von berall aus zu arbeiten - Du bentigst nur ein Handy, ein Stativ und gutes LichtPLANBARES EINKOMMEN: Durch unser Modell arbeiten wir mit unseren Creatorn langfristig zusammen - so kannst Du Dein Nebeneinkommen klar planenPREMIUM KUNDEN: Als Boutique Agentur arbeiten wir mit einer genauen Auswahl an Premium Kunden zusammen, die ausschlielich gesunde, nachhaltige und sinnvolle Produkte vertreiben. Wir wollen Dich als Creator mit Brands connecten, die auch wirklich zu Dir und Deinen Interessen passen.COOLES TEAM: Wir arbeiten in einem jungen, flexiblen und coolen Team mit schneller und klarer Kommunikation und flachen Hierarchien.FAQMuss ich die Videos auf meinem Account posten?Nein, die Videos werden ausschlielich fr den Account der Brand \/ des Kunden verwendetWir freuen uns auf deine Bewerbung!Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/reelstudio\/tiktok-reels-content-creator-fur-short-form-video-freelancer-berlin-380212","tags":["Remote","Social Media Manager"],"job_types":["Freelance"],"location":"Berlin","created_at":1702745342000,"original_language":"eng"},{"slug":"freelance-ugc-video-editor-cutter-ab-sofort-berlin-65179","company_name":"Unicorn Labs GmbH & Co. KG","title":"Freelance UGC Video Editor & Cutter (AB SOFORT)","description":"Mit Social Heaven sind wir eine Creative Agency mit Fokus auf Performance UGC Ads fr die Kanle meta, TikTok und YouTube. Von der Ad Conception, ber das Copywriting, Creator Scouting, Video Production bis hin zu finalen Ad und Ad Iterationen bernehmen wir den gesamten End-to-End Prozess der UGC Production. Zu unseren Kunden zhlen international DTC Brands und Digitalprodukte. Wir brennen wir Kreativitt und Performance Skalierung ber unsere Anzeigen AufgabenDu erstellst dynamische UGC Ads fr die Plattformen meta, TikTokDu berlegst Dir auf Basis des bestehenden Video Materials, wie Du geniale, dynamische und catchige Video Konzepte umsetzen kannst und kannst so Deiner Kreativitt freien Lauf lassenQualifikationGebter Umgang mit CapCut (die einzige Cutting Solution, die wir nutzen)Ausgebautes Skillset von Transitions und Effekten in CapCutSchnelle Auffassungsgabe und hohe AccountabilityStarke kommunikative Fhigkeiten und strukturierte ArbeitsweiseSaubere und fehlerfreie Ausdrucksform in Deutsch (Wort und SchriftHohe Eigenverantwortung und absolute ZuverlssigkeitBenefitsCoole DTC Brands, wie mymuesli oder emma Matratzen, die gern mit uns arbeitenDu bernimmst schnell Verantwortung und bist Teil eines smarten, motivierten TeamsDir ist etwas besonders wichtig? Lass uns offen darber sprechen & gemeinsam eine optimale Lsung finden!Wir sind auf der Suche nach tollen Charakteren fr unser Team, um uns daher ein erstes Bild von Dir machen zu knnen, bitten wir dich, diesen Persnlichkeitsfragebogen auszufllen:https:\/\/www.16personalities.com\/free-personality-testDein Ergebnis kannst Du direkt mit Deiner Bewerbung bei uns mit hochladen - wir sind super gespannt und freuen uns Dich ganz bald schon kennenzulernen!Jo Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/unicorn-labs-gmbh-co-kg\/freelance-ugc-video-editor-cutter-ab-sofort-berlin-65179","tags":["Remote","Social Media Manager"],"job_types":["Freelance"],"location":"Berlin","created_at":1702741743000,"original_language":"eng"},{"slug":"vereins-und-landercontrolling-erlangen-oder-remote-269433","company_name":"EinDollarBrille e.V.","title":"Club and country controlling (m\/f\/d), Erlangen or remotely","description":"Over 950 million people worldwide need glasses but cannot afford them. Children cannot learn, adults cannot work and provide for their families. We want to change that. EinDollarBrille e.V. was founded in 2012 by Martin Aufmuth and has received numerous awards. More than 500 employees worldwide, including more than 300 volunteers in Germany, are committed to our common goal with great personal commitment. More information can be found at www.eindollarbrille.de.As soon as possible, we are looking for an experienced person for our club and country controlling (m\/f\/d) full-time at the Erlangen location or in the home office.TasksSupporting our program countries with budget planning, forecasting and ReportingProject planning and controlling for larger projects in the program countriesPreparation and coordination of regular appointments in the finance area (including board appointments, planning and forecast rounds)Participation in the preparation of the budget and results in close cooperation with the finance management and those responsible for costs in the program countries and in Association Advice and support for report recipients and those responsible for costs with questions about reporting and bookings New and further development of the reporting system - in particular the introduction and expansion of a group-wide BI tool Development and operation of funding controlling for funds received and awarded Planning, preparation and implementation of compliance activities to check the in accordance with the association's statutes, use of fundsQualificationsProfound experience in controlling and\/or commercial environmentSpecial knowledge in project management and\/or in the use and further development of business intelligence software advantageous but not a requirementGood application knowledge of MS Office applications (esp. Excel and Teams) Very good knowledge of German and English is a given in our international organization, French and\/or Spanish is an advantage. In a global and predominantly virtual organization, we expect independent, reliable and careful work. Benefits An interesting and varied task in a highly motivated team. Participation in Context of meaningful projects in South America, Africa and AsiaFlexible and virtual work options Many creative options and room for personal developmentAppropriate remuneration within the framework of the remuneration structure of a non-profit organizationInterested?Then please send us your CV and your letter of motivation stating your salary expectations and the earliest possible starting date. We look forward to seeing you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/eindollarbrille-ev\/vereins-und-landercontrolling-erlangen-oder-remote-269433","tags":["Controlling"],"job_types":[],"location":"Erlangen","created_at":1702741743000,"original_language":"deu"},{"slug":"leitender-projektingenieur-fur-den-bereich-technik-bornheim-112669","company_name":"Euro Pool System","title":"Lead project engineer for technology (m\/f\/d)","description":"Euro Pool System is the leading logistics provider of reusable packaging in the European fresh supply chain - a true hidden champion. With our sustainable pooling solution and a constantly improving circular economy, we are also making an important contribution to improving the CO2 balance. As head of the technology department, you can now use your technical skills and leadership skills in an exciting position at Euro Pool System. TasksHead of the technical department of Euro Pool SystemAnalysis and optimization of existing processes and systems in the service centers within our region (DACH\/NORDICS)Planning and coordination of technical projects taking into account budget and timeline monitoring of operational performance (value stream analysis, productivity, lead time, compliance with the KPI's according to OEE, ...) Close cooperation with other departments and external partners for the successful implementation of the projectsQualificationCompleted studies in the field of mechanical engineering or comparable qualificationExperience in project planning and management of technical projectsBetween 5 to 10 years of relevant professional experience in manufacturing companies or a production-related environment, alternatively in industries such as packaging or food processingAbility to work together in interdisciplinary teamsCompetencies in the Lean Six Sigma methodExcellent communication skills (in German and English) and problem-solving skillsBenefitsCapital-forming benefits & company pension schemeCompany laptopFlexible working hoursFree drinks & fruitYou too can become part of our Euro Pool family as a lead project engineer for the technology sector ( m\/f\/d) and help shape the future of Euro Pool System. We look forward to receiving your application! Please send your application to Mr. Mario Winter.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/euro-pool-system\/leitender-projektingenieur-fur-den-bereich-technik-bornheim-112669","tags":["Engineering"],"job_types":["teamleitung"],"location":"Bornheim","created_at":1702741743000,"original_language":"deu"},{"slug":"junior-sales-manager-gerne-auch-als-quereinsteiger-nordhorn-423743","company_name":"Swiss Life Select Nordhorn","title":"Junior Sales Manager (M\/F\/D) - also as a career changer!","description":"We are now looking for more motivated employees for our law firm in Nordhorn. Working in the center of an innovative region. We, the “Sileman Dar law firm team” from Nordhorn, have over 25 years of experience in the German market and advise in Germany, Austria and Switzerland independent customers in the areas of real estate, financing, pension plans, basic insurance and investments. We are active in both the “private”, “civil service” and “business” sectors. It is important to us that we pay the highest attention to quality in our consultations and in the care of existing customers. Responsibilities Your area of ​​responsibility as a Junior Sales Manager includes, in addition to expanding our network, the ongoing care and support of existing customers. Your area of ​​responsibility also includes, among other things, the enthusiasm and loyalty of new customers, the development of consulting concepts, as well as the independent planning of projects and the introduction of suggestions for improvement. Qualifications, well-organized assets, willingness to learn, fun in daily contact with people, successful and result-oriented way of working, independent way of working, openness to new things, well-founded benefits Training and further education opportunities with corresponding recognized certificates, crystal-clear career prospects, employee vouchers from cooperation partners, events for personal development, team events, family environment, free time allocation, location-independent work, above-average remuneration opportunities, as well as security, vehicle offers at wholesale customer conditions (e.g. BMW, Mercedes, AUDI, VW and others) You are interested in a career with the Sileman Dar law firm team?Then apply directly here!We look forward to hearing from you.If you have any questions, please feel free to contact me.Sileman Dar--Swiss Life SelectSileman DarIndependent sales partner for Swiss Life Select law firm NordhornHsemanns Esch 20, 48531 NordhornMobile: +49 (0)151-143 53 141Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/swiss-life-select-nordhorn\/junior-sales-manager-gerne-auch-als-quereinsteiger-nordhorn-423743","tags":["Asset","Fonds Management"],"job_types":["Traineeship","berufseinstieg"],"location":"Nordhorn","created_at":1702738143000,"original_language":"deu"},{"slug":"digital-marketing-manager-berlin-488639","company_name":"kreuzwerker GmbH","title":"Digital Marketing Manager (d\/m\/w)","description":"We love problems. Mastering exciting tasks calmly. We are cross workers. For us, digital technologies are a real and honest craft. If you want marketing in the IT B2B sector, but don't want the loud posturing of a large consulting company, then become a kreuzwerker. With us you can always bring in new ideas and continually develop yourself in a family environment. We are looking for a Digital Marketing Manager (f\/m\/d) to strengthen our team. You will design, develop and distribute campaigns for a variety of business goals. Whether these are unique solutions, lead campaigns, or specific industry information, you will develop and drive marketing projects forward. kreuzwerker offers you a wide range of development opportunities and a lot of scope to make our brand, our exceptional services and offers known.Your tasksYou are an important part of corporate communication and in reaching new marketsYou develop and control campaigns and messages relating to advice and solutions with AWS -technologies.You analyze the market, identify customers and targets and share your knowledge with others.You actively participate in our corporate communications strategy and are the door opener and networker for as yet untapped business areas.This is what we offer youWe offer a modern, calm working environment. Appreciation is the core of our corporate culture. This is of course reflected in the salary. But also in many small details: Further training: For us, constantly developing means sticking our heads out the window from time to time. That's why we invest in you and you get the time you need, a fixed budget and individual advice from your manager to find the right training that will help you and us move forward. Mobility and flexibility: Benefit from a company bike and be good for yourself and the environment something good.Technical equipment: On your first day we will equip you with Apple hardware. In keeping with our sustainability goals, you can also receive a company cell phone from Fairphone upon request. Health: You can expect freshly prepared, organic lunches from our chef Sawsan (Berlin location) as well as a membership with which you can get fit in over 5,000 high-quality sports and wellness facilities Exciting projects and the latest technologies with customers such as , Solarisbank, DKB, idealo, AutoScout24, N26, Babbel, smava, Delivery Hero, Spryker and many, many more. Development and feedback: Your leadership and a mentor are there for you personally and technical development aside and set this aside with a structured development plan and regular feedback discussions.We know exactly what we wantSeveral years of experience in B2B campaign management.Proven track record in optimization, planning and implementation of multichannel campaigns with the aim of generating leads.Proven Successful collaboration with external agencies (SEA\/SEO, social media management, content and design etc.) and internal stakeholders. Natural maintenance of landing pages, data analysis, nurture flows, creation of reports. Experience in demand generation and the translation of technical features into business values for the right pitch.Nice to have:Experience in account based marketing in the B2B IT environment with a focus on the cloud.First experience in the AWS universe.A high level of personal responsibility, structure and initiative.Creative thinking with analytical skills.Native language German level and very good knowledge of spoken and written English, other languages ​​are welcome.Equal Opportunity StatementWe are waiting for a world in which the following becomes self-evident:As a company, we are committed to inclusion, diversity and equal opportunities. We do not accept discrimination and harassment of any kind based on gender, skin color, religion, sexual orientation, origin, disability, gender identity, age or other protected characteristics. We have people from 26 countries who speak 18 languages, worship 13 different gods and have 64 different weird hobbies. And we'd love to hear anything you can add to this list. And another personal note: you can always learn what you can't do. So if you don't meet 100% of all the requirements for a job, but are still keen to work with us, we encourage you to apply to us anyway. We look forward to receiving your application!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kreuzwerker-gmbh\/digital-marketing-manager-berlin-488639","tags":["Marketing and Communication"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702738143000,"original_language":"deu"},{"slug":"software-engineer-intern-ai-stealth-startup-berlin-88815","company_name":"Blona","title":"Software Engineer Intern | AI Stealth Startup","description":"We are looking for a software engineer intern (ideally full-stack) to join our stealth startup starting January\/February 2023.\/\/ TLDR We are building the AI copilot for European machine manufacturers and are starting to onboard our first pilot customers and partners. We recently received funding from the Berlin senate, TU Berlin and the European Social Fund as well as from the leading European innovation hub, the UnternehmerTUM. We are an ambitious team of 2 (previously working on Data & ML at Facebook, Goldman Sachs, BCG, Amazon, VC and founding experience) who have successfully built & scaled tech to millions of users. We are now looking to expand our team in tech!\/\/ Facts Role: Software Engineer (ideally Full-stack) Location: Berlin (Telekom Hubraum, near Nollendorfplatz) Time: start January\/February 2024 (3-6 months) with option to stay full-time\/\/ Your opportunity We are looking for a founding software engineer (ideally full-stack) to join our team. You will be building the product with us and set the foundation for what's to come. As the first hire, youll have a once-in-a-lifetime opportunity to co-define our product roadmap, and technical architecture, and profit from a steep learning curve with us from day 1.\/\/  Sounds promising? Reach out & apply directly here.Well then schedule a call or meet in person to get to know each other better. You can expect the whole process to take 1-2 weeks. We strive to be maximally transparent about our hiring process and find time to answer all your questions.TasksYour responsibility You will build the product (both front and backend, potentially AI) together with Charlotte (ex Meta, Goldman, BCG \/ ETH & Imperial)You will shape the product roadmapYou will take ownership over dedicated projects and product developmentRequirementsYour profile :)You have full-stack experience building tech products (Typescript \/ React \/ Node.js is a plus)You have experience with ML technologies (ideally with NLP)Experience leading your own projects or building your own products is a plus.Strong problem-solving skills and the ability to think creatively and strategicallyYou show bias for action and ownership, are curious and willing to learnYou are a team player and excited to work alongside us, share jokes, have tons of fun together, and optimise over the best lunch spaces in the areaFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/blona\/software-engineer-intern-ai-stealth-startup-berlin-88815","tags":["IT"],"job_types":[],"location":"Berlin","created_at":1702730943000,"original_language":"eng"},{"slug":"marketingassistenz-dusseldorf-262226","company_name":"pix and stripes","title":"Marketingassistenz (w\/m\/d)","description":"We have big plans for the medium-sized businesses of the future and they include you! With the new agency concept between pix and stripes and Niehaus Knwer and friends, which operates under Hey Unkelbach GmbH, the Mainz digital agency and the Düsseldorf advertising agency are shaping the future of the business in a success-oriented and sustainable manner Middle class! Together we map the entire value chain of successful communication. With our experienced and creative team, we create unique brand experiences and rely on holistic, meaningful and long-term solutions. Our portfolio ranges from brand building and the development of holistic marketing and communication concepts to cross-media campaigns and the implementation and optimization of all marketing measures. Become part of our growing team in Düsseldorf as a marketing assistant (f\/m\/d)! Tasks As a marketing assistant, you will support your colleagues in the Your back in your daily business by providing support with project-related, commercial and administrative issues. Supporting the marketing team in all marketing-related topics: competition and market research, support in the conception of marketing campaigns, creation of presentations, support in day-to-day operations within all marketing channels, creation and evaluation of reports. Our account management works hand in hand marketing and creation together. Therefore, you can also support them with administrative tasks such as billing, research work and quality management. As an organizational talent, you ensure efficient and structured office processes. You will take care of the processing and digitization of incoming and outgoing mail, including courier orders, as well as our telephone exchange. The preparation of (customer) appointments and workshops is also part of your area of ​​responsibility. Qualifications You have completed commercial training in the marketing or communications sector . You have already gained initial professional experience in the assistant area. You have very good knowledge of using the MS Office package. As a true organizational talent with a hands-on mentality, you coordinate project business and everyday office life! You show initiative, think for yourself and are characterized by a structured, independent and reliable way of working and a high level of flexibility. You love working in a team and bring a high level of quality awareness and interest in trends.Benefits#diversity&inclusion: Be yourself and get involved in our #nodiscrimination corporate culture with flat hierarchies, openness and, above all, warmth!#lean: Lean, agile and highly dynamic working environment with varied activities and plenty of room for creativity and participation.#personalgrowth: We support you with your personal development plan, workshops, training and regular feedback.#officegoals: Work in a modern, well-connected office.#100%flexible: Flexible working time models & home office options.# stateofheart: Here you can get the latest equipment - of course also for your home office! #teamteamteam: Celebrate legendary team events with us, fun and a feel-good atmosphere guaranteed. #familyfirst: Children and dogs are happy to be seen in the office. Then we look forward to your meaningful comments and complete application documents stating your possible start date and your salary expectations by email to our HR manager Selina Hanka.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/pix-and-stripes\/marketingassistenz-dusseldorf-262226","tags":["Marketing and Communication"],"job_types":["berufseinstieg"],"location":"Düsseldorf","created_at":1702723743000,"original_language":"deu"},{"slug":"account-managerin-marketing-dusseldorf-157337","company_name":"pix and stripes","title":"Account Manager*in Marketing (w\/m\/d)","description":"We have big plans for the medium-sized businesses of the future and they include you! With the new agency concept between pix and stripes and Niehaus Knwer and friends, which operates under Hey Unkelbach GmbH, the Mainz digital agency and the Düsseldorf advertising agency are shaping the future of the business in a success-oriented and sustainable manner Middle class! Together we map the entire value chain of successful communication. With our experienced and creative team, we create unique brand experiences and rely on holistic, meaningful and long-term solutions. Our portfolio ranges from brand building and the development of holistic marketing and communication concepts to cross-media campaigns and the implementation and optimization of all marketing measures. Become part of our growing team in Düsseldorf as an account manager in marketing! Tasks You are your first point of contact Customers and responsible for the holistic advice, support and further development of your customers and budgets. Developing a deep understanding of customers, products and industries is the basis for partnership-based collaboration with your customers. Acquiring and advising new customers as well as building and maintaining customer relationships. Classic project management from processing customer inquiries, coordinating customer briefings, preparing offers, project planning, coordinating the project team, up to compliance with the specifications, quality assurance of all marketing measures carried out as well as billing and carrying out retros with the customer and team.Preparation and moderation of (customer) workshops and presentation meetings. Collaboration in the development of brand and marketing strategies. Conducting annual discussions with customers, as well as economic and entrepreneurial development of customers. Qualifications You have a (technical) university degree in the field of marketing\/communications \/ business administration or comparable training.You have at least three years of professional experience in account management\/project management, ideally in an agency.Your holistic marketing know-how enables you to develop comprehensive customer strategies and work hand in hand with marketing and creation.You love customer contact, have negotiation skills and turn a lead into a new customer with authentic and goal-oriented advice. You also want to think outside the box, give new ideas and advise our customers holistically. As a true organizational talent with a hands-on mentality You coordinate your projects routinely and always keep an eye on timing and budget. You show initiative, think for yourself and are characterized by a structured and reliable way of working, high flexibility and advisory skills. You have a high level of quality awareness and love working in a team. Benefits # diversity & inclusion: Be yourself and get involved our #nodiscrimination corporate culture with flat hierarchies, openness and, above all, warmth! #lean: Lean, agile and highly dynamic working environment with varied activities and plenty of room for creativity and participation. #personalgrowth: We support you with your personal development plan, workshops, training and regular feedback.#officegoals: Work in a modern, well-connected office.#100%flexible: Flexible working time models & home office options.#stateofheart: Here you can of course also get the latest equipment for your home office!#teamteamteam: Celebrate legendary team events with us , fun and a feel-good atmosphere guaranteed.#familyfirst: Children and dogs are happy to be seen in the office. Then we look forward to receiving your detailed and complete application documents with details of your possible start date and your salary expectations by email to our HR manager Selina Hanka.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/pix-and-stripes\/account-managerin-marketing-dusseldorf-157337","tags":["Marketing and Communication"],"job_types":["berufserfahren"],"location":"Düsseldorf","created_at":1702723743000,"original_language":"deu"},{"slug":"telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-246045","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Telefonischer Kundenbetreuer m\/w\/d 2*pro Woche Home Office Schichtzulagen ab 18 Uhr","description":"Wollen Sie als Kundenbetreuer m\/w\/d fr ein Hotelvergleichsportal arbeiten?Als Kundenberater m\/w\/d erwartet Sie:AufgabenSie betreuen die Kunden bei Fragen und Problemen am Telefon oder per Mail und kmmern sich dabei professionell und freundlich um eine schnelle und zufriedenstellende LsungSie sind verantwortlich fr die fachliche Prfung und Bewertung von KundenanliegenSie stellen die zgige Abwicklung und den Abschluss der Kundenanfragen in enger Zusammenarbeit mit den nationalen und internationalen Partnern sicherSie haben stets ein offenes Ohr fr die Kunden und schaffen es, bei Rckfragen zu Buchungen  per Telefon und E-Mail  kulante Lsungen zur Zufriedenheit der Kunden zu findenGemeinsam mit dem Team wirken Sie an der internen Qualittssicherung mit, um eine fehlerfreie Bearbeitung sicherzustellenZur Weiterentwicklung der internen Prozesse, arbeiten Sie eng mit den Experten zusammenQualifikationBerufserfahrung im Dialogmarketing, in der Touristik \/ Hotelbranche (z.B. Reservierungsabteilung) oder im telefonischen KundenkontaktIdealerweise bringen Sie eine abgeschlossene Ausbildung im kaufmnnischen oder touristischen Bereich mitIn Beratungsgesprchen mit den Kunden zeichnen Sie sich durch ein freundliches, serises und lsungsorientiertes Auftreten aus  Sie bringt so schnell nichts aus der RuheSie sind ein echter Teamplayer (m\/w\/d), haben Spa am gemeinsamen Erfolg und bringen eigene Ideen einSchriftlich und mndlich berzeugen Sie mit verhandlungssicheren Deutschkenntnissen sowie mit sicheren EnglischkenntnissenVersierter Umgang mit den gngigen PC- und InternetanwendungenZeitliche Flexibilitt Randarbeitszeiten zwischen 8 und 22 Uhr abzudecken (Frh-\/Mittel-\/Sptschicht) sowie Bereitschaft zur Arbeit an Wochenenden und Feiertagen (5-Tage-Woche)Benefitsunbefristeter Arbeitsvertrag, eine attraktive Vergtung fr Wochenend-, Feiertags- und Sptschichten sowie jhrliche Prmien fr besondere Erfolge. Die bernahme von Verantwortung wird zustzlich honoriert (z.B. Wochenend-Schichtleitung). Eine bezuschusste betriebliche Altersvorsorge und viele weitere Vergnstigungen gibt es obendrauf.Der Schichtplan wird, unter der Bercksichtigung von Wnschen, mind. vier Wochen im Voraus erstellt. Gerarbeitet wird 3 Tage die Woche gemeinsam im Office  an den brigen 2 Tagen ist mobiles Arbeiten mglich (Home Office).Einen Laptop fr mobiles Arbeiten, zwei Bildschirme oder individuelles Equipment wie eine ergonomische Maus oder Noise-Cancelling-Kopfhrer? Kein Problem!Individuelle Frderung durch Fortbildungen sowie regelmige Feedbackgesprche. Durch ein starkes und nachhaltiges Wachstum werden langfristige Perspektiven in der Fach- und Fhrungslaufbahn geboten.Zentraler Standort direkt am Stadthafen. Dank Zuschuss zum Job-\/Deutschlandticket und Fahrrad-\/ eBike-Leasing kommen Sie klimaneutral und gnstig ins Bro.Kostenlose Getrnke, Msli und frisches Obst sorgen fr Energie. Mehrmals wchentlich gibt es ein kostenloses, abwechslungsreiches Mittagessen.Attraktives Sportprogramm durch einen Personaltrainer: Halten Sie sich fit durch Yoga, Rckenfit, Bootcamp-Training oder auch zwischendurch in der Bewegten Pause.Es herrscht ein kollegiales und freundschaftliches Umfeld. Bei regelmigen Office Partys, Teamevents und Sommer- und Weihnachtsfeier feiern wir zusammen.Haben wir ihr Interesse geweckt? Dann freuen wir uns auf ihre Bewerbung. Gerne auch per Whats App 015233605774Ivonne Wresch steht Ihnen gerne bei Fragen zur Verfgung. 01523\/3605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-246045","tags":["Customer Service"],"job_types":[],"location":"Münster","created_at":1702723743000,"original_language":"eng"},{"slug":"call-center-agent-zahnzusatzversicherung-hamburg-430537","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Call center agent m\/f\/d additional dental insurance","description":"To support the customer management team in the area of ​​supplementary dental insurance, we are looking for call center agents, telephone customer advisors m\/f\/d in customer service in Hamburg. As a call center agent, telephone customer advisor m\/f\/d you can expect: Tasks Advising existing and new customers on the topic Supplementary dental insurance by telephone and email (no cold calling) Creation of individual offers for the dental supplement area Collection and maintenance of customer data as well as responsibility for applications Interface function between customers and insurance companies Support in the permanent development of the comparison offer Qualification Commercial training (e.g. office clerk or insurance specialist ) or also like insurance career changerFirst experience in customer adviceHigh customer orientation as well as a confident and friendly demeanor on the telephoneResponsible, conscientious and structured way of workingHands-on mentality and strength of implementation with a focus on detailEnthusiasm for digital business modelsBenefitsPermanent employment contractWorking hours from Monday to Friday between 8 a.m. and 8 p.m.Salary 30 a.m. to 32 p.m.Intensive and individual trainingProfessional qualifications in the health insurance sectorWorking independently in a dynamic working environmentCentral location with excellent transport connections and a view of the AlsterSubsidy for the HVV ProfiCardIndividual development and further training opportunitiesFriendly working environment with a first-name culture, shared lunch breaks and many team eventsHave we aroused your interest? Then we look forward to receiving your application. You are welcome to apply by email or WhatsApp. If you have any questions, Ivonne Wresch will be happy to help you. 0152\/33605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/call-center-agent-zahnzusatzversicherung-hamburg-430537","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702723743000,"original_language":"deu"},{"slug":"sachbearbeiter-versicherung-vz-und-tz-moglich-mo-fr-hamburg-250203","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Clerk m\/f\/d insurance VZ and TZ possible. Mon-Fri","description":"Do you want to work for a leading online comparison portal? We are looking for employees\/clerks m\/f\/d to support the back office team in the insurance sector. We look forward to receiving your application as a career changer m\/f\/d insurance clerks full-time or part-time from 16 hours\/week. Task-independent review of Insurance applicationsSupport with telephone inquiries from existing customers (m\/f\/d)Communication with insurance companies is an interface between customer advisors (m\/f\/d) and external insurance companiesQualificationAn independent, reliable and detail-oriented way of working is what sets you apartIdeally - initial experience in clerical processing etc. ( possibly through internships or working student positions) high customer orientation as well as a confident and friendly demeanor in telephone and written contactBenefitsCentral workplace - home office days possibleOffice working hours between 9 a.m. and 5 p.m. 30,000 p.a.more than 30 days vacation possiblequalified trainingHave we aroused your interest? Then we look forward to receiving your application. We would be happy to send you an email or WhatsApp on 0152\/33605774 (CV is sufficient). If you have any questions, Ivonne Wresch will be happy to help you. Telephone 0152\/33605774 Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/sachbearbeiter-versicherung-vz-und-tz-moglich-mo-fr-hamburg-250203","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702723743000,"original_language":"deu"},{"slug":"sales-operations-manager-berlin-158897","company_name":"Joblift GmbH","title":"Sales Operations Manager (m\/w\/d)","description":"We are Joblift - a pioneer in tech-based recruiting. Since 2015 we have been working steadily to change the HR market with innovative technologies. Started as a metasearch engine, today we are a recruiting intelligence platform. Through performance-based multichannel recruiting, we find exactly the right candidates for millions of job advertisements. Our aim is to create the perfect match and to make the recruiting process easier, faster and more transparent.With our new job recommendation system, we want to become the digital career advisor for everyone and, as a virtual JobCoach, support users in their career planning over the long term.For our Commercial Team, we are looking for YOU as Sales Operations Manager (m\/f\/d), permanent, with the earliest possible start date and a workplace in Berlin.TasksYou have the chance to change the e-recruiting market together with your colleagues.Your tasks will be a mix of analytics and process design.You will contribute to the optimisation and further development of our CRM tool (Salesforce).You will have the opportunity to work on analyses and forecasts, both nationally and internationally.You will support our commercial team with daily challenges and ensure a smooth sales process.You will contribute to the analysis and optimisation of revenue development and pipelines.You will increase the quality and efficiency of our Commercial team by analyzing, developing and implementing optimized sales processes.You act as a point of intersection between Business Analytics, Finance, Marketing, Customer Success and Sales.RequirementsExperience in online business and business analytics, especially in pipeline management, forecasting and market analytics  Ideally, a degree with an analytical focusExperience in online business and business analytics, especially in pipeline management and forecastingA high affinity for numbers and strong analytical skills with attention-to-detailA structured, organized approach and way of workingYou enjoy understanding interrelationships in depthEnjoyment of a dynamic, agile startup environment that offers a lot of freedom for personal development and focuses more on talent, attitude and community than rigid hierarchiesYou want to take over responsibilities and think for yourselfExperience with Google Sheets or Microsoft ExcelIdeally experience with building dashboardsIdeally experience with SQL, Python and\/or a CRM systemFluent English, German skills are a big plusBenefitsA full-time, permanent position with great development opportunitiesThe opportunity to play a significant role in shaping the strong growth of our companyAn above-average transparent communication culture with flat hierarchies, where every team member is appreciatedAn international, diverse, dynamic and yet sustainable working environmentLiving our values: Ownership & Accountability, Eagerness & Curiosity, EntrepreneurshipA membership in the Urban Sports Club or a subsidy for the BVG ticketSubsidy to your company pension of 25% on top of the amount you are choosingMonthly subsidy for a language courseAnnual, multi-day offsite with the whole companyTeam and company events and our legendary Summer and Christmas partiesJoblift Charity Day to engage yourself in social activitiesMonthly lunch, Newstarter and Buddy lunch with Joblift colleagues, fruit, drinks, coffee for freeStart: ImmediatelyLocation: Berlin  *Open to LGBTQ+, internationals as well as applicants with disabilities!If you want to support our team and be part of one of the fastest-growing Tech startups, apply now!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/joblift-gmbh\/sales-operations-manager-berlin-158897","tags":["Management","Team Leader"],"job_types":["manager"],"location":"Berlin","created_at":1702723743000,"original_language":"eng"},{"slug":"2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-126726","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2600€ + 500€ bonus Telephone customer advisor m\/f\/d","description":"Would you like to work for an international company that is one of the market-leading independent service providers in the field of fuel card solutions in Germany? The team in Berlin is being expanded and we are looking for customer advisors\/clerks m\/f\/d in inbound. Tasks Customer support Quotation creation and processing Final processing of all customer inquiries E-mail - and fax processingInterface to other departmentsQualificationsAbility to work in a teamFriendly demeanorPleasant voiceKnowledge of spoken and written German at a native speaker levelEfficient, fast way of workingFun on the phoneMS Office skills in particularExcellent English skills for internal communicationBenefits2300 2600 gross (negotiable professional experience) plus 500 bonusPleasant officeNhe FriedrichstrasseWorking hours from Mon-Thu 8:30 a.m. 5 p.m., Friday until 3 p.m. Full time 37.5 hoursDevelopment opportunities in an international companyApplication:We look forward to receiving your application by email or WhatsAppIvonne WreschW & W Human Resources01523\/3605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-126726","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702723743000,"original_language":"deu"},{"slug":"kaufmannischer-geschaftsfuhrer-rastatt-158318","company_name":"Laszlo & Kollegen Personalberatung GmbH","title":"Commercial Managing Director (m\/f\/d)","description":"Our customer's successful craft businesses operate completely independently in their respective regions. You will receive the comprehensive support necessary to develop into leading companies in the regional market. Against this background and due to the rapid growth of our client, we are currently looking for a commercial regional manager (m\/f\/d) for further successful expansion, who will be responsible for the business matters of the regional craft businesses with up to 300 employees, mainly located in Baden-Württemberg . In the newly created position, you will drive the strategic development of the company in cooperation with the regional management team and initiate and support appropriate measures. Tasks Overall responsibility for all commercial matters with a focus on the departments of finance, accounting and (sales) controlling of the craft businesses creation and Monitoring the budget and carrying out cost controls Development of strategies to optimize economic performance Continuous analysis and evaluation of key company figures Ensuring compliance with legal and tax requirements Management and further development of the company from a commercial perspective in the course of the digitalization of the company Close cooperation with the holding company, the Management and the management team Establishing and maintaining business relationships and supporting strategic projectsQualificationSuccessfully completed studies in business administration or engineering; or an equivalent qualification Several years of experience in a comparable function, ideally management experience Desire to build a leading national refrigeration, air conditioning, ventilation and heat pump group Entrepreneurial thinking, an analytical way of thinking and a strong understanding of numbers Assertiveness, strong communication skills and an independent and goal-oriented way of working with financial acumen and a quick comprehension Willingness to travel A human and empathetic understanding of leadershipBenefitsOur client offers:Interesting and varied tasks with good development prospects.Flexible working and presence times.Flat hierarchies, short decision-making paths, plenty of freedom for personal initiative and designAn appreciative corporate culture as well as attractive remuneration.Benefits like JobRadFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/laszlo-kollegen-personalberatung-gmbh\/kaufmannischer-geschaftsfuhrer-rastatt-158318","tags":["Finance"],"job_types":[],"location":"Rastatt","created_at":1702720143000,"original_language":"deu"},{"slug":"quereinsteiger-it-administrator-geretsried-42975","company_name":"logiXperts GmbH","title":"(lateral entrant) IT administrator (m\/f\/d)","description":"logiXperts GmbH is a technology-savvy fulfillment service provider with a focus on D2C and B2B web shops. We were founded out of the box as an independent logistics company for startups and growing web shops. We are currently on a growth path and are looking for further reinforcements for our young team. Tasks Co-administration of the IT infrastructure and the IT network Co-administration of the customer web shops, Microsoft 365, ERP and merchandise management system Collaboration in ensuring and further developing IT security in the company Procurement and management of IT hardware First level support for IT-related questions and problems Management of resources and software licenses Assessment and introduction of new software and IT systems Planning, collaboration and support of IT projectsSupport in the digitalization of business processesOperating and monitoring of relevant IT processes and systemsContinuous, self-responsible documentation of the IT environmentTesting activities in the software and hardware environment (e.g. with web shop updates)QualificationVocational training or studies in the IT sectorAlternatively, career changers are also welcome with a passion for IT and initial practical experience, willingness to learn (e.g. in new eCommerce and IT trends) analytical way of thinking and knowledge of eCommerce and cloud first programming skills for web development (Javascript, HTML, CSS, SQL) desirable fluent German and good English skills, spoken and written, enjoyment of teamwork, communication and service orientation, ability to proactively solve problems, conscientiousness and Ability to work under pressureHands-on mentalityBenefitsCreative freedom to introduce and implement your own ideas (\"Just try it out!\")Flexible working hoursFlexible time with confidenceExtensive and practical trainingCreativity, taking responsibility and creative opportunitiesFun working in a young teamSodexo Benefit CardAttractive employee benefits through corporate benefits Portal24\/7 Smart access to the office and lager-free drinks (water, soft drinks, coffee, tea) 30 days of vacation with an average 5-day week Possibility of working from home We want to tackle the IT challenges of today and of course tomorrow together and for ourselves conquer!Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/logixperts-gmbh\/quereinsteiger-it-administrator-geretsried-42975","tags":["Remote","System and Network Administration"],"job_types":["berufseinstieg"],"location":"Geretsried","created_at":1702720143000,"original_language":"deu"},{"slug":"norwegian-insurance-customer-service-all-genders-berlin-97984","company_name":"Workstation Customer Care","title":"Norwegian Insurance Customer Service - all genders","description":"Our client operates as a specialist insurer, for mobile phones and devices for the European market. The offer ranges from the assumption of repair costs to the replacement in case of total damage or loss of the device. Due to the high demand, we are looking for you (m\/f\/d) as an expansion to the existing customer service team.Your tasks as a customer service rep :You inform potential customers about the services and package optionsYou capture customer data in the system and create insurance policiesYou deal with damage reportsYou maintain contract data (addresses, bank details, device data)Do you have what it takes:You are reliable and enjoy taking responsibilityExcellent listener and persuasive speakerUnderstand the importance of professionalismFluent in NorwegianWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/norwegian-insurance-customer-service-all-genders-berlin-97984","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702709342000,"original_language":"eng "},{"slug":"fast-paced-customer-service-role-berlin-170391","company_name":"Workstation Customer Care","title":"Fast paced customer service role (m\/f\/d)","description":"Our client is a fast-growing company that is transforming the retail industry with deliveries in minutes. They are looking for talents (m\/f\/d) from all fields to complete their team.They believe that their leading edge technology and their inclusive corporate culture will be a huge advantage in achieving their goal of becoming the leader in this transformation of the retail industry.The Customer Service Team:There is no point in making 10 minute deliveries if a company does not offer their clients a customer service that is flexible enough to modify an order in progress or to organize the exchange of a product that doesn't suit in a few minutes, just like in any other store but from your home.For this we are looking for people who are able to handle requests by phone, mail or chat in a smooth way and in an incredible time, thanks to the technology provided by our customer. Our client aims for an extraordinary quality of customer service that matches their vision.Do you have what it takes:Fluency in English (working language), French speaking and writing at a fluent level, German is a big plusProblem solving is your second natureIt is not necessary to have experience, only motivationMore than comfortable with current software environments CommitmentAbility to work shiftsWhat is in for you:Competitive salaryWorking with technologies still under the radar that will make the futureA committed corporate cultureAll the last trendy and fashionable food and drinking products available at willA fancy office with top notch infrastructureWe know that there are no perfect candidates, that's why if reading this description and you doubt to apply because you do not exactly meet all the criteria: ApplyBut if you feel that you do not fit: Think twiceWe encourage you to apply if you think you can fulfill your potential in this job on a daily basis.Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/fast-paced-customer-service-role-berlin-170391","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702709342000,"original_language":"eng "},{"slug":"produktmanagerin-spezialboxen-geretsried-54818","company_name":"Bücherbüchse","title":"Product manager: in special boxes","description":"The Bcherbchse was founded in December 2018 and is now one of Germany's largest book subscription boxes, a provider of exclusive editions, book covers and merch. Every month we put together surprise boxes for our customers, which contain a new book release as well as various products related to the book and the monthly theme. Our Exclusive editions delight our customers every time. With love for books, we work every day to produce refined books and create enthusiasm for books among our customers! You would like to work in a young and creative team with enthusiastic colleagues and, together with us, our customers and subscribers every month: make you happy inside? Then you've come to the right place! Tasks Planning and implementation of special boxes in our current genres (fantasy, romance, thriller\/crime) Analysis of trends, competitors and customer interests Product management (e.g. research service providers\/artists, voting & negotiations, placing orders) Product research and research of additional items for special boxesComparisons, obtaining offers and coordinationCommunication & coordination with artists (in German & English)Selection of books (e.g. look through previews, request reading copies, read books)Preparation & checking of media \/ print dataSupport and ensure operational business (e.g. create products in the shop , preparing master data, checking invoices) Controlling our logistics team (e.g. triggering and controlling packing campaigns, managing remaining stocks) Ensuring compliance with the Buchcherbchse quality, deadlines and costs Product cost controlling Collaboration in the creation of the strategic product roadmap as well as participation in the new and further development of the Bcherbchse product\/service offeringsQualificationsEnthusiasm for booksExtensive knowledge & interest in various book genresVery structured and independent workEasy to deal with people and enjoy organizingCommitment and motivation whether in a team or on your own, convincing communication in English and German, both verbally and in writingTeam player and always reliableHands-on mentality and excellent problem-solving skillsMore confident Dealing with Microsoft Office products (esp. Microsoft Excel) & Microsoft Outlook Confident handling of IT software solutions & web applications Desirable initial knowledge of product management & supplier control Desirable Benefits Flexible working hours A very good and team-oriented working atmosphere Creativity, assumption of responsibility and design opportunities Fun working in a young team & startup Sodexo Benefit Card as a monthly employee benefit (tax-free non-cash voucher )Discounts at numerous companies through corporate benefitsAnnual team event (unique & on-site)Area team meetings in the form of on-sites or off-sitesAttractive employee discounts on the entire Bcherbchse range30 days of vacation with an average 5-day weekYou think you've come to the right place for us? We look forward to your meaningful application!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/bucherbuchse\/produktmanagerin-spezialboxen-geretsried-54818","tags":["Product Management"],"job_types":["berufseinstieg"],"location":"Geretsried","created_at":1702709342000,"original_language":"deu"},{"slug":"extensions-product-manager-frankfurt-415543","company_name":"Upbound - Job Posting","title":"Extensions Product Manager","description":"The Extensions Product Manager is an integral part of both the OSS Crossplane project and the Upbound Product organization's efforts to build a world-class Cloud Native Platform. In this role you will help platform engineers, DevOps teams and developers consistently manage their cloud platforms. This role is responsible for the extensions to Crossplane - from our providers which interact with the clouds, the newly released compositions functions capability, new add-ons to extend Upbound, tooling such as Upjet, Uptest and migration tooling to help customers adopt our products.Success in this role will be driving our strategy and execution for extending Crossplane into a world-class platform. You'll collaborate with both our open source and product teams to deliver on an end-to-end vision.In this role you willDefine programs for 'official' and 'partner' extensions to Crossplane and Upbound.Create and execute on a vision for add-ons to Upbound - ways to extend and integrate the ecosystem around cloud native platforms with our next gen architecture.Drive provider roadmaps working to help users adopt and use Crossplane to manage the most critical workloads, from AWS, Azure, GCP and more.Develop partner strategies in collaboration to drive Crossplane adoption.Define roadmap and vision for first party Upbound functions.Manage roadmaps and product deliveries across both open source and commercial open core products focused on extending the reach of Crossplane.Work with the broader Upbound product team to align roadmaps and plans.Work closely with customer service to understand and respond to customer needs.You are a good fit if you haveDeveloper background - you can use our products and write code to try out new featuresVery familiar with Kubernetes and the related ecosystemEnterprise product management experience5+ years of Product Management experiencePublic examples of code on GH\/GL (of any quality, this role isn't shipping production code)Constantly think 'there has got to be a better way to do this' about anythingIt's a plus if you haveHave built CLI, API, and SDK products in the pastDemonstrated working knowledge of CrossplaneExperience creating diagrams and simple illustrations which enhance your contentWorked with open source communities and managed public roadmapsFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/upbound-job-posting\/extensions-product-manager-frankfurt-415543","tags":[],"job_types":[],"location":"Frankfurt, Bavaria, Germany","created_at":1702687515000,"original_language":"eng "},{"slug":"extensions-product-manager-berlin-241385","company_name":"Upbound - Job Posting","title":"Extensions Product Manager","description":"The Extensions Product Manager is an integral part of both the OSS Crossplane project and the Upbound Product organization's efforts to build a world-class Cloud Native Platform. In this role you will help platform engineers, DevOps teams and developers consistently manage their cloud platforms. This role is responsible for the extensions to Crossplane - from our providers which interact with the clouds, the newly released compositions functions capability, new add-ons to extend Upbound, tooling such as Upjet, Uptest and migration tooling to help customers adopt our products.Success in this role will be driving our strategy and execution for extending Crossplane into a world-class platform. You'll collaborate with both our open source and product teams to deliver on an end-to-end vision.In this role you willDefine programs for 'official' and 'partner' extensions to Crossplane and Upbound.Create and execute on a vision for add-ons to Upbound - ways to extend and integrate the ecosystem around cloud native platforms with our next gen architecture.Drive provider roadmaps working to help users adopt and use Crossplane to manage the most critical workloads, from AWS, Azure, GCP and more.Develop partner strategies in collaboration to drive Crossplane adoption.Define roadmap and vision for first party Upbound functions.Manage roadmaps and product deliveries across both open source and commercial open core products focused on extending the reach of Crossplane.Work with the broader Upbound product team to align roadmaps and plans.Work closely with customer service to understand and respond to customer needs.You are a good fit if you haveDeveloper background - you can use our products and write code to try out new featuresVery familiar with Kubernetes and the related ecosystemEnterprise product management experience5+ years of Product Management experiencePublic examples of code on GH\/GL (of any quality, this role isn't shipping production code)Constantly think 'there has got to be a better way to do this' about anythingIt's a plus if you haveHave built CLI, API, and SDK products in the pastDemonstrated working knowledge of CrossplaneExperience creating diagrams and simple illustrations which enhance your contentWorked with open source communities and managed public roadmapsFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/upbound-job-posting\/extensions-product-manager-berlin-241385","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702687515000,"original_language":"eng "},{"slug":"solutions-architect-emea-frankfurt-276194","company_name":"Upbound - Job Posting","title":"Solutions Architect [EMEA]","description":"As a Senior Solutions Architect at Upbound, you'll be a vital part of our go-to-market team, focusing on the post sales implementation of our products and adoption of solutions. Drawing from your deep technical knowledge and experience with implementing cloud native solutions based on Kubernetes, you will have a significant impact on driving and executing the technical implementation of Upbound's products and solutions. This will include building rapport with our new and existing customers to ensure a smooth delivery and adoption of our products.In this role, you will:Closely partner with the Upbound pre sales team to transition customers to and through a smooth post sales implementation.Deeply understand customer environments and requirements, identifying their platform needs, and designing architecture and solutions that delight.Ensure successful adoption of Upbound and Crossplane technology into customer production environments.Perform technical discovery to scope customer engagements and contribute to authoring Statements of Work.Work directly with customers to troubleshoot and solve technical challenges relating to the implementation phase of deploying Crossplane and Upbound Cloud based control plane architectures into their production environments.Solve problems and improve customer deployments by writing code, fixing bugs, and building scoped features within Upbound products, the provider ecosystem, and the Crossplane core code base.Build and maintain a set of cloud native \"reference platforms\" that will help accelerate adoption and position Crossplane and Upbound as a central piece of the cloud native landscape. See https:\/\/github.com\/upbound\/configuration-aws-ekss as an example.Work cross-departmentally to find solutions to complex scenarios and integration issues.Be the technical voice of Upbound to the customer, and represent customer needs internally to influence product roadmap.Be the trusted technical advisor to new and existing customers by identifying and presenting ongoing technical solutions as the Upbound product suite grows.You are a good fit if you have:Written and maintained code that interfaces with the Kubernetes API, such as operators, controllers, add-ons, etc.Managed production Kubernetes deployments or have been responsible for deploying\/managing workloads running on Kubernetes in production.A background in platform engineering\/SRE with building an IDP (Internal Developer Portal).German language proficiency is a huge plus.A deep understanding of highly scaled and reliable services, solutions, and infrastructure in multiple major cloud providers.Excellent communication skills - must be capable of effectively engaging and leading interactions with technical and business teams, and are comfortable presenting to customer and stakeholders at varying levels of managementWorked directly with customers and\/or open source community members to troubleshoot and solve their complex technical issues leading to successful adoption.Deployed and integrated the projects and tools of the Cloud Native Landscape, especially CNCF projects, into production environments.Incorporated modern operational and application delivery tools and methodologies into your production deployment workflows, like those from HashiCorp (e.g. Terraform), CI\/CD, IaC, and GitOps.Programming skills in a modern language (Go is ideal).The ability to work closely with people in a wide variety of disciplines from a wide variety of backgrounds.Successfully managed multiple projects and priorities in a fast paced and dynamic environment.Excitement and comfort being a key part of further defining, scaling, and making this critical part of our engineering and customer solutions efforts thrive.It is a plus if:Crossplane experience is highly preferred.You are actively involved or have contributed to the upstream Kubernetes community.You have a history of speaking at technology conferences, blogging\/writing technical articles, and\/or contributing to a popular open source project.You have worked in a startup and distributed\/remote team before, and understand the unique challenges of a startup environment.Current CKA or CKAD certification.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/upbound-job-posting\/solutions-architect-emea-frankfurt-276194","tags":[],"job_types":[],"location":"Frankfurt, Bavaria, Germany","created_at":1702687515000,"original_language":"eng "},{"slug":"extensions-product-manager-berlin-419575","company_name":"Upbound","title":"Extensions Product Manager","description":"Upbound is the company behind Crossplane, the open source project which started the control plane revolution in the cloud native community. Upbound helps companies rise above the clouds with our Crossplane powered Universal Cloud Platform. With Upbound you get universal real-time visibility into all of your infrastructure environments, the same API centric approach Kubernetes pioneered for managing infrastructure and policies, and self service infrastructure capabilities.The Extensions Product Manager is an integral part of both the OSS Crossplane project and the Upbound Product organization's efforts to build a world-class Cloud Native Platform. In this role you will help platform engineers, DevOps teams and developers consistently manage their cloud platforms. This role is responsible for the extensions to Crossplane - from our providers which interact with the clouds, the newly released compositions functions capability, new add-ons to extend Upbound, tooling such as Upjet, Uptest and migration tooling to help customers adopt our products.Success in this role will be driving our strategy and execution for extending Crossplane into a world-class platform. You'll collaborate with both our open source and product teams to deliver on an end-to-end vision.In this role you willDefine programs for 'official' and 'partner' extensions to Crossplane and Upbound.Create and execute on a vision for add-ons to Upbound - ways to extend and integrate the ecosystem around cloud native platforms with our next gen architecture.Drive provider roadmaps working to help users adopt and use Crossplane to manage the most critical workloads, from AWS, Azure, GCP and more.Develop partner strategies in collaboration to drive Crossplane adoption.Define roadmap and vision for first party Upbound functions.Manage roadmaps and product deliveries across both open source and commercial open core products focused on extending the reach of Crossplane.Work with the broader Upbound product team to align roadmaps and plans.Work closely with customer service to understand and respond to customer needs.You are a good fit if you haveDeveloper background - you can use our products and write code to try out new featuresVery familiar with Kubernetes and the related ecosystemEnterprise product management experience5+ years of Product Management experiencePublic examples of code on GH\/GL (of any quality, this role isn't shipping production code)Constantly think 'there has got to be a better way to do this' about anythingIt's a plus if you haveHave built CLI, API, and SDK products in the pastDemonstrated working knowledge of CrossplaneExperience creating diagrams and simple illustrations which enhance your contentWorked with open source communities and managed public roadmapsWhile building amazing technology is important, Upbound has an intense commitment to building a great culture. With company values like Be Accountable, Demonstrate Craftsmanship, Champion the Customer, Collaborate Decisively, Care For Our Communities, Act as an Owner and Engage Vulnerability; you'll find yourself in a place where learning, growth, impact, and fun finally intersect. Similar to the open source community we serve, we look to each other to constantly iterate and improve on what we're building and you will be a key contributor in this effort.We encourage people of all backgrounds, gender identities, ethnicities, ages, or any other descriptors that make you uniquely you, to apply with enthusiasm and confidence. Upbound is a place where you can be 100% comfortable being you.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/upbound\/extensions-product-manager-berlin-419575","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702687515000,"original_language":"eng"},{"slug":"solutions-architect-emea-berlin-476225","company_name":"Upbound - Job Posting","title":"Solutions Architect [EMEA]","description":"As a Senior Solutions Architect at Upbound, you'll be a vital part of our go-to-market team, focusing on the post sales implementation of our products and adoption of solutions. Drawing from your deep technical knowledge and experience with implementing cloud native solutions based on Kubernetes, you will have a significant impact on driving and executing the technical implementation of Upbound's products and solutions. This will include building rapport with our new and existing customers to ensure a smooth delivery and adoption of our products.In this role, you will:Closely partner with the Upbound pre sales team to transition customers to and through a smooth post sales implementation.Deeply understand customer environments and requirements, identifying their platform needs, and designing architecture and solutions that delight.Ensure successful adoption of Upbound and Crossplane technology into customer production environments.Perform technical discovery to scope customer engagements and contribute to authoring Statements of Work.Work directly with customers to troubleshoot and solve technical challenges relating to the implementation phase of deploying Crossplane and Upbound Cloud based control plane architectures into their production environments.Solve problems and improve customer deployments by writing code, fixing bugs, and building scoped features within Upbound products, the provider ecosystem, and the Crossplane core code base.Build and maintain a set of cloud native \"reference platforms\" that will help accelerate adoption and position Crossplane and Upbound as a central piece of the cloud native landscape. See https:\/\/github.com\/upbound\/configuration-aws-ekss as an example.Work cross-departmentally to find solutions to complex scenarios and integration issues.Be the technical voice of Upbound to the customer, and represent customer needs internally to influence product roadmap.Be the trusted technical advisor to new and existing customers by identifying and presenting ongoing technical solutions as the Upbound product suite grows.You are a good fit if you have:Written and maintained code that interfaces with the Kubernetes API, such as operators, controllers, add-ons, etc.Managed production Kubernetes deployments or have been responsible for deploying\/managing workloads running on Kubernetes in production.A background in platform engineering\/SRE with building an IDP (Internal Developer Portal).German language proficiency is a huge plus.A deep understanding of highly scaled and reliable services, solutions, and infrastructure in multiple major cloud providers.Excellent communication skills - must be capable of effectively engaging and leading interactions with technical and business teams, and are comfortable presenting to customer and stakeholders at varying levels of managementWorked directly with customers and\/or open source community members to troubleshoot and solve their complex technical issues leading to successful adoption.Deployed and integrated the projects and tools of the Cloud Native Landscape, especially CNCF projects, into production environments.Incorporated modern operational and application delivery tools and methodologies into your production deployment workflows, like those from HashiCorp (e.g. Terraform), CI\/CD, IaC, and GitOps.Programming skills in a modern language (Go is ideal).The ability to work closely with people in a wide variety of disciplines from a wide variety of backgrounds.Successfully managed multiple projects and priorities in a fast paced and dynamic environment.Excitement and comfort being a key part of further defining, scaling, and making this critical part of our engineering and customer solutions efforts thrive.It is a plus if:Crossplane experience is highly preferred.You are actively involved or have contributed to the upstream Kubernetes community.You have a history of speaking at technology conferences, blogging\/writing technical articles, and\/or contributing to a popular open source project.You have worked in a startup and distributed\/remote team before, and understand the unique challenges of a startup environment.Current CKA or CKAD certification.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/upbound-job-posting\/solutions-architect-emea-berlin-476225","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702687515000,"original_language":"eng "},{"slug":"solutions-architect-emea-berlin-191320","company_name":"Upbound","title":"Solutions Architect [EMEA]","description":"Upbound is the company behind Crossplane, the open source project which started the control plane revolution in the cloud native community. Upbound helps companies rise above the clouds with our Crossplane powered Universal Cloud Platform. With Upbound you get universal real-time visibility into all of your infrastructure environments, the same API centric approach Kubernetes pioneered for managing infrastructure and policies, and self service infrastructure capabilities.As a Senior Solutions Architect at Upbound, you'll be a vital part of our go-to-market team, focusing on the post sales implementation of our products and adoption of solutions. Drawing from your deep technical knowledge and experience with implementing cloud native solutions based on Kubernetes, you will have a significant impact on driving and executing the technical implementation of Upbound's products and solutions. This will include building rapport with our new and existing customers to ensure a smooth delivery and adoption of our products.In this role, you will:Closely partner with the Upbound pre sales team to transition customers to and through a smooth post sales implementation.Deeply understand customer environments and requirements, identifying their platform needs, and designing architecture and solutions that delight.Ensure successful adoption of Upbound and Crossplane technology into customer production environments.Perform technical discovery to scope customer engagements and contribute to authoring Statements of Work.Work directly with customers to troubleshoot and solve technical challenges relating to the implementation phase of deploying Crossplane and Upbound Cloud based control plane architectures into their production environments.Solve problems and improve customer deployments by writing code, fixing bugs, and building scoped features within Upbound products, the provider ecosystem, and the Crossplane core code base.Build and maintain a set of cloud native \"reference platforms\" that will help accelerate adoption and position Crossplane and Upbound as a central piece of the cloud native landscape. See https:\/\/github.com\/upbound\/configuration-aws-ekss as an example.Work cross-departmentally to find solutions to complex scenarios and integration issues.Be the technical voice of Upbound to the customer, and represent customer needs internally to influence product roadmap.Be the trusted technical advisor to new and existing customers by identifying and presenting ongoing technical solutions as the Upbound product suite grows.You are a good fit if you have:Written and maintained code that interfaces with the Kubernetes API, such as operators, controllers, add-ons, etc.Managed production Kubernetes deployments or have been responsible for deploying\/managing workloads running on Kubernetes in production.A background in platform engineering\/SRE with building an IDP (Internal Developer Portal).German language proficiency is a huge plus.A deep understanding of highly scaled and reliable services, solutions, and infrastructure in multiple major cloud providers.Excellent communication skills - must be capable of effectively engaging and leading interactions with technical and business teams, and are comfortable presenting to customer and stakeholders at varying levels of managementWorked directly with customers and\/or open source community members to troubleshoot and solve their complex technical issues leading to successful adoption.Deployed and integrated the projects and tools of the Cloud Native Landscape, especially CNCF projects, into production environments.Incorporated modern operational and application delivery tools and methodologies into your production deployment workflows, like those from HashiCorp (e.g. Terraform), CI\/CD, IaC, and GitOps.Programming skills in a modern language (Go is ideal).The ability to work closely with people in a wide variety of disciplines from a wide variety of backgrounds.Successfully managed multiple projects and priorities in a fast paced and dynamic environment.Excitement and comfort being a key part of further defining, scaling, and making this critical part of our engineering and customer solutions efforts thrive.It is a plus if:Crossplane experience is highly preferred.You are actively involved or have contributed to the upstream Kubernetes community.You have a history of speaking at technology conferences, blogging\/writing technical articles, and\/or contributing to a popular open source project.You have worked in a startup and distributed\/remote team before, and understand the unique challenges of a startup environment.Current CKA or CKAD certification.While building amazing technology is important, Upbound has an intense commitment to building a great culture. With company values like Be Accountable, Demonstrate Craftsmanship, Champion the Customer, Collaborate Decisively, Care For Our Communities, Act as an Owner and Engage Vulnerability; you'll find yourself in a place where learning, growth, impact, and fun finally intersect. Similar to the open source community we serve, we look to each other to constantly iterate and improve on what we're building and you will be a key contributor in this effort.We encourage people of all backgrounds, gender identities, ethnicities, ages, or any other descriptors that make you uniquely you, to apply with enthusiasm and confidence. Upbound is a place where you can be 100% comfortable being you.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/upbound\/solutions-architect-emea-berlin-191320","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702687515000,"original_language":"eng"},{"slug":"teamleiter-last-mile-logistik-ahrensfelde-489641","company_name":"Picnic Technologies","title":"Team Leader Last Mile Logistics (m\/f\/d)","description":"Picnic operates a just-in-time supply chain. Every part of the process is critical to success and our hubs play a central role in this. They are the last stop for our goods before they end up on the customer's kitchen table. As a team leader in the Last Mile (also known internally as Hub Lead), you take on this responsibility and manage one of these hubs (distribution center). You will take over the organization of your hub and ensure that it remains an efficient part of our process chain. You will ensure that safety is a central part of our hub operations because we have a safety first culture. Every hub is a community and you will create an appealing working atmosphere in which every employee is seen as a full team member. You motivate your team to achieve goals and satisfy our customers with every order. We're always looking at how we can improve our processes, so there's plenty of room for fresh ideas and experimentation. From repairing our electric vehicles to designing the hub layout to recruiting our runners - your ideas will help optimize our flow of goods and contribute to the growth of our company!Your taskManage one of our hubs (distribution center) and ensure that operations are running there runs smoothly and safely. Develop, motivate and lead your team of 50+ runners (drivers), and organize shift planning, training of new employees, etc. Control of communication between the hub, the fulfillment center (central warehouse) and the central team monitoring of the local EPV fleet (electric picnic vehicle)Optimizing the efficiency of your hub to achieve set goals, as well as creating regular reports of these goals (KPIs) about youCompleted degree or vocational training in logistics, retail or similar areasFirst experience in management from teamsGood communication skills and a self-confident demeanorThe ability to solve ad hoc problems independentlyYou have a valid Class B driving licenseFluent German and good English skillsPicnic advantagesBecome part of a great start-up atmosphere with the freedom of your own team and your own location buildWork in an international environment with motivated colleagues and legendary team eventsFree lunch, snacks and drinks at all Picnic locations30 vacation days per year for a healthy balanceCompany pension planA large selection of internal training and further education opportunitiesPicnic laptop and smartphoneReady for the challenge? Then apply and become part of the Picnic team!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/picnic-technologies\/teamleiter-last-mile-logistik-ahrensfelde-489641","tags":["Business Operations"],"job_types":[],"location":"Ahrensfelde","created_at":1702684143000,"original_language":"deu"},{"slug":"creative-strategist-freelancer-neuss-2206","company_name":"Alpurial GmbH","title":"Creative Strategist - Freelancer (m\/w\/d)","description":"Looking for a creative freelance job in a start-up company? - Then you've come to the right place. We, Alpurial GmbH, are looking for you! A creative mind who has experience with innovative and high-quality video editing. But who are we actually? We have been successfully selling supplementary horse feed through our online shop for 3 years now and have recorded rapid growth and increasing demand. Our goal is to combine innovation and nature in order to bring strong added value into the lives of people and animals. You Are you creative and like trying out new ideas?You have experience in video editing and are characterized by unique quality?You want a real startup feeling in a young and dynamic team?You are highly motivated and independent?You should answer YES to these questions answered, then you should definitely read on: Tasks Video editing for the creation of ads with existing material Support in the creation of new video material Development of creative ad ideas and the implementation of these Creation of creative concepts for the performance marketing channels (especially social media) Support with the Creation and optimization of marketing funnels with the help of content marketing strategiesQualificationYou already have many years of experience in video editing and have already successfully completed several projectsProducing ads is in your blood. You have ideas and can implement them skillfully and quickly in video editing.You love to develop yourself personally and always come up with new ideasYou want to make a difference, you have enthusiasm for entrepreneurial activityLots of initiative and the desire for personal responsibilityHighest quality standards, structured way of workingBenefitsHiring on a freelance basis and This means a high level of flexibility, a startup feeling and a young and dynamic team. Home office possible after the induction phase. An inspiring corporate culture that is based on team spirit and passion. In addition to the usual documents, we need a small sample of your work. Please send us 2-3 videos that you have edited so far. We look forward to receiving your application!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/alpurial-gmbh\/creative-strategist-freelancer-neuss-2206","tags":["Marketing and Communication"],"job_types":["Freelance"],"location":"Neuss","created_at":1702684143000,"original_language":"deu"},{"slug":"merger-acquisition-analyst-frankfurt-8708","company_name":"WartPress GmbH","title":"Merger & Acquisition Analyst","description":"Tasks Support and independent process management of M&A transactions Carrying out market, corporate and financial analyzes as well as company valuations Preparation of pitch and transaction-relevant marketing documents Qualifications Above-average university degree in an economics\/law or comparable course of study (at least Bachelor's degree; Master's is an advantage) Previous experience through relevant internships or first Professional experience in the areas of corporate finance, finance, accounting & controlling or corporate developmentHigh motivation, analytical and structured way of working, willingness to travel, independent team player with a confident appearanceFluent in spoken and written German and EnglishBenefitsMoneytbdFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wartpress-gmbh\/merger-acquisition-analyst-frankfurt-8708","tags":["Remote","Finance"],"job_types":["berufseinstieg"],"location":"Frankfurt","created_at":1702684143000,"original_language":"deu"},{"slug":"steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-hamburg-443438","company_name":"Schwertfels Consulting GmbH","title":"Tax clerk (F\/M\/D) - digital environment, flexible working hours & home office","description":"Fruit baskets, company parties or tea and coffee specialties no longer compensate for the long hours and stress! What is really important to you? You dream of flexible working hours and the possibility of working from home? You want a modern and digital environment friendly colleagues?You want to have a development perspective and move further up the career ladder?Then the following position might be exactly the right one for you!Seize the opportunity and become part of a great team.Take advantage of interesting tasks and further development opportunities.TasksThe preparation of annual financial statements is no problem for you. It doesn't matter whether it's balance sheets or income surplus statements. You know how to process tax returns. Checking tax notices is a matter of honor for you, because the tax office is not infallible either. When preparing For ongoing financial accounting, you only ask: Which chart of accounts should I use? If there are any questions, you will be the direct contact person for communicating with the tax offices, clients and authorities. QualificationSuccessfully completed training as a tax clerk (m\/f\/d) or corresponding professional experience in the law firm environmentDATEV knowledge desirableGood MS Office knowledgeVery good knowledge of GermanEnjoyment and fun at workBenefitsMoney: Attractive remuneration with vacation, Christmas bonuses and annual salary roundsWork-life balance: Flexible working hours, individual working time models & home officeCareer: An extensive range of further trainingEquipment: A modern and fully digital working environmentTeam: A young and dynamic teamVacation: 30 days of vacation to relaxBenefits: Travel allowance\/Germany ticket, 50 credit card, fitness club subsidy There is certainly something for you with this benefit offer!Interested?Then we look forward to getting to know you!If you have any questions You are welcome to contact Gino by phone (089 \/ 277 80 59 04) or by email to cozzolino(at) Schwertfels(.)de.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schwertfels-consulting-gmbh\/steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-hamburg-443438","tags":["Finance"],"job_types":[],"location":"Hamburg","created_at":1702684143000,"original_language":"deu"},{"slug":"steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-frankfurt-202612","company_name":"Schwertfels Consulting GmbH","title":"Tax clerk (F\/M\/D) - digital environment, flexible working hours & home office","description":"Fruit baskets, company parties or tea and coffee specialties no longer compensate for the long hours and stress! What is really important to you? You dream of flexible working hours and the possibility of working from home? You want a modern and digital environment friendly colleagues?You want to have a development perspective and move further up the career ladder?Then the following position might be exactly the right one for you!Seize the opportunity and become part of a great team.Take advantage of interesting tasks and further development opportunities.TasksThe preparation of annual financial statements is no problem for you. It doesn't matter whether it's balance sheets or income surplus statements. You know how to process tax returns. Checking tax notices is a matter of honor for you, because the tax office is not infallible either. When preparing For ongoing financial accounting, you only ask: Which chart of accounts should I use? If there are any questions, you will be the direct contact person for communicating with the tax offices, clients and authorities. QualificationSuccessfully completed training as a tax clerk (m\/f\/d) or corresponding professional experience in the law firm environmentDATEV knowledge desirableGood MS Office knowledgeVery good knowledge of GermanEnjoyment and fun at workBenefitsMoney: Attractive remuneration with vacation, Christmas bonuses and annual salary roundsWork-life balance: Flexible working hours, individual working time models & home officeCareer: An extensive range of further trainingEquipment: A modern and fully digital working environmentTeam: A young and dynamic teamVacation: 30 days of vacation to relaxBenefits: Travel allowance\/Germany ticket, 50 credit card, fitness club subsidy There is certainly something for you with this benefit offer!Interested?Then we look forward to getting to know you!If you have any questions You are welcome to contact Gino by phone (089 \/ 277 80 59 04) or by email to cozzolino(at) Schwertfels(.)de.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schwertfels-consulting-gmbh\/steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-frankfurt-202612","tags":["Finance"],"job_types":[],"location":"Frankfurt","created_at":1702684143000,"original_language":"deu"},{"slug":"steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-cologne-33454","company_name":"Schwertfels Consulting GmbH","title":"Tax clerk (F\/M\/D) - digital environment, flexible working hours & home office","description":"Fruit baskets, company parties or tea and coffee specialties no longer compensate for the long hours and stress! What is really important to you? You dream of flexible working hours and the possibility of working from home? You want a modern and digital environment friendly colleagues?You want to have a development perspective and move further up the career ladder?Then the following position might be exactly the right one for you!Seize the opportunity and become part of a great team.Take advantage of interesting tasks and further development opportunities.TasksThe preparation of annual financial statements is no problem for you. It doesn't matter whether it's balance sheets or income surplus statements. You know how to process tax returns. Checking tax notices is a matter of honor for you, because the tax office is not infallible either. When preparing For ongoing financial accounting, you only ask: Which chart of accounts should I use? If there are any questions, you will be the direct contact person for communicating with the tax offices, clients and authorities. QualificationSuccessfully completed training as a tax clerk (m\/f\/d) or corresponding professional experience in the law firm environmentDATEV knowledge desirableGood MS Office knowledgeVery good knowledge of GermanEnjoyment and fun at workBenefitsMoney: Attractive remuneration with vacation, Christmas bonuses and annual salary roundsWork-life balance: Flexible working hours, individual working time models & home officeCareer: An extensive range of further trainingEquipment: A modern and fully digital working environmentTeam: A young and dynamic teamVacation: 30 days of vacation to relaxBenefits: Travel allowance\/Germany ticket, 50 credit card, fitness club subsidy There is certainly something for you with this benefit offer!Interested?Then we look forward to getting to know you!If you have any questions You are welcome to contact Gino by phone (089 \/ 277 80 59 04) or by email to cozzolino(at) Schwertfels(.)de.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schwertfels-consulting-gmbh\/steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-cologne-33454","tags":["Finance"],"job_types":[],"location":"Cologne","created_at":1702684143000,"original_language":"deu"},{"slug":"steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-dusseldorf-379698","company_name":"Schwertfels Consulting GmbH","title":"Tax clerk (F\/M\/D) - digital environment, flexible working hours & home office","description":"Fruit baskets, company parties or tea and coffee specialties no longer compensate for the long hours and stress! What is really important to you? You dream of flexible working hours and the possibility of working from home? You want a modern and digital environment friendly colleagues?You want to have a development perspective and move further up the career ladder?Then the following position might be exactly the right one for you!Seize the opportunity and become part of a great team.Take advantage of interesting tasks and further development opportunities.TasksThe preparation of annual financial statements is no problem for you. It doesn't matter whether it's balance sheets or income surplus statements. You know how to process tax returns. Checking tax notices is a matter of honor for you, because the tax office is not infallible either. When preparing For ongoing financial accounting, you only ask: Which chart of accounts should I use? If there are any questions, you will be the direct contact person for communicating with the tax offices, clients and authorities. QualificationSuccessfully completed training as a tax clerk (m\/f\/d) or corresponding professional experience in the law firm environmentDATEV knowledge desirableGood MS Office knowledgeVery good knowledge of GermanEnjoyment and fun at workBenefitsMoney: Attractive remuneration with vacation, Christmas bonuses and annual salary roundsWork-life balance: Flexible working hours, individual working time models & home officeCareer: An extensive range of further trainingEquipment: A modern and fully digital working environmentTeam: A young and dynamic teamVacation: 30 days of vacation to relaxBenefits: Travel allowance\/Germany ticket, 50 credit card, fitness club subsidy There is certainly something for you with this benefit offer!Interested?Then we look forward to getting to know you!If you have any questions You are welcome to contact Gino by phone (089 \/ 277 80 59 04) or by email to cozzolino(at) Schwertfels(.)de.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schwertfels-consulting-gmbh\/steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-dusseldorf-379698","tags":["Finance"],"job_types":[],"location":"Düsseldorf","created_at":1702684143000,"original_language":"deu"},{"slug":"steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-berlin-422495","company_name":"Schwertfels Consulting GmbH","title":"Tax clerk (F\/M\/D) - digital environment, flexible working hours & home office","description":"Fruit baskets, company parties or tea and coffee specialties no longer compensate for the long hours and stress! What is really important to you? You dream of flexible working hours and the possibility of working from home? You want a modern and digital environment friendly colleagues?You want to have a development perspective and move further up the career ladder?Then the following position might be exactly the right one for you!Seize the opportunity and become part of a great team.Take advantage of interesting tasks and further development opportunities.TasksThe preparation of annual financial statements is no problem for you. It doesn't matter whether it's balance sheets or income surplus statements. You know how to process tax returns. Checking tax notices is a matter of honor for you, because the tax office is not infallible either. When preparing For ongoing financial accounting, you only ask: Which chart of accounts should I use? If there are any questions, you will be the direct contact person for communicating with the tax offices, clients and authorities. QualificationSuccessfully completed training as a tax clerk (m\/f\/d) or corresponding professional experience in the law firm environmentDATEV knowledge desirableGood MS Office knowledgeVery good knowledge of GermanEnjoyment and fun at workBenefitsMoney: Attractive remuneration with vacation, Christmas bonuses and annual salary roundsWork-life balance: Flexible working hours, individual working time models & home officeCareer: An extensive range of further trainingEquipment: A modern and fully digital working environmentTeam: A young and dynamic teamVacation: 30 days of vacation to relaxBenefits: Travel allowance\/Germany ticket, 50 credit card, fitness club subsidy There is certainly something for you with this benefit offer!Interested?Then we look forward to getting to know you!If you have any questions You are welcome to contact Gino by phone (089 \/ 277 80 59 04) or by email to cozzolino(at) Schwertfels(.)de.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schwertfels-consulting-gmbh\/steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-berlin-422495","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"erfahrener-vuejs-nuxt-frontend-entwickler-remote-cologne-426488","company_name":"Intercon Solutions GmbH IT & Engineering Experts","title":"Experienced Vue.JS & Nuxt frontend developer (m\/f\/d) - remote","description":"Are you looking for a new challenge in software development?Then the following position could be your chance to further educate yourself as a developer and grow together with a well-known company!TasksSupport, further development, testing and optimization of frontend applications and everything that goes with themClose collaboration between frontend and backend teams Clean code and a structured way of working are a given for youQualificationsPractical experience with modern design patterns and software architectureYou should be familiar with the following technologies: VueJS, Nuxt, Cypress, Tailwind or Twig, Bootstrap, SCSS, JavaScript\/TypeScriptGit, Composer, Buddy, Webpack, DockerNice to have: Headless PWABenefitsAttractive remuneration30 vacation daysMobile workingExcellent inductionPersonal training and further education opportunitiesA quick and transparent application processThis position is perfectly tailored to you?We would be happy to bring you together with our customer and provide you with lots of further information. IT consultant Cedric Baron is available to you at any time by email or telephone at: +49 211 95597688 and will support you throughout the entire process. Get to know your new employer in person in the next few days. You are not sure whether this job is really for you Suits you? No problem at all, because our strong network will help us find the perfect job for you.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/intercon-solutions-gmbh-it-engineering-experts\/erfahrener-vuejs-nuxt-frontend-entwickler-remote-cologne-426488","tags":["Remote","Software Development"],"job_types":["berufserfahren"],"location":"Cologne","created_at":1702684143000,"original_language":"deu"},{"slug":"steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-munich-220361","company_name":"Schwertfels Consulting GmbH","title":"Tax clerk (F\/M\/D) - digital environment, flexible working hours & home office","description":"Fruit baskets, company parties or tea and coffee specialties no longer compensate for the long hours and stress! What is really important to you? You dream of flexible working hours and the possibility of working from home? You want a modern and digital environment friendly colleagues?You want to have a development perspective and move further up the career ladder?Then the following position might be exactly the right one for you!Seize the opportunity and become part of a great team.Take advantage of interesting tasks and further development opportunities.TasksThe preparation of annual financial statements is no problem for you. It doesn't matter whether it's balance sheets or income surplus statements. You know how to process tax returns. Checking tax notices is a matter of honor for you, because the tax office is not infallible either. When preparing For ongoing financial accounting, you only ask: Which chart of accounts should I use? If there are any questions, you will be the direct contact person for communicating with the tax offices, clients and authorities. QualificationSuccessfully completed training as a tax clerk (m\/f\/d) or corresponding professional experience in the law firm environmentDATEV knowledge desirableGood MS Office knowledgeVery good knowledge of GermanEnjoyment and fun at workBenefitsMoney: Attractive remuneration with vacation, Christmas bonuses and annual salary roundsWork-life balance: Flexible working hours, individual working time models & home officeCareer: An extensive range of further trainingEquipment: A modern and fully digital working environmentTeam: A young and dynamic teamVacation: 30 days of vacation to relaxBenefits: Travel allowance\/Germany ticket, 50 credit card, fitness club subsidy There is certainly something for you with this benefit offer!Interested?Then we look forward to getting to know you!If you have any questions You are welcome to contact Gino by phone (089 \/ 277 80 59 04) or by email to cozzolino(at) Schwertfels(.)de.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schwertfels-consulting-gmbh\/steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-munich-220361","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702684143000,"original_language":"deu"},{"slug":"steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-gotha-458914","company_name":"Schwertfels Consulting GmbH","title":"Tax clerk (F\/M\/D) - digital environment, flexible working hours & home office","description":"Fruit baskets, company parties or tea and coffee specialties no longer compensate for the long hours and stress! What is really important to you? You dream of flexible working hours and the possibility of working from home? You want a modern and digital environment friendly colleagues?You want to have a development perspective and move further up the career ladder?Then the following position might be exactly the right one for you!Seize the opportunity and become part of a great team.Take advantage of interesting tasks and further development opportunities.TasksThe preparation of annual financial statements is no problem for you. It doesn't matter whether it's balance sheets or income surplus statements. You know how to process tax returns. Checking tax notices is a matter of honor for you, because the tax office is not infallible either. When preparing For ongoing financial accounting, you only ask: Which chart of accounts should I use? If there are any questions, you will be the direct contact person for communicating with the tax offices, clients and authorities. QualificationSuccessfully completed training as a tax clerk (m\/f\/d) or corresponding professional experience in the law firm environmentDATEV knowledge desirableGood MS Office knowledgeVery good knowledge of GermanEnjoyment and fun at workBenefitsMoney: Attractive remuneration with vacation, Christmas bonuses and annual salary roundsWork-life balance: Flexible working hours, individual working time models & home officeCareer: An extensive range of further trainingEquipment: A modern and fully digital working environmentTeam: A young and dynamic teamVacation: 30 days of vacation to relaxBenefits: company car, travel allowance\/Germany ticket, 50 credit card, fitness club subsidy There is certainly something for you in this benefit offer!Aroused interest?Then we look forward to getting to know you!At If you have any questions, please contact Gino by phone (089 \/ 277 80 59 04) or by email to cozzolino(at) Schwertfels(.)de.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schwertfels-consulting-gmbh\/steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-gotha-458914","tags":["Finance"],"job_types":[],"location":"Gotha","created_at":1702684143000,"original_language":"deu"},{"slug":"steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-erfurt-443268","company_name":"Schwertfels Consulting GmbH","title":"Tax clerk (F\/M\/D) - digital environment, flexible working hours & home office","description":"Fruit baskets, company parties or tea and coffee specialties no longer compensate for the long hours and stress! What is really important to you? You dream of flexible working hours and the possibility of working from home? You want a modern and digital environment friendly colleagues?You want to have a development perspective and move further up the career ladder?Then the following position might be exactly the right one for you!Seize the opportunity and become part of a great team.Take advantage of interesting tasks and further development opportunities.TasksThe preparation of annual financial statements is no problem for you. It doesn't matter whether it's balance sheets or income surplus statements. You know how to process tax returns. Checking tax notices is a matter of honor for you, because the tax office is not infallible either. When preparing For ongoing financial accounting, you only ask: Which chart of accounts should I use? If there are any questions, you will be the direct contact person for communicating with the tax offices, clients and authorities. QualificationSuccessfully completed training as a tax clerk (m\/f\/d) or corresponding professional experience in the law firm environmentDATEV knowledge desirableGood MS Office knowledgeVery good knowledge of GermanEnjoyment and fun at workBenefitsMoney: Attractive remuneration with vacation, Christmas bonuses and annual salary roundsWork-life balance: Flexible working hours, individual working time models & home officeCareer: An extensive range of further trainingEquipment: A modern and fully digital working environmentTeam: A young and dynamic teamVacation: 30 days of vacation to relaxBenefits: company car, travel allowance\/Germany ticket, 50 credit card, fitness club subsidy There is certainly something for you in this benefit offer!Aroused interest?Then we look forward to getting to know you!At If you have any questions, please contact Gino by phone (089 \/ 277 80 59 04) or send an email to cozzolino(at) Schwertfels(.)de.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schwertfels-consulting-gmbh\/steuerfachangestellte-digitales-umfeld-flexible-arbeitszeiten-home-office-erfurt-443268","tags":["Finance"],"job_types":[],"location":"Erfurt","created_at":1702684143000,"original_language":"deu"},{"slug":"bilanzbuchhalter-hauptbuchhalter-everyone-is-welcome-berlin-222690","company_name":"Sirius Facilities GmbH","title":"Accountant\/Chief Accountant (everyone is welcome) - Berlin","description":"Your tasksWe are looking for an experienced accountant (everyone is welcome) who would like to help shape the financial integrity and accounting of our company. In this position, you will make a significant contribution to ensuring the economic stability of our organization. Responsibility for accounting for several subsidiaries Close cooperation with controlling, focus on VAT organization Booking of all business transactions, independent monthly and HGB annual financial statements Clarification of fundamental questions with various contacts Support of controlling in budget preparation Analysis and optimization of work processes Central contact for auditors and business partners Implementation of quality standards in accounting and reporting Contribution to financial integrity and success of the corporate groupYour profileBusiness administration degree (focus on accounting) or accountant with experience in financial accounting and financial statementsProfound SAP-FI knowledge and skilled use of MS Office, especially ExcelVery good written and spoken German skills; Knowledge of English is an advantage Enjoying independent work and quick comprehension Goal-oriented, structured and reliable way of working with the ability to work in a team High flexibility, commitment and resilience What we offer you We offer you exciting development opportunities in a modern, future-oriented company. Here you can advance your career and continually develop. With us you will experience a lot of creative freedom, accompanied by a valued working atmosphere and an open corporate culture. We protect the personal contribution of every employee and promote a “you” culture at all levels. Think about your future today: We offer a company pension plan so that you can retire with peace of mind. We also take care of your health with company health insurance and support you in your active lifestyle with various health and sports offers. Benefit from exclusive employee discounts and use our internal training opportunities in the Sirius Academy to continuously expand your knowledge and skills. In addition We have room for fun and team spirit during work: Look forward to regular team and company events that not only promote cohesion, but also ensure unforgettable experiences. We look forward to welcoming you to our motivated team and to work together on a successful future.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sirius-facilities-gmbh\/bilanzbuchhalter-hauptbuchhalter-everyone-is-welcome-berlin-222690","tags":["Finance"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"talent-acquisition-manager-berlin-329343","company_name":"LUMAS Art Editions GmbH","title":"Talent Acquisition Manager (m\/w\/d)","description":"Become part of our mission to open the art world to everyone. Art changes the way we look at the world. With the aim of democratizing art, LUMAS has changed the art market. Supported by 250 artists and a community of over 300,000 art lovers and collectors, we are now the global market leader for art editions. In 19 galleries worldwide and online, we invite our audience to experience art in all its facets. Our well-curated program includes more than 3,000 works by around 250 established artists and promising newcomers, as well as historical and contemporary works from selected archives. We invite you to share your career goals with us so that we can shape your path with us together. We are looking for open-minded individuals who will enrich our team with new ideas and skills. Let's revolutionize the connection between art and retail in the booming interior, design and art market together and thus bring everyday life and art together.Your tasksYou are responsible for end-to-end recruiting at LUMAS from creating attractive job advertisements to conducting initial interviews and advising managers on personnel selection. You are a driving force in our team and are interested in optimizing our recruiting strategy and adapting it to changes in order to attract the best talent for our company. Together with the team, you will shape the on- and off-boarding process. Process further and support the new employees with commitment so that they feel comfortable with us right from the start. In addition to your role in recruiting, you will take on exciting projects, mainly in the area of ​​talent acquisition, on- and off-boarding and take part in higher-level people & culture projectsYour profileYou are successful Completed a university degree, ideally in the field of psychology or business administration with a focus on human resources or a similar field. With at least 3 years of professional experience in the area of ​​talent acquisition\/recruiting, you bring in-depth expertise. Active sourcing is no stranger to you, but an exciting field in which you enjoy are activeYou have extensive knowledge of various personnel selection methods and can successfully apply them in practiceYou are willing to deal with all topics related to people & culture and to step in if necessary.With your affinity for digital tools and good knowledge of MS Office are you well preparedYour German and English skills are business fluent and you communicate effortlessly in both languagesWhy LUMAS?International working environment and high-growth conceptMany career and development opportunities with individual supportA stable, sustainable business model - no venture capital or private equityShort decision-making processes and great scope for creativityVery committed, art enthusiasts & open founders as well as over 45 colleagues in our modern headquarters on Ernst-Reuter-Platz with a view of the entire cityAttractive employee discountsHybrid way of working for the best balance of teamwork and flexibilityJoint team activities and eventsWhether it's a MacBook or a Windows laptop, you decide what you would prefer to work withVery good transport connections with the subway and S-Bahn to the office. Feel free to visit our to get more impressions of LUMAS as an employer. We would like to invite you to apply and look forward to speaking with you. We are an employer that promotes equal opportunities. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or national origin and will not be discriminated against on the basis of disability.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/lumas-art-editions-gmbh\/talent-acquisition-manager-berlin-329343","tags":["HR"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"artist-manager-influencer-manager-berlin-217685","company_name":"Lionflence","title":"Artist Manager \/ Influencer Manager (m\/w\/d) BERLIN","description":"What we offer you: A responsible position in a committed team Working independently Freedom to actively shape things thanks to flat hierarchies and flexible structures A diverse, demanding and exciting area of ​​responsibility with renowned customers This is what work-life balance looks like: 30 days of vacation Constructive feedback is welcome Our company culture has open doors & ears, cool colleagues and fun at workA highly motivated, efficient team that works together - but also likes to celebrate shared successes. Helping to shape things instead of just swimming along - active participation in technical and cultural topics that go beyond the box. An exciting challenge, in who you can develop further in the area of ​​media\/social media, influencer marketing and the associated technologies (software systems) company cell phone company laptop tasks What tasks would you have? You are the first point of contact for our internal talents You support the search for new cooperation partners, create new offers and process them incoming inquiriesYou demonstrate your negotiating skills in contracts and price negotiations with providers and service providers (cooperation partners)You develop concepts and content formats together with the talents and support them in the implementationYou act as an interface between the talents and our partners, plan their deployment and take care of them for their well-beingYou identify and acquire possible new talents for existing and future formats and programsTogether we help you to work in a future-oriented manner and create new opportunities beyond being an artistQualificationsWhat you bring with you: at least. 1-3 years of experience in the area of ​​influencer marketing, online marketing, e.g. in a digital, social media or PR agency. Interest and knowledge of the latest digital and consumer trends. Confident handling of all common social media networks and online communities. Ideally, experience in implementation and\/or the conception of social media and influencer marketing campaignsHigh creativity and motivationFluent knowledge of German and written and spoken EnglishAbout us:Lionflence is a young company that specializes in online marketing and management. The headquarters are currently in Duisburg, but we are now also represented in Berlin Charlottenburg. We also support companies in brand building and develop our own software systems. A successful start-up company with flat hierarchies awaits you. As a circle of marketing, we offer customers a comprehensive 360 ​​service package and therefore also services that go beyond the usual services of a marketing agency. Our ideal candidate is a team player with strong Skills in the area of ​​interpersonal communication and have practical experience. Do you have a strong interest in looking after artists and would you like to take on exciting tasks in the area of ​​artist management immediately? Are you passionate about organizing and are an open-minded person? Then you could be a perfect fit for us!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/lionflence\/artist-manager-influencer-manager-berlin-217685","tags":["Marketing and Communication"],"job_types":[],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"teamleitung-tankstelle-bad-waldsee-vollzeit-oder-teilzeit-mind-80-271731","company_name":"BAG Allgäu-Oberschwaben eG","title":"Team leader at the gas station (m\/f\/d) - Bad Waldsee - full-time or part-time (at least 80%)","description":"BAG is a cooperative that has 16 locations in the Allgu-Upper Swabia area. With more than 300 employees in the agricultural, construction, energy, market and technology sectors, it provides an extensive portfolio of goods and services for farmers, companies and private individuals. We offer space for growth in a value-oriented company that works with a lot of passion. For more than a century, we have been facing the challenges that nature, agriculture and society bring with them. Tasks What tasks do you expect? Personnel responsibility for the gas station team and creation of work plans Monitoring of stocks and best-before dates First point of contact for our gas station customers Compliance with legal regulations, e.g.: HACCP Responsibility For the smooth running of all technical components, e.g. tank school or washing hall cashier, you will bring you with? Situation-based employee guiding departments. What do we have too offer?30 days of vacationEmployee discountVacation and Christmas bonusAn attractive remunerationOpportunity to become a member of the cooperativeActive participation in shaping the cooperative cultureCompany pension scheme and BusinessBikeDrink supply with free waterIndividual development opportunitiesTeam-building measuresInternal company celebrations, such as barbecues, company evenings, Christmas partiesHealthy and collegial working atmosphereFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/bag-allgau-oberschwaben-eg\/teamleitung-tankstelle-bad-waldsee-vollzeit-oder-teilzeit-mind-80-271731","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Bad Waldsee","created_at":1702684143000,"original_language":"deu"},{"slug":"kundenbetreuer-versicherungen-und-finanzanlagen-miwid-auch-als-quereinsteigerin-speyer-25520","company_name":"LeySelect GmbH","title":"Customer advisor for insurance and financial investments (mIwId) - also as a career changer","description":"Only a good strategy away! Our client doesn't work with products, but with people and their capital. You advise our client's customers on all questions relating to finances. You create orders and offers and take care of data and inventory maintenance. No matter which course you take with our client, you will always make progress with fun. Our customer is a close-knit community that celebrates success together. And with commitment, passion and pioneering spirit, we continue to pursue innovative paths. In order to drive further successful growth, we are looking for you as a customer advisor for insurance and financial investments (mIwId). location: Speyer global financial markets, with stocks and bonds, insurance and funds.QualificationsYou have completed training in the insurance or financial environment, or comparable.Initial professional experience in dealing with customers in the financial environment is very helpful and necessary.Team spirit and good cooperation are a given are your top priority.You have a strong customer orientation and excellent service behavior.BenefitsA special form of appreciation is traveling to training events at home and abroad, often together with the family. The exchange of experiences with successful colleagues is also encouraged. Our client also offers you: Modern workplace Structured training Home office options Job bike or travel allowance 30 vacation days What we offer: We offer a large and diverse network of top companies and a direct line to our clients. We know our clients, know exactly what they want and how we can ideally place candidates. In an initial telephone conversation, we discuss the details of the position and compare the skills and, above all, the wishes of a future employer. We discuss the CV, look for potential for improvement in the external image and take care of all communication with the client. And of course it’s free at the highest level! Values ​​such as appreciation, respect and honesty are very important here.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/leyselect-gmbh\/kundenbetreuer-versicherungen-und-finanzanlagen-miwid-auch-als-quereinsteigerin-speyer-25520","tags":["Private Banking"],"job_types":["berufserfahren"],"location":"Speyer","created_at":1702684143000,"original_language":"deu"},{"slug":"senior-3d-engineer-at-dive-solutions-berlin-333644","company_name":"DONE!Berlin","title":"Senior 3D Engineer (m\/f\/d) @ Dive solutions","description":"We are DONE!Berlin, an international consulting company that specializes in helping fast-growing companies of all sizes to develop to navigate the constantly changing world of work. Among other things, we help our customers attract the best talent for their company.Our client Dive solutions offers a B2B SaaS for world-known engineering enterprises in DACH and beyond, Dives mission is to empower engineers to create epic stuff. Their computer-aided engineering software combines smart simulation with scalable cloud computing to help engineers develop better products faster. It's cloud-native and browser-based, enabling designers and engineers to focus on engineering without limitations. Dives software is a pioneer in the world of engineering simulation. The young and ambitious team always stay in the forefront of Research & Development.TasksOur customers' core value creation lies in the analysis & interpretation of the three-dimensional and transient results of our material simulation engine You are responsible for creating a fascinating user experience in the 3D space: Improve the performance for visualizing millions of data points, craft new visualization methods for a better understanding of the fluid flow & the kinematics and optimize the 3D space for a high fidelity representation. You will play a pivotal role in enhancing our platform's 3D architecture, client-server data transfer mechanisms, and the development of cutting-edge 3D algorithms Your tasks include overseeing initiatives to significantly improve rendering performance and developing a comprehensive scene graph structure for simulationsYou will optimize the visualization and rendering in the 3D space to boost the user experience by developing custom shaders together with designersRequirementsYou have successfully completed a bachelors degree in computer science, mathematics, applied science, or similar Ideally 2+ years of experience in working with three.js and WebGL, along with proficiency in TypeScript, React and 3D visualization tools You have a strong understanding of mathematics, particularly in the area of linear algebra Proven capacity to excel in self-directed work settings Ideally you have experience in game development or CAD-software development You are familiar with agile software development and DevOps culture You demonstrate a commitment to fostering a diverse workplace that is inclusive, gender-sensitive, and free from discriminationWe encourage all people identifying as FLINTA (females, lesbians, intersex, non-binary, trans or agender) of all ages and culturally diverse backgrounds to apply for this role.BenefitsAs a deep tech company, Dive build state-of-the-art simulation software embedded in a modern cloud-native SaaS product that is used by customers from the mid-market and enterprise sectors all over the worldDive is backed by VC investors who believe in a significant market opportunity just like they doDive's office near Alexanderplatz in Berlin couldn't be more centrally located. Big plus: The breathtaking view over Berlin from the 19th floorDive value transparency and openly communicate Dive's career models and compensation structures to align personal and business incentivesDive always strive to offer an attractive compensation & benefits package consisting of salary, virtual shares and other benefits like events, free drinks and USC or Rydes membershipsWe believe that a social connection increases fun and productivity at work. At the same time we understand the importance of flexibility in everyday life. Dive support their employees by offering flexible working hours and home office & remote working daysWe are living in an era for engineers. Today's urgent need for technological advancement is unprecedented in human history. Some are motivated by a green planet, and some want to revolutionize human mobility. Either way, Dive help engineers develop great products faster by removing all unnecessary distractions and limitations within the simulation process. Dive believe that engineers should be able to focus on delivering great products - on just engineeringFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/doneberlin\/senior-3d-engineer-at-dive-solutions-berlin-333644","tags":["Engineering"],"job_types":["professional \/ experienced"],"location":"Berlin","created_at":1702684143000,"original_language":"eng "},{"slug":"customer-service-manager-bielefeld-7091","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Customer Service Manager (m\/w\/d) - Bielefeld","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations from the areas of plant engineering, mechanical engineering and automotive. We are looking for a Customer Service Manager (m\/f\/d) in Bielefeld for one of our customers in the metal construction sector. Tasks Development of a customer-oriented customer service strategy Design of service procedures and -guidelines to simplify the customer order processEfficiently lead the team to solve customer problemsImplementation of best practice processes to increase time and cost efficiencyResponsibility for customer problems, including tracking to resolutionBudget management and people management to maximize salesOverseeing daily team activities, prioritization and employee developmentQualificationsCustomer service management experienceExcellent communication skills in German and English organization skills and effective pensities for departmental cooperation. Time management and priority's own initiative, self-awareness and Bern take of responsibility 365 knowledge experience with SAP (Salesforce Worthworthiness) benefit space for personal and professional development in a dynamic environmental recognition and value for commitment and innovation. a company car. Don't meet every requirement? No problem, feel free to apply anyway. We look forward to receiving your application! Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHT: +49 221 8888 7897M +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/customer-service-manager-bielefeld-7091","tags":["Engineering"],"job_types":[],"location":"Bielefeld","created_at":1702684143000,"original_language":"deu"},{"slug":"senior-backend-engineer-at-dive-solutions-berlin-271933","company_name":"DONE!Berlin","title":"Senior Backend Engineer (m\/f\/d) @ dive solutions","description":"We are DONE!Berlin, an international consulting company that specializes in helping fast-growing companies of all sizes to develop to navigate the constantly changing world of work. Among other things, we help our customers attract the best talent for their company.  Our client Dive solutions offers a B2B SaaS for world-known engineering enterprises in DACH and beyond, Dives mission is to empower engineers to create epic stuff. Their computer-aided engineering software combines smart simulation with scalable cloud computing to help engineers develop better products faster. It's cloud-native and browser-based, enabling designers and engineers to focus on engineering without limitations. Dives software is a pioneer in the world of engineering simulation. The young and ambitious team always stay in the forefront of Research & Development.TasksAs a Senior Backend Engineer (m\/f\/d), you will plan, implement, test and roll out new services and data pipelines so that customers all over the world have access to a high performance product. You will continuously work on the vision of a cloud-native simulation software. You will be responsible for developing and extending Python web services, with a strong emphasis on crafting efficient and robust business logic You will design and develop an asynchronous API Gateway that connects various components of Dive's software ecosystem, facilitating data exchange and communication between services You will build data pipelines using Temporal workflows, to orchestrate and manage complex processes and interactions within our application Manage and design database and storage solutions to ensure terabytes of data are stored, retrieved, and maintained effectively You will aid in the design of service architectures, ensuring that they are scalable, reliable, and performantRequirementsYou have successfully completed a bachelors degree in computer science, applied science, or similar Ideally, you have 4+ years of backend development experience in Python including asyncio and a solid understanding of Golang You are proficient in designing code architectures of complex web services to ensure reliability, extendibility and collaboration on the code base You have experience with SQL and NoSQL database technologies such as PostgreSQL or MongoDB You have experience in client-server and inter-server communication patterns like REST APIs, WebSocket and RPC You have a profound knowledge in the field of data engineering and already have experience with tools like Celery, RabbitMQ or TemporalYou have a basic understanding of infrastructure technologies like Kubernetes and public clouds like Azure or AWS You are familiar with agile software development and a DevOps culture You demonstrate a commitment to fostering a diverse workplace that is inclusive, gender-sensitive, and free from discrimination We encourage all people identifying as FLINTA (females, lesbians, intersex, non-binary, trans or agender) of all ages and culturally diverse backgrounds to apply for this role.BenefitsAs a deep tech company, Dive build state-of-the-art simulation software embedded in a modern cloud-native SaaS product that is used by customers from the mid-market and enterprise sectors all over the world Dive is backed by VC investors who believe in a significant market opportunity just like they do Dive's office near Alexanderplatz in Berlin couldn't be more centrally located. Big plus: The breathtaking view over Berlin from the 19th floor Dive value transparency and openly communicate Dive's career models and compensation structures to align personal and business incentives Dive always strive to offer an attractive compensation & benefits package consisting of salary, virtual shares and other benefits like events, free drinks and USC or Rydes memberships We believe that a social connection increases fun and productivity at work. At the same time we understand the importance of flexibility in everyday life. Dive support their employees by offering flexible working hours and home office & remote working daysWe are living in an era for engineers. Today's urgent need for technological advancement is unprecedented in human history. Some are motivated by a green planet, and some want to revolutionize human mobility. Either way, Dive help engineers develop great products faster by removing all unnecessary distractions and limitations within the simulation process. Dive believe that engineers should be able to focus on delivering great products - on just engineering.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/doneberlin\/senior-backend-engineer-at-dive-solutions-berlin-271933","tags":["Engineering"],"job_types":["professional \/ experienced"],"location":"Berlin","created_at":1702684143000,"original_language":"eng "},{"slug":"ausbildung-zum-fachinformatiker-anwendungsentwicklung-munich-370665","company_name":"CHECK24","title":"Ausbildung zum Fachinformatiker (m\/w\/d) Anwendungsentwicklung","description":"CHECK24 - Dein Partner fr eine erfolgreiche Karriere in der IT!  Bei CHECK24 gestalten wir die digitale Zukunft und suchen engagierte Talente, die mit uns gemeinsam den Kfz-Vergleich verbessern mchten. Wir bieten dir eine herausfordernde Ausbildung mit vielfltigen Entwicklungsmglichkeiten und einem motivierten Team. Nutze deine Chance und werde Teil unseres Erfolgs.  Wenn du die Welt der IT mitgestalten und in einem innovativen Unternehmen durchstarten mchtest, dann bewirb dich jetzt als Auszubildender IT-Fachinformatiker (m\/w\/d) Anwendungsentwicklung fr September 2024 bei CHECK24! Wir freuen uns auf deine Bewerbung!AufgabenNach kurzer Zeit bist Du selbstndig fr die Weiterentwicklung bestehender Web-Anwendungen verantwortlichKonzeption und Umsetzung neuer Web-AnwendungenZustzlich untersttzt Du das Team bei tglichen Herausforderungen und suchst kreative LsungsanstzeWeiterentwicklung unseres Vergleiches und unseres Backoffice-Toolsin enger Zusammenarbeit mit weiteren Abteilungen (z.B. Produktmanagement)QualifikationDu hast eine erfolgreich abgeschlossene Mittlere Reife oder ein (Fach-) AbiturAuerdem berzeugst Du durch Deine Auffassungsgabe und hast Freude am Lsen von ProblemenVerhandlungssichere Deutschkenntnisse in Wort und Schrift (mind. C1 Level)Ein hohes Ma an Lernbereitschaft, Zielstrebigkeit und Zuverlssigkeit runden idealerweise Dein Profil abBenefitsVielseitige Ausbildung: Verknpfe die Theorie mit Praxis und lerne bei uns diverse Abteilungen und Versicherungsprodukte kennenAttraktives Gehalt: Bei uns bekommst Du folgende berdurschnittliche Vergtung1. Ausbildungsjahr: Monatlich 1.300  + 1.300  Bonus2. Ausbildungsjahr: Monatlich 1.400  + 1.400  Bonus3. Ausbildungsjahr: Monatlich 1.500  + 1.500  BonusOptimale Vorbereitung auf Dein Berufsleben: Unsere engagierten Ausbilder betreuen Dich intensiv und bereiten Dich durch praxisnahes Arbeiten optimal auf Deine Prfungen vorSehr gute bernahmechancen: Wir wachsen kontinuierlich und bieten Dir bei guter Leistung einen zukunftssicheren Job nach der AusbildungEigenverantwortliches Arbeiten: Bei uns wirst Du schnell eigenstndig ttig und bernimmst Verantwortung fr spannende AufgabenPersnliche Weiterentwicklung: Wir untersttzen Dein persnliches Wachstum durch regelmiges Feedback und Weiterbildungsangebote aus unserem breiten TrainingskatalogFood & Drinks: Kostenfreie Getrnke (z.B. Cola\/Cola Zero, Apfelschorle, Bionade oder Spezi), Msli, zweimal wchentlich Mittagessen und frisches Obst sind bei uns selbstverstndlich!Wohlfhlatmosphre: Fr die Pause zwischendurch lockt unsere Game-Area, bei schnem Wetter kannst Du auf unseren Dachterrassen ber den Dchern von Mnchen entspannenCHECKito Spirit: Lockeres Arbeitsumfeld mit Duz-Kultur und ohne Dresscode. Erfolge feiern wir gemeinsam auf Firmen- & TeameventsModerne Arbeitsumgebung: Ergonomischer Arbeitsplatz mit modernem Equipment (wie z.B. MacBook Air und zustzlichen Bildschirmen) sowie einem hhenverstellbaren Tisch ab dem ersten TagZentrale Lage & Job-Ticket: Brostandort mit ausgezeichneter (ffentlicher) Verkehrsanbindung und einem sehr gut bezuschusstes Deutschland-Job-Ticket oder 365-Euro-TicketFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/check24\/ausbildung-zum-fachinformatiker-anwendungsentwicklung-munich-370665","tags":["IT"],"job_types":["Apprenticeship"],"location":"Munich","created_at":1702684143000,"original_language":"eng"},{"slug":"firmware-developer-aerospace-lindenberg-463918","company_name":"K-tronik GmbH","title":"Firmware Developer (m\/f\/x) Aerospace","description":"Project description:To support our team at our customer in the aerospace sector, we are looking for an experienced firmware developer (m\/f\/x) for a permanent position at K-tronik. Does this sound interesting? Then we look forward to receiving your application!Tasks:Development of low-level software for the aerospace industryCollaboration in new and further development of productsDefinition of software design and requirements according to applicable norms and standardsSupport of project work in interdisciplinary development teamsCarrying out software reviews for requirements analyses and software designsDefinition, programming, commissioning and testing of board support packagesSkills:Successfully completed studies in the field of computer science, electrical engineering, electronics or comparable qualificationSeveral years of professional experience in low-level programming (firmware, drivers, boot code, etc.)Very good programming skills in embedded CExperience with tools and methods of model-based software developmentGood knowledge in microcontroller programmingExperience in software development according to safety standards like DO-178, MIL-STD, ISO26262 or similarFluent knowledge of EnglishAnalytical and structured way of working as well as good team skills  another plusGood knowledge of DO-178 and\/or DO-331Knowledge of RTOSGerman language skillsBenefits:Company pension plan & capital-forming benefits30 days vacation and flexible holiday planningRegular team eventsAward as Kununu TOP CompanyCorporate BenefitsFree beveragesIndividual further education360 Support: feedback meetings, career planning, relocation support, etc.Flexible working hoursFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/k-tronik-gmbh\/firmware-developer-aerospace-lindenberg-463918","tags":["Engineering"],"job_types":["professional \/ experienced"],"location":"Lindenberg","created_at":1702684143000,"original_language":"eng"},{"slug":"web-development-werkstudent-cologne-71500","company_name":"auguma.digital","title":"Web Development Werkstudent (m\/w\/d)","description":"Die Start-up-Schmiede auguma digital lebt Excellence in E-Commerce. Unser Ziel ist es in verschiedenen Mrkten die digitalen Marktfhrer von morgen aufzubauen, nachhaltig Geschftsmodelle zu etablieren und mit unseren Produkten die Lebensqualitt mglichst vieler Menschen in Europa zu verbessern. Wir suchen fr den Eintritt in neue Mrkte, aber auch fr das bestehende Kerngeschft, Werkstudenten (m\/w\/d), die unser Shop Development beim Aufbau, der Optimierung und Pflege unserer Onlineshops untersttzen. Der Fokus liegt hierbei auf der technischen Weiterentwicklung unserer Shops.AufgabenAls Web Developer kmmerst du dich um die funktionale Weiterentwicklung unserer Onlineshops. Du arbeitest dabei im Digital Infrastructure & BI Team, aber auch teambergreifend, z.B. direkt mit unseren Produktmanagern zusammen. Wir beschreiten hier neue Wege und lernen als Team kontinuierlich dazu. Deine Aufgaben umfassen die folgenden Themenschwerpunkte:Shop Development im Bereich Wordpress\/ WooCommerceFrontend\/Backend Development mit PHP und Java ScriptProgrammierung von neuen Wordpress Plugins, um die Shop-Funktionalitten zu erweiternErstellung von Automation (Code und Low-Code)Erweiterung unserer AI ImplementationenQualifikationDein ProfilDu studierst (Medien-\/ Wirtschafts-) InformatikDu hast berdurchschnittliche NotenDu verfgst ber einen hohen Qualittsanspruch an Deine ArbeitDu hast eine schnelle Auffassungsgabe und arbeitest strukturiertVorteilhaft: Du hast erste praktische Erfahrungen \/ BerhrungspunkteBenefitsDu bekommst von Anfang VerantwortungDu hast eine steile LernkurveDu hast die Chance, Dich  parallel zu den Aufgaben des Shop Developments - in Deiner Wunschexpertise weiterzuentwickelnDu kannst aus dem Homeoffice zu flexiblen Arbeitszeiten arbeiten, aber auch bei uns in unserem Loftbro am NeumarktDu hast die Chance auf einen Direkteinstieg nach dem Studium. Je nach Qualifikation und Aufgabengebiet: 16-20 \/Std.Du kannst zwischen 15h und 20h pro arbeitenDu passt zum Profil und knntest Dir vorstellen, in einem sehr erfolgreichen Startup Verantwortung zu bernehmen? Dann sollten wir uns kennenlernen!Tabellarischer LebenslaufAbi- und Bachelor-Zeugnis (fr Studierende in einem Masterstudiengang) \/ aktueller NotenspiegelStudiengang und aktuelles SemesterFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/augumadigital\/web-development-werkstudent-cologne-71500","tags":["Web Development"],"job_types":["Working student"],"location":"Cologne","created_at":1702684143000,"original_language":"eng "},{"slug":"kfz-serviceberater-ostheim-304068","company_name":"Autohaus Streit GmbH","title":"Automotive service advisor (m\/f\/d)","description":"About us: Cars are your passion and do you love your job in the automotive industry? Now you want to get into the fast lane and towards the future? Then set course for our SEAT | CUPRA car dealership dispute in Ostheim vor der Rhn. We have been a leading mobility partner in the border triangle of Bavaria, Hesse and Thringen for over 30 years. Be there and help shape the success of our well-known and popular car dealership as a valuable team member! To strengthen our team, we are looking for a dedicated automotive service advisor (m\/f\/d) as soon as possible who shares our passion for vehicles and will support our team with immediate effect . In this key position, you form the interface between the customer, the service and our car dealership. Tasks Order acceptance and transparent communication of repair and service services Advice and sale of services Creation of service orders with service, price and deadline commitments Preparation of cost estimates Preparation of offers and sale of spare parts and accessories Acceptance and Return of vehiclesCoordination of appointments and ensuring timely order processingWarranty and goodwill processingEnsuring customer satisfaction and professional complaint managementQualificationYou have completed technical or commercial training in the automotive industryIdeally, you have already worked as a service advisor (m\/f\/d).Communicative and trustworthy demeanor with a high level of customer orientationA Independent way of working with a high level of quality awareness and initiativeA high level of motivation, willingness to learn and organizational skillsThe class B driving license is a given for you.BenefitsAttractive remuneration and success-related bonus regulationsVacation and Christmas bonusCompany pension scheme and childcare subsidyRemuneration in kind worth 50 per month, e.g. B. Fuel voucherExclusive employee conditionsJob wheelExtensive employer-financed further education and training offersFamily working environment with flat hierarchies.Structured and comprehensive trainingPermanent employment contract in a demanding area of ​​activityReady to get started with us? Then get in and apply now! Directly online or via Mail.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/autohaus-streit-gmbh\/kfz-serviceberater-ostheim-304068","tags":["Customer Service"],"job_types":["berufserfahren"],"location":"Ostheim","created_at":1702684143000,"original_language":"deu"},{"slug":"it-admin-in-voll-oder-teilzeit-auch-werkstudent-berlin-3275","company_name":"Fuchs & Eule","title":"IT Admin (m\/f\/d) full-time or part-time (also working student)","description":"Now is the time to act and fight the climate crisis. We want to help as many homeowners as possible make their homes energy efficient and receive the optimal funding. Residential homes are responsible for a decisive proportion of global CO2 emissions and the pressure from high energy costs is greater than ever, but the path to a climate-neutral home with optimal support is complicated. We combine expertise in the energy and building sector with practical project support and digital innovation, thereby helping people and the environment in equal measure. Tasks A technically optimal ecosystem You ensure that Fuchs & Eule is technically optimally positioned by procuring hardware and software as needed and building them up and set up, maintain, maintain and manage. The savior of your colleagues You are a helpful contact for your colleagues when things go wrong with the technology, you help them solve acute problems and support them on the way to being able to help themselves better and better. The right partners and Systems You have an overview of the topics of network administration, cloud telephony and video conferencing, are experienced in a mixed Windows\/macOS environment, find the right service provider for each of our use cases and ensure that our systems and networks are and remain secure. A real purpose Together with us, you will build Fuchs & Eule into THE champion in digital energy consulting and help achieve the climate goalsQualificationFriendly technology nerd You love technology and are enthusiastic about using it as efficiently as possible in a company. At the same time, you love dealing with people and enabling them to use technology skillfully. Knowledge and experience You are experienced in dealing with Windows systems and common collaboration solutions such as Google GSuite or Microsoft Office365. Ideally, you have experience in operating device management solutions.Communication is King You enjoy speaking to and in front of colleagues in fluent German and English and you find it easy to impart knowledge to them.Entrepreneurial thinking & detail orientation You are experienced in systems, To procure and use hardware and licenses as needed and as cost-effectively as possible and to ensure that the systems optimally support the work of the company.BenefitsWe take our responsibility for a green future seriously and want to make a significant contribution to CO2 reduction with our commitment to energy efficiency are ambitious and always want to get better. That's why we give you scope and responsibility where you want to develop and support where you need it. We are digital, innovative, customer-centric and highly motivated to achieve great things together with you. We are a real team and stand up for each other, say what we think, have something in common Fun and the heart in the right placeWe look forward to your meaningful application. Your contact person is Ina Hoffmann, Director People & CultureFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/fuchs-eule\/it-admin-in-voll-oder-teilzeit-auch-werkstudent-berlin-3275","tags":["System and Network Administration"],"job_types":["berufseinstieg"],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"junior-business-analyst-mit-den-schwerpunkten-prozessoptimierung-und-reporting-cologne-370825","company_name":"auguma.digital","title":"(Junior) Business Analyst  mit den Schwerpunkten Prozessoptimierung und Reporting (m\/w\/d)","description":"Die Start-up-Schmiede auguma digital lebt Excellence in E-Commerce. Unser Ziel ist es, in verschiedenen Mrkten die digitalen Marktfhrer von morgen aufzubauen, nachhaltig Geschftsmodelle zu etablieren und mit unseren Produkten die Lebensqualitt mglichst vieler Menschen in Europa zu verbessern.AufgabenAls (Junior) Business Analyst (m\/w\/d) arbeitest du daran, unser Reporting und unsere Analysen auf ein neues Level zu bringen. Auerdem hebst du Potenziale durch die Automatisierung unserer Prozesse. Du arbeitest dabei im Digital Infrastructure & BI Team, aber auch teambergreifend, z.B. direkt mit unseren Produktmanagern zusammen.Wir nutzen ausschlielich Tools und Systeme, die fhrend in ihrem Bereich sind. z.B. Make.com (fhrendes Low-Code\/No-Code Automatierungstool von Celonis) und OpenAI mit ChatGPT und API-Anbindung bei Eigenentwicklungen. Unser Fokus liegt dabei darauf, den tglichen Herausforderungen des E-Commerce mit mglichst hoher Effizienz zu begegnen.Deine Aufgaben umfassen die Schwerpunkte:Business Intelligence:Datenanalyse und Reporting: Mitwirkung am BI-Monatsabschluss und Erstellung von Berichten und Analysen fr unsere Business Units.Verantwortung fr DatenintegrittSystemoptimierung und -entwicklung: bernahme von Projekten zur Optimierung und Erweiterung der BI-Systeme und -Tools (SQL und Make.com).Process Automation:Prozessanalyse und -verbesserung: Identifikation von Optimierungspotenzialen (Process-Mining) und Hebung dieser Potenziale.Automatisierung von Geschftsprozessen: Entwicklung und Implementierung von Automatisierungslsungen mit Make.com zur Vereinfachung organisatorischer Prozesse und zur Untersttzung der Produktmanager.Modernisierung unserer BI-Systeme: z.B. Ersetzen bestehender Prozesse auf SQL-Basis durch Automatisierungen mit Make.com, inkl. dem Aufsetzen neuer Berechnungslogiken.QualifikationWir setzen ausschlielich auf erstklassige Mitarbeiter! Daher:Du hast mit berdurchschnittlichem Erfolg ein wirtschaftswissenschaftliches Studium, oder ein Studium mit Informatikanteil an einer sehr guten Universitt abgeschlossen.Optimal: Du hast erste Erfahrungen in Bereichen wie E-Commerce, Automation, Lean Process Management, Business Intelligence, oder hnlichem gesammelt.Du identifizierst Dich gerne mit Deiner Arbeit und gehst Deine Aufgaben berdurchschnittlich motiviert und engagiert an.Du trittst selbstsicher auf, bist zuverlssig, loyal und konstruktiv-kritisch.Du verfgst ber einen sehr hohen Qualittsanspruch an Deine Arbeit und kannst Dich selbststndig in Themen einarbeiten.BenefitsDu bekommst von Anfang Verantwortung in einem kleinen und dynamischen TeamDu hast eine steile Lernkurve und kannst Expertise in den von dir bevorzugten Themenbereichen aufbauenDu arbeitest ausschlielich mit Tools und Systemen, die fhrend in ihrem Bereich sind. z.B. Make.com (fhrendes Low-Code\/No-Code Automatierungstool von Celonis) und OpenAI mit ChatGPT und API-Anbindung bei Eigenentwicklungen.Unsere Arbeit ist abwechslungsreich. Wir entwickeln uns schnell, genau wie die Aufgabenbereiche, die wir bearbeiten. Langeweile gibt es bei uns nichtDu kannst aus dem Homeoffice zu flexiblen Arbeitszeiten arbeiten, aber auch bei uns in unserem Loftbro am NeumarktBewirb Dich!Du passt zum Profil und knntest Dir vorstellen, in einem sehr erfolgreichen Startup Verantwortung zu bernehmen? Dann sollten wir uns kennenlernen!Schicke eine kurze und formlose Bewerbung mit folgenden AngabenMotivationsschreibenGehaltsvorstellungenFrhestes EinstiegsdatumTabellarischer LebenslaufAbi- und Hochschulzeugnisse (oder aktuellen Notenspiegel, falls das Studium noch nicht abgeschlossen ist)Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/augumadigital\/junior-business-analyst-mit-den-schwerpunkten-prozessoptimierung-und-reporting-cologne-370825","tags":["Business Intelligence"],"job_types":["berufseinstieg"],"location":"Cologne","created_at":1702684143000,"original_language":"eng "},{"slug":"senior-electrochemical-systems-rd-engineer-iron-salt-battery-munich-176918","company_name":"VoltStorage GmbH","title":"Senior Electrochemical Systems R&D Engineer - Iron Salt Battery (m\/f\/d)","description":"Are you excited about making renewable energy available 24\/7? Are you enthusiastic about flow battery technology in revolutionizing energy storage systems? Do you have a passion for conducting rigorous hands-on testing and analysis? Then apply now to be our next Electrochemical Systems R&D Engineer (title and compensation based on relevant experience). You will play a vital role in advancing our Iron Salt Battery technology through electrochemical systems development, modeling, and scaling from bench top to pilot scale. To keep our big project moving forward, I am currently looking for a   (Senior) Electrochemical Systems R&D Engineer  Iron Salt Battery (m\/f\/d). You will play a vital role in advancing our Iron Salt Battery technology through electrochemical systems development, modeling, and scaling from bench top to pilot scale.TasksBecome an expert in the Iron Salt Battery electrochemical systems and submodulesDesign experiments and test protocols needed to characterize the Iron Salt Battery Electrochemical systems and obtain key modeling data and scaling factors, ensuring adherence to project requirements and safetyDevelop mathematical models of the battery systems based on mass and energy balances and electrochemistryResearch new module concepts, challenge assumptions, and generate intellectual propertyCollaborate closely with cross-functional teams (including mechanical engineering, software development, and electronics) to support system automation, engineering, and scalingConduct failure analysis and root cause investigations to identify performance limitations and contribute to the development of mitigation strategiesContinuously evaluate and enhance testing methodologies, ensuring accuracy, repeatability, and efficiencyRequirementsMasters degree or higher in Chemical Engineering, Mechanical Engineering, Chemistry, Physics or related fieldProficient in describing electrochemical systems using mass and energy balances and electrochemical relationshipsProven track record in battery development and innovation, preferably in an R&D or product development environmentStrong knowledge of battery testing methodologies, including electrochemical characterization, performance evaluation, and environmental testingExcellent analytical and problem-solving skills, with a keen attention to detailStrong communication and collaboration skills, with the ability to work effectively in multidisciplinary teamsAbility to prioritize tasks, manage multiple projects simultaneously, and meet deadlinesAdaptability to evolving project requirements and a dynamic research environmentCommitment to maintaining a safe working environment and adhering to laboratory protocolsBenefitsFixed training budget per employeeFlexible working hoursUnlimited access to over 4,500 sports facilities with WellpassSubsidised Deutschland-TicketFreely selectable further training with our partner Sparrks CoachingHome office possibleRegular team eventsAbove-average development opportunitiesRoom for own ideas and suggestionsShort decision-making processes due to flat hierarchiesmodern, sunlit environments, generous break zones and an exclusive rooftop terrace on-site (from end of 2023: Detmoldstr. 26, 80935 Mnchen)If you have any questions, do not hesitate to contact us +49 89 215294943. Kind regards,JohnFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/voltstorage-gmbh\/senior-electrochemical-systems-rd-engineer-iron-salt-battery-munich-176918","tags":["Engineering"],"job_types":["professional \/ experienced"],"location":"Munich","created_at":1702684143000,"original_language":"eng"},{"slug":"holzbauingenieurin-eberswalde-74250","company_name":"timpla by Renggli","title":"Wood construction engineer: in (d\/w\/m)","description":"We are looking for you as a timber construction engineer (d\/f\/m) in the planning of our multi-storey timber construction projects. We offer you the opportunity to help build a production company in the field of timber construction and, together with the future team, turn it into a leading manufacturer in to develop Europe. We will control everything from our Berlin office until fall 2023. When Germany's largest wooden module factory is completed, you will change the construction sector with us from Eberswalde and actively support climate protection. By the way, we mean Eberswalde, which you can reach in 45 minutes from Berlin Ostkreuz, and not the Mars crater of the same name. In the initial period, your focus will be on the know-how transfer of relevant planning methods and systems. In your role, you act at the interface between project acquisition\/development and the construction of our timber construction modules. Her heart beats for the realization of large construction projects and the material wood. Do you see yourself as an enabler and would like to express your passion for sustainable building? Then we should definitely get to know each other. You can look forward to that. A completely healthy thing: flexible working hours and the possibility of working on the move (even after Corona, even at home). Light-flooded offices, state-of-the-art office equipment and excellent accessibility at the S-Bahn station. Westend30 days of well-deserved vacation Our safe side: A permanent employment relationship in a future-proof industrySalary in line with the market and tariffsAttractive employee benefitsSupplements for additional insurance from sustainable, certified partners (from A for company pension scheme to Z for supplementary dental insurance)A sustainable subsidy for mobility of your choice (e.g. public transport or leasing bike)A great climate: The chance to think wood and hybrid construction through to the end and to make a real contribution to climate protectionA common course - through teamwork and personal responsibilityCommon learning processes - from each other, from mistakes, with a budget and never lived out diversity - takes place modified theoryRegular team events - natural and probably legendaryYou are important to us - we don't forget birthdays, personal events and company anniversariesFree drinks - shared meals are also important to usA professional, first-name culture from the intern to the CEO from the moment the contract is signedGuaranteed 100% supporter densityThis will help you achieve a lasting impact. You will lead engineering projects in multi-storey timber construction from the project study to commissioning and will be responsible for: Independent creation of structural plans, verifiable static calculations, fire protection, heat protection and sound insulation certificates as well as thermal bridge calculations. Implementation of requirements from building physics and fire protection. Coordination and coordination with all internal and external parties Project participants on questions of building physics and statics in timber construction Support for the timber designers or specialist planners in further detailed planning Close cooperation with the BIM manager responsible for the respective project This is what you are building on. A completed degree in timber construction engineering or comparable Very good and tried-and-tested specialist knowledge in building physics (fire protection , sound insulation, heat insulation), statics and current standards, initiative and motivation for exciting and challenging projects as well as a goal-oriented and self-responsible way of working. Commitment, team spirit and enjoyment of a constructive working atmosphere in which laughter is also possible. Fluent knowledge of German, ideally good knowledge of English, spoken and written. Good subject-specific application knowledge in dealing with common CAD, statics and building physics applications as well as MS Office 365. This is how we get to know each other better. After your online application, you will receive an automatic confirmation of receipt. We will then check whether the advertised position fits your profile well. We Get to know us better in a first short telephone or video interview. If everything works well for you and us, you will get to know the tasks and your team in the second round. Are you and we really interested in working together? Then we will make you a concrete offer and hope that you will accept it. Welcome on board! Let's go! Apply in less than 2 minutes! Be yourself! We're not looking for anyone else. Join us to turn the wrong path into a success story - we look forward to getting to know you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/timpla-by-renggli\/holzbauingenieurin-eberswalde-74250","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Eberswalde","created_at":1702684143000,"original_language":"deu"},{"slug":"it-support-all-genders-langenberg-352035","company_name":"Kaufland e-commerce","title":"IT Support (all genders)","description":"Employment detailsEmployment, full-time, hybridInfoWho we areWe operate Kaufland's international business: Several thousand retailers and millions of products make us one of the fastest growing online marketplaces. Our dynamic corporate culture with a start-up mentality and the opportunities of a large group of companies behind us are what sets us apart. With us, knowledge and many years of experience in e-commerce meet flat hierarchies and a highly motivated team.TasksYour tasks What awaits you in detailYou discuss and resolve the service requirements of your colleagues, employees and external employees - via telephone, email, Slack and ticket systemYou manage Users and computers with Azure AD and Azure AD Domain ServicesYou are responsible for setting up and commissioning IT workstations, hardware and software installations and managing user accountsYou provide administration and support using mobile device management for our numerous mobile devicesYou create and update IT documentation and instructionsYou optimize support processes and find innovative ways to make our support process future-proofProfileYour profile - This is what we expect from youYou have completed IT training or a comparable degreeYou are interested in computers, networks and how they are connectedYou have initial experience You are no stranger to working with Windows and MacOS and Linux. Service-oriented action is your top priority. You are motivated, have a desire to learn new things and are open to constant changes. You work in a structured and reliable manner, can advance topics with your strong analytical and conceptual skills and are convincing Problem solvingYou have excellent communication skills (including fluent German - C1 or higher and can also communicate in English)You are willing to work on site one day a week in our Cologne office in Westgate directly on RudolfplatzBenefitsThis is what we offer you Diversity and diversity: An international environment with talent from over 55 different nations creates innovative and exciting perspectivesPower meets dynamic: Flat hierarchies and start-up mentality meet the power of a large group of companies and offer you an agile and secure working environment at the same timeFree choice of hardware: Whether Mac or Lenovo , with us you have the choiceWe are team players: Our strong solidarity extends beyond our own team: We connect thanks to many internal offers such as all-hands meetings, regular team and company events and our comprehensive digital Mental Well-Being: We support you with various initiatives on your personal and professional well-being journey!The future is digital: Develop the e-commerce of the future with us and work on a product with millions of usersGermany ticket: We subsidize your subscription for more mobilityUrban Sports Club: you get it through us You get top conditions for fitness, team sports, yoga and more. Take a look at our & ours and get even more insights into our corporate culture! Diversity at Kaufland e-commerce We welcome applications from all people - regardless of skin color, sexual orientation, Gender identity, age, disability, ethnic origin, religion and belief. We are signatories of the Diversity Charter because we know that extraordinary things can only be achieved with diversity. For reasons of better readability, the male form is used for personal names and personal nouns on this website. In the interests of equal treatment, corresponding terms generally apply to all genders. The shortened form of language is only for editorial reasons and does not contain any evaluation. Applying for a cover letter is a thing of the past! We are not interested in how well you can formulate a cover letter - we are interested in the facts. Therefore, please only apply with a meaningful CV and save yourself valuable time. How would you like to be addressed? Feel free to optionally add the following pronouns to your CV (e.g. after your name): she\/her, him\/he or they\/them.Contact personYour contact person: Alina AsmusKaufland e-commerceKaufland e-commerce Services GmbH & Co. KGPostal address:Habsburgerring 250674 KlnWe look forward to receiving your application!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kaufland-e-commerce\/it-support-all-genders-langenberg-352035","tags":["Software Development"],"job_types":["berufseinstieg"],"location":"Langenberg","created_at":1702684143000,"original_language":"deu"},{"slug":"hr-generalist-teilzeit-berlin-436006","company_name":"BabyFORTE","title":"HR Generalist (m\/w\/d) Teilzeit","description":"Unser Daily Business ist es, kleine Wunder wahr werden zu lassen. Mit den Health Brands BabyFORTE, MascuPRO und PuriaFAM begleiten wir unsere treue Community tglich mit Premium-Nahrungsergnzung von Kinderwunsch bis Schwangerschaft und Stillzeit sowie allen Bereichen rund um die weibliche und mnnliche Gesundheit.  Von Frauen gefhrt: Berliner Grnderin und CEO Anna-Maria Silinger ist seit ber 10 Jahren Unternehmerin und gilt als gefragte Mentorin rund um E-Commerce und Unternehmertum. Whrend der letzten Jahre hat Anna-Maria ein Team von ber 15 Mitarbeitenden aufgebaut, die ihre Vision, kleine Wunder wahr werden zu lassen, tglich aufs Neue teilen. Willst auch Du kleine Wunder wahr werden lassen? Dann suchen wir Dich!  Deine Rolle:Als HR Generalist (m\/w\/d) bernimmst Du in 20 Std.\/ Woche eine essentielle Schlsselrolle und betreust unser 15-kpfiges Team als vertrauensvolle:r HR Expert:in im gesamten Employee Lifecycle. Du sorgst zudem fr ein reibungsloses und professionelles Recruiting und Onboarding neuer Mitarbeitenden. Hierbei nutzt Du kontinuierlich Mglichkeiten, unsere Prozesse weiter zu professionalisieren.AufgabenDu bist unser Recruiting-Experte  von der passenden Stellenanzeige, ber die Identifizierung und Ansprache von Top-Talenten bis hin zur Sicherstellung eines reibungslosen OnboardingsDu kmmerst Dich um die Pflege aller Mitarbeitenden Dokumente wie z.B. Abwesenheits- und Urlaubsantrge sowie StundenzettelDu bist Ansprechpartner:in fr Vertrge, arbeitsrechtliche Themen und untersttzt in der allgemeinen Mitarbeitenden Verwaltung (bspw. Account- und Rechteverwaltung, Datenschutz-Formulare, etc.)Als Sparringspartner fr die Geschftsleitung untersttzt Du bei der Entwicklung und Umsetzung von HR-Strategien in Anlehnung an die UnternehmenszieleMit Deinem digitalen Mindset bist Du die treibende Kraft hinter neuen Ideen und bei der Implementierung innovativer HR-Lsungen, die unsere Prozesse auf das nchste Level hebenQualifikationDu hast Dein Studium erfolgreich abgeschlossen und bringst erste relevante Praxiserfahrung im Bereich Human Resources (z.B. Personalbetreuung \/ Recruiting) mit Dein Wissen im Arbeitsrecht und in HR-Best Practices ist nicht nur State-of-the-Art, sondern Deine LeidenschaftDu hast eine absolute Hands-on-Mentalitt, gehst Herausforderungen proaktiv und strukturiert an und bringst durch Deinen lsungsorientierten Ansatz Dinge ins Rollen Du hast ein ausgezeichnetes Kommunikationstalent und Spa am Aufbau zwischenmenschlicher BeziehungenDu verfgst ber verhandlungssichere Deutsch- und gute EnglischkenntnisseBenefitsJob mit Sinn in erfolgreichen Health Brands: Mit unserer Nahrungsergnzung konnten wir schon ber 250.000 Menschen glcklich machenWir sind ein dynamisches, profitables und eigenfinanziertes Unternehmen mit viel Gestaltungs- und Entwicklungsraum sowie schnellen EntscheidungswegenFlexibles Arbeitszeitmodell, Homeoffice Option und Zuschuss fr Dein Berliner VPN JobTicketFrderung Deiner persnlichen und fachlichen Skills durch regelmige Trainings und 1:1 Gesprche mit Deinem MentorHire for attitude - train for skills! Bei uns steht Deine Persnlichkeit im Fokus - denn schlielich knnen wir alle immer noch etwas dazulernen Das klingt nach Deinem nchsten Schritt? Dann freuen wir uns auf Deine Bewerbung (Lebenslauf, Gehaltsvorstellung und Startdatum)!  Deine Ansprechpartnerin ist Charlotte Reinholz.  Wir freuen uns auf Dich!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/babyforte\/hr-generalist-teilzeit-berlin-436006","tags":["Recruitment and Selection"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"eng"},{"slug":"enterprise-architect-remote-ngo-berlin-285723","company_name":"INDIE Solutions GmbH","title":"Enterprise Architect (m\/w\/x) | Remote | NGO","description":"Are you looking for a meaningful job in a company that pursues high ethical and moral goals with a focus on sustainability and social responsibility? For our customer everything revolves around improving the living conditions of people with disabilities, children and young people. The business model primarily includes the promotion of social projects and educational work for inclusion. Here, as part of the architecture and management team, you can take responsibility for the IT projects and IT landscape. Tasks You are a leading part of the architecture board and are responsible for the use of new technologies in interaction with the existing systems and technologies Responsible for IT planning in collaboration with software\/solutions architects as well as strategic developmentYou focus on standardization, innovations and a harmonious interaction of existing IT systems and new features (Sitecore 9 Shop, replacement of a WebDB, fulfillment framework)You ensures a high-performance, cross-system solution designYou are responsible for regular reporting to the stakeholdersYou monitor the market with regard to new technologiesYou are responsible for controlling technical debtYou are responsible for the development and implementation of guidelines, specifications and standards for the IT architecture and the IT assets -ManagementYou are responsible for the detailed documentation and knowledge management of the IT architectureQualificationYou have practical experience in the design of larger IT and corporate architectures as well as in the replacement of old systems and integration of new technologies into existing systems with a good solution designYou are strong in communication on various levels: both in Management and specialist departments as well as service providers. You have knowledge of make-or-buy processes when introducing standard software. You have strategic foresight, comprehensive methodological knowledge (e.g. TOGAF, UML, BPMN) as well as experience in conception and project managementKnowledge of technologies & systems: Azure Cloud, Oracle Cloud, ITIL, Kubernetes, Terraform, Ansible, Linux, Windows, JIRA, Azure DevOps, Jenkins, GITBenefitsA non-profit organization awaits you for the inclusion of people with disabilities, children and young people. A positive, open, friendly working atmosphere as well as a culture of trustA modern workplace with the latest hardwareFree scheduling of working hoursOvertime is compensated for in free time29 vacation days plus days off on Shrove Monday, Christmas Eve and New Year's Eve 38.5 hours per weekFreedom to decide whether you want to work 100% remotely or in the office Profit sharing, Performance bonus, retirement provision, capital-forming benefits, Deutschlandticket team events, interdisciplinary further training and democratic decision-making processes. Let's relax and talk about further details! I look forward to our contact!randy.adam(at)indie-solutions.deFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/indie-solutions-gmbh\/enterprise-architect-remote-ngo-berlin-285723","tags":["Remote","Management","Team Leader"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"projektleiter-im-maschinenbau-crailsheim-15649","company_name":"Biomatch GmbH","title":"Project manager in mechanical engineering (m\/f\/d)","description":"Our customer, an innovative company consisting of experts with many years of experience in the design, commissioning and support of production systems in the pharmaceutical industry, is looking for a qualified pharmaceutical engineer (m\/f\/d). Our client's customers are among the leading global companies in the pharmaceutical industry. The team gives its employees deep insights into the world of GMP and offers valuable experience. Tasks Holistic processing of service projects, from receipt of orders to acceptance by the customer Project management of conversions, maintenance and repairs of existing systems Technical clarification, scheduling and order tracking Creation of detailed project plans Monitoring of relevant milestones for Precise deadline tracking Holistic contact person for projects Regular reporting of the interim status Close, proactive communication with internal specialist departments Preparation and follow-up of cross-site construction sites at the customer's premises Instruction of technicians Clarification of responsibilities Qualification Completed technical studies or further training as a technician with additional business qualifications Ideally, professional or project experience in mechanical or plant engineering Practical experience and good knowledge of project management tools and MS OfficeCommunicative, independent, structured and team-oriented working styleStrong customer and cost orientationVery good language and writing skills in German and English, French is an advantageHigh willingness to travelBenefitsTeam cohesion: Collegial environment with flat hierarchiesCompany events: Joint celebrations and activities to strengthen team spiritCareer development: Individual career planning and personal developmentAdditional services: Rewards for shared successFlexible working time and work location design: Various part-time models, flexible working hours and the possibility of remote working to promote work-life balanceFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/biomatch-gmbh\/projektleiter-im-maschinenbau-crailsheim-15649","tags":["Project Management"],"job_types":[],"location":"Crailsheim","created_at":1702684143000,"original_language":"deu"},{"slug":"werkstudent-im-bereich-design-und-social-media-keltern-43058","company_name":"Dr. Bernhard Burger AG","title":"Working student (m\/f\/d) in the field of design and social media","description":"Design hero wanted for the precious metals & wedding ring industryFrom January 2024 we are looking for a student worker (m\/f\/d) in the area of ​​marketing communication & design.TasksWhat areas of responsibility await you? You produce meaningful, inspiring and target group-specific content in order to sustainably strengthen the Burger Edelmetalle brand. You design cross-media projects such as advertisements, brochures, flyers, etc. You support our marketing management in day-to-day business. You are part of the content and strategic orientation of our social media activities. Qualifications What sets you apart? ? You are at least in the 2nd semester of your studies with a focus on design. You have a desire for change and are creative. You work in a structured and precise manner and are ready to take responsibility. You are confident in using Adobe Photoshop and InDesign; ideally, you already have experience PremierePro collectedBenefitsLook forward to: a modern working environment in a successful, medium-sized family business with generational change, flat hierarchies, a personal working atmosphere in a collegial team and company events, space for independent organization, creative freedom and individual further training, flexible working hoursFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/dr-bernhard-burger-ag\/werkstudent-im-bereich-design-und-social-media-keltern-43058","tags":["Remote","Graphic Arts and Communication Design"],"job_types":["Working student","hilfstätigkeit \/ student"],"location":"Keltern","created_at":1702684143000,"original_language":"deu"},{"slug":"recruiter-german-speaking-berlin-486202","company_name":"Assecor GmbH","title":"Recruiter - German Speaking (m\/w\/d)","description":"Is your role with us Human Resources part of your passion and are you interested in agile work at the same time? You like communication and interaction with people and you are very familiar with recruiting specialists. Despite all of this, despite all the attention to detail, you don't lose sight of the big picture? Are you characterized by your open-mindedness and, above all, your joy in teamwork? Does that sound like you? Then we definitely want to get to know you! Who we are: We are here until digital work creates freedom for tomorrow. What we offer are not (just) products, but solutions for complex situations that make everyday (working) life easier. Beyond flat hierarchies, we attach great importance to always communicating at eye level, because everyone is a part of the whole. The Assecor Group is an owner-managed, medium-sized IT consulting and software development group with locations in Berlin, Stralsund and Nuremberg. We have been successfully serving enterprise and medium-sized customers in various industries for 14 years. If you are interested in a dynamic team and always new challenges, then apply as an (in-house) recruiter (m\/f\/d) at Assecor! Tasks Design the active and passive recruiting process (end-to-end) Maintain the career page as well as other tender platformsContinuous optimization and evaluation of existing recruiting processes, the candidate experience and employer brandingOrganization and participation in cross-company HR projectsSupport with personnel administrative tasksQualificationYou ideally have completed training or a degree with a focus on human resources managementYou have relevant professional experience in recruiting and you have it with you You have acquired a structured way of workingYou are very familiar with networks such as LinkedIn, Xing, etc. and you are familiar with common ATS and their reportingYou know the latest developments and trends in recruiting and also have a high affinity for the topic of New Work and IT TopicsYour friendly, communicative and empathetic nature makes it easy for you to make and maintain new contactsYou also bring a hands-on mentality, care and a responsible mindset to work in our teamYou have very good knowledge of German (at least. C1 level) Advantages: Experience in recruiting IT specialists Confident use of Personio and MS Office applications Desire for continuous development Benefits Flexible working hours and the possibility of working remotely Development opportunities including the assumption of further training costs Flat hierarchies and short decision-making paths Individual development and respectful cooperation Open corporate culture, pleasant working atmosphere & Regular team eventsLong-term prospects, company pension scheme & supplementary health insurance (BKzV)More work-life balance through cooperation with our partner voiioOptional subsidy for Urban Sports membership or BVG ticketTake advantage of discounts through our partner Corporate BenefitsFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/assecor-gmbh\/recruiter-german-speaking-berlin-486202","tags":["HR"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"test-engineer-berlin-316018","company_name":"Assecor GmbH","title":"Test Engineer (m\/w\/d)","description":"Deine Rolle bei unsWir suchen intelligente, freundliche, neugierige und kreative Tftler fr unsere Teams. Wenn du deine Ideen in einem entspannten und professionellen Umfeld einbringen willst, dann bist du bei uns richtig. Als Tester hast du bei uns die Mglichkeit, in vielen verschiedenen Projekten etwas zu bewegen und die Qualitt des Systems nicht nur auf einem hohen Niveau zu halten, sondern diese fortlaufend zu verbessern. Dabei kannst du dich proaktiv mit Ideen und Vorschlgen einbringen und mitentscheiden mit welchen Tools, Verfahren und Strategien wir unsere Testautomatisierung insgesamt optimieren knnen.  Weil die Anforderungen unserer Kunden niemals dieselben sind, ist kein Projekt und kein Team gleich. Auf dich warten daher vielfltige und interessante Aufgaben in einem agilen Arbeitsumfeld.  Das machen wir  Wir sind da, bis digitales Arbeiten Freirume fr morgen schafft. Was wir anbieten, sind nicht (nur) Produkte, sondern digitale Lsungen fr komplexe Situationen und Prozesse, die den (Arbeits-)alltag unserer Kunden erleichtern. Daher ist kein Projekt gleich. Auerdem kommunizieren wir als Familienunternehmen auf Augenhhe. Neben unserem Standort in Berlin, haben wir auch in Stralsund, Hannover und Nrnberg Bros.  Noch gut zu wissen Wir legen Wert auf Teamzusammenhalt und wollen, dass jeder Teil des Ganzen ist. Dafr haben wir Teamevents, Zeit fr Gesprche und einer Teamkultur mit Humor.Und wir glauben, dass man nie auslernt - schlielich gleicht sich keins unserer Projekte. Daher frdern wir eine Kultur der Offenheit und Neugier.Werde Teil des Teams, als Test Engineer (m\/w\/d) bei Assecor.  AufgabenDu bernimmst selbstndig die Konzeption von Testszenarien fr neue und bestehende Features, planst die entsprechenden Testschritte und bist fr die Erstellung, Ausfhrung und Wartung automatisierter Front- und Backend-Tests zustndig.Neben der Automatisierung von Regressionstests kmmerst du dich auerdem um die Durchfhrung von Security- und Lasttests.Du untersttzt die QA-Manager im Bedarfsfall bei manuellen Tests.In deinen Aufgabenbereich fllt auch die Fehlerreproduktion und  analyse bei auftretenden Bugs sowie die Erstellung von Tickets zu deren Behebung.QualifikationDu hast Freude an der Fehlersuche in komplexen Software-Anwendungen und zeigst Einfallsreichtum beim Finden von systemseitigen Schwachstellen.Du kannst Erfahrung im Software-Testing vorweisen und kennst dich in den Bereichen Test-Szenarienplanung, Testdurchfhrung und Testautomatisierung aus.Du verfgst ber eine strukturierte, selbstndige sowie gewissenhafte Arbeitsweise mit hoher EigenmotivationSehr gute Deutsch- und gute EnglischkenntnisseDu verfgst ber Grundkenntnisse in JavaScript, HTML, CSS und idealerweise SQL.Kenntnisse und Erfahrung im Testen mit Azure DevOps, Microsoft Test Manager und Selenium sind von VorteilBenefitsFlexible Arbeitszeiten und die Mglichkeit remote zu arbeitenEntwicklungsmglichkeiten inkl. bernahme von WeiterbildungskostenFlache Hierarchien und kurze EntscheidungswegeIndividuelle Entfaltung und ein respektvolles MiteinanderOffene Unternehmenskultur, angenehme Arbeitsatmosphre & regelmige TeameventsLangfristige Perspektiven, betriebliche Altersvorsorge & KrankenversicherungMehr Work-Life-Balance durch eine Kooperation mit unserem Partner voiioWahlweise Zuschuss zu Urban Sports Mitgliedschaft oder BVG-TicketInanspruchnahme von Rabatten ber unseren Partner Corporate BenefitsFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/assecor-gmbh\/test-engineer-berlin-316018","tags":["Business Operations"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"eng"},{"slug":"scrum-master-mwd-berlin-27749","company_name":"Assecor GmbH","title":"Scrum Master (m|w|d)","description":"Your role with us Have you already worked in Scrum and know the difficulties in introducing it? Do you know that everything depends on compliance with the processes? Are you also looking for new challenges in large companies with large project teams, which understandably find it more difficult to forego the waterfall method and move towards agile project management methods? Bingo. Because this is where we come in and we are looking for people who are hungry for knowledge for our customers and who not only think along but also think ahead and want to actively shape their working environment. Would you like to become part of our team as a Scrum Master? We look forward to getting to know you.TasksYou support and coach cross-functional teams in the introduction and establishment of agile methods and values ​​and ensure an understanding of the Scrum frameworkYou promote team development, knowledge transfer, self-organization and assumption of responsibility and create framework conditions for efficiently working teamsYou organize and moderate Scrum events , workshops and exchanges with the customer (e.g. refinements, planning, reviews, retrospectives, analysis of business requirements and other regular meetings) You identify impediments and support them in their elimination. You act as a moderator in conflict situations and in solution-finding processes and identify, minimize and communicate risks. You support the Building sustainable processes and contributing to the constant optimization of themYou advise the product owner in maintaining the Scrum artifacts and coach him as necessary in the Scrum contextYou develop functional DOR and DOD qualifications with the teamYou are enthusiastic about project work to develop innovative software and already have experience as a Scrum MasterYou have knowledge of the structured analysis and documentation of agile projectsYou have strong communication skills so that you can inspire your team members and stakeholders about agile topicsYou speak German at least at a C1 levelNice to have:You have experience in other agile software development methods and processes (Kanban, XP, Design Thinking, TDD, ATDD)BenefitsFlexible working hours and the possibility of working remotelyDevelopment opportunities including assumption of further training costsFlat hierarchies and short decision-making pathsIndividual development and respectful cooperationOpen corporate culture, pleasant working atmosphere & regular team eventsLong-term perspectives, company pension scheme & supplementary health insurance ( BKzV)More work-life balance through a cooperation with our partner voiioOptional subsidy for Urban Sports membership or BVG ticketTake advantage of discounts through our partner Corporate BenefitsFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/assecor-gmbh\/scrum-master-mwd-berlin-27749","tags":["Project Management"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"senior-frontend-entwickler-angular-berlin-247729","company_name":"Assecor GmbH","title":"Senior Frontend Developer | Angular","description":"Your role with usWe are Angular lovers and set up challenging projects with our teams. Professionalism and team cohesion are very important to us. We therefore value team events and channels, humor, creativity and personal responsibility. If you would like to convert your knowledge and experience as a front-end developer into solutions, exchange ideas with your team members and always remain curious, you have come to the right place. Tasks You will develop solutions for our customers in a team. You will join in Continuously work with team members to achieve the best results.You listen to customer requirements and independently develop solutions.You design the architecture for reusable components to increase the efficiency of software development.You enjoy sharing your knowledge with others and coaching them their position if required.QualificationsYou have good to very good experience with Angular 12, NgRX, Jest and Spring +PassYou are motivated, customer-centered and results-orientedYou have high standards of qualityAnalytical thinking skills as well as a strong ability to abstract and capture and reflect connections are no strangers to youYou speak good to very good German and EnglishSpeaking for you:Knowledge of using tailwindcss, Angular Material and DevOpsBenefitsFlexible working hours and the possibility of working remotelyDevelopment opportunities including the assumption of further training costsFlat hierarchies and short decision-making processesIndividual development and respectful cooperationOpen corporate culture, pleasant working atmosphere & Regular team eventsLong-term prospects, company pension scheme & supplementary health insurance (BKzV)More work-life balance through cooperation with our partner voiioOptional subsidy for Urban Sports membership or BVG ticketTake advantage of discounts through our partner Corporate BenefitsFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/assecor-gmbh\/senior-frontend-entwickler-angular-berlin-247729","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"product-owner-mwd-berlin-240413","company_name":"Assecor GmbH","title":"Product Owner (m|w|d)","description":"Your role with usThis is the formula of formulas for user stories. Of course you know them inside and out. And you also know that behind the variables there is a lot of care and organization, but also strong communication. Do you think that you can communicate sensitively even in flat hierarchies and that your compass is agile? Then you've come to the right place! We're looking for a product owner as an interface between customers and the team who understands how to maximize value without making translation errors. A product owner who manages to communicate sensitively in flat hierarchies and whose mindset always remains agile. Or in other words: As a [job], I want to [work in a great team] to [get the best out of myself and others]. Task clarification, evaluation and specification of technical requirements with stakeholders as well as ensuring the description in product backlog items using agile tools and methods, e.g. B. JIRA and SCRUMResponsibility for product development as well as planning and tracking of sprints, milestones and risksAchievement of technical acceptanceCommunication and reporting within the product team, the customer team and towards managementRecording, clarifying and evaluating functional and non-functional requirements of our customers and stakeholders Framework of workshopsInterface between development team, customers, suppliers and other stakeholders in areas such as digitalization, Industry 4.0 and many moreQualificationsCompleted studies in computer science, business informatics or a comparable course of study (at least bachelor's degree)Experience in the role as a product owner in software DevelopmentVery good knowledge of German and English!Scrum experienceHigh quality awarenessExcellent self-organization, communication skills and teamworkIn the best case already certified product ownerBenefitsFlexible working hours and the possibility of working remotelyDevelopment opportunities including assumption of further training costsFlat hierarchies and short decision-making pathsIndividual development and respectful cooperationOpen corporate culture, pleasant working atmosphere & regular team eventsLong-term Perspectives , company pension scheme & health insuranceMore work-life balance through a cooperation with our partner voiioOptional subsidy for Urban Sports membership or BVG ticketTake advantage of discounts through our partner Corporate BenefitsFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/assecor-gmbh\/product-owner-mwd-berlin-240413","tags":["Project Management"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"systemadministrator-it-infrastruktur-berlin-384187","company_name":"Assecor GmbH","title":"Systemadministrator IT-Infrastruktur (m\/w\/d)","description":"Deine Rolle bei unsAls Systemadministrator IT-Infrastruktur (m\/w\/d) ist es dein Ziel fr einen reibungslosen Betrieb unserer Infrastruktur zu sorgen. Unsere Infrastruktur ist etabliert, gleichwohl gibt es immer etwas zu tun.Das machen wirWir sind da, bis digitales Arbeiten Freirume fr morgen schafft. Was wir anbieten, sind nicht (nur) Produkte, sondern digitale Lsungen fr komplexe Situationen und Prozesse, die den (Arbeits-)alltag unserer Kunden erleichtern. Daher ist kein Projekt gleich. Auerdem kommunizieren wir als Familienunternehmen auf Augenhhe. Neben unserem Standort in Berlin, haben wir auch in Stralsund, Hannover und Nrnberg Bros.Noch gut zu wissenWir legen Wert auf Teamzusammenhalt und wollen, dass jeder Teil des Ganzen ist. Dafr haben wir Teamevents, Zeit fr Gesprche und einer Teamkultur mit Humor.Und wir glauben, dass man nie auslernt - schlielich gleicht sich keins unserer Projekte. Daher frdern wir eine Kultur der Offenheit und Neugier.Werde Teil des Teams, als IT-Administrator \/ Systemadministrator (m\/w\/d) bei Assecor.AufgabenIn Deiner Rolle bernimmst du die Betreuung unserer Infrastruktur und setzt gemeinsam mit dem Team technologische, strukturelle und softwarebasierte Projekte innerhalb unserer Unternehmensgruppe umDu treibst aktiv alle Fragestellungen rund um Microsoft Azure, Microsoft 365 und Microsoft SharePoint voran und bist Ansprechpartner fr dein Fachbereich mit Hands-on-MentalittDu bist verantwortlich fr das Design, die Entwicklung, den Betrieb sowie die Testung unserer Infrastrukturumgebungen. Dabei fokussierst du dich auf kontinuierliche Verbesserungen.Die Sicherheit der IT-Infrastruktur hat fr dich hchste Prioritt und du sorgst dafr, dass sie kontinuierlich gewhrleistet ist.QualifikationDu bist mit IT-Unternehmensinfrastrukturen auf Basis der Microsoft Cloud umfassend vertraut und kennst die Herausforderungen des stetigen Transformationsprozesses in die CloudDein Skillset untermauert deine Erfahrung und du zeichnest dich mit Verantwortungsbewusstsein und Analyse- sowie Konzeptionsgeschick ausDu bist in der Lage dich in neue Technologien und Systeme einzuarbeiten und kannst jene effektiv in die bestehende Landschaft integrierenEigeninitiative, Qualittsbewusstsein und Lernbereitschaft sind fr dich eine SelbstverstndlichkeitDu berzeugst mit sehr guten Deutschkenntnissen (in Wort und Schrift)BenefitsFlexible Arbeitszeiten und die Mglichkeit remote zu arbeitenEntwicklungsmglichkeiten inkl. bernahme von WeiterbildungskostenFlache Hierarchien und kurze EntscheidungswegeIndividuelle Entfaltung und ein respektvolles MiteinanderOffene Unternehmenskultur, angenehme Arbeitsatmosphre & regelmige TeameventsLangfristige Perspektiven, betriebliche Altersvorsorge & Krankenzusatzversicherung (BKzV)Mehr Work-Life-Balance durch eine Kooperation mit unserem Partner voiioWahlweise Zuschuss zu Urban Sports Mitgliedschaft oder BVG TicketInanspruchnahme von Rabatten ber unseren Partner Corporate BenefitsFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/assecor-gmbh\/systemadministrator-it-infrastruktur-berlin-384187","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"eng"},{"slug":"softwareentwickler-c-mwd-berlin-455082","company_name":"Assecor GmbH","title":"Software developer | C++ (m|f|d)","description":"Your role with usDo you want to play an active role as a software developer and person? Create something new both at the code level and in the area of ​​interpersonal relationships? You've come to the right place with us! As a C++ backend developer, you will work with us as part of a hand-picked team with high quality standards. The solidarity between each other is particularly important to us - after all, we will spend a lot of time together. We attach great importance to an open corporate culture, team events and low-threshold communication channels. We don't want to miss humor and creativity in our everyday lives, nor do we want to miss a high level of motivation and personal responsibility. So if you want to use your knowledge and experience to find solutions to complex problems, exchange ideas with your teammates and always retain a spark of curiosity, you've come to the right place! Tasks Working as part of an international development team you work on software implementationYou continuously coordinate with your team members to achieve the best results.As a team, you create architecture and component designsDuring your work, you always keep an eye on process improvementsQualificationAdvanced knowledge of C++11 or newer and experience with MFC, ActiveX\/OLE\/COM Interop, Win32 API, STL or boostKnowledge of C# backend developmentAbility to think conceptually regarding product design and technical solutionExperience in promoting code qualityExperience in task control and project managementAbility to understand requirements and provide feedback to them to question them if they seem unrealisticGood to very good knowledge of German and EnglishNice-to-haveWorking knowledge of cloud technologies is an advantageBenefitsFlexible working hours and the possibility of working remotelyDevelopment opportunities including the assumption of further training costsFlat hierarchies and short decision-making pathsIndividual development and respectful cooperationOpen corporate culture, Pleasant working atmosphere & regular team eventsLong-term prospects, company pension provision & supplementary health insurance (BKzV)More work-life balance through cooperation with our partner voiioChoice of subsidy for Urban Sports membership or BVG ticketTake advantage of discounts through our partner Corporate BenefitsFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/assecor-gmbh\/softwareentwickler-c-mwd-berlin-455082","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702684143000,"original_language":"deu"},{"slug":"vertriebsleiter-fur-mittelstandische-unternehmensgruppe-im-maschinen-und-anlagenbau-regensburg-261250","company_name":"PSchulz Consulting","title":"Sales Manager (M\/F\/D) for a medium-sized group of companies in mechanical and plant engineering","description":"As part of an exclusive search mandate, we are looking for a committed, technically experienced and internationally experienced sales person (m\/f\/d) for our client as soon as possible. Our client is a successful, medium-sized, traditional company with headquarters in the Regensburg-Nürnberg-Ingolstadt triangle, which has been in business for over... We have been successfully serving the international industry and automotive sector with customer-specific machines and systems for 30 years. Our client's approximately 300 employees are a guarantee for first-class customer-specific products, innovative solutions and professional service. The company's success is based on the constant development of technology and the continuous expansion and modularization of the machine portfolio as well as the constant optimization of corporate processes and structures. The sales organization includes product management, internal sales, field sales for customer-specific systems and modular standard machines including the dealer network and a service area. Tasks Development and implementation of the sales strategy in collaboration with the management in particular through further development, expansion and internationalization of the sales organization Expansion of strategic sales partners (international dealer network) Optimization of the entire sales process (professionalization of the customer acquisition, negotiation and contract drafting process) and the corresponding interfaces in the company Proactive further development and training of the sales team as well as improvement of transparency through professional sales controlling and reportingResponsibility for acquiring new customers, for key accounts and large projectsQualificationSuccessfully completed technical training with a commercial background or commercial training with appropriate technical background knowledge and further training in the area of ​​salesBroad and many years of experience in sales for a mechanical or plant manufacturer, ideally with management experienceExperience in the globalization of the sales organization and the expansion of a dealer network. Experienced use of MS Office and CRM as well as ERP systems. High level of competence and professional appearance both internally and externally with customers. Assertiveness, coupled with convincing leadership qualities and at the same time ability to work in a team. Structured, reliable and goal-oriented way of working. Very good knowledge of English (business fluent). Benefits to continuously develop Challenging strategic and operational tasks in an international customer environment Collaboration with committed team members who are motivated to achieve common goals Fair remuneration that recognizes your performance A permanent employment contract with flexitime and 30 days of vacation per year The possibility of mobile working and good transport connections to the Cities of Regensburg, Ingolstadt and NurembergCompany car and company cell phoneSupport for company pension schemes, company bike leasing as well as tax and social security-free benefitsAre you interested? Then contact us or send your application documents:Personalberatung PSchulz ConsultingDipl.-Ing. (FH) Peter SchulzMobile: +49 175 7253356Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/pschulz-consulting\/vertriebsleiter-fur-mittelstandische-unternehmensgruppe-im-maschinen-und-anlagenbau-regensburg-261250","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Regensburg","created_at":1702684143000,"original_language":"deu"},{"slug":"senior-consultant-cyber-strategy-and-architecture-frankfurt-79995","company_name":"NVISO","title":"Senior Consultant Cyber Strategy and Architecture (m\/w\/d)","description":"Who are we?It all starts with the mission: NVISO is here to protect European society from potentially devastating cyber attacks! This means we offer cyber security services to private and governmental organizations to help them better prepare for, prevent, detect and respond to cyber security incidents.All of this is built on four fundamental values that define who we are: We are Proud, We Break Barriers, We Care and No BS!TasksYou have a strong interest in cyber security and believe the following to be applicable to you?As a Senior Cyber Strategy & Architecture Consultant (m\/w\/d), you will assist our larger to smaller customers with the overall reinforcement of their security posture. Typical engagements include (but are not limited to): Defining a Security Strategy, supported by a corporate threat assessment in collaboration with key stakeholders in the organizationAssisting IT or security teams with the implementation of strategic security projects, acting as an interim security officer. You may be supported by other NVISO experts, or work in full integration with the client organizationImplementing or refining our clients security governance, including decision-making mechanisms, security policies, and norms or security management processes and proceduresExecuting risk assessments and elaborating action plans in concertation with internal and external stakeholdersAssisting in reaching or maintaining compliance to information security legal, contractual, or internal requirementsDefining or testing crisis management, business continuity, or disaster recovery planningRaising the awareness of staff or management on cyber threat through classic or innovative awareness initiativesWe work both for very large and small organizations that all have one goal in common: making significant progress in their protection against current and emerging cyber threatsRequirementsAre you eligible for NATO CLEARANCE At least 3 years of experience in managing ITGRC and\/or CISO-related projectsBachelor or a Masters degree, your education is not required to be in IT or technology, however you should have some affinity with technologyUsed to operating with a great deal of autonomy, but also appreciate the value of team workA people person: a good communicator and concerned about your co-workersProven project management skillsResults-oriented and able to deliver within deadlines. You value quality and client satisfaction above all, and appreciate the value of outstanding deliverablesExcellent English communication skills, both verbal and writtenGerman communication skills are beneficialBenefitsAt NVISO, we care. We are committed to offering you a highly competitive remuneration package including financial and non-financial components:A training budget of 10,000 EUR plus 10 days paid time off rolling over two yearsWorking with and learning from the best people in the European cyber security scene. We have several SANS Instructors working for us and we are also represented at popular hacking conferences (BlackHat, BruCON, OWASP, etc.). In addition, our employees can take advantage of prestigious continuing education opportunities (GSE, GXPN, CISSP, OSCP, etc.)A forward-thinking and agile company that supports you in the creation and implementation of new initiativesUnique team events (most recently e.g. Lisbon, Dubai, Malta)A sophisticated coaching concept starting on day 130 days of vacationFlexible working hours and home office options (Working Abroad Option)Cost absorption for the local transport ticket and the BahnCard50Company bike leasingA cool office in the heart of Frankfurt \/ Munich (roof terrace with grill, foosball, Playstation 4)If you are interested, please send us your application! Were looking forward to meeting you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/nviso\/senior-consultant-cyber-strategy-and-architecture-frankfurt-79995","tags":["IT Security"],"job_types":["professional \/ experienced"],"location":"Frankfurt","created_at":1702684143000,"original_language":"eng"},{"slug":"junior-e-mail-content-marketing-manager-all-genders-dusseldorf-180360","company_name":"Digital Career Institute GmbH","title":"Junior E-Mail & Content Marketing Manager (all genders)","description":"Your TasksHey digital native - fancy a change in marketing?The crisis-proof education industry is waiting for you!Who we are looking for:A marketing rockstar who doesn't just send emails, but tells epic stories that captivate our target group. Your playground? The digital world of further education - where you juggle with words and turn every click into an adventure.What we offer:A culture that encourages creativity and rewards innovation. A team full of marketing gurus who are as full of ideas as you are. A place in the spotlight where your input is not only heard, but also celebrated.So many things - but above all a meaningful purpose behind your work!Your ToDo's:Email marketing:Design, create and send exciting email campaigns to reactivate and qualify leads.Play it safe - carry out A\/B tests to optimise email performance.Help where it's needed - assist with our email customer support.Content creation:Develop creative content that not only informs, but captivates our target audience!Together with the world's best marketing crew, you will create well-founded concepts, strategies and content that will make our competitors green with envy.You'll ensure we deliver a consistent brand message across all our marketing materials.Analysing and reporting:You have an eye for the essentials - monitor, analyse and report on your KPIs - what recommendations for action do you suggest?You know your way around CRM tools: Take responsibility for your area of play and maintain our database.Your SkillsMust haves:First professional experience or a degree in marketing, communications, business or a comparable field.Very good knowledge of German and English (min. C1).You do convince us with:Technical know-how: The secret arts of email marketing tools (preferably Hubspot) and content creation are one of your easiest exercises.Your interest in the digital trends of today and tomorrow, and how you like to incorporate them into your work.Our participants come from over 125+ nations: Your brilliant feel for cultures, words and storytelling is a big plus.Your BenefitsFreedom to be creative - every idea is welcome!Developing ideas under palm trees? Of course! Take the opportunity to work 2x in another European country.Energise yourself with one of the courses from our partner Urban Sports orPractise mindfulness with a meditation session from Nilo Health - our partner for mental health.Come to our events regularly and celebrate yourself, your team and the entire company for the lessons learnt & successes!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/digital-career-institute-gmbh\/junior-e-mail-content-marketing-manager-all-genders-dusseldorf-180360","tags":["Marketing and Communication"],"job_types":["entry"],"location":"Düsseldorf","created_at":1702684143000,"original_language":"eng "},{"slug":"late-co-founder-for-chief-strategy-officer-cso-chief-marketing-officer-cmo-chief-revenue-officer-cro-im-petcare-startup-munich-373233","company_name":"Daphnee GmbH","title":"Late Co-Founder for Chief Strategy Officer (CSO)\/Chief Marketing Officer (CMO)\/Chief Revenue Officer (CRO) (w\/m\/d) im Petcare Startup","description":"Daphnee is an innovative and rapidly growing pet care startup. We're at the forefront of using AI-powered SaaS solutions to transform pet health and well-being. As we continue to scale and make significant strides in the pet care industry, we're looking for a dynamic, sales-driven, and visionary late co-founder to join our leadership team in the role of Chief Strategy Officer (CSO)\/Chief Marketing Officer (CMO)\/Chief Revenue Officer (CRO).In this role, you'll be the driving force behind our sales and marketing strategies. Initially, you will single-handedly spearhead our sales efforts, laying the groundwork for a strong sales department in the future. Your strategic vision, market insights, and passion for pet care will be crucial in driving our growth and success.TasksLead the development and implementation of innovative business, sales, and marketing strategies.Handle sales directly in the initial stages, with the opportunity to build and lead a sales team as we grow.Drive brand awareness, market penetration, and revenue growth.Collaborate with the team to align on and execute the company's vision.Foster a culture of innovation, agility, and continuous improvement.RequirementsEntrepreneurial spirit and motivation to bring a great product to success.Experience in strategic planning, marketing, and sales is a plus, but not a must.Exceptional leadership and communication skills, with the ability to think creatively and strategically.A genuine passion for pets and the pet care industry.Eagerness to work in a startup environment and wear multiple hats.BenefitsA chance to join as a late co-founder with an equity stake.Opportunity to lay the groundwork for our shared goals.Learn and grow beyond your expectations with us.Work with the latest hardware and modern tools.Steep learning curve, flat hierarchies, and flexible working hours.Initially working from home, with a move to our new office likely by 1st March.Numerous excellent corporate benefits.Fun and engaging team events.Please send your CV and a cover letter that showcases your entrepreneurial skills and love for pets to. We're excited to see how you can contribute to Daphnee's success!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/daphnee-gmbh\/late-co-founder-for-chief-strategy-officer-cso-chief-marketing-officer-cmo-chief-revenue-officer-cro-im-petcare-startup-munich-373233","tags":["Management","Team Leader"],"job_types":["professional \/ experienced"],"location":"Munich","created_at":1702684143000,"original_language":"eng"}]