[{"slug":"softwareentwickler-java-nuremberg-211904","company_name":"isento GmbH","title":"Softwareentwickler (m\/w\/d) Java","description":"Any fool can write code that a computer can understand. Good programmers write code that humans can understand.  Martin FowlerDas siehst du genauso? Dann freuen wir uns darauf Dich kennenzulernen!Wir sind isento (portug.: frei) und realisieren IT-Projekte in Nrnberg von der Konzeption bis zum Rollout. Als Software Developer bringst Du Dich bei der Entwicklung mageschneiderter Lsungen fr die Herausforderungen unserer Kunden ein. Dabei leben wir Teamwork, Austausch und das permanente von- und miteinander Lernen. So entwickeln wir Software und auch uns selbst stets weiter.AufgabenDein Job bei isentoEntwickle Softwareanwendungen mit Java, Spring Boot und aktuellen Webtechnologien wie AngularAbwechslungsreiche Aufgaben im gesamten Software-Lifecycle: Konzeption, Architektur, Entwicklung, Test, Deployment, ...Gestalte mit und bernimm Verantwortung  ob in Deinem agilen Team oder darber hinausProjekte fr lokale Kunden und hauseigene ProduktentwicklungWeiterentwicklung durch projektbergreifenden Austausch und individuelle WeiterbildungQualifikationDas bringst Du mitLeidenschaft fr Softwareentwicklung, Motivation stetig dazu zu lernen und Dein Wissen zu teilenMehrjhrige Projekterfahrung in der SoftwareentwicklungIdentifikation mit agilen Werten und strukturierte ArbeitsweiseFundierte Kenntnisse in Java und sicher im Umgang mit Datenbanken, Cloud- und Webtechnologien, Git, DevOpsGute Deutschkenntnisse (mind. B2)BenefitsDas ist isentoFlache Hierarchen, flexible Arbeitszeiten und Home Office sind schon lange kein Alleinstellungsmerkmal mehr, sondern gehren fr uns zu einer modernen Arbeitskultur. Auf was Du Dich bei uns also sonst noch freuen kannst:Wir arbeiten als Team auf Augenhhe. Wir leben den offenen Austausch, bringen Eigeninitiative, neue Ideen, aber auch konstruktive Kritik ein. Wir lernen von- und miteinander, entwickeln uns zusammen weiter und feiern gemeinsam auf unserer Dachterrasse. Egal ob Rinder- oder Seitansteak, Couchpotato oder Adrenalinjunkie, mit Familie, Katze oder Kakadu  wir sind ein buntgemischtes Team, wir sind isento! Komm in unser Team und bringe Deine Individualitt ein. Wir freuen uns auf Dich!Was wir sonst noch bieten? Besuche unsere Website unter www.isento.deoder schicke Deine Bewerbung und wir lernen uns kennen!Was wir sonst noch bieten? Besuche unsere Website oder schicke uns Deine Bewerbungsunterlagen und wir lernen uns kennen!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/softwareentwickler-java-nuremberg-211904","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000,"original_language":"eng "},{"slug":"it-fachinformatiker-munich-30199","company_name":"MY Humancapital GmbH","title":"IT specialist (m\/f\/d)","description":"Are you looking for a reliable partner to help you find a job in Munich? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer, we are looking for you as an IT specialist (m\/f\/d) as soon as possible. Tasks As an IT specialist (m\/f\/d) for system integration, you will configure and monitor all network components Take care of the setup, configuration and maintenance of servers, PC workstations, network printing and other hardware. You will also ensure system availability by analyzing and solving technical problems. The maintenance and optimization of the systems will also be part of your future area of ​​responsibility. Thanks to your expertise, you will become projects plan and implement independentlyQualificationYou have successfully completed training in the IT sector (e.g. as an IT specialist (m\/f\/d) for system integration, businessman (m\/f\/d) for IT system management, IT system clerk (m\/f\/d) , )Alternatively, you would also like to have a degree in the IT sector. Ideally, you have already been able to gain professional experience in IT administration. What stands out above all is your knowledge of dealing with Windows servers and Linux operating systems. You have a strong analytical way of thinking and impress with your independence , precise and solution-oriented way of working Very good knowledge of German and good English round off your profile. Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Andrej Oberdrfer on 089 954 287 112.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/it-fachinformatiker-munich-30199","tags":["System and Network Administration"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"trainee-hr-im-recruiting-munich-304449","company_name":"MY Humancapital GmbH","title":"Trainee HR (m\/w\/d) im Recruiting","description":"Have you successfully completed your studies and now finally want to start your career? Are you looking for an open-minded team that sees you as an important part? Basically, you don't want to take just any job. Are you more interested in finding the ideal career start? Then you've come to the right place! As one of the fastest-growing young companies in Munich, we are looking for you as a trainee (m\/f\/d) in HR to drive this upswing. You will be an integral part of HR and will be overseeing your own projects within a short period of time. When you apply, your grades are of secondary importance to us. Rather, it is important to us that we grow beyond ourselves as a team, achieve common goals and have fun at the same time! Tasks Candidate Experience: You are actively involved in setting up and implementing a modern candidate journey, from the first contact to onboarding, you put your stamp on it. Recruiting 2.0: You identify new recruiting channels and develop new, innovative ideas for talent search as a team. Job coaching: You plan individual career opportunities with applicants, conduct interviews independently and prepare them specifically for job interviews. Active sourcing: You dig using direct search true pieces of gold! You address potential applicants specifically and precisely and win them over for new, exciting job opportunities. Idea management: Your opinion is needed! Because the MHC is constantly developing, together with you! Bring in your ideas and suggestions for improvement and actively shape the future of MHC (e.g. employer branding, process design, etc.). Qualifications In addition to successful studies or training, you ideally already have professional experience in recruiting. You also impress with a few other character traits: Positive mindset: You love learning new things and taking on responsibility. You also like to go out of your comfort zone and grow beyond yourself. Focus: You achieve what you want and also have the necessary assertiveness and a high degree of initiative. Willingness to learn: Mistakes are part of learning. You are courageous, like to try out new things and always think in a solution-oriented way. Have fun with it: you should never miss out on the positive vibes. You inspire others with your energy and are always up for a laugh. BenefitsMonday is Funday culture: You too can create a working environment in which you look forward to Monday on Sunday. There are friendly teammates waiting for you who will welcome you with open arms and celebrate successes with you. Career booster: An individual, 18-month trainee program awaits you, which will turn you into a recruiting specialist in just a short time. We would be happy if you stayed with us afterwards and took your further career steps together with us.Monday Meal: Lets start the week right! Look forward to a free, healthy lunch every Monday with the whole team. Onboarding & Mentoring: Your onboarding takes place through professional and structured training, during which a permanent mentor is always at your side.Motivated environment: There are friendly teammates waiting for you who will welcome you with open arms and celebrate successes with you.Purpose: We For a large number of medium-sized and large companies in the Munich area, the most important resource is people, colleagues and employees. Knowledge is Key: True to this motto, you will regularly participate in seminars, webinars and internal coaching in order to continually advance your personal and professional development. And so much more: Your own Surface device, modern office in the heart of Munich, cool team events (Europapark, Suprise-Thursday, ), fresh fruit, access to exclusive company discounts. Would you like to become part of the success story? Then send us your CV today and you will receive a response promptly. If you have any questions about the application process, Franzi Wild is available at any time on 089 954287 104.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/trainee-hr-im-recruiting-munich-304449","tags":["Recruitment and Selection"],"job_types":["Traineeship"],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"mitarbeiterin-marketing-performance-marketing-in-teilzeit-munich-345293","company_name":"FLUID Design GmbH","title":"Employee:in Marketing | Performance Marketing (m\/f\/d) part-time","description":"FLUID is an award-winning design and innovation agency in the heart of Munich, Germany, with a partner office in Los Angeles, California. We are a multidisciplinary team specializing in the interface between the digital and the physical. With our broad knowledge, we develop visions and strategies, products and holistic design solutions for customers from a wide range of industries, from innovative startups to some of the world's best-known international brands and companies. Working at FLUID means being part of an enthusiastic and diverse group of creative thinkers working closely together to drive change and turn ideas into reality. We respect each other and share a strong team spirit. Our office is a place to feel good and get creative and is located in a historic industrial building in the heart of the Grönnerplatz district. To strengthen our team, we are looking for a marketing employee (m\/f\/d) with a focus on performance as soon as possible Part-time marketing (20h\/week).Together with you, we want to take our (performance) marketing to the next level and ensure that our existing and potential customers find out even more about us and our services, find us more easily and get involved Let us inspire you with our offer.TasksSupport and support of our B2B marketing in the area of ​​online \/ performance marketing - from social media (especially LinkedIn and Instagram), Google Ads to the creation of marketing content to support and performance tracking of the website with Google Analytics 4 ( or another analysis platform)In detail:Evaluation of the website performance with Google Analytics 4 - regular logging and summarization of the dataDeriving recommendations for action from campaigns and website analyticsMaintaining and updating our website (we use webflow)Supporting our diverse campaigns on our social media channels (especially LinkedIn & Instagram) - responsible maintenance of our Instagram account including creation of storiesAnalysis of the success of our social media campaigns: routine tracking of follower numbers, impressions, engagement and other KPIsPrepare and publish content for our social media channels: image and\/or Format and edit video material, write smaller textsAnalysis and, if necessary, optimization of our Google Ads campaigns including budget control and recommendations for actionContact person for our external Google Ads expertActive participation and support in the development of marketing content in collaboration with the various design teams and your lead teamSupport with preparation and sending the customer newsletter (we use mailchimp) Support in organizing events Taking photos at FLUID events such as Christmas parties, company anniversaries, etc. Qualifications You are proficient in using GA4 You are very familiar with Google Ads You are proficient in using social media Channels, especially InstagramYou have excellent written and spoken communication skills (German and English - we communicate our content mainly in English)Experience in paid social \/ especially the LinkedIn campaign manager is a plus, basic SEO knowledge is an advantageA high level of commitment , flexibility and personal responsibilityCareful, goal- and solution-oriented way of workingOpenness and strong communicationIdeally (not a must!) you have already worked with online collaboration platforms such as Miro, are familiar with webflow, know the newsletter tool mailchimp.BenefitsRegular lunch talks, joint lunches and various Corporate benefits such as an annual budget for further training, company pension scheme, a recruitment bonus, cheap shopping through corporate benefits and much more. The chance to work in an independent creative agency, really get involved with us and make a difference in the industry. Be part of a dynamic, talented and experienced team, with colleagues from many different cultures. Sound like you? If you would like to support our team with a lot of personal responsibility and commitment, we look forward to receiving your application! FLUID promotes equal opportunities and diversity in the workplace. All qualified applicants will be considered for employment, regardless of age, gender, origin, disability, orientation, identity, religion.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/fluid-design-gmbh\/mitarbeiterin-marketing-performance-marketing-in-teilzeit-munich-345293","tags":["Marketing and Communication"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"system-ingenieur-munich-436891","company_name":"MY Humancapital GmbH","title":"System engineer (m\/f\/d)","description":"Are you looking for a reliable partner to help you find a job in Munich? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer, we are looking for you as a systems engineer (m\/f\/d) as soon as possible. Tasks As a systems engineer (m\/f\/d), you are the central contact person for internal employees and external service providers ensure the implementation of technical and architectural requirements. You are also responsible for the conception, configuration and further development of the software. You coordinate the projects with internal interfaces from IT and other specialist areas. As a systems engineer (m\/f\/d), you also provide the 1st and 2nd level support for your area of ​​responsibility is guaranteedQualificationYou have successfully completed vocational training in the IT technical area (e.g. as an IT specialist (m\/f\/d) for system integration, businessman (m\/f\/d) for IT system management, IT System clerk (m\/f\/d), ) or have a corresponding degree (e.g. business informatics). Professional experience in the IT technical area is desirable. You also have a high level of IT affinity. Personally, you are characterized by your reliable and structured way of working coupled with a distinctive Customer orientation Good English skills round off your profile Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 112. Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/system-ingenieur-munich-436891","tags":["IT"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"2nd-level-support-sap-munich-164460","company_name":"MY Humancapital GmbH","title":"2nd Level Support (m\/w\/d) - SAP","description":"Are you looking for a reliable partner to help you find a job in Munich? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer, we are looking for you as 2nd Level Support (m\/f\/d) - SAP as soon as possible. Tasks As 2nd Level Support (m\/f\/d) you are for the solution You will be responsible for technical problems in connection with SAP. You will classify, organize and process tickets in SAP. You will be responsible for access authorizations and approvals in SAP within the organization. You will create technical tickets and forward them if necessary. You will also be involved in the improvement and further development of processes. Qualifications You have successfully completed vocational training in the IT technical area (e.g. as an IT specialist (m\/f\/d) for system integration, clerk (m\/f\/d) for IT system management, IT system clerk (m\/f\/d),) or bring a relevant degree (e.g. business informatics) Alternatively, you have experience in the IT sector and in dealing with SAP. You also have experience in dealing with SAP. As a 2nd level support (m\/f\/d) you are characterized by your Technical understanding and your communication skills Very good knowledge of German round off your profileBenefitsWork Life: The employer attaches great importance to balancing private life and career (e.g. Flexitime, home office option, etc.) Further training: If you rest, you rust. Accordingly, great importance is placed on the development of employeesTeam spirit: Friendly colleagues, flat hierarchies and numerous employee eventsInduction: You can expect individual and detailed training from experienced employeesDo you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/2nd-level-support-sap-munich-164460","tags":["IT"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"it-projektleiter-munich-364081","company_name":"MY Humancapital GmbH","title":"IT project manager (m\/f\/d)","description":"Are you looking for a reliable partner to help you find a job in Munich? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer, we are looking for you as an IT project manager (m\/f\/d) as soon as possible. Tasks As a project manager (m\/f\/d) you are responsible for the coordination and control of everything You will be responsible for the IT projects. You will assist the project team with technical and administrative questions about the projects. You will also be responsible for documenting project progress and creating monthly reports. You will also act as a central internal interface and contact person for project-related questions in the IT area. You will also be responsible for your area of ​​responsibility includes the organization of workshops and training courses for the IT teamQualificationsYou have successfully completed training in the IT sector (e.g. as an IT specialist (m\/f\/d) for system integration, businessman (m\/f\/d) for IT system management, IT System clerk (m\/f\/d), ) or alternatively have a degree in the IT sector. You already have experience with SAP, MS Access or other databases (e.g. SQL) You have a strong analytical mindset and impress with your independent, precise and solution-oriented way of working. You also have several years of professional experience in a managerial position or in managing IT projects. Very good knowledge of German and good English complete your profile. Benefits Flexibility: look forward to it flexible working hours and the opportunity to work from home. Onboarding: You can expect professional training from the experts in the department. Employer: The company offers you a dynamic and international working environment with unique development opportunities. Team spirit: A motivated, professional and well-coordinated team is waiting for you open arms Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/it-projektleiter-munich-364081","tags":["Project Management"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"junior-it-prozessmanager-standorte-hamburg-137517","company_name":"passport Business Engineering GmbH","title":"Junior IT process manager (m\/f\/d)_Locations: Hamburg","description":"Our customer acts as a management and IT consultancy and implements projects in the areas of controlling, business intelligence and data analytics. The focus is on building and optimizing customer processes and systems with the aim of increasing performance in the long term. Tasks Realization of projects in the areas of BI and data analytics in a team of 4-6 employees Digitization of controlling processes in the public sector ( Cities, municipalities or non-profit organizations)Stakeholder management, communication with customers and project employeesRequirements engineering, analysis of customer requirements Construction of dashboards and planning solutions, perspective takeover Sub-project managementQualificationStudy of economics, business informatics or comparableProfessional experience in public administration or in the NPO sectorKnowledge in the Areas of BI and databases (e.g. PowerBI, Board, Jedox) IT affinity, interest in working in consulting, analytical mindset, high communication skills, good knowledge of German, benefits, flexible working hours, 30 days of vacation, mixture of presence and home office possible, exciting projects and varied tasks, flat hierarchies and team-oriented working environment more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/junior-it-prozessmanager-standorte-hamburg-137517","tags":["Information Systems"],"job_types":["berufseinstieg"],"location":"Hamburg","created_at":1702680542000,"original_language":"deu"},{"slug":"public-services-consultant-standorte-hannover-hanover-20474","company_name":"passport Business Engineering GmbH","title":"Public Services Consultant (m\/f\/d) Locations: Hanover","description":"Our customer acts as a management and IT consultancy and implements projects in the areas of controlling, business intelligence and data analytics. The focus is on building and optimizing customer processes and systems with the aim of increasing performance in the long term. Tasks Realization of projects in the areas of BI and data analytics in a team of 4-6 employees Digitization of controlling processes in the public sector ( Cities, municipalities or non-profit organizations)Stakeholder management, communication with customers and project employeesRequirements engineering, analysis of customer requirements Construction of dashboards and planning solutions, perspective takeover Sub-project managementQualificationStudy of economics, business informatics or comparableProfessional experience in public administration or in the NPO sectorKnowledge in the Areas of BI and databases (e.g. PowerBI, Board, Jedox) IT affinity, interest in working in consulting, analytical mindset, high communication skills, good knowledge of German, benefits, flexible working hours, 30 days of vacation, mixture of presence and home office possible, exciting projects and varied tasks, flat hierarchies and team-oriented working environment more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/public-services-consultant-standorte-hannover-hanover-20474","tags":["Information Systems"],"job_types":["berufserfahren"],"location":"Hanover","created_at":1702680542000,"original_language":"deu"},{"slug":"sap-experte-freelancer-100-remote-munich-121460","company_name":"MY Humancapital GmbH","title":"SAP Experte (m\/w\/d) Freelancer - 100% Remote","description":"Unser Partnerunternehmen sucht Sie als \"SAP Experte (m\/w\/d)\" fr Ihr Headquarter im Herzen von Mnchen. Sie suchen nach einer abwechslungsreichen Ttigkeit in und einem krisensicherem Arbeitsplatz? Dann sollten Sie sich diese einmalige Chance nicht entgehen lassen!AufgabenAls SAP Consultant (m\/w\/d) bringen Sie sich aktiv in die Implementierung und Weiterentwicklung der SAP-Architektur einMit Ihrem Know-how untersttzen und beraten Sie die Fachabteilungen bei allen Fragen rund um SAPZustzlich erarbeiten Sie neue Lsungen fr die Einfhrung leistungsfhigerer ProzesseDas Erstellen von System- und Prozessdokumentationen fllt ebenso in Ihren Aufgabenbereich Zudem identifizieren Sie im Rahmen von Prozessanalysen Optimierungspotenziale fr unsere KundenQualifikationSie haben ein abgeschlossenes Studium in der (Wirtschafts-) Informatik oder verfgen ber eine Ausbildung im IT-Bereich (z.B. IT-Systemkaufmann (m\/w\/d), Informatikkaufmann (m\/w\/d), ) mit entsprechender Erfahrung Darber hinaus begeistern Sie sich fr Innovationsmglichkeiten in SAP und mchten im SAP-Umfeld langfristig arbeitenIdealerweise haben Sie bereits Erfahrung in der IT-Beratung mit SAP sammeln knnenSie verfgen ber eine ausgeprgte, analytische und lsungsorientierte ArbeitsweiseSehr gute Deutsch- sowie gute Englischkenntnisse runden Ihr Profil abBenefitsWork Life: Beim Arbeitgeber wird viel Wert daraufgelegt, Privatleben und Karriere unter einen Hut zu bekommen (bspw. Gleitzeit, Homeoffice-Mglichkeit, usw.)Weiterbildung: Wer rastet, der rostet. Dementsprechend wird groen Wert auf die Entwicklung der Mitarbeiter gelegtTeamspirit: Sympathische Kollegen, flache Hierarchien sowie zahlreiche MitarbeitereventsEinarbeitung: Sie erwartet eine individuelle und ausfhrliche Einarbeitung von erfahrenen MitarbeitendenSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/sap-experte-freelancer-100-remote-munich-121460","tags":["Remote","Consulting","Engineering"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"eng"},{"slug":"public-services-consultant-standorte-hamburg-486525","company_name":"passport Business Engineering GmbH","title":"Public Services Consultant (m\/f\/d) Locations: Hamburg","description":"Our customer acts as a management and IT consultancy and implements projects in the areas of controlling, business intelligence and data analytics. The focus is on building and optimizing customer processes and systems with the aim of increasing performance in the long term. Tasks Realization of projects in the areas of BI and data analytics in a team of 4-6 employees Digitization of controlling processes in the public sector ( Cities, municipalities or non-profit organizations)Stakeholder management, communication with customers and project employeesRequirements engineering, analysis of customer requirements Construction of dashboards and planning solutions, perspective takeover Sub-project managementQualificationStudy of economics, business informatics or comparableProfessional experience in public administration or in the NPO sectorKnowledge in the Areas of BI and databases (e.g. PowerBI, Board, Jedox) IT affinity, interest in working in consulting, analytical mindset, high communication skills, good knowledge of German, benefits, flexible working hours, 30 days of vacation, mixture of presence and home office possible, exciting projects and varied tasks, flat hierarchies and team-oriented working environment Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/public-services-consultant-standorte-hamburg-486525","tags":["Information Systems"],"job_types":["berufserfahren"],"location":"Hamburg","created_at":1702680542000,"original_language":"deu"},{"slug":"inhouse-sap-consultant-munich-421437","company_name":"MY Humancapital GmbH","title":"Inhouse SAP Consultant (m\/w\/d)","description":"Unser Partnerunternehmen sucht Sie als \"Inhouse SAP Consultant (m\/w\/d)\" fr Ihr Headquarter im Herzen von Mnchen. Sie suchen nach einer abwechslungsreichen Ttigkeit in und einem krisensicherem Arbeitsplatz? Dann sollten Sie sich diese einmalige Chance nicht entgehen lassen!AufgabenAls SAP Consultant (m\/w\/d) bringen Sie sich aktiv in die Implementierung und Weiterentwicklung der SAP-Architektur einMit Ihrem Know-how untersttzen und beraten Sie die Fachabteilungen bei allen Fragen rund um SAPZustzlich erarbeiten Sie neue Lsungen fr die Einfhrung leistungsfhigerer ProzesseDas Erstellen von System- und Prozessdokumentationen fllt ebenso in Ihren Aufgabenbereich Zudem identifizieren Sie im Rahmen von Prozessanalysen Optimierungspotenziale fr unsere KundenQualifikationSie haben ein abgeschlossenes Studium in der (Wirtschafts-) Informatik oder verfgen ber eine Ausbildung im IT-Bereich (z.B. IT-Systemkaufmann (m\/w\/d), Informatikkaufmann (m\/w\/d), ) mit entsprechender Erfahrung Darber hinaus begeistern Sie sich fr Innovationsmglichkeiten in SAP und mchten im SAP-Umfeld langfristig arbeitenIdealerweise haben Sie bereits Erfahrung in der IT-Beratung mit SAP sammeln knnenSie verfgen ber eine ausgeprgte, analytische und lsungsorientierte ArbeitsweiseSehr gute Deutsch- sowie gute Englischkenntnisse runden Ihr Profil abBenefitsWork Life: Beim Arbeitgeber wird viel Wert daraufgelegt, Privatleben und Karriere unter einen Hut zu bekommen (bspw. Gleitzeit, Homeoffice-Mglichkeit, usw.)Weiterbildung: Wer rastet, der rostet. Dementsprechend wird groen Wert auf die Entwicklung der Mitarbeiter gelegtTeamspirit: Sympathische Kollegen, flache Hierarchien sowie zahlreiche MitarbeitereventsEinarbeitung: Sie erwartet eine individuelle und ausfhrliche Einarbeitung von erfahrenen MitarbeitendenSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/inhouse-sap-consultant-munich-421437","tags":["Consulting","Engineering"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"eng"},{"slug":"junior-softwareentwickler-java-nuremberg-36790","company_name":"isento GmbH","title":"(Junior) Software Developer (m\/f\/d) Java","description":"Programming isn't about what you know; its about what you can figure out. - Chris PineDo you feel the same way? Then we look forward to getting to know you! We are isento (Portuguese: free) and implement IT projects in Nuremberg from conception to rollout. As a software developer, you will be involved in developing tailor-made solutions for the challenges of our customers. You are never on your own, because we live teamwork, exchange and constant learning from and with each other. This is how we constantly develop software and ourselves.TasksYour job at isentoDevelop software applications with Java, Spring Boot and current web technologies such as AngularEnsure software quality with unit tests, code reviews or pair programmingShare and take responsibility whether in your agile team or In addition, projects for local customers and in-house product development An isento buddy for all your questions when starting out Further development through individual training and cross-team exchange Qualification What you bring with you Passion for software development and motivation to constantly learn Study or training in the IT sector or talent as a career changer: in Identification with agile values ​​and Structured way of workingGood knowledge of Java and, ideally, initial experience in current cloud and web technologies, databases, Git and MavenGood knowledge of German (at least B2)BenefitsThis is isentoFlat hierarchies, flexible working hours and home office are no longer a unique selling point, but are part of one for us modern work culture. What else you can look forward to with us: We work as a team on equal terms. We practice open exchange, bring in our own initiative, new ideas and also constructive criticism. We learn from and with each other, develop together and celebrate together on our roof terrace. No matter whether it's beef or seitan steak, a couch potato or an adrenaline junkie, with a family, a cat or a cockatoo, we are a colorful team, we are isento! Join our team and bring in your individuality. We look forward to seeing you! What else do we offer? Visit our website or send us your application documents and we will get to know each other!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/junior-softwareentwickler-java-nuremberg-36790","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000,"original_language":"nds"},{"slug":"it-support-munich-240040","company_name":"MY Humancapital GmbH","title":"IT-Support (m\/w\/d)","description":"Unser Partnerunternehmen sucht Sie als \"IT-Support (m\/w\/d)\" fr ihr Headquarter in Mnchen. Dabei handelt sich um ein zukunftsorientiertes Wirtschaftsunternehmen aus dem ffentlichen Dienst. In den vergangenen Wochen und Monaten haben sie ein starkes Wachstum hingelegt, sodass das Team nun weiteren Zuwachs sucht. Wenn Sie sich selbst als Organisationstalent und IT-affin beschreiben, ist die Stelle genau die richtige fr Sie!AufgabenAls IT-Support (m\/w\/d) untersttzen Sie die Fachabteilungen bei der Abwicklung von Strungsmeldungen und Service RequestsSie sind verantwortlich fr die Bearbeitung von eingehenden Anfragen im Rahmen des 1st- und 2nd-Level SupportsDabei erfassen und bearbeiten Sie relevante Stammdaten in bestehenden DatenbankenZudem stellen Sie die Weiterleitung der Antrge an den 3rd Level Support sicherDarber hinaus kmmern Sie sich als IT-Mitarbeiter Service Desk (m\/w\/d) um die Koordination der ServicespezialistenQualifikationSie haben eine abgeschlossene Ausbildung im Bereich Informatik bspw. als Fachinformatiker (m\/w\/d), IT-Systemelektroniker (m\/w\/d) oder IT-Manager (m\/w\/d) Zudem konnten Sie idealerweise bereits Erfahrungen im IT-Support oder Service Desk sammeln Ihre analytischen Fhigkeiten sowie eine ausgeprgte Lsungsorientierung zeichnen Sie aus Durch Ihre strukturierte und zuverlssige Arbeitsweise behalten Sie stets alle relevanten Projekte im berblick Ein sicherer Umgang mit den gngigen MS-Office-Anwendungen sowie gute SAP-Kenntnisse, idealerweise in der Nutzung des SAP Solution Managers runden Ihr Profil abBenefitsModerner Arbeitgeber: Das Unternehmen erhielt bereits zahlreiche Auszeichnungen als attraktiver Arbeitgeber Flexibilitt: Genieen Sie die Freiheit durch flexible Arbeitszeiten sowie die Mglichkeit im Homeoffice zu arbeiten Onboarding: Sie erwartet eine professionelle Einarbeitung von den Experten der AbteilungVerpflegung: Ihre ausgewogene Ernhrung ist dank des firmeninternen Restaurants gesichert Gesundheit: Neben hhenverstellbaren Schreibtischen, gibt es ein breites Sportangebot sowie kostenfreies ObstSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/it-support-munich-240040","tags":["Helpdesk"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"eng"},{"slug":"it-prozessmanager-standorte-hannover-hanover-311109","company_name":"passport Business Engineering GmbH","title":"IT process manager (m\/f\/d)_Locations: Hanover","description":"Our customer acts as a management and IT consultancy and implements projects in the areas of controlling, business intelligence and data analytics. The focus is on building and optimizing customer processes and systems with the aim of increasing performance in the long term. Tasks Realization of projects in the areas of BI and data analytics in a team of 4-6 employees Digitization of controlling processes in the public sector ( Cities, municipalities or non-profit organizations)Stakeholder management, communication with customers and project employeesRequirements engineering, analysis of customer requirements Construction of dashboards and planning solutions, perspective takeover Sub-project managementQualificationStudy of economics, business informatics or comparableProfessional experience in public administration or in the NPO sectorKnowledge in the Areas of BI and databases (e.g. PowerBI, Board, Jedox) IT affinity, interest in working in consulting, analytical mindset, high communication skills, good knowledge of German, benefits, flexible working hours, 30 days of vacation, mixture of presence and home office possible, exciting projects and varied tasks, flat hierarchies and team-oriented working environment Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/it-prozessmanager-standorte-hannover-hanover-311109","tags":["Information Systems"],"job_types":["berufserfahren"],"location":"Hanover","created_at":1702680542000,"original_language":"deu"},{"slug":"java-entwickler-sap-munich-421699","company_name":"MY Humancapital GmbH","title":"Java Entwickler (m\/w\/d) - SAP","description":"Unser Partnerunternehmen sucht Sie als \"Java Entwickler (m\/w\/d) - SAP\" fr Ihr Headquarter im Herzen von Mnchen. Sie suchen nach einer abwechslungsreichen Ttigkeit in und einem krisensicherem Arbeitsplatz? Dann sollten Sie sich diese einmalige Chance nicht entgehen lassen!AufgabenEntwicklung und Implementierung von Java-Anwendungen in Verbindung mit SAP-SystemenAnpassung und Erweiterung von SAP-Modulen unter Verwendung von Java-TechnologienIntegration von Java-Anwendungen mit SAP-Schnittstellen und -DatenbankenMitarbeit in Projekten zur Einfhrung oder Weiterentwicklung von SAP-LsungenErstellung von technischer Dokumentation und Schulung von Mitarbeitern bei BedarfZusammenarbeit mit anderen Entwicklern, SAP-Experten und dem IT-TeamQualifikationSie haben ein abgeschlossenes Studium in der (Wirtschafts-) Informatik oder verfgen ber eine Ausbildung im IT-Bereich (z.B. IT-Systemkaufmann (m\/w\/d), Informatikkaufmann (m\/w\/d), ) mit entsprechender Erfahrung Darber hinaus begeistern Sie sich fr Innovationsmglichkeiten in SAP und mchten im SAP-Umfeld langfristig arbeitenIdealerweise haben Sie bereits Erfahrung in der IT-Beratung mit SAP sammeln knnenSie verfgen ber eine ausgeprgte, analytische und lsungsorientierte ArbeitsweiseSehr gute Deutsch- sowie gute Englischkenntnisse runden Ihr Profil abBenefitsWork Life: Beim Arbeitgeber wird viel Wert daraufgelegt, Privatleben und Karriere unter einen Hut zu bekommen (bspw. Gleitzeit, Homeoffice-Mglichkeit, usw.)Weiterbildung: Wer rastet, der rostet. Dementsprechend wird groen Wert auf die Entwicklung der Mitarbeiter gelegtTeamspirit: Sympathische Kollegen, flache Hierarchien sowie zahlreiche MitarbeitereventsEinarbeitung: Sie erwartet eine individuelle und ausfhrliche Einarbeitung von erfahrenen MitarbeitendenSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/java-entwickler-sap-munich-421699","tags":["Software Development"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"eng"},{"slug":"it-prozessmanager-standorte-hamburg-183319","company_name":"passport Business Engineering GmbH","title":"IT process manager (m\/f\/d)_Locations: Hamburg","description":"Our customer acts as a management and IT consultancy and implements projects in the areas of controlling, business intelligence and data analytics. The focus is on building and optimizing customer processes and systems with the aim of increasing performance in the long term. Tasks Realization of projects in the areas of BI and data analytics in a team of 4-6 employees Digitization of controlling processes in the public sector ( Cities, municipalities or non-profit organizations)Stakeholder management, communication with customers and project employeesRequirements engineering, analysis of customer requirements Construction of dashboards and planning solutions, perspective takeover Sub-project managementQualificationStudy of economics, business informatics or comparableProfessional experience in public administration or in the NPO sectorKnowledge in the Areas of BI and databases (e.g. PowerBI, Board, Jedox) IT affinity, interest in working in consulting, analytical mindset, high communication skills, good knowledge of German, benefits, flexible working hours, 30 days of vacation, mixture of presence and home office possible, exciting projects and varied tasks, flat hierarchies and team-oriented working environment more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/it-prozessmanager-standorte-hamburg-183319","tags":["Information Systems"],"job_types":["berufserfahren"],"location":"Hamburg","created_at":1702680542000,"original_language":"deu"},{"slug":"junior-hr-manager-recruiting-munich-354981","company_name":"MY Humancapital GmbH","title":"Junior HR Manager (m\/w\/d) - Recruiting","description":"Join our team: Candidate Consultant (m\/w\/d) im Recruiting gesucht! Du mchtest die Arbeitswelt von morgen aktiv mitgestalten und bringst einen unschlagbaren Mix aus Persnlichkeit und Motivation mit? Dann solltest du auf jeden Fall weiterlesen!Das Herzstck aller Unternehmen sind ihre Mitarbeiter*innen. Und genau hier kommen wir ins Spiel  wir supporten zahlreiche Unternehmen im Raum Mnchen entlang des gesamten Employee-Life-Cycle.Vom Focus Online wurden wir zum wachstumsstrksten Unternehmen im Sddeutschen Raum ausgezeichnet  und wir suchen Dich als neues Teammitglied, um gemeinsam diesen Aufschwung voranzutreiben. Dabei bist Du fester Bestandteil im Recruiting und wirst innerhalb krzester Zeit Deine eigenen Projekte betreuen. Bei uns steht Teamwork an erster Stelle und wir freuen uns darauf, gemeinsam mit Dir unsere Ziele zu erreichen  und dabei darf der Spa natrlich nicht zu kurz kommen!Also worauf wartest Du? Bewirb Dich jetzt und werde Teil der MHC-Crew! AufgabenCandidate Experience: Du wirkst aktiv beim Aufbau und der Umsetzung einer modernen Candidate Journey mit  vom ersten Kontakt bis zum Onboarding trgst du Deinen Stempel mit auf.  Recruiting 2.0: Du identifizierst neue Recruiting-Kanle und entwickelst im Team innovative Ideen fr die Talentsuche.  Career-Coaching: Du planst mit Bewerbern individuelle Karrieremglichkeiten, fhrst eigenstndig Interviews und bereitest sie gezielt auf Vorstellungsgesprche vor. Active Sourcing: Mittels Direct Search grbst Du wahre Goldstcke aus! Du sprichst gezielt und passgenau potentielle Bewerber an und gewinnst Sie fr neue, spannende Jobmglichkeiten.  Onboarding: Du begleitest die Bewerber*innen und neuen Mitarbeiter*innen entlang des kompletten Onboardingprozesses und bist erste Ansprechperson in Sachen Contract-Management.  Ideenmanagement: Deine Meinung ist gefragt! Denn die MHC entwickelt sich immer weiter  und zwar gemeinsam mit Dir! Bring Deine Ideen und Verbesserungsvorschlge ein und gestalte die Zukunft der MHC aktiv mit (bspw. Employer Branding, Prozessgestaltung, ). QualifikationNeben einem erfolgreichen Studium oder einer Ausbildung bringst Du idealerweise bereits Berufserfahrung im Recruiting mit. Zudem berzeugst Du noch mit einigen weiteren Charaktereigenschaften: Positives Mindset: Du liebst es Neues zu lernen und Verantwortung zu bernehmen. Dabei gehst Du auch gerne mal aus Deiner Komfortzone und wchst ber Dich hinaus. Fokus: Du weit, was Du mchtest, und bringst auch das ntige Durchsetzungsvermgen sowie ein hohes Ma an Eigeninitiative mit.  Lernbereitschaft: Fehler sind Teil des Lernens. Du bist mutig, probierst gerne Neues aus und denkst stets lsungsorientiert. Mit Spa bei der Sache: Auch die positive Vibes drfen bei Dir zu keinem Zeitpunkt zu kurz kommen. Du reit andere mit Deiner Energie mit und bist immer fr einen Lacher zu haben. BenefitsMonday is Funday Kultur: Gestalte auch Du ein Arbeitsumfeld, in dem Du Dich sonntags bereits auf Montag freust. Dabei warten sympathische Teamkollegen auf Dich, die Dich mit offenen Armen empfangen und mit Dir gemeinsam Erfolge feiern.  MHC-Workation: Einmal im Jahr geht es gemeinsam zu einer einzigartigen Destination, denn Erfolge mssen gemeinsam gefeiert werden.  Monday-Meal: Lets start the week right! Freue Dich jeden Montag auf ein kostenloses, gesundes Mittagessen gemeinsam mit dem ganzen Team.  Birthday-Vacation: An Deinem wichtigsten Tag im Jahr stehst du im Mittelpunkt und bekommst von uns zu Deinen 30 Tagen Urlaub sogar noch einen zustzlichen Urlaubstag geschenkt.  Jhrliche Gehaltserhhung: Dir machen Gehaltsverhandlungen wenig Spa? Uns auch nicht. Daher steigt Dein Gehalt automatisch  und das gleich zweimal im Jahr.  Purpose: Wir stellen bei einer Vielzahl von mittelstndischen und Grounternehmen im Raum Mnchen die wichtigste Ressource sicher  die Menschen, Kollegen und Mitarbeitenden.  Onboarding & Feedback: Der erste Eindruck zhlt! Deshalb erfolgt Dein Onboarding durch eine professionelle und strukturierte Einarbeitung mit regelmigen Feedback-Gesprchen. Dabei steht Dir Dein Mentor zur Seite und sorgt dafr, dass Du Dich innerhalb krzester Zeit zum Recruiting-Experten entwickelst. Karriere-Booster: Dich erwarten flache Hierarchien, abwechslungsreiche Aufgaben und die Mglichkeit in kurzer Zeit Verantwortung zu bernehmen.  Knowledge is Key: Getreu nach diesem Motto wirst Du regelmig an Seminaren und Coachings teilnehmen, um Deine persnliche und fachliche Weiterentwicklung stetig voranzutreiben. Zustzlich hast Du Zugriff auf exklusive Online-Akademien.Du mchtest Teil der Erfolgsgeschichte werden? Dann freuen wir uns auf Deine Bewerbung. Sende uns einfach Deinen Lebenslauf zu. Auf ein Anschreiben kannst Du gerne verzichten. Fr Rckfragen steht Dir Franzi Wild gerne unter 089 954 287  104 zur Verfgung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/junior-hr-manager-recruiting-munich-354981","tags":["Recruitment and Selection"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"eng "},{"slug":"kfz-mechatroniker-erding-327456","company_name":"MY Humancapital GmbH","title":"Automotive mechatronics engineer (m\/f\/d)","description":"Are you looking for a reliable partner to help you find a job? Then MHC is the right place for you! Benefit from the many years of experience of our experts. Thanks to the trusting cooperation with numerous companies, we can offer you tailor-made job opportunities at any time. Avoid writing numerous applications. Together we will find your dream job and completely free of charge! On behalf of our customer in Erding, we are looking for you as a vehicle mechatronics technician (m\/f\/d) as soon as possible. Tasks As a vehicle mechatronics technician (m\/f\/d) you will identify and repair mechanical problems , electronic and technical faults on vehiclesYou carry out regular maintenance work and inspections on vehiclesYou repair damaged or defective vehicle components such as engines, transmissions and brakesYou install new vehicle parts and replace damaged onesFinally, you advise customers on repairs, maintenance and services for their vehiclesQualificationYou have a Successfully completed training as an automotive mechatronics engineer (m\/f\/d) or comparable training. Ideally, you have initial professional experience as an automotive mechatronics engineer (m\/f\/d). Craftsmanship and precise work are among your strengths. You are also characterized by your willingness to take responsibility and Reliability Finally, you really enjoy working in a teamBenefitsFlexibility: Flexible working hours from Monday to Friday ensure that work and private life are balanced. Modern equipment: You work with the latest work equipment. Security: Work in a crisis-proof and future-oriented industry. Team spirit: You expect flat hierarchies and short decision-making processes as well as a respectful collaboration Versatility: Are you looking forward to exciting and varied activities in a collegial working environment Do you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Simon Schneider on 089 954 287 111.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/kfz-mechatroniker-erding-327456","tags":["Automotive Engineering"],"job_types":[],"location":"Erding","created_at":1702680542000,"original_language":"deu"},{"slug":"programmierer-automatisierungstechnik-leipzig-413711","company_name":"univativ GmbH","title":"Programmer (m\/f\/d) automation technology","description":"From now on, long-term, with option to extend, with option to take over | 40 hours per week | Leipzig | Electrical engineering | Experienced professional | 48,000 to 54,000 per year | Project ID A202344252_4Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. We are looking for a programmer (m\/f\/d) for automation technology who will drive the project forward with determination and responsibility. Do you have in-depth specialist knowledge and are familiar with automation applications? Then we are looking for you! Our customer is a global company with a focus on electrification, automation and digitalization. As one of the largest providers of energy-efficient, resource-saving technologies, our partner is a leader in systems for energy generation and transmission as well as medical diagnosis. If we were able to arouse your curiosity, then don't wait long and apply today! Tasks Electronics engineer\/programmer (m\/f\/d) for system communication and automation technology: Development of applications and methods for system monitoring and condition assessment of energy distribution systems (electrical, electronic and mechanical components )Development and adaptations of methods\/solutions of an engineering platform for a system monitoring system \"SIMARIScontrol\" for low- and medium-voltage switchgear and their peripheral components. Capture and storage of measured values\/information in local systems and cloud storage. Possibility to capture reference data as a database for evaluating the development of suitable components Evaluation and analysis procedures for product dataDevelopment and implementation of solutions for diagnostics and service supportDefinition of user interfaces and their functionsQualificationState. Certified technician or degree (Bachelor, Master, Diploma) in the field of electrical engineering, programming\/software development or comparable Knowledge of industrial automation, control and communication technology and general electrical engineering Desirable experience with SCADA systems and their communication connection, advantageous WinCCOA Experience in cloud technologies Programming knowledge in C\/ C++, data structures and algorithmsExperience in the front-end development area UI\/UXFluent in spoken and written German as well as good written and spoken EnglishBenefitsAn annual salary between 48,000 and 54,000 Personal project supportVarious further training opportunities in our e-AcademyIndividual coaching as preparation for the presentation to the customerUp to 2,000 bonus for Your recommendation to friendsExclusive job offersNetworking in various industriesWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/programmierer-automatisierungstechnik-leipzig-413711","tags":["Engineering"],"job_types":[],"location":"Leipzig","created_at":1702680542000,"original_language":"nds"},{"slug":"mitarbeiter-anlagenbuchhaltung-leipzig-79563","company_name":"univativ GmbH","title":"Asset accounting employee (m\/f\/d)","description":"From now on, long-term, with option to extend, with option to take over | 40 hours per week | Leipzig | Energy industry | Experienced professional, career starter | 42,000 to 48,000 per year | Project ID A202342070_6Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you have experience in asset accounting and have completed commercial training? Are you familiar with accounting according to HGB and do you also know how to use SAP FI CO? Then this is your chance: Apply now as an asset accountant (m\/f\/d). We will give your career a kick! Get off to a successful start with our customer in the energy industry! In an innovative team, you have the opportunity to work on exciting projects and continually expand your knowledge! Does that sound like a fascinating career prospect? We look forward to getting to know you!TasksCommercial accounting of investment measures including transfer to asset accountingIndependent processing of asset accounting for various companies, associations and in-house operationsPreparation of monthly, quarterly and annual financial statements in asset accounting including reconciliation of the general ledgerCollaboration and coordination with balance sheet accounting and with annual financial statement audits with auditors of asset accounting data for the creation of business plans, fee calculations and statisticsQualificationCommercial training or comparableSeveral years of professional experience in accounting is an advantageVery good knowledge and confident use of SAP and MS OfficeIdeally experience in asset accounting and project managementTechnical understanding is an advantageAssertiveness, initiative and independenceContact and team skillsSecure German in Word and writingBenefitsAn annual salary between 42,000 and 48,000 Personal project supportVarious further training opportunities in our e-AcademyIndividual coaching as preparation for the introduction to the customerUp to 2,000 bonus for recommending to friendsExclusive job offersNetworking in various industriesWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/mitarbeiter-anlagenbuchhaltung-leipzig-79563","tags":["Finance"],"job_types":[],"location":"Leipzig","created_at":1702680542000,"original_language":"nds"},{"slug":"mitarbeiter-lohnbuchhaltung-leuna-3033","company_name":"univativ GmbH","title":"Payroll accounting employee (m\/f\/d)","description":"From now on, long-term, with option to extend, with option to take over | 40 hours per week | Leuna | public service | Career starter, experienced professional | 30,000 to 32,400 per year | Project ID A202344298_4Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Are you looking for the perfect entry into payroll accounting? Do you have completed commercial training, have a high affinity for numbers and an analytical way of thinking? Then we have exactly the right position for you as a payroll accounting employee (m\/f\/d). Our customer works in the public service and is currently looking for support in the project. Are you looking to get into public service? Then you are right with us. Apply now and benefit from our comprehensive development opportunities.TasksProcessing and preparation of payroll accounting in compliance with the current tax and social security regulationsContact person for all billing-related, payroll tax and social security issuesAccount reconciliation and creation of provisions for the month-end closingGeneral cooperation in the day-to-day business of the human resources departmentOn-time monthly preparation of reports of billing data to external bodiesReporting and certification management and maintenance of personnel master dataQualificationSuccessfully completed commercial training desirable \/ lateral entry possibleFirst professional experience in payroll accounting is an advantageKnowledge in the areas of payroll tax, social security and labor law desirableUser knowledge of using the MS OfficeERP Knowledge e.g. B. in SAP or DATEV are an advantageHigh numerical affinity and analytical skillsCommitment and flexibilityIndependent, structured and reliable way of workingDriver's license is absolutely necessary, as it is difficult to achieve with public transportBenefitsAn annual salary between 30,000 and 32,400Personal project supportVarious further training opportunities in our e-AcademyIndividual coaching as preparation for the presentation at CustomersUp to 2,000 bonus for recommending friendsExclusive job offersNetworking in various industriesWe were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/mitarbeiter-lohnbuchhaltung-leuna-3033","tags":["Finance"],"job_types":[],"location":"Leuna","created_at":1702680542000,"original_language":"nds"},{"slug":"telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-762","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Telefonischer Kundenbetreuer m\/w\/d 2*pro Woche Home Office Schichtzulagen ab 18 Uhr","description":"Wollen Sie als Kundenbetreuer m\/w\/d fr ein Hotelvergleichsportal arbeiten?Als Kundenberater m\/w\/d erwartet Sie:AufgabenSie betreuen die Kunden bei Fragen und Problemen am Telefon oder per Mail und kmmern sich dabei professionell und freundlich um eine schnelle und zufriedenstellende LsungSie sind verantwortlich fr die fachliche Prfung und Bewertung von KundenanliegenSie stellen die zgige Abwicklung und den Abschluss der Kundenanfragen in enger Zusammenarbeit mit den nationalen und internationalen Partnern sicherSie haben stets ein offenes Ohr fr die Kunden und schaffen es, bei Rckfragen zu Buchungen  per Telefon und E-Mail  kulante Lsungen zur Zufriedenheit der Kunden zu findenGemeinsam mit dem Team wirken Sie an der internen Qualittssicherung mit, um eine fehlerfreie Bearbeitung sicherzustellenZur Weiterentwicklung der internen Prozesse, arbeiten Sie eng mit den Experten zusammenQualifikationBerufserfahrung im Dialogmarketing, in der Touristik \/ Hotelbranche (z.B. Reservierungsabteilung) oder im telefonischen KundenkontaktIdealerweise bringen Sie eine abgeschlossene Ausbildung im kaufmnnischen oder touristischen Bereich mitIn Beratungsgesprchen mit den Kunden zeichnen Sie sich durch ein freundliches, serises und lsungsorientiertes Auftreten aus  Sie bringt so schnell nichts aus der RuheSie sind ein echter Teamplayer (m\/w\/d), haben Spa am gemeinsamen Erfolg und bringen eigene Ideen einSchriftlich und mndlich berzeugen Sie mit verhandlungssicheren Deutschkenntnissen sowie mit sicheren EnglischkenntnissenVersierter Umgang mit den gngigen PC- und InternetanwendungenZeitliche Flexibilitt Randarbeitszeiten zwischen 8 und 22 Uhr abzudecken (Frh-\/Mittel-\/Sptschicht) sowie Bereitschaft zur Arbeit an Wochenenden und Feiertagen (5-Tage-Woche)Benefitsunbefristeter Arbeitsvertrag, eine attraktive Vergtung fr Wochenend-, Feiertags- und Sptschichten sowie jhrliche Prmien fr besondere Erfolge. Die bernahme von Verantwortung wird zustzlich honoriert (z.B. Wochenend-Schichtleitung). Eine bezuschusste betriebliche Altersvorsorge und viele weitere Vergnstigungen gibt es obendrauf.Der Schichtplan wird, unter der Bercksichtigung von Wnschen, mind. vier Wochen im Voraus erstellt. Gerarbeitet wird 3 Tage die Woche gemeinsam im Office  an den brigen 2 Tagen ist mobiles Arbeiten mglich (Home Office).Einen Laptop fr mobiles Arbeiten, zwei Bildschirme oder individuelles Equipment wie eine ergonomische Maus oder Noise-Cancelling-Kopfhrer? Kein Problem!Individuelle Frderung durch Fortbildungen sowie regelmige Feedbackgesprche. Durch ein starkes und nachhaltiges Wachstum werden langfristige Perspektiven in der Fach- und Fhrungslaufbahn geboten.Zentraler Standort direkt am Stadthafen. Dank Zuschuss zum Job-\/Deutschlandticket und Fahrrad-\/ eBike-Leasing kommen Sie klimaneutral und gnstig ins Bro.Kostenlose Getrnke, Msli und frisches Obst sorgen fr Energie. Mehrmals wchentlich gibt es ein kostenloses, abwechslungsreiches Mittagessen.Attraktives Sportprogramm durch einen Personaltrainer: Halten Sie sich fit durch Yoga, Rckenfit, Bootcamp-Training oder auch zwischendurch in der Bewegten Pause.Es herrscht ein kollegiales und freundschaftliches Umfeld. Bei regelmigen Office Partys, Teamevents und Sommer- und Weihnachtsfeier feiern wir zusammen.Haben wir ihr Interesse geweckt? Dann freuen wir uns auf ihre Bewerbung. Gerne auch per Whats App 015233605774Ivonne Wresch steht Ihnen gerne bei Fragen zur Verfgung. 01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-762","tags":["Customer Service"],"job_types":[],"location":"Münster","created_at":1702680542000,"original_language":"eng"},{"slug":"sachbearbeiter-versicherung-vz-und-tz-moglich-mo-fr-hamburg-307167","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Clerk m\/f\/d insurance VZ and TZ possible. Mon-Fri","description":"Do you want to work for a leading online comparison portal? We are looking for employees\/clerks m\/f\/d to support the back office team in the insurance sector. We look forward to receiving your application as a career changer m\/f\/d insurance clerks full-time or part-time from 16 hours\/week. Task-independent review of Insurance applicationsSupport with telephone inquiries from existing customers (m\/f\/d)Communication with insurance companies is an interface between customer advisors (m\/f\/d) and external insurance companiesQualificationAn independent, reliable and detail-oriented way of working is what sets you apartIdeally - initial experience in clerical processing etc. ( possibly through internships or working student positions) high customer orientation as well as a confident and friendly demeanor in telephone and written contactBenefitsCentral workplace - home office days possibleOffice working hours between 9 a.m. and 5 p.m. 30,000 p.a.more than 30 days vacation possiblequalified trainingHave we aroused your interest? Then we look forward to receiving your application. We would be happy to send you an email or WhatsApp on 0152\/33605774 If you have any questions, Ivonne Wresch will be happy to help you. Telephone 0152\/33605774 Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/sachbearbeiter-versicherung-vz-und-tz-moglich-mo-fr-hamburg-307167","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702680542000,"original_language":"deu"},{"slug":"2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-217908","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Telephone customer advisor m\/f\/d additional dental insurance","description":"To support the customer management team in the area of ​​supplementary dental insurance, we are looking for call center agents, telephone customer advisors m\/f\/d in customer service in Hamburg. As a call center agent, telephone customer advisor m\/f\/d you can expect: Tasks Advising existing and new customers on the topic Supplementary dental insurance by telephone and email (no cold calling) Creation of individual offers for the dental supplement area Collection and maintenance of customer data as well as responsibility for applications Interface function between customers and insurance companies Support in the permanent development of the comparative offer Qualification Commercial training (e.g. office clerk or insurance specialist ) or also like insurance career changerFirst experience in customer adviceHigh customer orientation as well as a confident and friendly demeanor on the telephoneResponsible, conscientious and structured way of workingHands-on mentality and strong implementation skills with a focus on detailEnthusiasm for digital business modelsBenefitsPermanent employment contractWorking hours from Monday to Friday between 8 a.m. and 8 p.m.Salary 30 a.m. to 32 p.m.Intensive and individual trainingProfessional qualifications in the health insurance sectorWorking independently in a dynamic working environmentCentral location with excellent transport connections and a view of the AlsterSubsidy for the HVV ProfiCardIndividual development and further training opportunitiesFriendly working environment with a first-name culture, shared lunch breaks and many team eventsHave we aroused your interest? Then we look forward to receiving your application. You are welcome to apply by email or WhatsApp. If you have any questions, Ivonne Wresch will be happy to help you. 0152\/33605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-217908","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702680542000,"original_language":"deu"},{"slug":"it-first-level-support-vogt-414367","company_name":"Ingenieurbüro Sulzer GmbH & Co. KG","title":"IT First Level Support","description":"We are a dynamic engineering office for building technology with 80 employees. We are looked after by an external IT company which procures hardware for us and looks after our entire server. In order to improve the interface between our employees and the external IT service provider, we are looking for a dedicated half-time IT support employee. Salary information refers to a 40-hour week.TasksReceiving and processing IT concerns from our employees.Initial problem analysis and resolution in the IT area.Coordination and communication with our external IT service provider.Monitoring and reporting the status of IT problems.Support and Internal coordination in the implementation of new IT systems and processes.Expert handling and support in the area of ​​Office 365.Support in setting up and moving employee workstations, including the IT infrastructureDocumentation of the IT systemQualificationCompleted training in the IT sector or comparable qualifications.Experience in IT -Support and in dealing with IT infrastructures.Excellent knowledge and experience with Office 365.Experience in setting up and relocating workplaces.Excellent communication skills and service orientation.Ability to work both independently and in a team.Good knowledge of spoken German and English Writing.BenefitsYou will be well trained by a helpful team of colleagues.You will work in modern workplaces.You have the opportunity to work from home.You will benefit from flexible working hours.You will receive continuous training opportunities.You will benefit from an attractive remuneration system.You will receive many additional social benefits .You will be part of a dynamic and heterogeneous team in a collegial working atmosphere with short decision-making processes.You have access to the company's own canteen.You can use sufficient parking spaces directly at the company.You enjoy a very good work-life balance.You benefit from a corporate culture , which offers you every opportunity to develop your personal strengths. Become part of our team and support us as an IT support employee. We offer a modern working environment, good training opportunities and a familiar working atmosphere.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ingenieurburo-sulzer-gmbh-co-kg\/it-first-level-support-vogt-414367","tags":["IT"],"job_types":[],"location":"Vogt","created_at":1702680542000,"original_language":"sun"},{"slug":"senior-backend-engineer-munich-10848","company_name":"Temedica","title":"Senior Backend Engineer (f\/d\/m)","description":"Let's win togetherAs a Backend Engineer for our Mobile team at Temedica, you take charge of developing our new patient companion apps and contribute to the creation of a scalable app platform. You work towards the goal of improving patient outcomes by delivering tailored support to them. By leveraging the power of artificial intelligence, you actively influence patient behavior and shape their experiences into meaningful interventions. If you are passionate about using technology to make a real difference in patients' lives and want to be a key player in a dynamic and agile environment, this is the right opportunity for you!Your Role with usYou drive good, clean code practices while sharing your knowledge with the team, contributing to the success of your peers along the way.You shape the development of the overall apps by sharing proactive feedback and improving decision making.You search for and actionably deliver value for our users through building and influencing features.You think about PII data and how to protect our users.What you bring to the tableYou have 5+ years of experience working as a backend engineer, preferably in NodeJS, or in a similar role with a strong track record of developing, deploying, and maintaining the full lifecycle of, ideally, mobile applications.You have the ability to understand and discuss (but not necessarily know how to implement) infrastructure topics - big plus for cloud architecture knowledge (GCP, AWS, etc) and frontend topics, preferably in react\/react native.You have previous experience with platform or similar shared usage projects.You speak English fluently. German is a plus.What we bring to the tableWe use data for the better. We create technology that really helps. At Temedica, we break new ground in digital health and challenge the traditional healthcare model. We believe that individualized treatment is a fundamental right of every patient - so we make it happen! We build medical applications and use artificial intelligence to translate patient behavior into sensible interventions. We also combine our applications data with data sources from research, social listening and key market providers. Based on a B2B SaaS business model, we so offer novel data monitors that secure previously unknown insights for Pharma and Life-sciences to make personalized medicine reality. Finally!You want more? There are a bunch of things that Temedica offers its employees - and were talking real benefits, not equipment, fruits and drinks. Of course we take care of your daily caffeine and vitamin supply while you perform your work on state-of-the-art devices, but theres much more that we do to support our Temedicans, for example: 150 monthly subsidiary: For whatever makes most sense for you. Starting after the probationary period, you have the freedom to select where to direct your subsidiary from a wide range of options. Whether it's internet at home, a BahnCard or public transport, Kindergarden subsidy, paid time-off, or even your dream workation, the choice is yours to make. And yes, we've also got your back for the long run. Our company pension scheme offers a 50% subsidy, capped at a maximum of 90 per month, to proactively support your future financial security and help you save for retirement while maximizing your benefits. Mix and match these benefits to create a personalized package that suits your preferences and enhances your work-life balance!Hybrid-work policy: Our hybrid-work policy allows you to work from anywhere within Germany. In your team, you are free to decide when to come to the office and enjoy working and celebrating your wins together. Were talking 4 days per month here - cool?Company off-sites and kick-offs: These events allow you to knowledge-share and gather a better understanding of how to successfully reach our goals. Let us tell you, the food during these events is also worth a shot!We are happy to tell you more about our benefits and way of working at Temedica in a first call!Join us!You are looking for an exciting challenge within digital health? We are looking forward to your application!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/temedica\/senior-backend-engineer-munich-10848","tags":["Software Development"],"job_types":["professional \/ experienced"],"location":"Munich","created_at":1702680542000,"original_language":"eng "},{"slug":"junior-controller-neunkirchen-330991","company_name":"Amapharm GmbH","title":"Junior Controller (m\/w\/d)","description":"Bored with your current job?! We not only offer fruit baskets, but also a lifelong supply of jelly rolls for the long-awaited energy kick. We are looking for a committed and qualified controlling specialist to strengthen our team at Amapharm. Our company is known for its diverse, health-conscious products that ensure a healthy vitamin intake for children and adults. Tasks Now you could become our new specialist. The following to-dos await you: Creating reports and analyzes in Excel Preparing business reports Creating deviation analyzes and Ad-hoc evaluations Monitoring and evaluation of key figures Participation in projects Self-responsible assurance of data quality Creation of calculations and offers Calculations, offer preparation Data analysis and Power BI evaluations Logistics Controlling Calculation of employee bonuses Invoice verification Qualification This is what we expect from you: Completed degree in business administration or comparable qualification Experience in the controlling area Good knowledge of MS Excel and ideally experience with Microsoft NavisionIndependent way of working, analytical thinking and high commitmentStructured work, especially in stressful situationsVery good knowledge of spoken and written EnglishBenefitsA young, motivated team in a relaxed working atmosphere is waiting for you.Look forward to fun team events, cool sports programs, charity events and great Christmas traditions.A Fresh fruit basket and lots of vitamin fruit gums are available to you every day!Apply today and secure your place in #TeamAmapharm.We look forward to seeing you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/amapharm-gmbh\/junior-controller-neunkirchen-330991","tags":["Controlling"],"job_types":[],"location":"Neunkirchen","created_at":1702680542000,"original_language":"deu"},{"slug":"referent-international-projektfinanzen-munich-374782","company_name":"MY Humancapital GmbH","title":"Referent international project finance (m\/f\/d)","description":"Our cooperation partner has set itself the goal of shaping Munich in such a way that it becomes a future-oriented and sustainable metropolis that uses digitalization for the benefit of urban society. If you would like to experience Munich digitally and would like to be part of the team that is committed to this, then you have come to the right place. On behalf of our partner company, we are looking for you as an international project finance consultant (m\/f\/d) as soon as possible. TasksAs a consultant (m\/f\/d) for project finance, you will support the development of financing concepts for international projects. You will identify and evaluate potential financing partners. You will create budget plans for international projects. You will also monitor and control budget expenditure during the course of the project. You will also carry out financial analyzes for projects, including cost-benefit -Analysis through qualificationsYou have a completed degree in business administration, finance, economics or a related field. You also have initial professional experience as a project controller (m\/f\/d), financial advisor (m\/f\/d) for international projects, international finance manager (m\/f\/d). w\/d) or a similar area. You also have a deep understanding of the principles of project financing and their evaluation. You have already gained experience in dealing with financial software, especially SAP or other relevant systems. You are also familiar with the international financial markets and their influence on project financing. Benefits Professional onboarding to pick you up from day one and support you individuallyA hybrid working model because you know best where and how to work effectivelyAn excellent employer and an appreciative company culture because you like to work in a friendly and cooperative environmentA rich selection of culinary dishes, such as fruits , snacks and drinks, because your holistic well-being counts A varied range of tasks in a flexible working environment so that you are satisfied with your position in the long term An agile company in a future-proof industry because you should be protected for the future Excellent training measures so that you can grow personally and professionally Can you find the job profile interesting? Then we look forward to receiving your application. Send us your documents. If you have any questions, please contact Johanna Artmann on 089 954 287 106.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/referent-international-projektfinanzen-munich-374782","tags":["Controlling"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"projektleiter-elektrik-kolbermoor-240937","company_name":"unternehmensberatung monika gräter","title":"Project manager m\/f\/d Electrics","description":"Turnkey production systems in the areas of conveyor and automation technology are our client's profession. Over the decades, the medium-sized company has transformed into a globally active group of companies. As a key player in the fast and dynamic industry, he realizes customer-specific systems, especially for major customers in the automotive industry and logistics, with high quality and reliability. For the parent company based in the Rosenheim area, we are looking for you to carry out the technical and constructive management of customer projects for conveyor systems, plan the electrical engineering scope and accompany the project from development to acceptance by the customer. With direct customer contact, you act as an interface to overall project management, construction and purchasing and production and also support sales and suppliers in technical topics. You evaluate different technical concepts, carry out cost assessments, prepare FMEA and risk analyses, weigh up the advantages and disadvantages and keep an eye on market and competitive events. As part of your project, you coordinate mechanical-electrical interfaces, determine cable routing and take over the selection Design of sensors, drive and control technologyYou organize meetings for coordination and participate in them (e.g. design review, kick-off, etc.)Using the PDM system, you create electrical assembly drawings, record the as-built statuses on site and meet the necessary processes in purchasing, work preparation and production control.Qualifications Sound technical training background (e.g. studies in electrical engineering or mechatronics, technical qualification or comparable skills and knowledge) Professional experience in a comparable environment Willingness to undertake occasional business trips at home and abroad Good German and English Benefits Permanent position* with attractive remuneration, bonus payments and holiday pay Company pension provision and accident insurance Home office possible Job bike leasing and additional payment for the fitness studio Small and large company events and outings Are you looking to get started in project management or want to expand your skills? Then send us your application or simply give us a call. Ms. Grter looks forward to your call and your questions.*An employment contract is always concluded directly with our client, but we are available not only to our customers but also to you as a neutral intermediary.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/unternehmensberatung-monika-grater\/projektleiter-elektrik-kolbermoor-240937","tags":["Engineering"],"job_types":["teamleitung"],"location":"Kolbermoor","created_at":1702680542000,"original_language":"deu"},{"slug":"us-gaap-accounting-expert-cologne-354075","company_name":"MVE - Most Valuable Employee","title":"US GAAP Accounting Expert","description":"MVE - Most Valuable Employee ist eine Personalberatung, die ausschlielich mitarbeiterfreundliche und attraktive Arbeitgeber mit motivierten Kandidaten verbindet.Fr einen globalen Player im Rheinland suchen wir einen erfahrenen US GAAP Accounting Expert (*gn ). Wenn Sie daran interessiert sind, Ihre Big 4 Erfahrungen auf Unternehmensseite einzubringen und sich in den Bereichen US GAAP und SOX Compliance zuhause fhlen, dann sind Sie hier genau richtig.AufgabenUntersttzung in der Erstellung von Finanzaufstellungsangaben fr vierteljhrliche und jhrliche Berichterstattungen nach US GAAP und IFRS StandardSicherstellung der Compliance mit den relevanten RechnungslegungsstandardsDurchfhrung von Finanzanalysen und -bewertungen zur Untersttzung strategischer EntscheidungsprozesseEffiziente Vermittlung von technischen Buchhaltungskonzepten an Buchhalter und andere StakeholderQualifikationAbgeschlossenes Studium in Finanzen, Buchhaltung oder eine hnliche QualifikationMehr als 3 Jahre Berufserfahrung, vorzugsweise in einem brsennotierten Unternehmen und\/oder einer groen WirtschaftsprfungsgesellschaftNachgewiesene Fhigkeit, komplexe Buchhaltungsthemen sowohl fr technische als auch nicht-technische Stakeholder zu interpretieren und zu kommunizierenHervorragende Kommunikations- und VerhandlungsfhigkeitAnalytische Denkweise und die Fhigkeit, komplexe Finanzdaten zu interpretierenFlieende Englisch und Deutschkenntnisse in Wort und SchriftBenefitsModerne RumlichkeitenInklusive Unternehmenskultur, die Vielfalt frdertmehr als 30 Tage Urlaub und ein hybrides ArbeitsmodellWeiterbildungsmglichkeitenAttraktive Benefits, wie Mitarbeitervorteile und -rabatte*geschlechtsneutral. Allein aus Grnden der besseren Lesbarkeit wird im weiteren Textverlauf auf die gleichzeitige Verwendung mnnlicher, weiblicher und diverser Sprachformen verzichtet. Smtliche Personenbezeichnungen gelten geschlechtsneutral.Fr Fragen und Rckmeldungen melden Sie sich gerne bei unserer Ansprechpartnerin Frau Kwofie, unter 017655851530.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/mve-most-valuable-employee\/us-gaap-accounting-expert-cologne-354075","tags":["Finance"],"job_types":["berufserfahren"],"location":"Cologne","created_at":1702680542000,"original_language":"eng"},{"slug":"qualitatsingenieur-lieferantenmanagement-raum-aachen-15214","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Quality engineer\/supplier management (f\/m\/d) - Aachen area","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations from the areas of plant engineering, mechanical engineering and automotive. We are looking for a quality engineer (m\/f\/d) in the greater Aachen area for one of our customers in the area of ​​special mechanical engineering. Tasks In your new position, your focus will be on Things supplier development program. In accordance with our guidelines, you maintain your global supplier network, check process specifications including compliance with them as well as delivery capabilities and carry out audits. You identify process-related sources of error at an early stage, analyze them and coordinate with the respective suppliers in order to continuously improve the supply chains. You also provide support during start-up - and relocation projects and participate in initial sampling and product validation.You document your project progress and supplier performance precisely, ensuring a clear structure and developing the basis for decision-making for supplier and component approval.QualificationCompleted engineering studies or comparable trainingSeveral years of professional experience in quality management with a focus on supplier qualifications as a quality auditor, experience in the area of ​​supplier auditing is desirable. Practically proven knowledge of quality methods such as FMEA, APQP, 8D, SPC, etc. Routine with SAP and MS Office as well as business fluent German and English. Strong analytical-structured as well as careful and independent way of working coupled with significant problem-solving ability A degree of initiative, strong communication skills and assertiveness A pragmatic, entrepreneurial personality who likes to approach projects strategically, is highly willing to travel and inspires with his communicative, open-minded nature. Benefits Joining an innovative, international and expanding technology leader Attractive remuneration and social benefits Flat hierarchies and direct interdisciplinary collaboration Continuous Professional trainingFlexible working hours and mobile workingCapital-generating benefitsCompany health management30 days vacationDon't meet every requirement? No problem, please apply anyway. We look forward to receiving your application! Dilara YabanciRecruiting ConsultantTALENTSCOUTS Recruiting GmbHT: +49 221 8888 7897M +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/qualitatsingenieur-lieferantenmanagement-raum-aachen-15214","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000,"original_language":"deu"},{"slug":"qualitatsprufer-raum-aachen-465716","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Quality inspector (m\/f\/d) - Aachen area","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations from the areas of plant engineering, mechanical engineering and automotive. We are looking for a quality inspector (m\/f\/d) in the greater Aachen area for one of our customers in the area of ​​special machine construction. Tasks Testing of products and complete trades based on production documents and test plansDocumentation of the test results as well as release or blocking of the tested itemsSupport in the implementation of supplier qualification and development measuresOptimization of production drawings with regard to the definition of quality requirements, in particular taking into account technical feasibility and sensible tolerancesDetection and presentation of deviations in parts procurementExecution of product acceptances from suppliers and service providersSystematic application of statistical methodsAnalysis and improvement of existing company processesContact person for production in the event of deviations in the product quality of a supplierQualificationCompleted technical training in mechanical engineering or electrical engineeringSeveral years of practical professional experience in the area of ​​quality assuranceGood knowledge of the methods in quality managementIn-depth SAP knowledge in dealing with the logistics and QM modulesKnowledge of in the field of vacuum technology as well as in the handling and processing of the materials quartz and graphite are desired. Organizational talent, friendliness in dealing with customers, employees and suppliers Good knowledge of spoken and written English Benefits Joining an innovative, international and expanding technology leader Attractive remuneration and social benefits Flat hierarchies and direct interdisciplinary CollaborationContinuous professional trainingFlexible working hours and mobile workingCapital-generating benefitsCompany health management30 days vacationDon't meet every requirement? No problem, feel free to apply anyway. We look forward to receiving your application! Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHT: +49 221 8888 7897M +49 176 45263917Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/qualitatsprufer-raum-aachen-465716","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000,"original_language":"deu"},{"slug":"werkstudentin-content-managerin-berlin-47728","company_name":"emjul","title":"Werkstudent*in Content Manager*in","description":"We are looking for a dedicated working student Content Manager to support our team in the development and implementation of high-quality content. As an aspiring digital agency with a focus on Fintech, Real Estate and Blockchain, we offer you the opportunity to work in an exciting and future-oriented environment. Tasks: Creation and editing of content for the website and social media. Writing of appealing texts and articles about the company and its ProductsSelect and upload images and videos to improve the visual representation of the brandCommunication with the marketing team to coordinate the content strategyAnalyzing data and measuring the success of the published contentQualificationsYou should be able to speak and write fluently in German and English. Experience in content management or social media is desirable .Good knowledge of creating appealing and creative content is required.Basic knowledge of image editing would be an advantage.You should have a good feel for current trends and topics.We offer you a challenging and varied job in a motivated team. You have the opportunity to further develop your skills and make a significant contribution to the success of our company. We look forward to your application.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/emjul\/werkstudentin-content-managerin-berlin-47728","tags":["Marketing and Communication"],"job_types":["Working student"],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"elektrokonstrukteur-eplan-raum-aachen-196768","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Electrical designer EPLAN (m\/f\/d) - Aachen area","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations from the areas of plant engineering, mechanical engineering and automotive. We are looking for an electrical designer (m\/f\/d) in the greater Aachen area for one of our customers in the area of ​​special mechanical engineering. Tasks: Creation of all electrical engineering documents: electronic planning , material BOMs, pneumatic plans, execution guidelines Creation of the blueprint of all standard systems Contact person for production during construction and testing of new specials in customer upgrades or in standard systems Support of system definition in technical questions Support other departments with questions and problems Ensuring complete, timely and error-free provision of documents following departments in the process processQualificationSuccessfully completed training as an electrical engineering technician Very good knowledge of EPlan 8Knowledge of SAP\/R3 Good spatial imagination and interest in technical connectionsGood MS Office knowledge (Excel)Good communication and organizational skillsVery good spoken and written EnglishBenefitsStarting at an innovative, International and expanding technology leaderAttractive remuneration and social benefitsFlat hierarchies and direct interdisciplinary collaborationContinuous professional trainingFlexible working hours and mobile workingCapital-generating benefitsCompany health management30 days of vacationDon't you meet every requirement? No problem, feel free to apply anyway. We look forward to receiving your application! Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHT: +49 221 8888 7897M +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/elektrokonstrukteur-eplan-raum-aachen-196768","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000,"original_language":"deu"},{"slug":"industriemechaniker-mechatroniker-montage-raum-aachen-cologne-67267","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Industrial mechanic \/ mechatronics technician assembly (m\/f\/d) - Aachen area","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations from the areas of plant engineering, mechanical engineering and automotive. For one of our customers in the area of ​​special machine construction, we are looking for an industrial mechanic \/ mechatronics assembly technician (m\/f\/d) in the greater Aachen area. Tasks Assembly\/tubing of mechanical\/ electromechanical assemblies and components according to planConstruction of mechanical assemblies according to drawingsKnowledge of pneumaticsPerforming functional and hardware tests of the systemsQualificationSuccessfully completed technical training as an industrial mechanic, mechatronics engineer or a comparable trainingFirst professional experience, ideally in special machine constructionVery good knowledge of German and basic knowledge of EnglishPrecise and reliable way of workingTeamwork skillsHigh quality standardsBenefitsStarting with an innovative, international and expanding company Technology leaderAttractive remuneration and social benefitsFlat hierarchies and direct interdisciplinary collaborationContinuous professional trainingCapital-generating benefitsCompany health management30 days vacationDon't meet every requirement? No problem, feel free to apply anyway. We look forward to receiving your application! Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobile: +49 176 45263917Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/industriemechaniker-mechatroniker-montage-raum-aachen-cologne-67267","tags":["Engineering"],"job_types":[],"location":"Cologne","created_at":1702680542000,"original_language":"deu"},{"slug":"konstruktionsingenieur-sondermaschinenbau-creo-aachen-18410","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Design engineer for special mechanical engineering - CREO (f\/m\/d) - Aachen","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations in the areas of plant engineering, mechanical engineering and automotive. For one of our customers in the field of plant engineering, we are looking for a design engineer for special mechanical engineering - CREO (f\/m\/d) in the greater Aachen area. Tasks Creation and modification of individual parts - and assembly drawings in Creo 8\/WindchillCreation of the blueprint for standard systems, if necessary integration of customer specialsCreation of mechanical documents (CREO planning, SAP material BOMs, work instructions)Contact person for production during construction and testing of new specials in customer upgrades or standard systemsSupport of the system definition area in technical questionsEnsuring timely provision of documents for subsequent departmentsQualificationsCompleted mechanical engineering degree (Bachelor\/Engineer)Good spatial imagination and interest in technical connectionsVery good knowledge of CAD systems (Creo 8)Good knowledge of SAP\/R3 and MS OfficeAbility to work independently and in a teamVery good English Word and writingBenefitsFlexible working hours, mobile officeEmployee profit sharingHealth weeks to support physical and mental healthFurther education and training opportunitiesCompany pension provision, capital-forming benefits and individual additional insuranceCompany-owned canteen with subsidized menus and seasonal fruit basketsE-charging stations for cars and bicycles, good transport connections with free parking spacesEmployee-initiated leisure activitiesGenerous “Employee recruit employees program\"If this position suits you and sounds interesting to you, we look forward to receiving your application to:Dimitrios NoulisRecruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobile: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/konstruktionsingenieur-sondermaschinenbau-creo-aachen-18410","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000,"original_language":"deu"},{"slug":"technischer-redakteur-raum-aachen-cologne-224845","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Technical editor (f\/m\/d) - Aachen area","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations from the areas of plant engineering, mechanical engineering and automotive. We are looking for a technical editor (f\/m\/d) in the greater Aachen area for one of our customers in the area of ​​special machine construction. Tasks Active participation in development and CIP Projects with a focus on product documentationSupport in the creation, management and maintenance of all product-related technical documentsCreation of editorial drafts on product manual topicsMaintenance of company terminology as a basis for all technical documentationQualificationTechnical editor with experience in terminology workBasic knowledge of the Machinery Directive and ISO\/IEC 82079 -1:2012 StandardKnowledge\/knowledge in the creation and editing of technical product documentationNative German speaker with good written and spoken EnglishAbility to work in a team, communication skills and assertivenessComprehensive theoretical and practical understanding of the areas of software, mechanics and electronics in plant engineeringBenefitsStarting with an innovative, international and expanding technology leader Attractive remuneration and social benefits Flat hierarchies and direct interdisciplinary collaboration Continuous professional training Flexible working hours and mobile working Capital-forming benefits Company health management 30 days of vacation Don't you meet every requirement? No problem, feel free to apply anyway. We look forward to receiving your application! Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobile: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/technischer-redakteur-raum-aachen-cologne-224845","tags":["Engineering"],"job_types":[],"location":"Cologne","created_at":1702680542000,"original_language":"deu"},{"slug":"qualitatsplaner-aachen-261354","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Quality planner (f\/m\/d) - Aachen","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations from the plant engineering, mechanical engineering and automotive sectors. We are looking for a quality planner (m\/f\/d) in the greater Aachen area for one of our customers in the plant engineering sector. Tasks: Creation of QM test plans and instructions and process plansDetermination of quality requirements for supplier parts and, if necessary, testing facilitiesCreation of the EMBP and definition of testing and acceptance criteriaSupport with process acceptance and audits at suppliers and service providersPerforming product acceptance and sampling at suppliers and service providersIdentification and documentation of deviations in parts procurementPlanning the content and timing of the initial sampling of Supplier parts Support with supplier development programs and preventative measures Collaboration on improvement measures, projects and FMEAs Support in defining and creating standards with the development department Qualification Training as an electrical engineering engineer or as a state-certified electrical engineer\/mechanical engineer Training or further education in the area of ​​QM\/QS is an advantage (e.g. QB\/QM, SixSigma-Green Belt\/Black Belt) Good knowledge of quality management methods (FMEA, SPC, QFD, Ishikawa, Pareto) Several years of professional experience in quality management in plant construction and commissioning, preferably in the semiconductor industry Sound knowledge of Microsoft Office and SAP ( Logistics and QM modules)Team-oriented, responsible, good knowledge of EnglishAnalytical thinking, didactic skills, assertivenessOrganizational skills, friendliness in dealing with customers, employees and suppliersBenefitsFlexible working hours, mobile officeEmployee profit sharingHealth weeks to support physical and mental healthFurther education and training opportunitiesCompany pension scheme, capital-forming benefits and individual Additional insuranceCompany-owned canteen with subsidized menus and seasonal fruit basketsE-charging stations for cars and bicycles, good transport connections with free parking spacesEmployee-initiated leisure activitiesGenerous \"employees recruit employees program\"Don't you meet every requirement? No problem, feel free to apply anyway. We look forward to receiving your application!Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobile: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/qualitatsplaner-aachen-261354","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000,"original_language":"deu"},{"slug":"sachbearbeiter-technischer-innendienst-raum-aachen-82279","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Technical Internal Service Clerk (m\/f\/d) - Aachen area","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations from the areas of plant engineering, mechanical engineering and automotive. We are looking for a technical internal service clerk (m\/f\/d) in Aachen for one of our customers from the bulk material technology and industrial services sector. Tasks You are the operational contact person in the office and take care of inquiry and order processing.You check customer orders, maintain and manage them in the ERP system and create order confirmations.You coordinate the flow of information in customer projects.You obtain offers from suppliers and procure standard and drawing parts as well as semi-finished products. You create statistics and evaluations and take care of monthly closing work.QualificationCompleted commercial training or technical training with a commercial backgroundPreferred experience in manufacturing companiesCompetence in dealing with technical drawings and parts listsVersified MS Office knowledgeGood knowledge of German and EnglishBenefitsA comprehensive and structured inductionAn interesting and varied job as well as a dynamic one and open working atmosphere Overtime compensation and home office options A permanent employment contract and an attractive compensation package as well as modern IT equipment Don't you meet every requirement? No problem, feel free to apply anyway. We look forward to receiving your application! Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobile: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/sachbearbeiter-technischer-innendienst-raum-aachen-82279","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000,"original_language":"deu"},{"slug":"senior-project-manager-wurzburg-356411","company_name":"PlanerAI GmbH","title":"Senior Project Manager (m\/f\/d)","description":"PlanerAI, when software solution meets sustainability - we want to halve food waste in the retail sector within the next five years using artificial intelligence. How do we do that? Our strength is our unique team. We are AI experts, espresso lovers and team players! Our team spirit not only ensures the best solution for the end customer, but also sustainable cooperation, which makes PlanerAI a pleasant employer. Become part of our team and support us as a Senior project manager (m\/f\/d). We are a dynamic , fast-growing startup. With us you have the opportunity to shape your tasks based on your skills. That's why we encourage you to apply even if you don't quite meet some of the desired qualifications.TasksWe are tapping into a new market segment. That is why we are looking for someone who can support us in this expansion.External aspects of this position:Successfully manage test projects with major retail suppliers.Manage large-scale rollout of our planning solution.Provide continuous support and coordination.Build and maintain business relationships with additional local partners, distributors, retailers and other relevant players. Internal aspects of the role: Gathering, structuring and coordinating product requirements with the product team in line with the company's objectives Close exchange with management to integrate the project into the organization Optional\/medium term : Building a customer success team for the new vertical.RequirementsBachelor's or master's degree in a business administration field or equivalent+3 years of experience in project management, preferably in product introduction or in a similar environment.Demonstrated experience in building and maintaining customer relationships .Startup experience in an agile and rapidly changing environment.Analytical and technical insightVery good communication skills in written and spoken Dutch and English.German communication skills are a plusBenefits25 vacation days and 5 days of educational leave per year, which are at your free disposal, because we want to give you the opportunity for personal development!We take your individual life plan into account: You have the option to come to the office every day or work hybrid and arrange your working hours freely - we look forward to seeing you on your first working day at the office and at our monthly team eventWe work with trust-based working hours and a free organization of working time, within the possibilities of your position.We provide you with modern equipment (also for your home office) - you decide whether you prefer works with Mac or LenovoStructured onboarding tailored to your needs - your buddy looks forward to supporting you and making your start with us pleasantWe want to support you to take care of yourself according to your wishes and ideas and therefore offer you the option of a company pension schemeYour mental health is important to us. With our partner likeminded you have access to a platform where you can access various psychological offers at any time. Regular team events and team building - escape room, 3D mini golf, beer garden meetings, BBQs and much more... Together with you we want to be the leading becoming a planning solution for fresh food in Europe.What are you waiting for? Apply Now! - We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/planerai-gmbh\/senior-project-manager-wurzburg-356411","tags":["Remote","Project Management"],"job_types":["manager"],"location":"Würzburg","created_at":1702680542000,"original_language":"nds"},{"slug":"konstrukteur-creo-koln-cologne-376703","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Konstrukteur Creo (m\/w\/d) - Köln","description":"Talentscouts is a young, dynamic personnel agency. Our motto: IDEAL MATCH - enthusiasm for companies and candidates. Since 2017, our mission has been to bring engineers and technical experts together with the right companies. As a personnel service provider in the engineering sector, we are a strong partner for both companies and candidates. Our customers include well-known medium-sized companies and large international corporations from the plant engineering, mechanical engineering and automotive sectors. We are looking for a designer (m\/f\/d) at the Cologne location for one of our customers in the plant engineering sector. Tasks: You create concepts for the execution of Core Units and cost-effective designs of assemblies and components, taking into account the given specifications. You create engineering designs of machines, assemblies and components using 3D CAD (CREO). You carry out detailed technical calculations and analyzes of assemblies and components. You develop innovative ideas for new products within the Gas and Process Division.You work on the processes for implementation in all departmentsYou have no problem with occasional business tripsQualificationsYou have a bachelor's or master's degree in mechanical engineering or a similar qualification.You have experience in independent design or development work Use of 3D CAD software, ideally in CREO.Knowledge of SAP and PLM is desirable.You are capable of creative and unconventional thinking and willing to pursue new ideas.You are a team player and willing to work with other departments.You are Ready to familiarize yourself with the implementation of international standards for turbomachinery.You have good English skills.BenefitsResponsible and varied tasks at a constantly growing and innovative global market leader.In-depth, intensive familiarization with the field of work by a competent and motivated team.Professional and personal training opportunities through the company's own academy.Attractive canteen with a variety of dishes.Versatile employee benefits.Attractive Remuneration and social benefitsCapital-forming benefits30 days vacationIf this position suits you and sounds interesting to you, we look forward to receiving your application to:Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobile: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/konstrukteur-creo-koln-cologne-376703","tags":["Engineering"],"job_types":[],"location":"Cologne","created_at":1702680542000,"original_language":"deu"},{"slug":"project-manager-wurzburg-198","company_name":"PlanerAI GmbH","title":"Project Manager (m\/f\/d)","description":"PlanerAI, when software solution and sustainability come together - we want to halve food waste in the retail sector within the next five years with the help of artificial intelligence.How do we do that? Our strength is our unique team. We are AI experts, espresso lovers and team players! Our team spirit not only creates the best solution for the end customer, but also sustainable cooperation, which makes PlanerAI a pleasant employer.Become part of our team and support us as a Project Manager (m\/f\/d).We are a dynamic, fast-growing startup. With us, you have the opportunity to shape your tasks according to your skills.Therefore, we encourage you to apply, even if you do not quite meet some of the preferred qualifications.TasksWe are tapping into a new market segment. We are therefore looking for someone who can support us in this expansion.External aspects of this role:Successfully manage test projects with large retail suppliers.Manage large-scale roll-out of our planning solution.Provide and coordinate ongoing support.Establish and maintain business relationships with additional local partners, distributors, retailers and other relevant players.Internal aspects of the role:Collecting, structuring and coordinating product requirements with the product team in line with the company's objectivesClose exchange with the management to integrate the project into the organizationOptional\/medium-term: Build up customer success team for the new vertical.RequirementsBachelor's or Master's degree in a business degree program or equivalent+3 years of experience in project management, preferably in the introduction of products or in a similar environment.Proven experience in building and maintaining customer relationships.Startup experience or ability to work in an agile and rapidly changing environment.Analytical and technical understandingVery good communication skills in written and spoken Dutch and English.German communication skills are a plusBenefits25 vacation days and 5 days of educational leave per year, which are at your free disposal, because we want to give you the opportunity for personal development!We accommodate your individual life planning: You have the opportunity to come into the office every day or work hybrid and organize your working hours freely - we look forward to meeting you in our office on your first working day and at our monthly team eventWe work with trust-based working hours and free working time organization, within the possibilities of your roleWe provide you with modern equipment (also for your home office) - you decide whether you prefer to work with Mac or LenovoStructured onboarding tailored to your needs - your buddy is looking forward to supporting you and making your start with us a pleasant oneWe want to support you in providing for yourself according to your wishes and ideas and therefore offer you the option of a company pension schemeYour mental health is important to us. With our partner likeminded, you have access to a platform where you can access various psychological offers at any timeRegular team events and team building - escape room, 3D mini golf, beer garden meetings, BBQs and much more...A team that also likes to meet up after work for bouldering, CrossFit and pizza :)And of course perhaps the best espresso north of the AlpsTogether with you, we want to become the leading planning solution for fresh food in Europe.What are you waiting for? Apply now! - We look forward to receiving your applicationFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/planerai-gmbh\/project-manager-wurzburg-198","tags":["Remote","Project Management"],"job_types":["manager"],"location":"Würzburg","created_at":1702680542000,"original_language":"eng"},{"slug":"senior-project-manager-wurzburg-75786","company_name":"PlanerAI GmbH","title":"Senior Project Manager (m\/f\/d)","description":"PlanerAI, when software solution and sustainability come together - we want to halve food waste in the retail sector within the next five years with the help of artificial intelligence.How do we do that? Our strength is our unique team. We are AI experts, espresso lovers and team players! Our team spirit not only creates the best solution for the end customer, but also sustainable cooperation, which makes PlanerAI a pleasant employer.Become part of our team and support us as a Senior project manager (m\/f\/d).We are a dynamic, fast-growing startup. With us, you have the opportunity to shape your tasks according to your skills.Therefore, we encourage you to apply, even if you do not quite meet some of the preferred qualifications.TasksWe are tapping into a new market segment. We are therefore looking for someone who can support us in this expansion.External aspects of this role:Successfully manage test projects with large retail suppliers.Manage large-scale roll-out of our planning solution.Provide and coordinate ongoing support.Establish and maintain business relationships with additional local partners, distributors, retailers and other relevant players.Internal aspects of the role:Collecting, structuring and coordinating product requirements with the product team in line with the company's objectivesClose exchange with the management to integrate the project into the organizationOptional\/medium-term: Build up customer success team for the new vertical.RequirementsBachelor's or Master's degree in a business degree program or equivalent+3 years of experience in project management, preferably in the introduction of products or in a similar environment.Proven experience in building and maintaining customer relationships.Startup experience or ability to work in an agile and rapidly changing environment.Analytical and technical understandingVery good communication skills in written and spoken Dutch and English.German communication skills are a plusBenefits25 vacation days and 5 days of educational leave per year, which are at your free disposal, because we want to give you the opportunity for personal development!We accommodate your individual life planning: You have the opportunity to come into the office every day or work hybrid and organize your working hours freely - we look forward to meeting you in our office on your first working day and at our monthly team eventWe work with trust-based working hours and free working time organization, within the possibilities of your roleWe provide you with modern equipment (also for your home office) - you decide whether you prefer to work with Mac or LenovoStructured onboarding tailored to your needs - your buddy is looking forward to supporting you and making your start with us a pleasant oneWe want to support you in providing for yourself according to your wishes and ideas and therefore offer you the option of a company pension schemeYour mental health is important to us. With our partner likeminded, you have access to a platform where you can access various psychological offers at any timeRegular team events and team building - escape room, 3D mini golf, beer garden meetings, BBQs and much more...A team that also likes to meet up after work for bouldering, CrossFit and pizza :)And of course perhaps the best espresso north of the AlpsTogether with you, we want to become the leading planning solution for fresh food in Europe.What are you waiting for? Apply now! - We look forward to receiving your applicationFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/planerai-gmbh\/senior-project-manager-wurzburg-75786","tags":["Remote","Project Management"],"job_types":["manager"],"location":"Würzburg","created_at":1702680542000,"original_language":"eng"},{"slug":"die-prophezeiung-sagt-mach-lieber-datenbankadministration-mit-positivem-impact-werde-oracle-crack-bleib-mensch-lich-frankfurt-114265","company_name":"myTalentscout GmbH","title":"Die Prophezeiung sagt: Mach lieber Datenbankadministration mit positivem Impact - Werde Oracle Crack & bleib (M|E|N|S|C|H) -lich","description":"Weil ORACLE eben nicht nur ein Tempel in Griechenland, sondern hier im Norden von Frankfurt ein wichtiger Teil von erstklassigen, branchenfhrenden IT-Produkten ist.  ORACLE weckt auch bei dir Begeisterung und Lust auf die Administration von Datenbanken? Dann knnte diese Position der nchste Schritt auf dem Weg zum\/zur absoluten Oracle-Spezialisten\/-Spezialistin sein.  Die Vision: eine sicherere Welt. Von der Forschung ber die Software bis hin zu Netzwerken und Serversystemen erschaffen die Menschen in diesem Unternehmen Sicherheits-Komplettlsungen fr ihre Kund:innen.Aufgaben Stell dir vor, dein neuer Job ist ein wahrer Datenbanken Deepdive in einem Hochverfgbarkeitsumfeld. Deine Mission ist die Betreuung von Oracle 11g und 19c Datenbanken.  Bei der Planung von Datenbank-Neuinstallationen legst du mit deinem Knnen und deiner Kreativitt die Grundlagen.  Deine weitere Mission in der Datenwelt: Patches, Upgrades, Backup und Recovery, Monitoring, Reorganisation, Migration, Performance Tuning und Troubleshooting.QualifikationDamit deine Mission nicht impossible, sondern eine langfristige berufliche Erfllung ist, suchen wir Denker:innen mit folgenden Fhigkeiten:  ca. 3 Jahre Berufserfahrung in der Administration von Oracle Datenbanken Kenntnisse in Linux und AIX Administration Gute Deutsch- und Englischkenntnisse fr eine harmonische Teamkommunikation Wir suchen einen leidenschaftlichen Techmenschen mit einem offenen, kreativen Mindset, der gerne an Problemen tftelt und Interesse an der Erkundung neuer Technologien hat.BenefitsDas schlgt sich in den Rahmenbedingungen nieder. Schau doch mal, ob sie deinen Vorstellungen entsprechen:  Flexibilitt fr deinen Arbeitsalltag mit einer Hybriden Home-Office Lsung (ca. 50% Office + 50% HO) & Vertrauensarbeitszeit  Ein Einstiegsgehalt je nach deiner Erfahrung bis zu ca. 80.000  p.a.  Regelmige und\/oder individuelle Fortbildungen  wchentlicher Englischkurs und Tech-Talk  Arbeitgeberfinanzierte, betriebliche Krankenzusatzversicherung sowie Zuschuss zu VWL oder DV  Viele Teamevents und gemeinsame Sportveranstaltungen  Kinderbetreuungszuschuss von bis zu  200,- monatlich pro KindWas sagst du? Wollen wir gemeinsam Plne fr deine berufliche Zukunft schmieden? Einfach bewerben! Wir freuen uns dich kennenzulernen. Damit meine ich, wirklich kennenlernen!  Wir sind myTalentscout! Fr uns ist ein Lebenslauf mehr als nur ein Stck Papier!  Happy to connect!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/mytalentscout-gmbh\/die-prophezeiung-sagt-mach-lieber-datenbankadministration-mit-positivem-impact-werde-oracle-crack-bleib-mensch-lich-frankfurt-114265","tags":["Database Administration"],"job_types":["berufserfahren"],"location":"Frankfurt","created_at":1702680542000,"original_language":"eng"},{"slug":"controller-kaufmannische-angestellte-markdorf-487643","company_name":"WEBER FIBERTECH GMBH","title":"Controller\/Commercial Employee (m\/f\/d)","description":"Are you ready for a new challenge? Would you like to demonstrate your talent in an innovative and dynamic company? As a team, we work every day with heart and passion for our innovative technology. Because together we can create something meaningful for ourselves and your career. What more could you want?WEBER FIBERTECH GmbH is a constantly expanding company based in Markdorf on Lake Constance. We develop and produce long and continuous fiber-reinforced thermoplastic lightweight components based on our patented E-LFT process. Our employees work every day to further develop our technology. We take new paths, set new standards in the market and inspire our customers from different industries.TasksFurther development of the controlling of the entire companyResponsible and proactive support of the management in reportingProject controlling, commercial support of construction and development projectsProject results accounting, deviation analyses, project forecasts and creation of final calculationsPreparation and Evaluation of key figures for monthly reporting Participation in the preparation of the annual report Support of ongoing accounting Qualifications Completed bachelor's\/master's degree with a focus on controlling and finance. You have at least 2 years of professional experience in controlling Good SAP knowledge Precise independent working style combined with the highest level of accuracy Analytical thinking and structured way of working Team spirit, high commitment and FlexibilityGood knowledge of EnglishBenefitsFixed employment in a rapidly growing and family-friendly companyFamily-friendly working hours and 30 days of vacationTargeted promotion and further development of your skillsFlexible working hoursPerformance-related remunerationChallenging tasksFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/weber-fibertech-gmbh\/controller-kaufmannische-angestellte-markdorf-487643","tags":["Controlling"],"job_types":[],"location":"Markdorf","created_at":1702680542000,"original_language":"deu"},{"slug":"customer-success-account-managerin-berlin-73242","company_name":"Matera GmbH","title":"Customer Success - Account Manager*in","description":"In a nutshell: As an account manager, you've come to the right place if you want to help shape the development of the Customer Success Department. Work with us in Berlin in the office or flexibly hybrid, full-time. Start now or in the next 4 months.TasksYour role at Matera:Advice and support for your customersBuilding structures and processes together with the team and our country managerSmart automation of existing processesBuilding a knowledge base for recurring questionsQualificationsWhat you bring with you:You deal with problems Be creative and stick with it until you find the perfect solution. You enjoy contact with people. Initial experience with real estate, law or accounting is an advantage, but not necessary. You speak German at a very good level and can communicate confidently in English. At Matera we guarantee it Equal opportunities and diversity. Here you are as welcome as you are!BenefitsYour prospects:Remuneration of 37,500-45,000 plus attractive share options in the companyMatera Benefits: discounted membership for the Urban Sports Club, lunch vouchers and a monthly public transport subsidyWork independently with creative freedomParts of the learning curve in an up-and-coming SaaS Start-up ambitious team where fun is not neglected either:)Our mission:Our mission at Matera is to make apartment owners happy! With us you can manage your property yourself transparently and easily, thereby saving a lot of time and money. We have been active on the French market since 2017 and are already making the lives of more than 100,000 homeowners better every day. We also got off to a great start in Germany last year with an ambitious team. Would you like to tackle scaling the German market together with us? Then apply now!:)To get to know our team and get an impression of our culture, feel free to check us out on LinkedIn or Instagram!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/matera-gmbh\/customer-success-account-managerin-berlin-73242","tags":["Customer Service"],"job_types":["berufseinstieg"],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"kopie-von-example-it-systemadministrator-berlin-126487","company_name":"jemix GmbH","title":"Copy of example: IT system administrator (m\/f\/d)","description":"Your tasks THIS IS THE JOB: As part of #teamjemix, you will provide our customers with professional IT solutions in their day-to-day business and you will be the direct point of contact for our customers Processing tickets for day-to-day business Exciting IT projects make your working day varied Recording, maintaining and documenting the knowledge database Ensuring operations are more complex System environments of our customers During the application and getting to know process, we would like to work with you to find out which of our teams could become your potential home. The teams can be found in the areas of Helpdesk & Field Service, Network & Data Center, Device Management and Cloud Management.Your ProfileTHAT YOU BRING WITH YOU:Completed training in the IT sector or relevant practical professional experienceIT innovations inspire youMacOS and iOS are your passionIndependent working styleCommunication and teamwork skillsWhy us?These are your advantages:Current Apple equipmentAnnual team trip to MallorcaEmployer subsidy for company pension provisionUnlimited soft drinks, as well as coffee and fruitMobile workingWork location in MallorcaQualitrain: Access to over 5,000 fitness & spa offersKita subsidyPVN company ticketWe look forward to hearing from you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jemix-gmbh\/kopie-von-example-it-systemadministrator-berlin-126487","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"kopie-von-kopie-von-example-it-systemadministrator-berlin-154309","company_name":"jemix GmbH","title":"Copy of Copy of example: IT system administrator (m\/f\/d)","description":"Your tasks THIS IS THE JOB: As part of #teamjemix, you will provide our customers with professional IT solutions in their day-to-day business and you will be the direct point of contact for our customers Processing tickets for day-to-day business Exciting IT projects make your working day varied Recording, maintaining and documenting the knowledge database Ensuring operations are more complex System environments of our customers During the application and getting to know process, we would like to work with you to find out which of our teams could become your potential home. The teams can be found in the areas of Helpdesk & Field Service, Network & Data Center, Device Management and Cloud Management.Your ProfileTHAT YOU BRING WITH YOU:Completed training in the IT sector or relevant practical professional experienceIT innovations inspire youMacOS and iOS are your passionIndependent working styleCommunication and teamwork skillsWhy us?These are your advantages:Current Apple equipmentAnnual team trip to MallorcaEmployer subsidy for company pension provisionUnlimited soft drinks, as well as coffee and fruitMobile workingWork location in MallorcaQualitrain: Access to over 5,000 fitness & spa offersKita subsidyPVN company ticketWe look forward to hearing from you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jemix-gmbh\/kopie-von-kopie-von-example-it-systemadministrator-berlin-154309","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"example-it-systemadministrator-hamburg-242646","company_name":"jemix GmbH","title":"Example: IT-Systemadministrator (m\/w\/d)","description":"Your tasks THIS IS THE JOB: As part of #teamjemix, you will provide our customers with professional IT solutions in their day-to-day business and you will be the direct point of contact for our customers Processing tickets for day-to-day business Exciting IT projects make your working day varied Recording, maintaining and documenting the knowledge database Ensuring operations are more complex System environments of our customers During the application and getting to know process, we would like to work with you to find out which of our teams could become your potential home. The teams can be found in the areas of Helpdesk & Field Service, Network & Data Center, Device Management and Cloud Management.Your ProfileTHAT YOU BRING WITH YOU:Completed training in the IT sector or relevant practical professional experienceIT innovations inspire youMacOS and iOS are your passionIndependent working styleCommunication and teamwork skillsWhy us?These are your advantages:Current Apple equipmentAnnual team trip to MallorcaEmployer subsidy for company pension provisionUnlimited soft drinks, as well as coffee and fruitMobile workingWork location in MallorcaQualitrain: Access to over 5,000 fitness & spa offersKita subsidyPVN company ticketWe look forward to hearing from you!We look forward to your application! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jemix-gmbh\/example-it-systemadministrator-hamburg-242646","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Hamburg","created_at":1702680542000,"original_language":"deu"},{"slug":"spezialist-fur-technische-softwaretests-nuremberg-409759","company_name":"isento GmbH","title":"Specialist (m\/f\/d) for technical software testing","description":"Software testers don't destroy code, they destroy illusions about the code! (after James Bach) Do you see it the same way? Then we are looking for you as a specialist (m\/f\/d) for technical software testing. We testers at isento are realists; analysts; anarchists; creative; systematic; intuitive; curious; skeptical; methodical; communicative; always available for a pairing; beliefs and qualities; lifelong learners; technically fascinated; professionally interested; professional and above all: in a good mood because we love what we do! We are isento (Portuguese: free) and implement software projects from conception to rollout. As a specialist (m\/f\/d) for technical software testing, you support our projects with valuable and early feedback, sustainable test solutions and methodical excellence. You know that test code is not second-class code and can think like a developer ? If you also have knowledge of load testing, security testing or accessibility testing and would like to develop yourself further in all of these tasks, then we should get to know each other!TasksYour job at isentoTest automation: strategy, architecture, implementation, introduction and maintenance of automation solutions and QA of unit testsSupport with static code analysisConception and execution of load and performance tests, security tests or accessibility testsQualificationWhat you bring with youIn-depth programming and network knowledgeProject experience in test automationIn-depth knowledge in load and performance tests or security tests or accessibility testsKnowledge of relevant Tools and frameworks for the above-mentioned test typesISTQB: at least Foundation Level, Advanced Level Technical Tester would be idealBenefitsThis is isentoFlat hierarchies, flexible working hours and home office are no longer a unique selling point, but are part of a modern working culture for us. What else you can look forward to with us: We work as a team on equal terms. We practice open exchange, bring in our own initiative, new ideas and also constructive criticism. We learn from and with each other, develop together and celebrate together on our roof terrace. No matter whether it's beef or seitan steak, a couch potato or an adrenaline junkie, with a family, a cat or a cockatoo, we are a colorful team, we are isento! Join our team and bring in your individuality. We look forward to seeing you! What else do we offer? Visit our website or send us your application documents and we will get to know each other!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/spezialist-fur-technische-softwaretests-nuremberg-409759","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000,"original_language":"deu"},{"slug":"dein-neuer-traumjob-steuerfachwirt-in-hohr-grenzhausen-201724","company_name":"Tina Lehr Steuerberaterin","title":"Your new dream job - tax specialist (m\/f\/d) in Höhr-Grenzhausen!","description":"Are you looking for an appreciative and familiar working environment, exciting and national mandates and for developing yourself professionally and personally? Then our small law firm could offer you exactly what you are looking for. We, that's me Tina, Sabrina, Heike, Anita, Elke, Johanna and our bro, Josie, and we look forward to having you as a new team member. Tasks Our offer for you: Relax fully with 29 days of vacation. Not enough? Extend your vacation days indefinitely with the overtime you have saved. Continue your education and benefit from time off and reimbursement of costs, even if you are training to become an accountant or tax advisor. Team spirit: breakfast together every Friday, taking a deep breath with coffee breaks in the garden and regular team events. You have the freedom to choose: benefits in kind card , fuel voucher, subsidies for the gym or kindergarten as well as employer subsidies for retirement provisionQualifications What you bring with you: You have successfully completed your training as a tax specialist (m\/f\/d) You have enjoyed further training to become a tax specialist (m\/f\/d) or can imagine to continue your training You are basically at home in tax consulting and have already gained experience in a law firm.Benefits Summer = More free time. Work a little more in the winter so you can spend more time in the outdoor pool, park or your garden in the summer. Perfect conditions: Attractive brorums, lots of focus in two-person bros and including two monitors. Attention animal lovers: Our office dog Josie is looking forward to being with you to play in our garden and is always ready for long walks! Are you ready to become part of our small law firm family? Then send us your application to bewerbung (at) steuer-lehr. de cover letter is a thing of the past, just send us your CV or a link to your Xing or LinkedIn profile. If you have any questions beforehand, you can reach me on: 02624 \/ 9000 690Bonus for late readers: Should you take your tax advisor exam If you want to, a partnership is possible in the medium term. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/tina-lehr-steuerberaterin\/dein-neuer-traumjob-steuerfachwirt-in-hohr-grenzhausen-201724","tags":["Finance"],"job_types":[],"location":"Höhr-Grenzhausen","created_at":1702680542000,"original_language":"deu"},{"slug":"dein-neuer-traumjob-steuerberater-in-hohr-grenzhausen-239653","company_name":"Tina Lehr Steuerberaterin","title":"Your new dream job - tax consultant (m\/f\/d) in Höhr-Grenzhausen!","description":"Are you interested in a respectful and familiar working environment, exciting and national mandates and in developing yourself professionally and personally? Then our small law firm could offer you exactly what you are looking for. We, that's me Tina, Sabrina, Heike, Anita, Elke, Johanna and our bro, Josie, and we look forward to having you as a new team member. Tasks Our offer for you: Relax fully with 29 days of vacation. Not enough? Extend your vacation days indefinitely with the overtime you have saved. Continue your education and benefit from time off and reimbursement of costs, even if you are training to become an accountant or tax advisor. Team spirit: breakfast together every Friday, taking a deep breath with coffee breaks in the garden and regular team events. You have the freedom to choose: benefits in kind card , fuel voucher, subsidies for the gym or kindergarten as well as employer subsidies for retirement provisionQualifications What you bring with you: You have passed your tax advisor exam or are currently in the middle of preparation You are at home in tax advice and have already gained experience in a law firmBenefits summer = more free time. Work a little more in the winter so you can spend more time in the outdoor pool, park or your garden in the summer. Perfect conditions: Attractive brorums, lots of focus in two-person bros and including two monitors. Attention animal lovers: Our office dog Josie is looking forward to being with you to play in our garden and is always ready for long walks! Are you ready to become part of our small law firm family? Then send us your application to bewerbung (at) steuer-lehr. de cover letter is a thing of the past, just send us your CV or a link to your Xing or LinkedIn profile. If you have any questions beforehand, you can reach me on: 02624 \/ 9000 690Bonus for late readers: Should you take your tax advisor exam If you want to, a partnership is possible in the medium term. Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/tina-lehr-steuerberaterin\/dein-neuer-traumjob-steuerberater-in-hohr-grenzhausen-239653","tags":["Finance"],"job_types":[],"location":"Höhr-Grenzhausen","created_at":1702680542000,"original_language":"deu"},{"slug":"working-student-marketing-munich-410018","company_name":"Magazino GmbH","title":"Working Student (f\/m\/x) Marketing","description":"Your tasksYou will help plan, conceptualize and execute all digital marketing activities, e.g. paid advertising (LinkedIn, Google) and organic postingsYou will work closely with our Sales & Marketing team to find the best approach to reach potential customersHelping to create content and graphics for our website and social mediaYou keep our Customer Relations Management (CRM) system up to dateYou support and actively participate in the organization of customer events and trade fairsRequirementsYou are currently studying and are interested in marketing, communication or something similarYou like social media and marketing and, of course, for robotsYou are fluent in German and have a good command of English to communicate successfully with internal and external stakeholdersYou get an extra smile from us if ...o ... you understand the principles of digital advertising and have experience with cost-per-click (CPC) campaignso ... you are familiar with some CRM, photo and video editing programs (e.g. Wordpress, Canva, HubSpot)  Important: As a working student (f\/m\/x) you have at least 15 hours per week or 6 months as an intern (f\/m\/x)!What we have to offerCutting-edge technology: As pioneers in robotics we are able to navigate and manipulate without rails and guides and offer solutions to processes that no one could automate ever before!Team: We are an international team with more than 25 nationalities. Youll work in a team with exceptionally smart, humble, collaborative and hardworking individuals.Culture: Come as you are! Join a vibrant, inventive, and diverse team that values collaboration over hierarchy. To innovate you need to fail from time to time  we always learn and improve.Workplace: Our office is located near the SBahn station Hirschgarten. We work in a loft-style office with great equipment, our own workshop and testing area.Full Board: You dont feel like thinking about what you want to have for lunch tomorrow, not to mention preparing it? Luckily, our french cook treats us with a freshly cooked free lunch everyday! And as the cherry on top, there is a packed fridge with drinks, fresh fruits and of course coffee!Flexibility: Flexibility is a top priority for us. Our hybrid working model for positions where presence is dispensable helps to achieve a healthy work-life balance.Benefits: We offer attractive holiday, health care, and compensation packages. Learn more about our current benefits here.At Magazino fostering inclusivity is our top priority. We are dedicated to create an inclusive environment for all candidates and provide equal opportunities to all qualified applicants regardless of gender, ethnicity, age, national origin, sexual orientation, culture, or education. If you need any reasonable adjustments to make the application process accessible for you, well do our best to accommodate you. Feel free to approach us for that!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/magazino-gmbh\/working-student-marketing-munich-410018","tags":["Marketing and Communication"],"job_types":["Internship","no experience required \/ student"],"location":"Munich","created_at":1702680542000,"original_language":"eng"},{"slug":"werkstudent-praktikant-marketing-munich-324964","company_name":"Magazino GmbH","title":"Working student\/intern (f\/m\/x) Marketing","description":"Your tasksYou will help with the planning, conception and implementation of all digital marketing activities, e.g. B. paid advertising (LinkedIn, Google) and organic postingsYou work closely with our sales & marketing team to find the best approach to reach potential customersYou help create content and graphics for our website and social mediaYou manage our customer relations State-of-the-art management (CRM) systemYou support the organization of customer events and trade fairs and actively participate in themYour profileYou are currently studying and are interested in marketing, communication or similarYou have fun and passion for social media and marketing and of course also for robotsYou speak Fluent in German and have good English skills to communicate successfully with internal and external stakeholders You will get an extra smile from us if you understand the principles of digital advertising and have experience with cost-per-click (CPC) campaigns You have familiarized yourself with some CRM, You are familiar with photo and video editing programs (e.g. Wordpress, Canva, HubSpot)Important: As a working student (f\/m\/x) you have at least 15 hours per week or 6 months as an intern (f\/m\/x)!What we offerTop technology: As Pioneers in robotics, we are able to navigate and manipulate without rails and guidelines, providing solutions for processes that no one has ever been able to automate before!Team: We are an international team with more than 25 nationalities. You will work in a team with very smart, humble, cooperative and hard-working people. Culture: Just be yourself! Become part of a dynamic, innovative and diverse team that values ​​collaboration over hierarchy. To be innovative, you have to fail every now and then - we are constantly learning and improving.Workplace: Our office is near the \"Hirschgarten\" S-Bahn station. We work in a loft-style office with great facilities, our own workshop and testing area.Full catering: Don't feel like thinking about what you want to have for lunch tomorrow, let alone preparing it? Luckily, our French chef treats us to a freshly cooked free lunch every day! And the icing on the cake is a full fridge with drinks, fresh fruit and of course coffee! Flexibility: Flexibility is very important to us. Our hybrid working model for positions where attendance is not necessary contributes to a healthy work-life balance. Benefits: We offer attractive vacation, health and compensation benefits. Find out more about our current benefits here. At Magazino, promoting inclusivity is very important to us. We therefore strive to create an inclusive environment for all candidates (f\/m\/x) and offer equal opportunities to all qualified applicants regardless of gender, ethnicity, age, national origin, sexual orientation, culture or education. If you require certain adjustments to make the application process accessible to you, we will do our best to accommodate you. Feel free to talk to us about it!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/magazino-gmbh\/werkstudent-praktikant-marketing-munich-324964","tags":["Marketing and Communication"],"job_types":["Internship","hilfstätigkeit \/ student"],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"systemadministrator-nuremberg-334685","company_name":"isento GmbH","title":"Systemadministrator (m\/w\/d)","description":"Du suchsteine Stelle, bei der du Verantwortung bernimmst und die Mglichkeit hast, Neues zu lernen und Dich weiterzuentwickeln.ein Unternehmen, das auf Langfristigkeit ausgerichtet ist, Kommunikation auf Augenhhe frdert, und wo Wertschtzung und offener Austausch einen hohen Stellenwert habenein Umfeld, in dem Du aktiv mitgestalten kannst, um positive Vernderungen voranzutreibenber isento: YES zu Kompetenz und Leidenschaft!Wir sind isento (portugiesisch: frei) und realisieren IT-Projekte in Nrnberg von der Konzeption bis zum Rollout. Als Systemadministrator (m\/w\/d) bist Du ein wertvolles Mitglied unseres Teams und untersttzt uns bei der Verwaltung und Wartung von Linux- und Windows-Systemen. Auerdem bernimmst du die Verantwortung fr die Sicherstellung der reibungslosen Funktion unserer IT-Systeme und -Netzwerke.AufgabenDas erwartet dich bei isentoInstallation, Administration und Wartung von Linux- und Windows-Servern und -ClientsKonfiguration und Betrieb von Applikationen fr Softwareentwicklung, wie Jenkins, GitLab, SonarQube etc., sowie Integration mit anderen ApplikationenVerwaltung von Active Directory (AD) und LDAP zur Authentifizierung und Autorisierung von BenutzernKontinuierliche Optimierung und Weiterentwicklung der IT-Infrastruktur sowie der IT-SicherheitIdentifizierung und Lsung technischer Probleme sowie die Untersttzung von internen Fachabteilungen und Mitwirkung an IT-ProjektenQualifikationDas bringst Du mitAbgeschlossenes Studium im Bereich Informatik \/ Berufsausbildung zum Fachinformatiker (m\/w\/d) Systemintegration oder eine vergleichbare QualifikationMehrjhrige Erfahrung in der Administration von Linux- und Windows-SystemenFundierte Kenntnisse in Active Directory, LDAP und Identity ManagementGute Kenntnisse in der Netzwerktechnologie (TCP\/IP, DNS, DHCP)Idealerweise Erfahrung in den Bereichen Cloud-Services, Datenbankanwendungen und Netzwerktechnik, sowie Applikationen zur Untersttzung der SoftwareentwicklungsprozesseFhigkeit, Probleme selbststndig zu lsen und effektiv in einem Team zu arbeitenAusgezeichnete Kommunikationsfhigkeiten in Deutsch sowie gutes EnglischBenefitsWas wir bieten?Obstkorb und Getrnkeflat  klar. Auf was du dich bei isento aber wirklich freuen kannst:Wir arbeiten als Team auf Augenhhe. Wir leben den offenen Austausch, bringen Eigeninitiative, neue Ideen, aber auch konstruktive Kritik ein. Wir lernen von- und miteinander, entwickeln uns zusammen weiter und feiern gemeinsam auf unserer Dachterrasse. Egal ob Rinder- oder Seitansteak, Couchpotato oder Adrenalinjunkie, mit Familie, Katze oder Kakadu  wir sind ein buntgemischtes Team, wir sind isento!Komm in unser Team und bringe Deine Individualitt ein. Wir freuen uns auf Dich!Was wir sonst noch bieten? Besuche unsere Website oder schicke uns Deine Bewerbungsunterlagen und wir lernen uns kennen!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/systemadministrator-nuremberg-334685","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000,"original_language":"eng"},{"slug":"cobol-entwickler-refnr-41185-munich-409983","company_name":"Q-Perior","title":"Cobol Entwickler (m\/w\/d) (Ref.Nr.: 41185)","description":"Fr unseren Kunden in Dsseldorf suchen wir einen Cobol Entwickler (m\/w\/d).  Key FactsStart: 01.04.2024Dauer: 12 Monate \/ + VerlngerungsoptionAuslastung: 100 %Einsatzart: ArbeitnehmerberlassungEinsatzort: RemoteEinsatzland: DeutschlandIhre Aufgaben Zur Aufrechterhaltung des Betriebs einer abzulsenden Anwendung wird Untersttzung in der COBOL Anwendungsentwicklung gesucht.  Muss-Anforderungen Mehrjhrige Berufserfahrung in der Anwendungsentwicklung im IBM Grorechnerumfeld (z\/OS) Sehr gute Kenntnisse in COBOL, JCL und IMS DC Tiefgehende Kenntnisse im Umgang mit relationalen Datenbanken, insbesondere DB2 Verbindliches Auftreten und Verhandlungsgeschick sowie eine schnelle Auffassungsgabe Flexibilitt und Offenheit bei sich verndernden Rahmenparametern grundstzlich gutes technisches\/architekturelles Verstndnis inkl. Testprozesse\/-vorgehen Erfahrungen im Versicherungsumfeld wren vorteilhaft  Weitere InformationenCOBOL, IBM, DB2  ber unsEs ist unser Anspruch als Business- und IT-Beratung, erstklassige Leistung und hchste Qualitt fr unsere Kunden zu erbringen. Daher steht Q fr Qualitt und _PERIOR, abgeleitet aus superior, unterstreicht, dass wir alles dafr tun, erstklassige Ergebnisse fr unsere Kunden zu liefern. Wir bieten Partnerunternehmen und Freelancern (m\/w\/d) umfassende Perspektiven innerhalb unserer eigenen Projekte und untersttzen unsere Kunden als langjhriger Rahmenvertragspartner bei der Besetzung von Projektvakanzen  zeitnah und direkt.  Wir freuen uns auf Ihre Kontaktaufnahme!  Ihr direkter Ansprechpartner bei Q_PERIORElma AbdagicTelefon: +49 89 455 99 282E-Mail: Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/q-perior\/cobol-entwickler-refnr-41185-munich-409983","tags":["Remote","Software Development"],"job_types":["Interim","berufserfahren"],"location":"Munich","created_at":1702680542000,"original_language":"eng"},{"slug":"vp-of-sales-berlin-55303","company_name":"Lumiform","title":"VP of Sales","description":"Lumiform, founded in 2019, is one of the fastest-growing software startups based in Berlin. We operate globally, and over 50,000 organizations across 201 countries use our innovative Lumiform platform - and this is just the beginning .We have already secured 8 million in investment, are currently in the Series-A stage, and are backed by Germany's Tier 1 SaaS investors Capnamic and 42CAP. Our mission is to unleash the full potential of frontline teams, eliminate operational inefficiencies, reduce costs, and drive a new era of collaboration and automation in frontline teams.We seek a dynamic VP Sales to optimize our successful inbound funnel of 4,000 monthly signups by refining our pipeline structure and segmentation. Your role includes rapidly introducing new sales channels, such as outbound and channel sales, and spearheading our transition from towards increasing ACVs.Your approach should be hands-on, directly engaging in sales activities while also applying a strategic mindset to swiftly establish clear, efficient structures. You will play a key role in coaching our sales team, leveraging your extensive experience in SaaS and hands-on team leadership.Reporting directly to the CEO, you will be instrumental in aligning our sales strategies with overall company goals. Your expertise will drive sales performance and shape our sales teams development and success.TasksSales Leadership & Team Management:Direct a team of 3 SDRs and 3 Account ExecutivesDevelop and execute a sales strategy targeting key regions: DACH, Western Europe, Latin America, and the US.Monitor team and individual performance against quotas.Provide regular feedback and coaching sessions to enhance team output.Lead recruitment of new sales talent.Hands-On Sales Activities:Close high-value accounts and oversee negotiations.Deliver tailored product demos to potential clients.Lead in RFP submissions.Sales Strategic Development:Refine the inbound sales process to make it scalable and repeatable.Collaborate with marketing, customer success, and product for aligned strategies.Design and launch new channels like an outbound motion or partnerships.Offer precise monthly and quarterly sales forecasts.Sales Team Building, Training & Development:Recruit, hire, and onboard new salespeople as needed.Equip the team with comprehensive product knowledge.Coach the team on Lumiform's USPs for a compelling sales pitch.Arrange training to enhance sales and product expertise.Performance Metrics and Analysis:Define key sales KPIs and regularly review them.Use data to analyze sales performance and make adjustments as necessary.Stakeholder Communication & Management:Regularly update the CEO, board, and other stakeholders on sales progress, challenges, and strategies.Participate in board meetings or investor relations as the face of sales.Requirements8+ years experience in sales, preferably in a B2B SaaS environment.Proven experience in managing a sales team of at least five people.You work together with your team members in our office in Berlin.Perfect English and German skills (native speaker level).Demonstrated ability to meet or exceed sales quotas.Proficient in CRM software, preferably Hubspot and Salesforce.Exceptional negotiation and closing skills.Strong analytical and team management skills.Excellent verbal and written communication abilities.BenefitsCompetitive salary with team-performance-based bonuses.Opportunity to be a key player in a rapidly growing SaaS company.Option to get an attractive virtual share package.We care about your personal & professional development. You will receive an annual learning budget for books, courses, conferences, etc.; some hours per week are reserved for learning new skills.You are also welcome to work from our beautiful and bright pet-friendly office in the heart of Berlin where we have fresh fruits, free drinks, good coffee and several cafs and restaurants of almost every origin close by.Annual meet-up in Berlin for a week (The Lumi-Week) with all employees where we have workshops, team events, drinks, delicious food, and good talks.Urban Sports Club or Benefitsy membership.Join a team of 15 nationalities (>35 employees) and various backgrounds. We ensure you have regular contact with everybody and are updated on the company's progress.Join us at our rapidly growing startup, where we take pride in achieving double-digit growth month after month.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/lumiform\/vp-of-sales-berlin-55303","tags":["Management","Team Leader"],"job_types":["manager"],"location":"Berlin","created_at":1702680542000,"original_language":"eng "},{"slug":"key-account-manager-hamburg-119849","company_name":"Pulse Advertising GmbH","title":"(Key) Account Manager (m\/w\/d)","description":"Are you a professional when it comes to expanding customer relationships and love creative content? Sales pitches, project management and reporting make your heart beat faster? Do you enjoy positioning your customers in the best possible way on the digital market and do you know what key figures are needed to evaluate the success of a social media campaign? Then you are the perfect match for our ambitious accounts team!TasksYou are responsible for supporting, advising and strategically expanding our customersYou independently prepare sales pitches and carry them out in front of our customersYou create reports and project evaluations and analyze them for potentialYou identify as well as develop new sales strategies and optimize project processes, qualification-driven. Passionate. Various. Equal. These are qualities that you value. You have already gained over 4 years of professional experience in sales or customer support and consulting. You enjoy creating calculations and reports in order to optimize and actively advance processes based on them. You are an absolute team player, have strong communication skills and are fluent in German EnglishBenefitsWork from any of our offices worldwide: Have you always wanted to go to Paris, London, Milan, Hamburg or Berlin? Then pack your bags and work from one of our international locations! Business & Executive Coaching: We are happy to see you develop further and offer you individual individual or team workshops Worldwide meetings: Lets connect! At our global team events we come together to learn from each other and celebrate our successesHybrid & flexible working options: Want a change? No problem! With us you have the opportunity to work flexibly remotely two days a week. Central office locations: short commutes guaranteed! Our offices are all located in the middle of urban hotspots. Dogs are welcome here: animal motivation and cuddle factor included! Your four-legged friend is welcome in our officesFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/pulse-advertising-gmbh\/key-account-manager-hamburg-119849","tags":["Marketing and Communication"],"job_types":[],"location":"Hamburg","created_at":1702680542000,"original_language":"deu"},{"slug":"it-anwendungsspezialist-offenbach-6205","company_name":"univativ GmbH","title":"IT application specialist (m\/f\/d)","description":"As soon as possible, long-term, in permanent position | 40 hours per week | Offenbach am Main | Finance | Experienced professional | 80,000 to 100,000 per year | Project ID P202344873_2Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. As a computer scientist (m\/f\/d), do you impress with your creativity and specialist knowledge? Do you find programming individual software solutions as exciting as creating test environments? If you are familiar with C# and Java, working for our customer is exactly the right thing for you! Tasks Design, adaptation and development of extensions for an existing system, based on standard software for controlling and managing the cover assets of a credit institution (TXS) Ensuring the Compliance with internal regulations regarding IT security and compliance 3rd level support Control of external service providers Advice to departments on the conception and further development of systems Qualifications University degree (computer science or scientific-technical course of study) Experience in a similar area of ​​responsibility Good knowledge of software development (e.g. C# or JAVA) Ideally Also knowledge of working under z\/OSEA good technical understandingStructured way of workingAnalytical and conceptual thinkingHigh level of commitmentVery good knowledge of German and English (spoken and written)BenefitsAn annual salary between 80,000 and 100,000 A permanent position directly with our customerOur customer offers: The opportunity to work 50% from home to work, health and fitness courses, company pension scheme, individual development opportunities, flexible working hours We were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/it-anwendungsspezialist-offenbach-6205","tags":["IT"],"job_types":[],"location":"Offenbach","created_at":1702680542000,"original_language":"deu"},{"slug":"junior-consultant-requirements-engineering-nuremberg-471255","company_name":"isento GmbH","title":"Junior Consultant (m\/w\/d) Requirements Engineering","description":"You are looking for a company that passionately promotes innovation and offers you the opportunity to actively contribute to it. a team of like-minded people who are not only colleagues, but also sources of inspiration who challenge and encourage you every day. a working environment that respects the balance between work and private life, allows flexible working hours and offers you space for your personal development. About isento: YES to competence and passion! We are isento (Portuguese: free) and implement IT projects in Nuremberg from the Conception to rollout. We analysts are united by a passion: understanding what people really need. Our motto: Develop products that inspire! And we want to do that together. As a Junior Requirements Engineer (m\/f\/d) you will be involved in the design and development of software systems that impress our customers.TasksYour job at isentoYou will acquire knowledge and skills in requirements determination and system analysis, accompanied by a committed team.You Take on your first independent tasks and actively participate in real projects, always with an experienced mentor at your side. You proceed in a structured and systematic manner in order to precisely record requirements and understand customer needs. You support agile development teams and acquire practical knowledge of agile frameworks. In You play a key role in your team in identifying diverse customer wishes and user needs.QualificationsWhat you bring with youYou have completed training or a degree. If not, just convince us with your empathy, your analytical thinking and your commitment. We don't just count on traditional methods. Although knowledge of computer science is an advantage, we are also open to those who are willing to familiarize themselves with technical contexts.IREB -Certificate: If you already have it, great! If not, we will support you in getting started and accompany you on the way to becoming an expert.Experience in requirements engineering would be nice, but is not a mandatory requirement.You speak German very well, but English is no problem for you either.BenefitsThat's it isentoFlat hierarchies, flexible working hours and home office are no longer a unique selling point, but are part of a modern working culture for us. What else you can look forward to with us: We work as a team on equal terms. We practice open exchange, bring in our own initiative, new ideas and also constructive criticism. We learn from and with each other, develop together and celebrate together on our roof terrace. No matter whether it's beef or seitan steak, a couch potato or an adrenaline junkie, with a family, a cat or a cockatoo, we are a colorful team, we are isento! Join our team and bring in your individuality. We look forward to seeing you! What else do we offer? Visit our website or send us your application documents and we will get to know each other!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/junior-consultant-requirements-engineering-nuremberg-471255","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000,"original_language":"deu"},{"slug":"teamleiter-umwelt-genehmigung-und-managementsysteme-berlin-86771","company_name":"Personalas GmbH","title":"Teamleiter (m\/w\/d) Umwelt, Genehmigung und Managementsysteme","description":"Wir suchen fr ein fhrendes Beratungs- und Ingenieurbro in Berlin einen Teamleiter (m\/w\/d) fr den Bereich Umwelt, Genehmigung und Managementsysteme. (Alternativ auch fr den Bereich Arbeitsschutz und Anlagensicherheit.)Das bekommen Sie geboten:+ Unbefristetes Arbeitsverhltnis, in Festanstellung+ 75k bis 120k Jahresbrutto, je nach Expertise+ Sonderzahlungen \/ Prmien+ 30 Urlaubstage+ Ausgewogene Work-Life-Balance, durch flexible Vertrauensarbeitszeit+ Home-Office-Mglichkeiten (2 Tage \/ Woche)+ gefrderte Fort- und Weiterbildungsmglichkeiten + Firmenwagen (AUDI A4), auch privat nutzbar+ Bahncard 25 (1. Klasse), auch privat nutzbar+ Jobrad, Betriebliche Altersvorsorge, betriebliches Gesundheitsmanagement (Massagen, Fitnessprogramm), regelmige Teamevents uvm...AufgabenWas tun Sie dafr:+ operative Fhrung und Entwicklung der Teammitglieder+ Bearbeiten und Fhren von Projekten im Bereich Umwelt, Genehmigung, sowie Managementsysteme+ interne Prozessoptimierungen, sowie externe Prsentation des UnternehmensQualifikationWas bringen Sie mit:+ ein abgeschlossenes (naturwissenschaftliches) Studium oder vergleichbare Berufserfahrung+ mehrjhrige Projekterfahrung im Bereich immissionsschutzrechtliche Genehmigungsverfahren und\/oder Managementsysteme+ sicherer Umgang mit komplexen und multiplen Projekten+ idealerweise erste FhrungserfahrungKlingt das interessant fr Sie? Dann kontaktieren Sie uns Montag  Freitag von 08:00  20:00 Uhr: 030 12 37 36 21PS : Die Vermittlung ist fr Sie als Bewerber immer kostenfrei. Sie bentigen keinen Vermittlungsgutschein. Es handelt sich hierbei um ein Direktvermittlungsangebot. Das Arbeitsverhltnis schlieen Sie mit dem Auftraggeber.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/personalas-gmbh\/teamleiter-umwelt-genehmigung-und-managementsysteme-berlin-86771","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Berlin","created_at":1702680542000,"original_language":"eng"},{"slug":"kaufmannischer-mitarbeiter-in-teilzeit-nuremberg-125236","company_name":"isento GmbH","title":"Commercial employee (m\/f\/d) part-time","description":"You are looking for a position in which you can fully develop your skills in different tasks. an environment where you are not just a cog in the wheel, but can actively advance issues. an employer who offers you the opportunity to plan your time individually and take advantage of the flexibility of a part-time position. About us: We are isento (Portuguese: free) and realize IT projects in Nuremberg from conception to rollout. As a commercial employee (m\/f\/d), you are the key to our smooth processes and can be involved in various areas such as HR, controlling, sales and more. In this way, we offer you the opportunity to grow both personally and professionally and to continuously develop yourself.TasksYour job at isento:Updating and maintaining the project portalsImplementation and regular maintenance of forecastsEvaluation of remaining vacation, sick days, time accounts and overtime for efficient resource planningSupport with maintenance in knowledge managementPossibility to work in the areas of marketing and recruitingAnalysis of sales data and participation in sales campaigns and campaignsEvaluation of cooperation opportunities with new partners and customersQualificationsWhat you bring with you:Professional experience you have already gained, regardless of your specialist area, is valuable to us. What counts here is your skills and your commitment!Good ones Excel skills and the ability to do things efficiently (Getting Things Done mentality) Proactive and attentive way of working, combined with a quick comprehension Enjoyment of the office: an additional plus if you protect an animal-friendly working environment Good knowledge of German and English Benefits What we offer? Flat hierarchies , flexible working hours and home office are no longer a unique selling point, but are part of a modern working culture for us. What else you can look forward to with us: We work as a team on equal terms. We practice open exchange, bring in our own initiative, new ideas and also constructive criticism. We learn from and with each other, develop together and celebrate together on our roof terrace. No matter whether it's beef or seitan steak, a couch potato or an adrenaline junkie, with a family, a cat or a cockatoo, we are a colorful team, we are isento! Join our team and bring in your individuality. We look forward to seeing you! What else do we offer? Visit our website or send us your application documents and we will get to know each other!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/kaufmannischer-mitarbeiter-in-teilzeit-nuremberg-125236","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000,"original_language":"deu"},{"slug":"physiotherapeut-als-fuhrungskraft-zielgehalt-50400-eur-dortmund-5347","company_name":"Jarl Skand Personalberatung GmbH","title":"Physiotherapist as manager (m\/f\/d): Target salary €50,400","description":"What fire once led you to physiotherapy? For us, the individual care of our patients is our focus and we are looking for an inspiring personality who will enrich our practice in Dortmund with passion and professional expertise and lead the way as a leader. Tasks Your responsibility: You lead and shape it Team to ensure the highest quality of patient care. Carefully analyze imbalances and pain to develop tailored therapy plans and maximize treatment outcomes. Actively lead the journey to recovery, continually optimize plans and celebrate successes with patients and team. Document accurate treatment histories, Progress and healing processes to ensure comprehensive follow-up.QualificationsYour DNA as a leader:Your passion for physiotherapy is contagious and inspiring.Both patients and colleagues appreciate your empathy and sensitive demeanor.You are a driving force in teamwork and encourage creativity Ideas.BenefitsOur offers to you as a manager:Attractive target salary: 50,400 euros Organization of your working hours: We offer flexible options and the possibility of a 4-day week.Career prospects: Lead as a manager or take full advantage of the company's advantages as a freelancer.Supporting team: Our reception offers professional support to optimize the patient experience.Individual scheduling: Plan your working hours and vacation days via our internal app.Work efficiently: Longer treatment times for maximum results.Your development: We invest in your training and promote your professional development.Comfort and Modern: Use state-of-the-art practice rooms, spacious training areas and innovative equipment. Balanced balance: Generous changing times and space for spontaneous breaks promote your work-life balance. Ready to live your passion for physiotherapy as an inspiring leader? I'm looking forward to your application !You can reach me like this: by email: karriere (at) physioforlife . net by phone: 0231 58 06 75 83 by WhatsApp: 0175 20 52 182 I would be happy to take enough time to answer your questions and get to know you over a freshly brewed cup of coffee. Many GreDein SamiFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jarl-skand-personalberatung-gmbh\/physiotherapeut-als-fuhrungskraft-zielgehalt-50400-eur-dortmund-5347","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Dortmund","created_at":1702680542000,"original_language":"deu"},{"slug":"physiotherapeut-als-fuhrungskraft-in-dortmund-leite-mit-leidenschaft-199764","company_name":"Jarl Skand Personalberatung GmbH","title":"Physiotherapist as a manager (m\/f\/d) in Dortmund: Lead with passion","description":"What fire once led you to physiotherapy? For us, the individual care of our patients is our focus and we are looking for an inspiring personality who will enrich our practice in Dortmund with passion and professional expertise and lead the way as a leader. Tasks Your responsibility: You lead and shape it Team to ensure the highest quality of patient care. Carefully analyze imbalances and pain to develop tailored therapy plans and maximize treatment outcomes. Actively lead the journey to recovery, continually optimize plans and celebrate successes with patients and team. Document accurate treatment histories, Progress and healing processes to ensure comprehensive follow-up.QualificationsYour DNA as a leader:Your passion for physiotherapy is contagious and inspiring.Both patients and colleagues appreciate your empathy and sensitive demeanor.You are a driving force in teamwork and encourage creativity Ideas.BenefitsOur offers to you as a manager:Attractive target salary: 50,400 euros Organization of your working hours: We offer flexible options and the possibility of a 4-day week.Career prospects: Lead as a manager or take full advantage of the company's advantages as a freelancer.Supporting team: Our reception offers professional support to optimize the patient experience.Individual scheduling: Plan your working hours and vacation days via our internal app.Work efficiently: Longer treatment times for maximum results.Your development: We invest in your training and promote your professional development.Comfort and Modern: Use state-of-the-art practice rooms, spacious training areas and innovative equipment. Balanced balance: Generous changing times and space for spontaneous breaks promote your work-life balance. Ready to live your passion for physiotherapy as an inspiring leader? I'm looking forward to your application !You can reach me like this: by email: karriere (at) physioforlife . net by phone: 0231 58 06 75 83 by WhatsApp: 0175 20 52 182 I would be happy to take enough time to answer your questions and get to know you over a freshly brewed cup of coffee. Many GreDein SamiFind jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jarl-skand-personalberatung-gmbh\/physiotherapeut-als-fuhrungskraft-in-dortmund-leite-mit-leidenschaft-199764","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Dortmund","created_at":1702680542000,"original_language":"deu"},{"slug":"sap-mm-experte-fur-unternehmensweite-s-4hana-neueinfuhrung-hamburg-84668","company_name":"Connecting Dots GmbH & Co. KG","title":"SAP MM - Experte (m\/w\/d) für unternehmensweite S\/4Hana Neueinführung","description":"Fr unseren Kunden in Hamburg suchen wir einen SAP MM Inhouse Consultant S\/4HANA (m\/w\/d) zur Festanstellung. Das Unternehmen beschftigt rund 1.000 Mitarbeiter und ist in der Logistikbranche ttig. Da die IT-Landschaft neu aufgebaut und modernisiert werden soll, wird also eine Position erffnet, welche unter anderem die Greenfield SAP Einfhrung und den Neuaufbau von SAP beinhaltet. Fr die Position sollten mindestens sehr gute Deutsch und Englischkenntnisse, sowohl in Wort als auch in Schrift, vorhanden sein. Der grte Teil der Arbeit kann im Homeoffice verrichtet werden, jedoch sollte der Lebensmittelpunkt in oder um Hamburg liegen oder dorthin verlagert werden, da mindestens 7 Tage im Monat vor Ort gearbeitet werden soll.AufgabenDu bist fr die Umstellung der Warenwirtschaft (MM) auf SAP S\/4HANA hauptverantwortlich und bernimmst gleichzeitig die Betreuung der Vorarbeiten zur Gestaltung des Systems. Der Aufbau der SAP-Landschaft (klassisch Greenfield) und die Einfhrung von SAP MM spielen dabei die zentrale Rolle. Das wird ein Projekt fr die nchsten zehn Jahre werden.  Die Zusammenarbeit mit anderen Fachbereichen, um beispielsweise State-of-the-Art Lsungen zu finden, fllt ebenfalls in deinen Aufgabenbereich.  Das Dokumentieren und Bereitstellen deines Wissens gehren ebenso zu deinen Aufgaben, wie auch die Untersttzung deiner Kollegen, zum Beispiel bei Trainings oder Workshops. Bei allen technischen Fragestellungen rund um SAP MM bist du erster technischer Ansprechpartner.QualifikationDu hast ein abgeschlossenes Studium im Bereich der Informatik und bringst mehrjhrige Berufserfahrung in dieser oder einer vergleichbaren Position mit. Auch solltest Du dich bestens mit SAP S\/4HANA auskennen sowie sehr gute kommunikative Fhigkeiten besitzen.  Der Aufbau von SAP-Landschaften sollte fr dich kein Problem darstellen, da dies den grten Teil deiner Arbeit ausmacht. Da Du Teil eines neuen Teams bist, solltest du ebenfalls Spa an der Arbeit mit und innerhalb eines Teams haben. Erfahrung in Modellierung und der Prsentation von komplexeren Sachverhalten hast du im besten Fall auch, da auch dies Themen in deinem Aufgabenbereich sind. Durch den Freiraum in der Mitgestaltung der Umstellung, ist ein kreatives und tiefes Prozessverstndnis gerne gesehen.BenefitsUnser Kunde bietet seinen Mitarbeitern eine groe Menge an verschiedenen Benefits. Neben einer 38,5 Stunden Woche als Vollzeitarbeitsplatz, bietet das Unternehmen die Mglichkeit ungefhr 75% der Arbeit im Homeoffice zu erledigen. Es wird ein attraktives Gehaltspaket geboten, welches mit tariflichen und weiteren Zusatzleistungen, wie beispielsweise 30 Tage Urlaub, Urlaubs- und Weihnachtsgeld und 29 Deutschlandticket, unterstrichen wird. Sowohl die PNV als auch die Anbindung mit dem Auto ist sehr gut und du hast viel Spielraum in der eigenen Gestaltung deines Arbeitsplatzes. Das sind natrlich noch nicht alle Punkte, allerdings lassen sich die genannten Benefits schon sehen.Solltest Du also Lust haben ein neues Team aufzubauen und ein positives Arbeitsklima mitzugestalten, freue ich mich auf deine Unterlagen.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/connecting-dots-gmbh-co-kg\/sap-mm-experte-fur-unternehmensweite-s-4hana-neueinfuhrung-hamburg-84668","tags":["SAP\/ERP Consulting","Development"],"job_types":["berufserfahren"],"location":"Hamburg","created_at":1702680542000,"original_language":"eng"},{"slug":"auftragssachbearbeiter-in-im-e-commerce-coldcenter-bochum-wattenscheid-401411","company_name":"Seco Kältetechnik GmbH","title":"Order clerk in the E-COMMERCE Coldcenter (Bochum \/ Wattenscheid)","description":"Seco Klttetechnik GmbH was founded in 1993 by our owner in Bochum. What began as a planning office for large refrigeration systems quickly developed into a full service in all areas of refrigeration and air conditioning technology. Our customers from food retail, discount, industry, refrigeration manufacturers, catering and retail turn to us with confidence. No wonder! Through our business areas in regional plant engineering as well as the Coldcenter (nationwide service for plug-in refrigeration and deep-freeze units) and Seco Manufaktur GmbH (customized special solutions), we are the number 1 contact for refrigeration, air conditioning and heat technology as well as the associated measurement, control and and control technology.As a successful, innovative and constantly growing medium-sized company, we are characterized by flat hierarchies, quick decision-making processes and efficient and technologically modern work processes and workplaces. In particular, the professional and personal support of our almost 500 colleagues in Germany and Austria is very important to us. Tasks What you are passionate about: expert processing of all customer inquiries received by telephone or in writing, as well as final processing of customer concerns Processing of our customers' inquiries by telephone & E-mail creation and management of order documentation with modern IT systems, independent complaint and problem processing, general tasks in project administration and coordination, as well as in the implementation of quality assurance measures. Qualifications Your toolbox includes: completed commercial training, ideally in office management, comprehensive professional experience in the above-mentioned field. Area of ​​activity Strong communication skills for telephone support of end customers Very good PC \/ Internet and MS Office knowledge (Word, Excel, Outlook) Good knowledge of spoken and written German Service orientation and skill in dealing with customers Benefits What should not leave you indifferent: a familiar and fair working environment and working atmosphere with the charm of the Ruhr area, a secure job in a systemically relevant and constantly growing company, an exciting and challenging field of work, collegial cooperation in a dynamic team with a flat hierarchy, a permanent employment contract with performance-oriented remuneration, an attractive company pension scheme as well as holiday and Christmas bonuses after the probationary period, an intensive and practical training and Support in everyday working lifeWe look forward to receiving your meaningful application documents and getting to know you soon.See you coldFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/seco-kaltetechnik-gmbh\/auftragssachbearbeiter-in-im-e-commerce-coldcenter-bochum-wattenscheid-401411","tags":["HR"],"job_types":[],"location":"Bochum","created_at":1702680542000,"original_language":"deu"},{"slug":"projektmanager-tech-munich-98170","company_name":"MegaDev GmbH","title":"Project Manager - Tech (m\/f\/d)","description":"english version belowDo you love gaming, are you creative and looking for a new challenge? Perfect! MegaDev GmbH was founded in Munich in 2015 and, with its PLITCH software, is the European market leader for legal cheats and training codes for single-player PC games. PLITCH helps gamers tailor the gaming experience to their tastes and preferences to make the most of their time playing PC games. The all-in-one software can unlock thousands of skills, items and resources, minimizing repetitive play; On the other hand, it also offers a training mode with which gaming situations can be made more challenging. Our team consists of experienced entrepreneurs, developers and enthusiasts from the gaming industry. What's still missing is you: to strengthen us, we are looking for you as a full-time PROJECT MANAGER - TECH (m\/f\/d).________________________________________________________________________Do you love gaming, are you creative and looking for a new challenge? Perfect!The MegaDev GmbH was founded in Munich, Germany, in 2015 and is the European market leader for legal cheats and training codes for single-player PC games with its software PLITCH. PLITCH gives gamers the freedom to customize their gaming experience according to their wishes. This enables users to get the most out of their play time as our software provides the power to tailor single-player PC games to the players exact needs and preferences. On the one hand, the all-in-one product makes it possible to effortlessly increase skills, multiply items, and add resources thereby minimizing repetitive gameplay. On the other hand, our software offers hardcore cheats which can be used for the creation of a training environment in-game. In this way, players can practice and improve their personal gaming skills.The MegaDev team consists of experienced entrepreneurs, developers and enthusiasts from the gaming industry. But you are still missing:We are looking for you to support us as a full-time PROJECT MANAGER - TECH (m\/f\/d).TasksTYPICAL CHALLENGES OF YOUR JOB:You are responsible for planning, coordinating and monitoring projects in development In terms of scope, resources and quality, you are responsible in your interface function in constant exchange with the relevant specialist departments within MegaDev GmbH and support in identifying new features as well as development and improvement potential of our products. In collaboration with the respective specialist departments, you develop and define relevant requirements as a team Project scopes and roadmaps and distribute the resulting requirements and tasks to the tech team or, if necessary, to external service providers\/agencies. You work in close communication with the tech team and external service providers and proactively report on project progress. You supervise the agile tech team in day-to-day business Responsible for empowering, mentoring and supporting all team members to ensure they have the right tools and knowledge for assigned tasks You communicate early on further action needs to ensure ongoing transparency of project schedules and cross-team synchronization You promote a culture Continuous improvement by questioning existing methods and proposing innovative solutions to optimize project deadlines and performance in order to achieve the best possible result at all times ________________________________________________________________________TYPICAL CHALLENGE OF YOUR POSITION:You are responsible for the planning, coordination and monitoring of development projects in terms of scope , resources and qualityAs a liaison, you are in constant communication with the relevant specialist departments within the MegaDev GmbH and support the identification of new features as well as development and improvement potential for our productsIn collaboration with the respective specialist departments, you will work in a team to develop relevant requirements, define project scopes and roadmaps and distribute the resulting requirements and tasks to the tech team or, if necessary, to external service providers\/agenciesYou work closely with the tech team and external service providers and proactively report on project progressYou support the agile tech team in its day-to-day businessYou are responsible for empowering, mentoring and supporting all team members to ensure they have the right tools and knowledge for the assigned tasksYou communicate further action needs early to ensure ongoing transparency of project timelines and cross -team synchronizationYou foster a culture of continuous improvement by challenging existing methods and proposing innovative solutions to optimize project timelines and performance to always achieve the best possible outcomeQualificationYOUR PROFILE:You are solution-oriented","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/megadev-gmbh\/projektmanager-tech-munich-98170","tags":["Project Management"],"job_types":["berufserfahren"],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"versuchsingenieur-bergbau-recycling-50-70k-cologne-154089","company_name":"Riverstate Premium Recruiting","title":"Experimental engineer mining\/recycling 50-70k (m\/f\/d)","description":"Have you always wanted to be a superhero and your heart beats for sustainability and high-tech? In this position you will find everything combined! As a test engineer for an internationally renowned company, you are responsible for returning raw materials to the cycle. In this way, you make a significant contribution to sustainability in areas where recyclable materials, metals and materials from mining are reused. You can expect extraordinary projects for customers around the globe, a friendly team, and a starting salary of up to 70,000 euros, depending on your experience , monthly bonus payments and generous flextime models. The company's own development department works closely with universities and research institutions and thus ensures leading innovative strength in order to be able to process recyclable materials in their purest form worldwide. Join the team and apply now as a test engineer for mining\/recycling 50-70k (m\/f\/d) Tasks You will carry out tests independently and guide the customer through the individual work processes. You will provide technical advice to customers for processes and machine use right through to creation of complete work programs You provide technical support for sales You support your technical colleagues on site or remotely if necessary Qualifications You are a technician or engineer in the fields of processing technology, raw materials engineering or environmental engineering, electrical or process engineering, etc. You have very good knowledge of German and English Word + writingYou have a BBenefits driving licenseExciting field of work: Your work is extremely varied and you enjoy a high degree of personal responsibility. Here you will interact with interesting people as well as exciting machines from a wide variety of industries. Field of activity: In order to make the best possible use of your expertise, you accompany colleagues around the globe and support the technical workflow. The travel portion is 20%.Development potential: The company has grown significantly in recent years and new areas of work have emerged as a result of general global developments. In the next few years there will continue to be new requirements for technology that you can play a key role in shaping. Other benefits: In addition to 30 days of vacation each year, you will receive a company pension plan, bicycle leasing options and a future-oriented working environment with the latest technology. Enjoy the advantages of generous flextime models and the opportunity to write your reports from home. It's best to apply now. We will then contact you by telephone and accompany you competently and reliably through the entire application process. Our advice is completely free of charge for you. If you have any questions, you can reach your personal contact Marion Hofmann on +49 30 549 059 738. # recycling # circular economy # process engineering # testing # process engineer # testing engineer # testing # testing technician # raw materials # waste recycling # recyclable materials processing # sorting machines # sorting systems # special machine construction # commissioning engineer # mining # metallurgy # process engineer # waste treatmentFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riverstate-premium-recruiting\/versuchsingenieur-bergbau-recycling-50-70k-cologne-154089","tags":["Process Engineering"],"job_types":["berufserfahren"],"location":"Cologne","created_at":1702680542000,"original_language":"deu"},{"slug":"werkstudentin-praktikantin-venture-capital-in-koln-cologne-8048","company_name":"Realyze Ventures Management GmbH","title":"Working Student \/ Intern (m\/f\/d) Venture Capital in COLOGNE","description":"Here in KLN we are looking for committed working students and interns to support our team in the area of ​​venture capital and start-up management. In this exciting role, you will have the opportunity to participate in various aspects of the venture capital business and gain valuable experience in the start-up industry. Responsibilities Acquisition and selection of new start-ups: You will help identify and acquire promising start-ups ups that fit into our portfolio and supports the pre-qualification of our deal flow based on the requirements we have defined. Startup and deal administration: You take responsibility for the administrative investment process, enter startups relevant to us in our database, ensure continuous documentation, keeps track of the individual process steps and works closely with our investment managersDeal Due Diligence: You take on subtasks in the due diligence process and work closely with the responsible investment managers Document Management: You work on the creation of investment templates and other relevant documents in the decision-making process with and supports our team enormously Portfolio management and monitoring\/reporting: You will help with the monitoring and reporting of our portfolio companies and gain insights into the collaboration with the startups Growth & More: You will have the opportunity to gain initial experience in creating financial reports Modeling reviews and the creation of business cases as well as various topics in the area of ​​fund management & investor relations and develop yourself further in various areasQualificationPassion for start-ups: You should have a strong interest in the start-up scene and entrepreneurship and already have a first Have gained experience in the form of an internship or a working student job in a startup. Your goal should be to gain a foothold in the VC industry after your studies.Analytical skills & finance: The ability to analyze information and draw conclusions is crucial. In addition, a basic understanding of finance and business models is an advantage. Self-employment: You work independently and show initiative; it is also natural for you to go the extra mile and are willing to continuously learn and familiarize yourself with various areas of responsibility in the venture capital business. Teamwork skills: You enjoy working in a team, communicate openly and transparently, have no problem standing up for your work results and have already successfully demonstrated your ability to interact in a team in practice and have gained initial experienceCommunication skills\/bilingualism: Good written and oral communication skills in English AND German is important in order to cope with your daily tasks with usAvailability\/working hours Working students: You have the time and desire to support us as a working student for at least the next 12 months: In for 16-20 hours\/week on 2-3 days\/week and to grow with usAvailability\/working hours Interns: You have the time and desire to support us as an intern for at least 3 to 6 months: In the best case, full-time and grow with usLocation Cologne: You have the opportunity 1-2 times a week to be on site in our office in Cologne\/Mhlheim and to work with us on-site. If a move to Cologne and the surrounding area is an option for you, that is of course also an option.BenefitsWhat to expect?A pleasant working atmosphere in a small, agile team with great opportunities for development and participation.Diverse and innovative subject areas and an enormous learning curve.The opportunity personally and to grow professionally in a constructive and dynamic working environment. Development opportunities and the chance to start your career at a young, up-and-coming venture capital company. We look forward to receiving your applications! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/realyze-ventures-management-gmbh\/werkstudentin-praktikantin-venture-capital-in-koln-cologne-8048","tags":["Business Analyst"],"job_types":["Working student"],"location":"Cologne","created_at":1702680542000,"original_language":"deu"},{"slug":"quereinstieg-als-netzwerk-service-techniker-aalen-241908","company_name":"Software Engineering GmbH","title":"Lateral entry as a network service technician (f\/m\/d)","description":"Are you looking for new challenges? WE are looking to strengthen our team! For the service team in Aalen we are looking for committed support as: IT network service technician (f\/m\/d) - gladly (cross) BeginnersHelp us to support external and internal customers by taking on various technical activities in the areas of installation, repair and shutdown of network elements and \/ or learning the activities and tasks!TasksMaintenance and installation of LAN and WAN environmentsEnd-to-end -Troubleshooting, troubleshooting and troubleshootingManaging ticket management systemsExternal technical testing of devicesManaging the logistics of spare parts and repairsSetting up hardware and downloading device configurations at the customer's siteActivities related to network and customer maintenance and installation. (Service Desks, Telco, etc.) Supervision of administrative tasks such as device returns, updating service coordination, closing cases Coordination and management of network infrastructure changesQualificationFirst practical experience in the field of network technology Interest in LAN & WAN technologies, telecommunications technologies and protocolsPC knowledge in the field MS Outlook, MS Excel, MS Word, MS Explorer, Visio, etc. Language skills: fluent in German and English Benefits Company car (also possible for private use) Working in an innovative company Exchanging experiences with other specialists Good opportunity for further training Excellent working conditions and fair pay Type: Permanent position Location: Aalen Start: January 2nd .2024 or by arrangementIf we have aroused your interest, apply now, we look forward to your feedback!Contact:SOFTWARE ENGINEERING GMBHAContact person: Mr. LdemannTel.: 089 1787677-55Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/software-engineering-gmbh\/quereinstieg-als-netzwerk-service-techniker-aalen-241908","tags":["System and Network Administration"],"job_types":[],"location":"Aalen","created_at":1702680542000,"original_language":"deu"},{"slug":"lohn-und-gehaltsbuchhalter-munich-18844","company_name":"RiJu Connecting GmbH","title":"Payroll accountant (m\/f\/d)","description":"RiJu Connecting GmbH stands for professionalism and loyalty. We are a young company with a lot of experience in personnel services. Our name RiJu Connecting is made up of the first letters of our first names Riccardo and Julia as an expression of our intensive, personal commitment. And with the addition Connecting, we specify what we do to connect the right people and positions with each other. For a company in the catering sector in the Munich area, we are looking for a payroll accountant (m\/f\/) as soon as possible. d).It is a direct placement.TasksExecution of payroll accountingMaintenance and support of electronic time recordingPreparation of statistics and evaluationsQualificationCompleted commercial vocational trainingSeveral years of professional experience in payroll accountingGood knowledge of common MS Office applicationsVery good knowledge of spoken and written GermanBenefitsFree mealsFull social securityPossibility to Mobile workDiscounted mobility offers (e.g. public transport)If we have aroused your interest, please send us your application documents.If you have any questions, we will be happy to help you at 069-850966011.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riju-connecting-gmbh\/lohn-und-gehaltsbuchhalter-munich-18844","tags":["HR"],"job_types":[],"location":"Munich","created_at":1702680542000,"original_language":"deu"},{"slug":"microsoft-dynamics-365-ce-entwickler-mainz-490149","company_name":"RiJu Connecting GmbH","title":"Microsoft Dynamics 365 CE Entwickler (m\/w\/d)","description":"RiJu Connecting GmbH stands for professionalism and loyalty. We are a young company with a lot of experience in personnel services. Our name RiJu Connecting is made up of the first letters of our first names Riccardo and Julia as an expression of our intensive, personal commitment. And with the addition Connecting we specify what we do to connect the right people and positions with one another. For a successful, medium-sized full-service IT company in the greater Mainz area, we are looking for a Microsoft Dynamics 365 CE developer as soon as possible ( m\/f\/d).It is a direct placement.TasksDevelopment of backend processesCreation of model-driven appsCreation of technical dataQualificationExperience with the adaptation and integration of Microsoft Dynamics 365Very good knowledge of development with C# and Type ScriptGood SQL database knowledgeVery good German and Knowledge of EnglishBenefitsCompany pension schemeFlexible working hoursMobile workingCompany car also for private useIf we have aroused your interest, please send us your application documents. If you have any questions, please do not hesitate to contact us at 069-850966010. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riju-connecting-gmbh\/microsoft-dynamics-365-ce-entwickler-mainz-490149","tags":["System and Network Administration"],"job_types":[],"location":"Mainz","created_at":1702680542000,"original_language":"deu"},{"slug":"veranstaltungstechniker-edingen-neckarhausen-145728","company_name":"RiJu Connecting GmbH","title":"Event technician (m\/f\/d)","description":"RiJu Connecting GmbH stands for professionalism and loyalty. We are a young company with a lot of experience in personnel services. Our name RiJu Connecting is made up of the first letters of our first names Riccardo and Julia as an expression of our intensive, personal commitment. And with the addition Connecting (= connecting) we specify what we do to connect the right people and positions with each other. For a customer in the Event industry in the Rhein-Neckar district, we are looking for a full-time event technician (m\/f\/d) as soon as possible. This is a direct placement. Tasks Planning as well as setting up and dismantling event technology and video installations Media and broadcast technology for projects and studio productions Support of events on siteProcessing of customer and project inquiries as well as tendersQualificationCompleted technical training\/degree or comparable qualification in the field of video or event technologySeveral years of professional experience in event technologyVery good knowledge of spoken and written GermanWillingness to travel \/ driving license class BBenefitsSalary and benefits are agreed individually with the customer.Should we be yours If you are interested, please send us your application documents. If you have any questions, please do not hesitate to contact us at 069-850966011 or 0160-99806415. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riju-connecting-gmbh\/veranstaltungstechniker-edingen-neckarhausen-145728","tags":["Engineering"],"job_types":[],"location":"Edingen-Neckarhausen","created_at":1702680542000,"original_language":"deu"},{"slug":"kaufmannischen-mitarbeiter-buchhaltung-rechnungswesen-straubing-475809","company_name":"ODAV AG","title":"Commercial employee bookkeeping \/ accounting (m\/f\/d)","description":"We are looking for a commercial employee in bookkeeping\/accounting (m\/f\/d) as soon as possible. As an innovative technology partner for the trades, ODAV AG has been supporting craft businesses and their organizations with high-quality software solutions and IT services for 50 years Operation of software products in the area of ​​finance and accountingExisting customer support and product marketingProject managementConducting customer trainingContinuous product developmentQualificationsYou have commercial or tax training or a completed university degree, preferably in business administration or economics.Ideally, you already have initial professional experience in finance and accountingYou are enthusiastic about dealing with us Customers as well as IT systems and software products Teamwork is a given for you, because successes are celebrated together. Good analytical skills and a structured way of working round off your profile. Benefits We offer a future-oriented workplace with a high degree of independence and the opportunity to work in a mobile office. Benefit from a lively work-life balance and committed colleagues. You can contribute your skills and ideas to exciting projects. Our extensive training offering ensures that your development does not stand still. A flexible working time model, company pension scheme and performance-related pay complete our offer.Interested? Then we should get to know each other!Apply directly via our online portal.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/odav-ag\/kaufmannischen-mitarbeiter-buchhaltung-rechnungswesen-straubing-475809","tags":["IT"],"job_types":[],"location":"Straubing","created_at":1702680542000,"original_language":"deu"},{"slug":"controller-hr-bereich-stuttgart-175804","company_name":"univativ GmbH","title":"Controller (m\/f\/d) HR department","description":"As soon as possible, by May 1st, 2025 | 40 hours per week | Stuttgart | Energy industry | Career starter, experienced professional | 62,000 to 65,000 per year | Project ID A202344895_2Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Are you looking for a position where you can fully utilize and develop your knowledge? Then we are looking for you as a controller (m\/f\/d) for the HR department! Our customer is a successful company in the energy industry. A variety of tasks and a friendly working atmosphere await you. We were able to arouse your interest? Then we look forward to receiving your application! Tasks You create and present HR reports with meaningful key figures. You will also be involved in quarterly and annual financial statements. Your tasks will include the creation of ad-hoc evaluations as well as the analysis and interpretation of strategic HR KPIs. You will be responsible for an interface function ITTaking on operational controlling topics as well as their coordination is also within your area of ​​responsibilityQualificationsYou have a degree in economics, business informatics or comparableYou have experience in HR controllingYou are also IT-savvy, have an analytical way of thinking and a good understanding of numbersIdeally, you have knowledge of SAP BW, SAP HCM and MS Power BIYou speak German and English fluentlyBenefitsAn annual salary between 62,000 and 65,000The possibility of working remotely from homeYou will receive feedback from us within 48 hoursDuring your assignment you will be accompanied by a personal talent coachWe offer you a variety of further training opportunities in our e-academyWe were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/controller-hr-bereich-stuttgart-175804","tags":["Finance"],"job_types":[],"location":"Stuttgart","created_at":1702680542000,"original_language":"deu"},{"slug":"2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-393791","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2600€ + 500€ bonus Telephone customer advisor m\/f\/d","description":"Would you like to work for an international company that is one of the market-leading independent service providers in the field of fuel card solutions in Germany? The team in Berlin is being expanded and we are looking for customer advisors\/clerks m\/f\/d in inbound. Tasks Customer support Quotation creation and processing Final processing of all customer inquiries E-mail - and fax processingInterface to other departmentsQualificationsAbility to work in a teamFriendly demeanorPleasant voiceKnowledge of spoken and written German at a native speaker levelEfficient, fast way of workingFun on the phoneMS Office skills in particularExcellent English skills for internal communicationBenefits2300 2600 gross (negotiable professional experience) plus 500 bonusPleasant officeNhe FriedrichstrasseWorking hours from Mon-Thu 8:30 a.m. 5 p.m., Friday until 3 p.m. Full time 37.5 hoursDevelopment opportunities in an international companyApplication:We look forward to receiving your application by email or WhatsAppIvonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-393791","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"hr-generalist-berlin-178697","company_name":"Workstation Customer Care","title":"HR Generalist (m\/f\/d)","description":"Our customer is one of the most important call centers on the market. As a result of its expansion their HR department is looking into having new members join the team.The HR Generalist (m\/f\/d) will advise, guide and coach corporate people managers on employment matters including policy interpretation, HR procedures, employee conflicts, engaging employees, performance management and employee transitions within and\/or out of the company.The HR Generalist will also conduct investigations into Employee Relations matters with a focus on customer or competitor behavior complaints, employer complaints and applicant\/employee complaints. The HR Generalist will partner with the Law department to ensure a fair and consistent approach to policies and procedures, thus promoting a positive culture within the business. Responsibilities:Coach and advise managers to provide resources and guidance when complex workplace issues arise among employees or between employees and managers, especially at key points of the employee life cycle such as performance management, leaves or absence, internal job changes or end of employment.Supports the corporate Mission, Vision, and Values in their work and communications.Acts as a Company advocate, advancing corporate culture, while ensuring that employees are being supported and represented in a fair and consistent manner.Maintains the highest standards of integrity and business ethics.Proactively connects with new employees in the business unit to discuss their onboarding experience, reinforce culture and values, and assist them in networking within their new organization.Works closely with leaders and employees to improve work relationships, build morale, increase productivity and engagement.Your qualifications:Ability to listen well, understand root causes of a situation, then provide exceptional guidance and coaching to leaders on how to proceed.Knowledgeable of employment law; must be up-to-date with current Employee Relations legislation.Strong negotiation and influencing skills with proven track record in influencing employees at all levels of the organization in a consultative manner.Excellent verbal and written communication skills in German and English.Excellent analytical ability.Well-organized and able to successfully handle several priorities simultaneously.Independent judgment and decision-making skills.Ability to use modern workplace technology (e.g. IP phones, video conferencing, etc.) and software, including Microsoft Word, Excel and PowerPoint, etc.At least 3 years progressive HR experience requiredWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/hr-generalist-berlin-178697","tags":["HR"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"eng"},{"slug":"kundenservice-vertragsverlangerung-turkisch-berlin-187105","company_name":"Workstation Customer Care","title":"Customer service contract extension TURKISH - m\/f\/d","description":"Our customer is one of the major mobile operators. In contrast to the competition, it specifically addresses its customers before the end of the contract term and offers current tariffs and new cell phones. The customer benefits from cheaper tariffs and the opportunity to get a new smartphone at the best conditions - our client benefits from customer loyalty and an increasing number of users. If you (m\/f\/d) want to become part of this successful team, you should apply. The company attaches great importance to ensuring that every offer offers a real advantage for the customer. To do this, the computer system analyzes the current key data in advance of the discussions. The system shows you possible alternative products on the screen and the exact savings options for the customer. We are looking for talented individuals who speak both German and Turkish. This is what our client offers you: Fixed salary plus a success bonus Modern offices with free drinks Discounted NVP ticket No time constraints for the discussions These tasks await you: Direct contact with existing customers by telephone or email Summary of the existing contractual conditions for the customer (e.g. end of term, transfer speed) presentation of the available phones with their distinguishing criteria (e.g. operating system, size, camera resolution) reference to particularly favorable special offers presentation of the appropriate contract options (taking into account the current usage profile - e.g. many stays abroad, high data transfer volume) maintenance of the database and the Contract documentsWe look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kundenservice-vertragsverlangerung-turkisch-berlin-187105","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"einstieg-in-die-buchhaltung-magdeburg-317379","company_name":"Workstation Customer Care","title":"Entry into accounting - Magdeburg m\/f\/d","description":"Have you successfully completed training or retraining in the field of accounting and would now like to gain your first professional experience in this area? You are annoyed that many companies expect you to have several years of professional experience so that you can be employed immediately without much training. Things are different for our client! Before you start, your knowledge will be refreshed in a six-week training course and will certainly be supplemented in one place or another: You will learn how to find invoice items in the display masks. You will gain experience in creating invoice corrections and credit notes. You are allowed to do so also write offers and change contract conditionsYou will learn how you can gain insight into payment receipts and account balancesYou will create debit orders and initiate payment processesYou will receive training in SAP (if you have already worked with it, all the better)In this position you will work (m\/f\/ d) in administrative processing for a large energy provider. You support customers in all commercial issues and record the relevant data in the system. You can now use everything you have learned: you can provide information about advance payments made, explain the billing details or change the energy mix if, for example, the customer no longer wants nuclear power. We look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/einstieg-in-die-buchhaltung-magdeburg-317379","tags":["Finance"],"job_types":[],"location":"Magdeburg","created_at":1702680542000,"original_language":"deu"},{"slug":"burokaufmann-schwerpunkt-personal-berlin-468590","company_name":"Workstation Customer Care","title":"Office clerk with a focus on human resources (m\/f\/d)","description":"Our client is a well-known name in retail with several hundred branches. Through convincing and future-oriented service and high-quality products, the company has positioned itself excellently in the market and made a name for itself among its customers. We are looking for a clerk (m\/f\/d) for human resources administration with a focus on human resources. Your tasks: Support and advice for employees on all human resources issues Recruitment Creation and maintenance of personnel files Recording of absences such as vacation and illness Preparatory payroll accounting Maintenance of time recording Personnel introduction General administrative tasks Your profile: Professional experience in Human resources administration Completed commercial training with a focus on human resources Good knowledge of labor law Confident use of MS Office Independent work High reliability Flexibility and commitment We look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-schwerpunkt-personal-berlin-468590","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"mitarbeiter-kassenabrechnung-und-tagesabschluss-berlin-494629","company_name":"Workstation Customer Care","title":"Employee cash accounting and daily closing (m\/f\/d)","description":"On behalf of our client, a successfully run retail company in the non-food sector, we are looking for a commercial... Employees (m\/f\/d) for the preparation and execution of cash accounting and daily closings.Your tasks:Cash accounting and cash accountingBooking of deposits and withdrawals Verification of depositsTelephone communication with the branchesClearing cash differencesVoucher management and credit card billingMonitoring and carrying out payment transactionsAccount adjustmentOur requirements:Successfully completed training in business Area very good understanding of numbers, initial experience in a comparable function (e.g. preparatory accounting) good knowledge of MS Office applications a high level of independence, flexibility and analytical thinking What you can expect: a demanding job with a high level of responsibility good development opportunities competent training by a friendly team a modern office and a pleasant working atmosphereWe look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-kassenabrechnung-und-tagesabschluss-berlin-494629","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"nds"},{"slug":"user-helpdesk-spezialist-konigs-wusterhausen-48557","company_name":"Workstation Customer Care","title":"User Helpdesk Spezialist (m\/w\/d)","description":"Our customer is a leading global company in the financial industry and is looking for several motivated and technically experienced employees (m\/f\/d) for technical support in the help desk for the in-house employees with fluent German language skills, an outstanding work attitude and a great interest in IT. Suitable candidates will enjoy a fast-paced, exciting career in a global corporate environment with an emphasis on providing exceptional customer service. Certain qualifications are not a requirement, but our client would like an interest in IT systems and a demonstrable interest in the technical development of hardware and software. Due to the strong growth, there are very good development opportunities, e.g. in the direction of team leader, trainer (m\/f\/d) or in completely other areas of the group. This is an excellent opportunity to join a global organization and, in a future-oriented environment, take advantage of the opportunities to grow with your tasks and take a consistent next step in your life. We are looking for talented individuals with the following characteristics: very good German language skills, both spoken and written. First experience in the IT sector; Helpdesk would be ideal, but exceptional candidates with no experience will also be considered. Technical aptitude with an obvious enthusiasm for technology. Motivated and enthusiastic personality with a desire to develop. Positive attitude to work, flexible in terms of time and able to work with multiple problems in parallel. Optimistic about the future and a good team playerThis activity can alternatively be carried out in our client's offices or in your home office. We look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/user-helpdesk-spezialist-konigs-wusterhausen-48557","tags":["Customer Service"],"job_types":[],"location":"Königs Wusterhausen","created_at":1702680542000,"original_language":"deu"},{"slug":"kundenberater-tarifauskunft-arabisch-berlin-378487","company_name":"Workstation Customer Care","title":"Kundenberater Tarifauskunft Arabisch - m\/w\/d","description":"Fr die nachfolgende Stelle suchen wir Mitarbeiter (m\/w\/d) zur Festanstellung bei unserem Kunden. Als fhrender Anbieter von Kundenkontaktlsungen mit insgesamt 6.000 Mitarbeitern prsentiert sich unser Unternehmen auch in Deutschland als einer der Marktfhrer. Im Produktportfolio ist die gesamte Leistungspalette der Kundenbetreuung vereint und wird durch ein umfassendes IT- und Serviceangebot ergnzt. Mit ca. 1.000 Mitarbeitern in Berlin\/ Brandenburg ist es ber viele Jahre gelungen, durch Innovation, Kompetenz und Kundenorientierung die Stellung am Markt zu etablieren und auszubauen. Die Mitarbeiter sichern dabei durch eine hohe Serviceorientierung das Wachstum des Unternehmens. Wir suchen eine motivierte Persnlichkeit als Kundenbetreuer (m\/w\/d) eines internationalen MobilfunkunternehmensAufgaben:Tarifberatung fr Neu- und BestandskundenDurchfhrung von Rufnummer- bzw. KartentauschPrfung des Auftragsstatus bei Endgert und Ersatzkarte, zzgl. SendeverfolgungVersand von ErsatzkartenSperrung und Einrichtung von DienstenBeantwortung von RechnungsnachfragenAllgemeine Beratung zu Sonderdiensten (WAP, GPRS, UMTS)Allgemeine Beratung zu Endgerten und ZubehrAnschlieende Sach- und Nachbearbeitung der TelefonateAnforderungen:Berufserfahrung in kaufmnnischen Bereichengutes sprachliches Ausdrucksvermgen auf Deutsch UND Arabischgute PC-Kenntnisseserviceorientiertes AuftretenVerantwortungsbewusstsein und Engagementstrukturierte und zielorientierte Arbeitsweisezeitliche FlexibilittWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kundenberater-tarifauskunft-arabisch-berlin-378487","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"eng"},{"slug":"french-customer-service-english-language-materials-berlin-19433","company_name":"Workstation Customer Care","title":"French Customer Service English Language Materials m\/f\/d","description":"Our client provides world class content in the most relevant, engaging and flexible formats to support students, teachers and institutions through a lifetime of learning. Our client develops and distributes textbooks, e-books and interactive e-learning resources. Our client, a leading publisher in English language materials and digital solutions, is seeking a Customer Service Assistant (m\/f\/d) to join its team, supporting its French customer base.Reporting to the Customer Service Manager, you will be handling French customers queries as well as assisting the team with internal reporting and editing of support materials.Key areas of support include:Digital customer supportOnline end-user support (teachers, students)The ideal applicant will:be a team playerbe a problem solver who takes ownership of all tasksbe keen on learning and developing a career in the field of Customer Servicebe a fluent French speakerWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/french-customer-service-english-language-materials-berlin-19433","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"eng"},{"slug":"email-abrechnungsservice-energieversorger-homeoffice-potsdam-58185","company_name":"Workstation Customer Care","title":"Email billing service energy supplier home office M\/F\/D","description":"You can do this job from home. You should not live further than 100 km from Potsdam. Our client is the contractual partner of a renowned energy supplier. We are looking for talented individuals (m\/f\/d) to build a new team.Your tasks:Recording customer concerns and documenting all inquiries in the systemWritten declarations on year-end invoices, advance payments and deferral requestsMoving service for new and existing customersProviding information on conditions, time of provision and contractual modalitiesCompiling and maintaining Customer, master and transaction dataEnsuring customer satisfactionWhat you should bring with you:Commercial knowledge and skills, career changers are warmly welcomeKnowledge of common MS Office programsAffinity and enjoyment of working on a PCStrong communication skillsIndependent working style and accuracyFirst experience in customer service is an advantage, but not a requirementWhat You can expect: Detailed, paid trainingInteresting and responsible work in a friendly teamFlexible working time modelsGood development opportunitiesPossibility of professional reorientation for career changersModern workplaces and friendly teams that look forward to meeting you!We look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/email-abrechnungsservice-energieversorger-homeoffice-potsdam-58185","tags":["Finance"],"job_types":[],"location":"Potsdam","created_at":1702680542000,"original_language":"deu"},{"slug":"neukundenbetreuung-technik-homeoffice-potsdam-349832","company_name":"Workstation Customer Care","title":"New customer support technology home office Potsdam m\/f\/d","description":"Our client is a large internet provider who wants to ensure that its new customers have the best possible start with the new contract. This means that there are no technical obstacles and the customer (m\/f\/d) can use all functions and devices from the first minute. However, not every customer has the necessary understanding of, for example, installing a router or downloading applications from the Internet. This is where you (m\/f\/d) come into play.What will you do in this position?You help customers put end devices into operationYou support them with downloading softwareYou activate applications for useYou order the shipping of replacement devicesYou carry out line tests through you: You understand how modern technical devices work You can listen well and empathize with problems You are helpful and patient You can work in shifts You always stay up to date with technical developments Alternatively, the position can take place in our client's offices or at your home Home office. The training takes place in the company at the location. So that you don't lose contact with the company, you should work in the company about once a week. We look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/neukundenbetreuung-technik-homeoffice-potsdam-349832","tags":["Customer Service"],"job_types":[],"location":"Potsdam","created_at":1702680542000,"original_language":"deu"},{"slug":"junior-bankkaufmann-im-homeoffice-berlin-299567","company_name":"Workstation Customer Care","title":"Junior bank clerk in the home office (m\/f\/d)","description":"Do you have a commercial career or do you have commercial basics and are interested in entering the banking services segment? Then the position of service employee (m\/f\/d) in the service center (inbound) is just right for you and the perfect first step into the world of finance! This entry-level position (junior) in the banking sector can be carried out nationwide from the home office. You will be tasked with the following tasks: telephone customer advice inbound in connection with all products and services of the credit institutions, e.g. telephone banking (payment transactions), building savings, inquiries about checking accounts, master data control\/maintenance of the document details Independently carrying out the follow-up work, such as reporting and keeping statistics What you bring with you: commercial training (m\/f\/d) or professional experience in a commercial profession (m\/f\/d) initial professional experience at a financial service provider is advantageous, but not mandatory, high communication skills, high level of customer and service orientation, very good knowledge of German, IT affinity, we look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/junior-bankkaufmann-im-homeoffice-berlin-299567","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"kundenservice-mit-arabischen-sprachkenntnissen-berlin-120666","company_name":"Workstation Customer Care","title":"Customer service with Arabic language skills m\/f\/d","description":"For our customer, an established service center with numerous awards, we are looking for several customer advisors (m\/f\/d) for the mobile communications sector - inbound, full-time & part-time possible. Your tasks: Telephone and written processing of customer inquiries Friendly and goal-oriented communication with customers Independent problem analysis and error elimination Assistance with contract changes Complaint processing and complaint management Support for private and business customersYour profile: Service-oriented and communicative personality Proficient in using standard PC applications Very good knowledge of German AND Arabic Performance and goal-oriented way of working Career changer (m\/f\/d) and career starters (m\/f\/d) are warmly welcome! What you can expect: Paid training, competent induction and regular coaching Pleasant working atmosphere in a dynamic team Further training with development opportunities If you have any questions, we are of course happy to help you! We look forward to getting to know you ! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kundenservice-mit-arabischen-sprachkenntnissen-berlin-120666","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"mitarbeiter-rechnungswesen-magdeburg-140011","company_name":"Workstation Customer Care","title":"Accounting employee (m\/f\/d)","description":"We are looking for an employee (m\/f\/d) in the accounting department for our customer. You will take over the administrative processing for our customer with the following tasks: Preparatory accounting, in particular processing of incoming invoices Creation of outgoing invoices (e.g. monthly invoices, collective invoices) Creation of credit notes and invoice corrections of annual reimbursements and sales evaluationsMaintaining various customer-specific price lists\/master data maintenanceProcess optimization in the area of ​​accounting and further development of work processesWhat you should have for this position in addition to a passion for numbers:Completed commercial training or comparable professional experienceIT knowledge, MS OfficeStructured way of working, reliability, independenceGood knowledge of English is an advantage, but not A must! Our customer offers you: A motivated team and long-term prospects for challenging tasks Further training and development opportunities Flat hierarchies, joint team events and leisure opportunities We look forward to receiving your application documents and getting to know you for the first time! We look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-rechnungswesen-magdeburg-140011","tags":["Finance"],"job_types":[],"location":"Magdeburg","created_at":1702680542000,"original_language":"deu"},{"slug":"mitarbeiter-lohnabrechnung-fur-industrieunternehmen-berlin-149306","company_name":"Workstation Customer Care","title":"Payroll employee for industrial companies (m\/f\/d)","description":"Our client is looking for an experienced employee (m\/f\/d) in payroll accounting. Bring what you need: Experience in carrying out payroll accounting Experience in accounting for commercial employees necessary Independent and structured way of working as well as a team player Good user knowledge in dealing with SAP In-depth knowledge of Labor, payroll tax and social security lawWhat will you do:Payroll accounting for a defined group of employeesCalculation of time wages as well as piecework and group wagesEmployee advice on billing issuesMonitoring of time managementChecking continued payment of wages in the event of illnessAdvice of employees on wage-related issuesAdministrative and organizational activities in day-to-day businessPreparation of contribution statements, wage tax registrations and certificatesWe look forward to hearing from you to get to know each other! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-lohnabrechnung-fur-industrieunternehmen-berlin-149306","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"nds"},{"slug":"burokaufmann-sekretariatsservice-magdeburg-423289","company_name":"Workstation Customer Care","title":"Office clerk (m\/f\/d) secretarial service","description":"Office clerk (m\/f\/d) looking for secretarial service (home office possible after training).Your tasks:Organization of further training, appointment coordinationPreparation and follow-up of seminars, general secretarial tasksYour profile:Completed commercial trainingFirst professional experience desirableVery good PC skillsVery good German skillsGood English skillsA friendly team & intensive training are waiting to you. We look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-sekretariatsservice-magdeburg-423289","tags":["Business Operations"],"job_types":[],"location":"Magdeburg","created_at":1702680542000,"original_language":"deu"},{"slug":"burokaufmann-okologischer-tourismus-homeoffice-berlin-167640","company_name":"Workstation Customer Care","title":"Office Clerk Ecological Tourism - Home Office (M\/F\/D)","description":"This position can be carried out 80% of the time from home - the company would like to welcome you to the office once a week so that contact is not lost. In this respect, you should not live too far from the Berlin district of Spandau. Our client is a tour operator and specializes in sustainable, ecologically valuable tourism. For this purpose, our customer operates a travel portal on which holidaymakers can quickly and interactively find out about travel areas, travel arrangements and prices. The potential customer does not always find what they are looking for and calls the hotline provided - and then reaches you (m\/f\/d). Our customer attaches great importance to the quality of the advice - so there are no time limits for discussions. The aim of your contact with the customer is to give the customer exactly the holiday experience they are looking for. Your tasks as a travel consultant (m\/f\/d): You are the first point of contact for customers who want to book a trip. You approach each individual customer individually and ask for his exact ideasYou describe the destination area, select according to the menu and number of stars, advise on child-friendly or child-free hotels and take the customer's flight times into account. You advise the customer in detail and offer alternative offersOur requirements: good linguistic expression, good PC skills, service-oriented demeanor, sense of responsibility and commitment, structured and goal-oriented Working styleFlexibilityPersuasivenessWe look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-okologischer-tourismus-homeoffice-berlin-167640","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"nds"},{"slug":"mitarbeiter-rechnungserfassung-berlin-347511","company_name":"Workstation Customer Care","title":"Employee invoice entry (m\/f\/d)","description":"We are looking for a commercial employee (m\/f\/d) for administration, part-time 20 hours \/ week.Your area of ​​responsibility:Processing and shipping of contract documentsInvoice captureProject tasksYour profile:Commercial trainingFirst professional experienceSecure MS Office knowledgeReliabilityIndependent working styleTime flexibility (8 a.m. to 5 p.m., in 2 shifts )We are pleased to meet you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-rechnungserfassung-berlin-347511","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"burokaufmann-rechnungsprufung-magdeburg-262880","company_name":"Workstation Customer Care","title":"Office clerk (m\/f\/d) auditing","description":"For our client we are looking for a clerk (m\/f\/d) for invoice auditing, including the following tasks: Checking incoming invoices and credit notes for factual and mathematical accuracy Clarification of differences and ambiguities with the relevant internal contacts Monitoring of incoming payments Clarification of discrepancies and deviations Support of the administrative Day-to-day business For this position as an office clerk (m\/f\/d) invoice auditing, we would like you to have: Completed commercial vocational training or comparable professional experience, e.g. as an office clerk (m\/f\/d) or accounting specialist (m\/f\/d).Good PC knowledgeStructured and correct way of workingDeadlines and reliabilityGood knowledge of MS Office applicationsUnderstanding of numbersFirst professional experience in auditing is an advantage but not a requirementWe offer:Extensive and paid trainingFixed salary without variable componentsA varied job in an international companyProfessional structures incl. works councilInternal further training and development opportunitiesGood cohesion in the team and fun at workWe look forward to meeting you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-rechnungsprufung-magdeburg-262880","tags":["Business Operations"],"job_types":[],"location":"Magdeburg","created_at":1702680542000,"original_language":"deu"},{"slug":"abrechnungsservice-abo-zahlungen-tlw-homeoffice-berlin-252549","company_name":"Workstation Customer Care","title":"Billing service subscription payments partly home office m\/f\/d","description":"Whether music, cars, clothing or even razors - the subscription economy is booming - because it gives users the flexibility they want. Easy registration, the perfect product and flexible payment round off the offers that we use in a variety of ways today. To ensure that everything runs smoothly, there is our customer - and you in your new role as an employee (m\/f\/d) in the billing service. Your working day will revolve around the following questions or topic areas: Renewal \/ termination \/ pause of subscriptions Selection of Payment methods and invoicingPayment allocation and agreement on installment paymentsComplaint managementThe best thing to do is to have a lot of understanding:for the individual needs of the customersfor numbers, data, factsfor the decision-making scope that the company gives youfor the need for professional behaviorfor rules and laws for challenges and positive solutions - our client doesn't leave anyone out in the rain. We look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/abrechnungsservice-abo-zahlungen-tlw-homeoffice-berlin-252549","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"burokauffrau-entgeltabrechnung-berlin-13244","company_name":"Workstation Customer Care","title":"Office clerk (m\/f\/d) payroll accounting","description":"We are looking for an employee (m\/f\/d) for the payroll accounting team for our customer in Berlin. Responsibilities: Support in the preparation of payroll and salary accounting as well as in the preparatory activities. Support for customer inquiries about the functionality of the payroll program, independent mandate processing, creation of monthly evaluations and information for the software development department Correspondence with health insurance companies and authorities Requirements: For this activity we want a candidate (m\/f\/d) with a commercial background and technical affinity. In addition, the ideal candidate (m\/f\/d) should have good communication skills and be able to We are happy to coordinate with customers, other departments and also the software development department. If you have successfully completed further training in the area of ​​wages and salaries, this would be an advantage, but is not a requirement. If our customer has great technical affinity, we will also be happy to train you on the technical components of payroll accounting. We look forward to receiving your application and an initial meeting! We look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokauffrau-entgeltabrechnung-berlin-13244","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"operations-advisor-berlin-19229","company_name":"Worldia GmbH","title":"Operations Advisor M\/W\/D","description":"Who we are Worldia is a B2B2C travel platform for tailor-made trips. We enable all our partners to exploit the immense potential for la carte travel by combining powerful technology, carefully selected quality products and premium customer service. After receiving an investment of 25 million euros in 2023, Worldia is expanding with many exciting projects : Introducing the new platform version, new business partnerships and international expansion.We are proud to carry the HAPPY INDEX AT WORK certificate from CHOOSE MY COMPANY!Do you want to join our adventure? Welcome on board!Our valuesAMBITION \/\/ Reach for the stars.PLEASURE \/\/ Spend a good time togetherINTEGRITY \/\/ Always be honest and transparent.This is what you do with us:You make travel dreams come true and carry out internal and external booking processes in order to to enable customers to complete their booked trip. Quality comes first - by creating and editing individual travel documents, our customers no longer have any questions left. Regular contact with our product providers is on your agenda. This is what you bring with you: You live in Berlin or are ready to move to Berlin to work in our office You speak German at a B2 level and very good written and spoken English You ideally have initial experience in the travel industry. But career changers are also welcome to join us. You are tidy, thorough and have a good eye for detail. You like to take the initiative and are solution-oriented. You are enthusiastic and convincing. You are not afraid to pick up the phone and enjoy talking to customers and partners Challenges are no problem for you. Traveling is in your DNA! Your advantages with us: We will teach you everything you need to know and know for your position on site as part of individual training. Our international base is in Berlin between Bernauer Strasse and Rosenthaler Platz - a fantastic location in the middle of the capital. Discounts for the own trips Discounted BVG ticket Tax-free material vouchers as a monthly salary extra Discounted Urban Sports Club membership Weekly team lunch and meal vouchers for your meals at work Opportunity on FAM tripsA young working environment in tourism with a lot of development potential Fair working conditions (it has to be good for you and for us fit) Dog-friendly office (currently our four four-legged friends Pepe, Pamuk, Schneemann and Ceberus are part of our team)Worldia has signed the IDEA pact (Inclusion - Diversity - Justice - Accessibility) and follows a fair and non-discriminatory hiring process.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/worldia-gmbh\/operations-advisor-berlin-19229","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"supervisorin-infrastrukturelles-facility-management-vollzeit-berlin-400741","company_name":"GONDER Group","title":"Supervisor: in infrastructure facility management (m\/f\/d) - full-time","description":"In a nutshell: We are looking for a full-time property manager\/supervisor (m\/f\/d) from February 1st, 2023 (working hours Mon-Fri from 7:00 a.m. to 3:00 p.m.) in Berlin (main train station) with a pay rate Pay and attractive benefits.Welcome to the GONDER Group Your partner for excellent career opportunities in building servicesThe GONDER Group is a leading family business based in Frankfurt am Main that has been active in the field of infrastructural building management for almost 100 years. With our almost 4,000 dedicated employees, we are a reliable partner for facility management, in-house logistics and personnel services throughout Germany. Why the GONDER Group? Tradition meets innovation: We rely on proven methods and the latest technologies (e.g. digitalization & robotics) Career development: We offer a wide range of options Opportunities for advancement and promote continuous further training.Sustainability: Together with our customers, we rely on sustainable services and are proud of our EcoVadis Gold rating.Team culture: For us, people are the focus. We attach great importance to a positive working atmosphere and teamwork.TasksYour tasks include, among other things:Contact person for the customer for all infrastructural servicesSupport, coordination and coordination of all employees in the propertyResponsible for building cleaning, service staff, receptionists and security forcesPerforming quality controls and initiating necessary measures occurring defects as well as final inspection (general property support) Additional support for basic and maintenance cleaning and acceptance of the services by the customer When carrying out the activity, always pay attention to labor law, safety-related requirements and ensure data protectionQualificationSeveral years of professional experience in building cleaning, quality assurance or facility management (desirable) OR Several years of professional experience in the hotel industry, catering, system catering, in the restaurant industry, etc. as a team leader or manager - career changers welcome Very good knowledge of spoken and written German, knowledge of English is an advantageFriendly appearance, assertiveness, reliability and commitmentA certificate of leadership without entriesA strong service orientationBenefitsGood pay - fair and always on time30 days of vacationFlexible working hoursModern work equipment including company cell phone, laptop or tabletFree work clothesBike leasingGONDER eHealth - your offer for health and well-beingContinuing education opportunities in the in-house training academyEmployee discounts from many well-known manufacturers and brandsPlease send us your detailed application documents online to:Mr DrnerWe look forward to receiving your application!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/gonder-group\/supervisorin-infrastrukturelles-facility-management-vollzeit-berlin-400741","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Berlin","created_at":1702680542000,"original_language":"deu"},{"slug":"expansion-manager-startup-stuttgart-297592","company_name":"ooblee Europe GmbH","title":"Expansion Manager (m\/w\/d) - Startup","description":"Werde Expansion Manager bei ooblee und stehe an der Spitze der Digitalisierung des Einzelhandels mit unserer schnell wachsenden Social Commerce App.Du suchst nach einer Herausforderung im Startup Umfeld und hast die Untersttzung des lokalen Einzelhandels am Herzen? Du hast Interesse am Aufbau von Kundenbeziehungen und Kontakt mit Bestandskunden? Wir freuen uns auf deine Bewerbung als Expansion Manager (m\/w\/d) in unserem Team bei ooblee.ooblee betreibt eine Social Commerce App, die lokale Geschfte und mit lokalen Konsumenten verbindet. Unsere Social-Shopping-Community untersttzt somit Einzelhndler und ermglicht es Usern das Shopping Angebot Ihrer Stadt zu erkunden und lokal einzukaufen.Als ooblee-Expansion Manager bist du die erste Kontaktstelle zu lokalen Ladengeschften und reprsentierst unsere Shopping Community. Indem du die besten Produkte fr das Produktsortiment unserer Plattform aussuchst, langfristige Beziehungen zu einzelnen Geschften aufzubaust und diesen einen ersten Vorgeschmack bietest, hilfst du dabei unsere Shopping Community zu expandieren und einen attraktiven Marktplatz aufzubauen.AufgabenSelektion der mglichen Partnershops fr die ooblee App Selektion der Produkte fr das Produktsortiment unserer Plattform Besuche lokale Geschfte, um ihnen ooblee vorzustellen Knpfe Kontakte zu lokalen Einzelhndlern und gib ihnen einen Vorgeschmack auf die Nutzung der ooblee App Arbeite mit unseren Marketing- und Produktteams zusammen, um Kundenfeedback zu sammeln und uns bei der kontinuierlichen Verbesserung der App zu helfen Aktualisierung und Erweiterung der Kundendaten in unserem CRM Reisettigkeit 80% innerhalb DeutschlandsQualifikationDu reist gerne und hast Interesse deine Sales Skills aufzubauen? Dann bist Du bei uns richtig! Du bist verantwortlich fr die Expansion unserer Verkaufsaktivitten in deinem Bundesland und darber hinausAusgeprgte Kommunikationsfhigkeiten und ein freundliches Auftreten, vorzugsweise mit Erfahrung in einer Rolle mit KundenkontaktAusgezeichneter Teamplayer mit hoher Arbeitsmoral, sozialer Kompetenz und KommunikationsfhigkeitDu bringst ein hohes Ma an Eigeninitiative, Motivation und Teamfhigkeit mit  und berzeugst durch eine freundliche Hartnckigkeit mit ausgeprgter ZielorientierungSelbststndige und strukturierte ArbeitsweiseFlieend in DeutschFhrerscheinklasse B wird erwartetBenefitsWerde Teil eines innovativen, schnell wachsenden, gut finanzierten und ffentlich untersttzten E-Commerce Startups Ausgezeichnete Entwicklungs- und Aufstiegsmglichkeiten und gute Work-Life-Balance Flache Hierarchien und Teamgeist Erhalte Discounts und kostenlose Produkte von unseren Partnershops Erstattung von ReisekostenUntersttze uns bei der Mission mit ooblee den lokalen Handel zu strken und die lokale Shopping Community aufzubauen. Bewirb dich jetzt! #JobOpening #ExpansionManager #StartUp #Expansion #SupportLocal #oobleeFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ooblee-europe-gmbh\/expansion-manager-startup-stuttgart-297592","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Stuttgart","created_at":1702680542000,"original_language":"eng"}]