[{"slug":"customer-success-account-managerin-berlin-330825","company_name":"Matera GmbH","title":"Customer Success - Account Manager*in","description":"In a nutshell: As an account manager, you've come to the right place if you want to help shape the development of the Customer Success Department. Work with us in Berlin in the office or flexibly hybrid, full-time. Start now or in the next 4 months.TasksYour role at Matera:Advice and support for your customersBuilding structures and processes together with the team and our country managerSmart automation of existing processesBuilding a knowledge base for recurring questionsQualificationsWhat you bring with you:You deal with problems Be creative and stick with it until you find the perfect solution. You enjoy contact with people. Initial experience with real estate, law or accounting is an advantage, but not necessary. You speak German at a very good level and can communicate confidently in English. At Matera we guarantee it Equal opportunities and diversity. Here you are as welcome as you are!BenefitsYour prospects:Remuneration of 37,500-45,000 plus attractive share options in the companyMatera Benefits: discounted membership for the Urban Sports Club, lunch vouchers and a monthly public transport subsidyWork independently with creative freedomParts of the learning curve in an up-and-coming SaaS Start-up ambitious team where fun is not neglected either:)Our mission:Our mission at Matera is to make apartment owners happy! With us you can manage your property yourself transparently and easily, thereby saving a lot of time and money. We have been active on the French market since 2017 and are already making the lives of more than 100,000 homeowners better every day. We also got off to a great start in Germany last year with an ambitious team. Would you like to tackle scaling the German market together with us? Then apply now!:)To get to know our team and get an impression of our culture, feel free to check us out on LinkedIn or Instagram!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/matera-gmbh\/customer-success-account-managerin-berlin-330825","tags":["Customer Service"],"job_types":["berufseinstieg"],"location":"Berlin","created_at":1702896543000,"original_language":"deu"},{"slug":"senior-3d-artist-munich-457393","company_name":"New Flag GmbH","title":"(Senior) 3D Artist (m\/w\/d)","description":"This is what awaits you with us. Do you like creating visual experiences and are you a creative mind? Do you also have a strong sense of design and sophisticated 3D visualization? As part of our creative team, you have the opportunity to take our projects to a new aesthetic level through innovative CGI elements and design ideas and thus be directly involved in the success of our unique brands. You are an expert in CGIYou coordinate our CGI projects in collaboration with external partnersYou create high-quality 3D assets of our productsYou design and design renderings of our products (stills and animations)You design 3D scenery and mood images that atmospherically present our productsYou support the design process new product ideas through high-quality renderings of various design approaches and thus bring them to lifeYou support the marketing of fully developed products through photorealistic renderings, which are widely used in digital and printed formAs a designer, you accompany the shape and color design of new productsWhat you bring with youCompleted bachelor's degree \/Master's degree in design\/design or comparable training as well as at least 2-3 years of professional experience as a 3D artistYou have experience as a product designer and in project managementExcellent knowledge of Maxon Cinema 4D, OTOY Octane Render and the Adobe Creative Cloud (especially Photoshop, Illustrator, After Effects and Premiere Pro) 3D modeling: Fast and detailed polygon subdivision modeling (both hard surface as well as textiles and liquids) as well as the efficient processing of production data (e.g. STEP)Shading and Lighting: Creation of complex shaders as well as the realistic lighting of products and their stagingRendering and post-production: You render high-resolution images and give them the final touches through color grading and retouchingYou have experience with digital photography, image editing, video editing, Sound recording and typographyYou have attention to detail, a good sense of image composition, form and color as well as artistic creativity.Structured and orderly way of working (folder structures, file naming, workflows).A high level of quality awareness and the ability to objectively evaluate designs.A high level of reliability and an independent, goal-oriented approach and structured way of workingYou are able to work in a forward-looking, solution-oriented and efficient manner within tight time constraintsVery good knowledge of spoken and written German and EnglishThis is what we offer youLots of responsibility at the cutting edge in a creative and highly motivated teamAn international working environment with a start-up atmosphere and You cultureExciting, varied areas of responsibility in a fast-paced, thriving companyAttractive fitness cooperations, bicycle leasing, corporate benefits and free fruit & drinksExceptional trend products at reduced prices and many free productsA modern workplace in the heart of Munich and home office (2 days\/week)Your way to usThe upload of your Application documents stating your starting date and salary expectations only take 2 minutes. We value diversity and therefore welcome all applications regardless of gender, nationality, religion and ideology, ethnic and social origin, disability, age, sexual orientation and identity. Join us! We look forward to seeing you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/new-flag-gmbh\/senior-3d-artist-munich-457393","tags":["Graphic Arts and Communication Design"],"job_types":["berufserfahren"],"location":"Munich","created_at":1702896543000,"original_language":"deu"},{"slug":"junior-softwareentwickler-java-hanover-386752","company_name":"univativ GmbH","title":"(Junior) Software Developer (m\/f\/d) Java","description":"As soon as possible, permanent, permanent position | 40 hours per week | Hanover | Personnel services | Career starter, experienced professional | 42,000 to 50,000 per year | Project ID P202238667_13Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Object-oriented programming, agile development and a modern working environment are all keywords that your dream job should have? Have you completed your studies or training in the IT sector, specialized in Java programming and are you looking to start your career? Do you also love diversity and variety in your job, would you like to continually develop yourself and are you looking for someone to support and accompany you on your career path? Then you've come to the right place! We offer you a permanent position at univativ and the opportunity to gain experience in different industries, companies and projects. You will be part of our team in Hanover from day one and, over the course of your employment, you will work on various customer projects in the metropolitan region of Hanover, Braunschweig, Gttingen and Wolfsburg. Whether recording requirements, developing Java applications or advising customers, a wide range of tasks await you as a software developer. That sounds exciting? Then send us your application today! Tasks Development, testing, implementation and maintenance of Java applications Implementation of quality assurance measures in the development process Optimization of software applications and elimination of defects Recording of requirements through regular consultations with the specialist departments and customers 3rd level support for the developed programs and processes Qualification A completed degree in computer science, business informatics and\/or completed training as an IT specialist for application development. First practical experience in development with Java or an object-oriented programming language. Experience in connecting databases is desirable. A confident approach to working with development environments such as Eclipse or NetBeans and with frameworks such as Spring or JSF Knowledge of German and fluent written and spoken EnglishStructured and independent work as well as a strong solution orientationBenefitsAn annual salary between 42,000 and 50,000 A permanent position directly with our customerThe possibility of working remotely from home.We offer you a permanent position at univativ as well as the possibility of experience in different industries , companies and projects. With us you can get ahead! On the one hand, you build real expert knowledge in software development. On the other hand, we actively promote your development and offer you exciting career prospects. You will be supported by your personal talent coach, who will be there for you as your central contact and career companion. You are part of our univativ team in Hanover and also have the opportunity to pursue your professional career Expand your network with various customers. We were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-softwareentwickler-java-hanover-386752","tags":["IT"],"job_types":[],"location":"Hanover","created_at":1702892942000,"original_language":"deu"},{"slug":"brand-manager-biosimilar-bad-homburg-436415","company_name":"Biomatch GmbH","title":"Brand Manager Biosimilar (m\/w\/d)","description":"We are looking for a Brand Manager for a leading company in the biosimilars industry. Position summary: The position of Brand Manager Inflammation involves the active management of Inflammation products. The ideal candidate has extensive experience in brand management and preferably has knowledge in the therapeutic areas of gastroenterology, dermatology or rheumatology OR in the area of ​​biologics\/biosimilars. A dynamic environment offers opportunities to shape and expand brands, while the company offers an agile, growth-oriented environment. Location: Office in Bad-Homburg, Germany (hybrid) Working hours: Full-time (40 hours\/week) Tasks Development and implementation of local brand plans, aligned with the global marketing strategy Planning and implementation of local marketing activities in the areas of gastroenterology, rheumatology and dermatology Collaboration with creative and media agencies as well external service providersDevelopment and implementation of innovative marketing approachesOrganization and implementation of congresses and eventsCollaboration with sales and medical professionalsContinuous training of the field serviceBudget control and regular evaluation of marketing initiativesGeneration of market information to prioritize promotional activitiesQualificationAcademic degree in natural sciences, medicine, pharmacy or businessAt least 1-2 years of experience in the pharmaceutical industry as a brand\/product managerPreferably experience in the field of biologics\/biosimilarsExpertise in gastroenterology, dermatology or rheumatologyVery good knowledge of English and GermanBenefitsWork-life balance: Flexible working hours and remote optionsCareer development: Further training opportunitiesCorporate culture: Collaborative, integrative environment Attractive remunerationApply now with your CV!Find jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/biomatch-gmbh\/brand-manager-biosimilar-bad-homburg-436415","tags":["Product Management"],"job_types":["berufserfahren"],"location":"Bad Homburg","created_at":1702892942000,"original_language":"deu"},{"slug":"talent-acquisition-specialist-calw-483688","company_name":"Börlind GmbH","title":"Talent Acquisition Specialist (m\/w\/d)","description":"Das erwartet Dich:Kreativer Kopf im Recruiting: Du entwickelst innovative Konzepte, setzt diese operativ um und optimierst kontinuierlich die Personalprozesse rund um Recruiting und OnboardingCandidate Experience Experte: Als Herzstck des Recruitings koordinierst, begleitest und fhrst du den gesamten Recruiting-Prozess, um unseren Bewerber:innen eine unvergessliche Erfahrung zu bietenMarkenbotschafter in sozialen Medien: Gemeinsam mit unserem Team baust du aktiv an einer starken Arbeitgebermarke auf Social Media. Dein Ziel: Brlind als attraktiven Arbeitgeber prsentieren und das Netzwerk erweiternActive Sourcing Virtuose: Du implementierst und steuerst Active Sourcing Manahmen, inklusive langfristigem Candidate Community Management, um die besten Talente fr Brlind zu gewinnenProjektmanagement-Profi: Du bearbeitest HR-Projekte mit Leidenschaft, um unsere Personalprozesse kontinuierlich zu verbessern und weiterzuentwickelnKPI-Messung und Reporting: Du behltst den berblick ber die verantworteten Prozesse, misst KPIs und berichtest im Shopfloor ber deine ErfolgeDas solltest Du mitbringen:Beauty und Brain: Du bringst ein erfolgreich abgeschlossenes Studium (BWL, Wirtschaftspsychologie, Sozialwissenschaften o..) mit Schwerpunkt Personal oder eine kaufmnnische Ausbildung mit personalwirtschaftlicher Zusatzqualifikation mitErfahrungspionier: Mit mindestens 3 Jahren Erfahrung im Active Sourcing, Personalrecruiting und -marketing kennst du die Trends und Technologien der HR-WeltTech-Enthusiast: Begeisterungsfhigkeit fr neue Technologien und HR-Trends zeichnen dich ausOrganisationstalent: Du behltst in einem vielseitigen Aufgabenspektrum den berblick und arbeitest konzeptionell sowie operativBetriebswirtschaftlicher Blick: Du verstehst die betriebswirtschaftlichen Zusammenhnge und agierst mit unternehmerischem DenkenSocial Media Guru: Du bist sicher im Umgang mit Social-Media-Plattformen, gestaltest Content und setzt Recruitingkanle der Zukunft erfolgreich einDas bieten wir Dir:NoneFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/borlind-gmbh\/talent-acquisition-specialist-calw-483688","tags":["HR"],"job_types":[],"location":"Calw","created_at":1702892942000,"original_language":"eng"},{"slug":"e-commerce-manager-operations-gesucht-cologne-342046","company_name":"Atelier X GmbH","title":"E-Commerce Manager - Operations wanted","description":"\"Atelier . We rely on young, unconventional brands and established, traditional brands with a clear identity. Our brand portfolio includes a selected product range of high fashion brands and exclusive niche products, such as Acne Studios, Autry, Craig Green, Fear Of God, Ami Paris, Kenzo, Maison Margiela, Marni, Raf Simons, Rick Owens, Jil Sander, Hed Mayner, Y-Project & more.\"We are now looking for a part-time e-commerce manager - operations to support our online shop. Your tasks: full support of the online shop. Product review: direct correction\/item adjustment in the event of errors between the merchandise management system and ShopifySeasonal product maintenance of all items in the online shop: maintenance of images via Farfetch\/online shop, product description, product names, categories, colors etc. Processing of tickets\/customer service: structure of the texts in the CRM, as well as optimizationMonitoring of orders and returns within Shopify for special casesProcess optimization of e-commerceCollaboration in the strategic-commercial orientation of the Shopify sales platformAnalysis and action controlQualificationWhat you bring with you:Very good knowledge of the processes for omnichannel commerceSystem competence in the area of ​​merchandise management Practice in PIMExcellent talent for organization and process managementWant knowledge in the graphics areaBenefitsWe offer you:a dynamic and technically competent teamthe opportunity to work flexibly in our offices, home office or remotelya detailed training phasedirect and uncomplicated communication channelsgrowing and goal-oriented digital companyspecial flair in the field of luxury fashionWe look forward to your application.Find more English Speaking Jobs in Germany on Arbeitsnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/atelier-x-gmbh\/e-commerce-manager-operations-gesucht-cologne-342046","tags":["Marketing and Communication"],"job_types":["berufserfahren"],"location":"Cologne","created_at":1702892942000,"original_language":"deu"},{"slug":"team-lead-support-berlin-309864","company_name":"mediaire GmbH","title":"Team Lead Support","description":"We are a Berlin-based MedTech startup dedicated to developing AI-based software solutions that support radiologists in their daily work: analyzing medical images. With our highly innovative software solutions for identifying dementia, aneurysms or multiple sclerosis (MS) from MRI scans, we have already been able to win many enthusiastic customers. Responsibilities You lead our support team and take the lead in designing internal processes together with your colleagues. You are not only responsible for processes - you live it by working in day-to-day operations and supporting the team in solving problems and communicating. People are more important to you than KPIs, you like to think out of the box and adapt your approach if necessary to make us even faster and more efficient in supporting our customers.You will work with our development team and our radiologists to improve our products and infrastructure.You will support your colleagues in their personal and professional development.QualificationsYou You are technically savvy, familiar with Linux and the command line and are no stranger to containers and VMs. You are empathetic, like to communicate and love supporting customers and colleagues. You make things possible and enjoy working in the background and relieving the workload of your colleagues by designing optimal processes. You are curious and enjoy finding solutions to tricky problems.You have fluent written and spoken German and English skills.You already have at least 3 years of experience in technical support, ideally with SaaS applications, and ideally also gained initial experience as a team lead.Bonus points is available for: Experience with radiological IT systems (PACS, RIS, DICOM) is a big plus.Experience with audit procedures and\/or in the field of medical technologyLinux Sysadmin knowledge, especially networking and scripting with Bash or PythonBenefitsFor us, competence, personality and commitment count more as a formality and course of study.With your work, you will contribute to making the diagnosis of diseases faster, more accurate and more manageable.You will be part of an interdisciplinary, highly motivated team with quick decision-making processes.Flexibility: You can work from home or in our office in Berlin- Kreuzberg work.Perks: Membership in the Urban Sports Club, drinks and snacks in the Bro.mediaire was founded in 2018 by Dr. Andreas Lemke and Dr. Jrg Dpfert - both physicists with a background in MRI physics. However, the actual founding story dates back to 2009, when the scientific paths of Andreas and Jrg crossed several times with the renowned radiologist Prof. Henrik Michaely. Coming from different backgrounds and realizing that both had the same goal, the idea of ​​a scientifically and economically successful high-tech product took shape - software powered by artificial intelligence (AI) and providing highly efficient analysis of medical image data in the Radiology enables to support radiologists in their daily routine.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/mediaire-gmbh\/team-lead-support-berlin-309864","tags":["Remote","Helpdesk"],"job_types":["teamleitung"],"location":"Berlin","created_at":1702892942000,"original_language":"sun"},{"slug":"vertriebsinnendienst-100-remote-hamburg-186916","company_name":"thejugglingswan GmbH","title":"Vertriebsinnendienst (m\/f\/d) 100% remote","description":"Every call you make brings you closer to your own goal, every no is an incentive to get the next YES. Are you celebrating? Then read on. Because if you are a person who is passionate about sales, regularly educates yourself through YouTube videos etc. + existing processes and wants to use a good product to achieve your own sales goals...then you've come to the right place.Who we are?We are a team of social media experts from Hamburg who always stay up to date. Our goal is to help our customers stand out from the competition. We know that companies today need to combine traditional values ​​and modern needs, and social media is perfect for this. We offer tailored solutions by taking the time to understand our customers and their goals. We promote medium-sized businesses, attract the right employees and generate new sales for our customers. Tasks What you will do: Process customer inquiries via email Mail & telephone: Generate outbound leads through social media & cold calling.Call leads and schedule sales discussions.Conduct cold calling with a provided list (with the aim of arranging a potential analysis).Agree appointments with interested parties by telephone.Build and expand customer relationships: advise customers and upsells Prepare.Prepare for meetings: Maintain CRM and forward relevant information to sellers.Follow up with customers and interested partiesConduct final discussions in the future and sell our productsQualificationExtroverted & interested in people.Previous experience in sales necessary.Have grit and want to achieve goals.Customer and service-oriented and friendly and Communicative demeanor. Committed and has a quick comprehension, a structured way of working and a high willingness to learn. Strong and eloquent. A calm, pleasant and attractive voice. Able to follow existing processes. Previous experience in online marketing and coaching is beneficial, but not necessary .Training\/study: is secondaryBenefits The opportunity to work with a cool team: We celebrate personal growth and help each other advance. Fair and secure salary Mentoring: What do you actually want to achieve professionally and personally? Together we will design a plan to implement your goals. Regular team events (dinner, offsites) Coffee machine with delicious coffee We provide the necessary equipment (Macbook and so on) A top modern office in Hamburg SternschanzeDo you love sales and want to work from anywhere? Apply now as an internal sales representative (m\/f\/d) at thejugglingswan GmbH and become part of our dynamic team!Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/thejugglingswan-gmbh\/vertriebsinnendienst-100-remote-hamburg-186916","tags":["Remote","Distribution Marketing"],"job_types":["berufseinstieg"],"location":"Hamburg","created_at":1702892942000,"original_language":"deu"},{"slug":"applikationsingenieur-in-bereich-vertriebsinnendienst-saarbrucken-90095","company_name":"Fluid.iO Sensor + Control GmbH & Co. KG","title":"Application Engineer - Area: Internal Sales (m\/f\/d)","description":"We are a rapidly growing industrial company that develops, produces and sells reliable sensor technology and electronics for measuring, testing and controlling gases and liquids. Tasks Your tasks: You are the first point of contact for our customers for technical products and solutions in the B2B sector: convincing ideas from our innovative products for (potential) customers Support in the implementation of applications and requirements of our customers Sales support activities (telephone customer advice, technical support, preparation of offers) Collaboration with R&D and marketing (product documentation, carrying out product and system tests, trade fair preparation and implementation) Qualifications This is what you bring with you : completed studies in electrical engineering, process engineering or a related technical field, initial professional experience in the field of industrial measurement, control, regulation technology and\/or process engineering. Productivity, customer orientation, creativity and willingness to help - both independently and in a team. Enthusiasm for technical craftsmanship. Benefits. What we offer: Training takes place \"on the job\" in a committed, competent team. Long-term collaboration. Modern and familiar working environment with short decision-making processes. Independent work in varied and individual projects. Flexible working hours. Performance-related remuneration. Development and career opportunities. B. company pension scheme with an employer subsidy above the law Further details about the employment: Place of work: Saarbrücken Entry level: graduate, if necessary, initial experience Type of employment: full-time Start of activity: immediately The job advertisement applies equally to people of all genders. Find Jobs in Germany on Arbeitsnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/fluidio-sensor-control-gmbh-co-kg\/applikationsingenieur-in-bereich-vertriebsinnendienst-saarbrucken-90095","tags":["Engineering"],"job_types":[],"location":"Saarbrücken","created_at":1702892942000,"original_language":"deu"},{"slug":"allrounder-in-buchhaltung-rechnungswesen-berlin-1354","company_name":"Adato AG","title":"All-rounder in bookkeeping\/accounting","description":"Workload: 100% Start of position: immediately\/by arrangement Place of work: Airport region Type of employment: Permanent position Introduction: For our client, an innovative SME in the service sector, we are looking for an experienced all-rounder personality immediately or by arrangement to support the existing accounting team. Job description: Several years of relevant professional experience and completed training in the field of accounting are required. You also communicate fluently in German; other languages ​​such as FR\/EN are an advantage. A well-filled backpack of experience as well as your “hands-on” Mentality rounds off your profile. Requirements profile: In this exciting position you will have contact with the following tasks: account assignment and recording of incoming invoices, monitoring the accounts payable workflow, managing accounts payable and asset accounting as well as assisting with monthly, quarterly and annual financial statements. The topics of direct debit, reading in daily debtor payments, paying out creditors and general accounting tasks such as transitory bookings and evaluations\/analyses are not new territory for you. In-depth knowledge of payment transactions is a great advantage. Have we sparked your interest? Then apply today, we look forward to hearing from you.__Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/adato-ag\/allrounder-in-buchhaltung-rechnungswesen-berlin-1354","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702892942000,"original_language":"deu"},{"slug":"senior-consultant-sap-mm-mannheim-474553","company_name":"Avvale GmbH","title":"(Senior) Consultant SAP MM (m\/w\/d)","description":"Tauchen Sie ein in ein Universum grenzenloser Mglichkeiten und gestalten Sie aktiv unsere gemeinsame Zukunft mit  werden Sie Teil von Avvale in Deutschland!Um das Potenzial unserer Kunden optimal zu nutzen und unsere Beratungsfelder weiterzuentwickeln und zu vertiefen, suchen wir eine\/einen (Senior) Consultant SAP MM (m\/w\/d) mit hoher Eigenmotivation und dem Ziel, sich in unseren von Innovation und Wachstum geprgten Unternehmensalltag einzubringen.Als Teil von Avvale in Deutschland tragen Sie aktiv zur Gestaltung einer gemeinsamen und nachhaltigen Zukunft bei. Bei uns erwartet Sie von Anfang an die Mglichkeit, Verantwortung zu bernehmen und sich in einem professionellen Umfeld schnell weiterzuentwickeln. Ihre Ideen und Ihr Engagement sind bei uns gefragt, um innovative Lsungen fr unsere Kunden zu schaffen und neue Mastbe in der Branche zu setzen.AufgabenDurchfhrung von Digitalisierungs- und Implementierungsprojekten im SAP-Umfeld als Teilprojektleiter SAP MMMitgestaltung, Planung und Durchfhrung von BeratungsprojektenKonzepterstellung mit Vorschlgen zu Handlungsempfehlungen und Umsetzung in den Kunden-SystemenKonstruktive, lsungsorientierte und partnerschaftliche Zusammenarbeit mit dem Kunden und dem ProjektteamQualifikationMust-have:Mehrjhrige Berufserfahrung als SAP Consultant oder Key User im Bereich SAP MMSehr gute Kenntnisse im SAP-Modul MM (Prozesse, Customizing, Stammdaten)Sicheres und berzeugendes Auftreten, sowie eine ausgeprgte Kommunikationsfhigkeit und eine proaktive ArbeitsweiseFlexibilitt, Reisebereitschaft, Kundenorientierung und ausgeprgte Analysefhigkeiten runden Ihr Profil abFlieende Deutschkenntnisse und sehr gute Englischkenntnisse sind VoraussetzungWnschenswert:Erfahrungen in SAP Rollout Projekten (idealerweise S\/4HANA Rollouts)Strukturierte, zielorientierte Arbeitsweise und eine konzeptionelle DenkweiseKenntnisse in einem weiteren SAP-ModulBenefitsArbeitsmodell nach Ihren Bedrfnissen: Genieen Sie Flexibilitt durch flexible Arbeitszeiten und einen Mobile Office VertragAttraktives Vergtungspaket: Neben einem wettbewerbsfhigen Grundgehalt bieten wir Ihnen die Option auf einen Firmenwagen sowie grozgige Beitrge zur betrieblichen AltersvorsorgeNachhaltige Mobilittsoptionen: Erhalten Sie einen Zuschuss zum Leasing eines E-Bikes im Rahmen unseres Dienstrad-ProgrammsAgile Unternehmensstruktur: Bei uns genieen Sie die Freiheit, rasch in Verantwortungsfelder aufzusteigen und eigene Ideen einzubringen, dabei profitieren Sie von flachen Hierarchien und kurzen EntscheidungswegenIndividuelle Karrierebegleitung und fokussierte Entwicklung: Persnliches Mentoring und zielgerichtete Entwicklungsgesprche bilden die Grundlage fr kontinuierliche berufliche Aufstiegschancen und KompetenzsteigerungIndividuell gestaltbare Weiterbildung: Sie erhalten bei uns die Freiheit, aus einer Reihe von Weiterbildungsinitiativen diejenigen auszuwhlen, die Ihren beruflichen und persnlichen Entwicklungszielen entsprechenInternationales Netzwerk und Team-Events: Tauschen Sie sich innerhalb eines globalen Kollegen-Netzwerks aus und nehmen Sie an regelmigen Firmenevents teilWir freuen uns auf Sie!Starten Sie mit uns in eine aufregende neue Beratungszeit in der fnften industriellen Revolution! Leben Sie die Ihnen gebotenen Freirume aus und gestalten Sie aktiv unsere gemeinsame Zukunft mit.Senden Sie hierzu bitte Ihre aussagekrftigen Bewerbungsunterlagen (Anschreiben, Lebenslauf, Projektliste) hier ber Join zu.BER UNS:Avvale ist ein global agierendes Beratungsunternehmen fr digitale Unternehmenstransformation mit mehr als 3.000 Mitarbeitenden, die ber mehrere Kontinente hinweg Unternehmen auf ihrem Weg zur Industrie 5.0 begleiten. Nachhaltigkeit und Circular Economy nehmen dabei einen besonderen Platz ein. Wir untersttzen unsere Kunden dabei, die heutigen Herausforderungen erfolgreich zu meistern, sowohl nachhaltig als auch profitabel zu wirtschaften und ihre Geschftsprozesse mithilfe der neuesten Technologien zu optimieren und zu digitalisieren und die digitale Transformation erfolgreich zu gestalten.Unsere Dienst- und Beratungsleistungen erstrecken sich ber eine breite Palette von Branchen und Themen, dabei liegt unsere herausragende Kompetenz rund um SAP. In Deutschland konzentrieren wir uns auf die Hauptbereiche: SAP ERP Consulting & S\/4HANA Migration, Digital Experience & Cloud Innovations, System Integration sowie das Application Lifecycle Management. Unser Leistungsportfolio umfasst die Implementierung und Maintenance fhrender SAP Lsungen sowie die Planung und Entwicklung mageschneiderter digitaler Plattformen. Darber hinaus bieten wir umfassende Beratungsleistungen im Bereich Test- Incident & Change Management an.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/avvale-gmbh\/senior-consultant-sap-mm-mannheim-474553","tags":["Remote","SAP\/ERP Consulting","Development"],"job_types":[],"location":"Mannheim","created_at":1702892942000,"original_language":"eng"},{"slug":"senior-consultant-sap-sd-mannheim-191730","company_name":"Avvale GmbH","title":"(Senior) Consultant SAP SD (m\/w\/d)","description":"Tauchen Sie ein in ein Universum grenzenloser Mglichkeiten und gestalten Sie aktiv unsere gemeinsame Zukunft mit  werden Sie Teil von Avvale in Deutschland!Um das Potenzial unserer Kunden optimal zu nutzen und unsere Beratungsfelder weiterzuentwickeln und zu vertiefen, suchen wir eine\/einen (Senior) Consultant SAP SD (m\/w\/d) mit hoher Eigenmotivation und dem Ziel, sich in unseren von Innovation und Wachstum geprgten Unternehmensalltag einzubringen.Als Teil von Avvale in Deutschland tragen Sie aktiv zur Gestaltung einer gemeinsamen und nachhaltigen Zukunft bei. Bei uns erwartet Sie von Anfang an die Mglichkeit, Verantwortung zu bernehmen und sich in einem professionellen Umfeld schnell weiterzuentwickeln. Ihre Ideen und Ihr Engagement sind bei uns gefragt, um innovative Lsungen fr unsere Kunden zu schaffen und neue Mastbe in der Branche zu setzen.AufgabenDurchfhrung von Digitalisierungs- und Implementierungsprojekten im SAP-Umfeld als Teilprojektleiter SAP SDMitgestaltung, Planung und Durchfhrung von BeratungsprojektenKonzepterstellung mit Vorschlgen zu Handlungsempfehlungen und Umsetzung in den Kunden-SystemenKonstruktive, lsungsorientierte und partnerschaftliche Zusammenarbeit mit dem Kunden und dem ProjektteamQualifikationMust-have:Mehrjhrige Berufserfahrung als SAP Consultant oder Key User im Bereich SAP SDSehr gute Kenntnisse im SAP-Modul SD (Prozesse, Customizing, Stammdaten)Flexibilitt, Reisebereitschaft, Kundenorientierung und ausgeprgte Analysefhigkeiten Sicheres und berzeugendes Auftreten, sowie eine ausgeprgte Kommunikationsfhigkeit und eine proaktive ArbeitsweiseFlieende Deutschkenntnisse und sehr gute EnglischkenntnisseWnschenswert:Erfahrungen in SAP Rollout Projekten (idealerweise S\/4HANA Rollouts)Kenntnisse in angrenzenden SAP Modulen (z. B. VC, PP, MM, LE)Strukturierte, zielorientierte Arbeitsweise und eine konzeptionelle DenkweiseBenefitsArbeitsmodell nach Ihren Bedrfnissen: Genieen Sie Flexibilitt durch flexible Arbeitszeiten und einen Mobile Office VertragAttraktives Vergtungspaket: Neben einem wettbewerbsfhigen Grundgehalt bieten wir Ihnen die Option auf einen Firmenwagen sowie grozgige Beitrge zur betrieblichen AltersvorsorgeNachhaltige Mobilittsoptionen: Erhalten Sie einen Zuschuss zum Leasing eines E-Bikes im Rahmen unseres Dienstrad-ProgrammsAgile Unternehmensstruktur: Bei uns genieen Sie die Freiheit, rasch in Verantwortungsfelder aufzusteigen und eigene Ideen einzubringen, dabei profitieren Sie von flachen Hierarchien und kurzen EntscheidungswegenIndividuelle Karrierebegleitung und fokussierte Entwicklung: Persnliches Mentoring und zielgerichtete Entwicklungsgesprche bilden die Grundlage fr kontinuierliche berufliche Aufstiegschancen und KompetenzsteigerungIndividuell gestaltbare Weiterbildung: Sie erhalten bei uns die Freiheit, aus einer Reihe von Weiterbildungsinitiativen diejenigen auszuwhlen, die Ihren beruflichen und persnlichen Entwicklungszielen entsprechenInternationales Netzwerk und Team-Events: Tauschen Sie sich innerhalb eines globalen Kollegen-Netzwerks aus und nehmen Sie an regelmigen Firmenevents teilWir freuen uns auf Sie!Starten Sie mit uns in eine aufregende neue Beratungszeit in der fnften industriellen Revolution! Leben Sie die Ihnen gebotenen Freirume aus und gestalten Sie aktiv unsere gemeinsame Zukunft mit.Senden Sie hierzu bitte Ihre aussagekrftigen Bewerbungsunterlagen (Anschreiben, Lebenslauf, Projektliste) hier ber Join zu.BER UNS:Avvale ist ein global agierendes Beratungsunternehmen fr digitale Unternehmenstransformation mit mehr als 3.000 Mitarbeitenden, die ber mehrere Kontinente hinweg Unternehmen auf ihrem Weg zur Industrie 5.0 begleiten. Nachhaltigkeit und Circular Economy nehmen dabei einen besonderen Platz ein. Wir untersttzen unsere Kunden dabei, die heutigen Herausforderungen erfolgreich zu meistern, sowohl nachhaltig als auch profitabel zu wirtschaften und ihre Geschftsprozesse mithilfe der neuesten Technologien zu optimieren und zu digitalisieren und die digitale Transformation erfolgreich zu gestalten.Unsere Dienst- und Beratungsleistungen erstrecken sich ber eine breite Palette von Branchen und Themen, dabei liegt unsere herausragende Kompetenz rund um SAP. In Deutschland konzentrieren wir uns auf die Hauptbereiche: SAP ERP Consulting & S\/4HANA Migration, Digital Experience & Cloud Innovations, System Integration sowie das Application Lifecycle Management. Unser Leistungsportfolio umfasst die Implementierung und Maintenance fhrender SAP Lsungen sowie die Planung und Entwicklung mageschneiderter digitaler Plattformen. Darber hinaus bieten wir umfassende Beratungsleistungen im Bereich Test- Incident & Change Management an.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/avvale-gmbh\/senior-consultant-sap-sd-mannheim-191730","tags":["Remote","SAP\/ERP Consulting","Development"],"job_types":[],"location":"Mannheim","created_at":1702892942000,"original_language":"eng"},{"slug":"senior-talent-acquisition-manager-all-genders-munich-124318","company_name":"Parkdepot","title":"Senior Talent Acquisition Manager (all genders) Munich","description":"Your new roleAre you ready to join us on an exciting road trip? We are an emerging startup and aim to turn parking management on its head. You support your colleagues in building a product that revolutionizes the way parking is managed. With our innovative technology, we are ready to transform mobility and explore new ways of doing things.  Imagine yourself actively shaping the growth of our company and having a significant impact on the future of urban mobility. With your expertise in Talent Acquisition and the entire Candidate Journey you will strengthen our position as market leader, while as Talent Acquisition Manager (all genders) you will achieve new successes together with our excellent team.What to expectSparring partner: Forge strong partnerships with department heads, gaining insights into recruitment requirements, and offer adept coaching and support in market dynamics, interview techniques, and process best practicesHiring Strategies: You oversee hiring needs, comprehend priorities in the recruitment process, and develop suitable sourcing strategies based on that understanding to attract active and passive talentData: Shape business decisions and hiring strategies by utilizing your market expertise and harnessing the power of dataProcesses: Champion top-tier processes and systems, aiding in the preservation of data integrity and adherence to processes, all geared towards cultivating a positive hiring experience for both candidates and hiring teamsEmployer Branding: You serve as a brand ambassador, promoting our employer brand externallyInspire us byExperience: Proven track record in in-house recruiting, specializing in engineering \/ tech profiles and experience in sourcing, engaging, and activating passive candidatesCandidate Experience: Deep understanding of balancing candidate experience and impactful interview processesHands-on: You enjoy working independently in a dynamic environment and are characterized by your proactive approachData-driven: You take a data-driven approach and have the ability to work in a solution-oriented way to gather meaningful analytics for hiring through recruitment dataCommunication: Proficiency in both German and English languagesWhat we offer youFlexibility: Our model allows you to tailor your work schedule to your unique requirements, ensuring maximum flexibility.Equipment: Decide on your own equipment to work efficiently and comfortably.Workation: Work in inspiring locations during your Workation for fresh ideas.Measurable goals: Our OKRs allow you to directly measure your impact on our product and company success.Catering: Fresh coffee from our portafilter machine around the clock for your energy and productivity. Discover the variety of Bella&Bona, our online cafeteria, or help yourself to our fruit basket or enjoy breakfast at the cereal bar.Dress code: Dress in a way that makes you feel most comfortable.Events: Celebrate our successes at our legendary team events and OKR parties.Development: Take advantage of our language courses or in-house training programs to learn new skills.Health: We support your health and fitness with EGYM to keep you active.Security: Your workplace security is ensured by our profitable business model.Profit sharing: Benefit from our Virtual Stock Option Plan (VSOP) and participate in the success of Parkdepot.Innovation through diversityRegardless of your background, origin, gender identity, or individual circumstances, it's your personality that interests us. That's why we're committed to building a culture of collaboration and respect, where every team member has a voice, can grow, and feels valued with us.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parkdepot\/senior-talent-acquisition-manager-all-genders-munich-124318","tags":["HR"],"job_types":["professional \/ experienced"],"location":"Munich","created_at":1702892942000,"original_language":"eng"},{"slug":"maschineneinrichterin-in-3-schicht-kehl-40002","company_name":"CARECOS Kosmetik GmbH","title":"Maschineneinrichter:in (m\/w\/d) in 3-Schicht","description":"Die JDA cosmetic group ist ein international ttiger Hersteller von High End Wirkstoffkosmetik. Teil der Gruppe ist die Eigenmarke JEAN DARCEL Cosmtique GmbH & Co. KG und der erfahrene Lohnhersteller CARECOS Kosmetik GmbH. Die stark expandierende CARECOS Kosmetik GmbH ist seit mehr als 25 Jahren fr die Entwicklung und Herstellung von Hautpflegeprodukten der JDA-Produkte und fr viele namhafte hochwertige Kosmetikmarken in Deutschland sowie international ttig. Fr die CARECOS Kosmetik GmbH suchen wir zum nchstmglichen Zeitpunkt eine:n Mitarbeiter:in (m\/w\/d) in der Betriebstechnik.AufgabenRsten, Einstellen und Justieren von Abfll- & VerpackungsanlagenAnlagenbetreuung in der laufenden FertigungBehebung von technischen StrungenPlanung und Durchfhrung von Instandhaltungs- und WartungsarbeitenErprobung neuer und Optimierung bestehender AbfllvorgngeQualifikationAbgeschlossene Berufsausbildung (Mechanik, Elektrotechnik, Steuerungstechnik) oder Quereinsteiger mit entsprechender BerufserfahrungKenntnisse in der Produktions-\/ Abfll- und VerpackungstechnikIdealerweise aus der Kosmetik-\/ Lebensmittel- oder PharmaindustrieErfahrung in der Wartung von industriellen AnlagenGute Deutschkenntnisse in Wort und SchriftZuverlssigkeit und TeamfhigkeitVerantwortungs- und Qualittsbewusstsein, selbststndige ArbeitsweiseGute EDV-KenntnisseBereitschaft zur Schichtarbeit (3-Schichtbetrieb), Option Dauernachtschicht ist auf Wunsch mglichBenefitsEine 38,5 Stunden-Woche30 Tage Urlaub sowie ein 13. GehaltMitarbeiterrabatte und -benefits, wie z.B. unsere SpenditCardTtigkeitsbezogene WeiterbildungsangeboteVermgenswirksame Leistungen und Mglichkeit der Entgeltumwandlung zur betrieblichen AltersvorsorgeBetriebliches GesundheitsmanagementModerne Technik-AusstattungTeamevents wie Sommerfest, Weihnachtsfeier, TeambuildingUmfassende Einarbeitung und Kolleg:innen, die ihr Wissen gerne teilenEin familiengefhrtes Unternehmen mit Duz-KulturEin stark wachsendes Team mit flachen Hierarchien und einem kollegialen ArbeitsumfeldBitte senden Sie uns Ihre vollstndigen Bewerbungsunterlagen unter Angabe Ihrer Gehaltsvorstellungen und Ihrem frhestmglichen Eintrittsdatum zu. Wir freuen uns auf Ihre aussagekrftige Bewerbung!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/carecos-kosmetik-gmbh\/maschineneinrichterin-in-3-schicht-kehl-40002","tags":["Industrial Engineer"],"job_types":[],"location":"Kehl","created_at":1702892942000,"original_language":"eng "},{"slug":"leiter-kundenservice-callcenter-rottenburg-53709","company_name":"Kopp Verlag e.K.","title":"Leiter Kundenservice \/ Callcenter (m\/w\/d)","description":"Wir suchen zum nchstmglichen Termin einen Leiter Kundenservice (m\/w\/d) fr unseren Unternehmenssitz in Rottenburg am Neckar. Sie leiten unseren Kundenservice und steuern unsere externen Callcenter.AufgabenFachliche und disziplinarische Fhrung sowie Weiterentwicklung der Mitarbeiter im eigenen Kundenservice-Team Entwicklung von Manahmen zur Motivation des eigenen Teams Fhren von Mitarbeitergesprchen sowie Mitarbeit bei Trainings- und CoachingmanahmenBearbeitung von Eskalationsfllen und KundenbeschwerdenErstellen von Forecasts Sicherstellung bzw. Weiterentwicklung unserer Servicequalitt sowie Gewhrleistung einer hervorragenden Kundenbetreuung und hohen KundenzufriedenheitBerichterstattung ber Leistungskennzahlen und -trendsMonitoring der Verkaufserfolge und kontinuierliche Weiterentwicklung der einzelnen TeammitgliederAbstimmung und Fhrung der externen CallcenterAktive Mitarbeit im Tagesgeschft in der HauptsaisonQualifikationAbgeschlossenes Studium der Betriebswirtschaft oder vergleichbare QualifikationMehrjhrige Berufserfahrung im (telefonischen) Kundenservice im B2C-UmfeldErfahrungen in der fachlichen und disziplinarischen FhrungVerhandlungssichere Deutschkenntnisse in Wort und SchriftAusgeprgte Kunden- und Serviceorientierung sowie hohe KommunikationsstrkeTeamorientierte Einstellung und die Fhigkeit, andere zu berzeugen und zu motivierenAusgeprgte VertriebsorientierungSelbstsicheres Auftreten als kooperative Fhrungspersnlichkeit mit Entscheidungs- und KonfliktlsungsstrkeServiceorientierte und empathische PersnlichkeitBereitschaft, im Team zu agieren und Entscheidungen gemeinsam zu tragenBenefitsWir bieten eine angenehme Arbeitsatmosphre und kurze Entscheidungswege. Auerdem erwartet Sie bei uns:Ein moderner, lichtdurchfluteter, klimatisierter Arbeitsplatz in unserem neugebauten, architektonisch interessanten Firmengebude direkt an der NaturEin eigenes Betriebsrestaurant mit reichhaltigem Angebot, gratis Tafelwasser, Kaffee sowie frisches ObstEine optimale Lage an der B28 mit Parkflchen direkt am GebudeRadabstellflchen, Umkleiderume und Duschen sowie eine gute Anbindung an den ffentlichen NahverkehrHohe Mitarbeiterrabatte auf das komplette Sortiment von ber 13 Millionen ArtikelnUntersttzung bei der Altersvorsorge durch vermgenswirksame Leistungen und eine Mglichkeit der betrieblichen AltersvorsorgeGemeinsame MitarbeitereventsEin attraktives Vergtungspaket30 Tage Urlaub und 24. wie 31.12. freiEine wertschtzende \"Du\"-KulturUnd natrlich eine sorgfltige EinarbeitungWir haben Ihr Interesse geweckt?Dann freuen wir uns auf Ihre aussagekrftige Bewerbung mit:AnschreibenLebenslaufArbeits- und AusbildungszeugnissenKndigungsfrist und EintrittsterminSowie Ihren GehaltsvorstellungenFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kopp-verlag-ek\/leiter-kundenservice-callcenter-rottenburg-53709","tags":["Customer Service"],"job_types":["teamleitung"],"location":"Rottenburg","created_at":1702889342000,"original_language":"eng"},{"slug":"full-stack-developer-all-genders-krefeld-348796","company_name":"KOMMSOFT - R+R IT-Solutions GmbH","title":"Full Stack Developer (all genders)","description":"Wir sind KOMMSOFT - Experten fr Softwareentwicklung und suchen einen Full Stack Entwickler zur Untersttzung unseres jungen & dynamischen Teams.Bei uns dreht sich alles um Innovation, Technologie und die Bereitstellung hervorragender Produkte fr Verwaltungen.Wenn Du eine Leidenschaft fr Innovation hast und gerne in einem kreativen und untersttzenden Umfeld arbeiten mchtest passt du wie die Faust aufs Auge zu uns.Trau dich und spring ins warme Wasser und starte mit deiner Karriere endlich durch.AufgabenNeu und Weiterentwicklungen von Web ApplikationenFrontend Entwicklung mit HTML \/ CSS \/ JavaScript \/ Angular(JS)Backend Entwicklung mit PHPDatenbankentwicklung mit SQL (MSSQL)Quellcode auf Herz und Nieren testenSecond-Level-SupportSpa daran haben, eigene Ideen\/Erfahrungen & Verbesserungsmglichkeiten einzubringenKontinuierliche Weiterentwicklung der eigenen FachkenntnisseAber vor allem: Die Digitlisierung voranbringen!QualifikationDu hast gute Kommunikationsfhigkeiten und kannst technische Konzepte verstndlich erklrenDu bist kundenorientiert und hast Spa daran, individuelle Lsungen zu entwickelnDu bist geduldigDu arbeitest gerne im Team und bist flexibel, um auf wechselnde Anforderungen reagieren zu knnenSuper wre, wenn du dich in den o.g. Sprachen sowie mit Webservern (IIS), GIT & CI\/CD auskennstBenefitsGenau wie wir sind unsere Benefits dynamisch und kreativ, so wie viel knnen wir sagen: Mobiles & flexibles Arbeiten, regelmige Mitarbeiter Events und Feel Good im Arbeitsalltag sowie im Bro und Zuhause sind fr uns selbstverstndlich.Mchtest du in einem jungen dynamischen Unternehmen arbeiten, das sich auf die Digitalisierung unserer Verwaltungen also auch unser eigenes Leben spezialisiert hat? Bewirb dich jetzt als  bei KOMMSOFT!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kommsoft-rr-it-solutions-gmbh\/full-stack-developer-all-genders-krefeld-348796","tags":["Software Development"],"job_types":[],"location":"Krefeld","created_at":1702889342000,"original_language":"eng"},{"slug":"it-consultant-requirements-engineer-software-kundenberater-all-genders-krefeld-133380","company_name":"KOMMSOFT - R+R IT-Solutions GmbH","title":"IT-Consultant \/  Requirements Engineer \/ Software-\/Kundenberater (all genders)","description":"Wir sind KOMMSOFT - Experten fr Softwareentwicklung und suchen einen IT-Consultant \/ Requirements Engineer \/ Software-\/Kundenberater zur Untersttzung unseres jungen & dynamischen Teams.Bei uns dreht sich alles um Innovation, Technologie und die Bereitstellung hervorragender Produkte fr Verwaltungen.Wenn Du eine Leidenschaft fr Innovation hast und gerne in einem kreativen und untersttzenden Umfeld arbeiten mchtest passt du wie die Faust aufs Auge zu uns.Trau dich und spring ins warme Wasser und starte mit deiner Karriere endlich durch.AufgabenAnforderungsanalyse fr neue Softwareprojekte durchfhrenKunden bei der Definition und Spezifikation von Anforderungen untersttzen(Technische) Lsungen konzipieren und prsentieren, um die Kundenbedrfnisse zu erfllenEng mit dem Entwicklungsteam zusammenarbeiten, um die Umsetzung der Anforderungen sicherzustellenKundensupport bei technischen Fragen und ProblemenQualifikationDu besitzt Kenntnisse in der Softwareentwicklung und hast bereits Erfahrung als IT-Consultant, Requirements Engineer oder Software-\/Kundenberater gesammeltDu bist kommunikationsstark und kannst technische Sachverhalte verstndlich erklrenDu hast ein ausgeprgtes Verstndnis fr die Bedrfnisse und Anforderungen der Kunden und kannst diese in technische Lsungen bersetzenDu bringst eine hohe Kundenorientierung mit und arbeitest gerne im TeamBenefitsGenau wie wir sind unsere Benefits dynamisch und kreativ, so wie viel knnen wir sagen: Mobiles & flexibles Arbeiten, regelmige Mitarbeiter Events und Feel Good im Arbeitsalltag sowie im Bro und Zuhause sind fr uns selbstverstndlich.Mchtest du in einem jungen dynamischen Unternehmen arbeiten, das sich auf die Digitalisierung unserer Verwaltungen also auch unser eigenes Leben spezialisiert hat? Bewirb dich jetzt als bei KOMMSOFT!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kommsoft-rr-it-solutions-gmbh\/it-consultant-requirements-engineer-software-kundenberater-all-genders-krefeld-133380","tags":["Consulting","Engineering"],"job_types":[],"location":"Krefeld","created_at":1702889342000,"original_language":"eng"},{"slug":"2300-2800eur-provision-sales-agent-telefonischer-kundenberater-berlin-360093","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2800€ + commission sales agent\/telephone customer advisor m\/f\/d","description":"Would you like to work for an international company that is one of the market-leading independent service providers in the field of fuel card solutions in Germany? We are looking for telephone customer advisors, sales agents, call center agents, telephone customer advisors m\/f\/d in outbound, customer service. The team in Berlin is expanded and you can work as a telephone customer advisor (m\/f\/d) for the internal sales department. As a telephone customer advisor, sales agent, call center agent, telephone customer advisor m\/f\/d you can expect: tasks customer advice inbound and outbound telephony ( B2B) Offer creation and processing Existing customer support (B2B) E-mail and fax processing Qualifications Ability to work in a team Friendly demeanor Experience in sales, ideally in telephone sales Loyalty Efficient, fast way of working Knowledge of PC applications and office programs Business-fluent knowledge of German Benefits Fixed salary (negotiable, at least 2300 - 2800) plus uncapped bonus ( on average 300-500 in the first quarter), when quarterly targets are achieved, the basic salary and bonus payments increase. Pleasant office in 10117 Berlin (near Friedrichstrasse S-Bahn station) Working hours from Monday to Thursday 8:30 a.m. to 4:45 p.m. on Friday until 3 p.m. (37 .5 hours)Development opportunities in an international companyApplicationHave we aroused your interest? We look forward to receiving your application documents. Feel free to email or WhatsApp.Ivonne WreschW & W Human Resources01523\/3605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2800eur-provision-sales-agent-telefonischer-kundenberater-berlin-360093","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702889342000,"original_language":"deu"},{"slug":"2500eur-mitarbeiter-terminierung-berlin-46842","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ employee m\/f\/d scheduling","description":"Would you like to work for an international company that is one of the market-leading independent service providers in the area of ​​fuel card solutions in Germany? We are looking for Telephone Customer Advisors, Call Center Agents, Telephone Customer Advisors m\/f\/d in the area of ​​existing customers.As Telephone Customer Advisors, Call Center Agents, Telephone customer advisor m\/f\/d awaits you:TasksCustomer satisfaction surveyNeeds assessmentScheduling for the sales teamQuality managementExpanding your own portfolio through customer loyalty and customer recommendationsQualificationIdeally, first or several years of experience in existing customer care and telephonyStrong communication, enthusiasm and teamwork skillsGood self-organizationGood MS Office knowledgeFluent in GermanBenefits2500 (negotiation bar)Pleasant Office in 10117 Berlin (near Friedrichstrasse S-Bahn station) Working hours from Monday to Thursday 8:30 a.m. 4:45 p.m. on Friday until 3 p.m. (37.5 hours) Development opportunities in an international company Application Have we aroused your interest? We look forward to receiving your application documents. Feel free to email or WhatsApp.Ivonne WreschW & W Human Resources01523\/3605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-mitarbeiter-terminierung-berlin-46842","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702889342000,"original_language":"deu"},{"slug":"2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-428738","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2600€ + 500€ bonus Telephone customer advisor m\/f\/d","description":"Would you like to work for an international company that is one of the market-leading independent service providers in the field of fuel card solutions in Germany? The team in Berlin is being expanded and we are looking for customer advisors\/clerks m\/f\/d in inbound. Tasks Customer support Quotation creation and processing Final processing of all customer inquiries E-mail - and fax processingInterface to other departmentsQualificationsAbility to work in a teamFriendly demeanorPleasant voiceKnowledge of spoken and written German at a native speaker levelEfficient, fast way of workingFun on the phoneMS Office skills in particularExcellent English skills for internal communicationBenefits2300 2600 gross (negotiable professional experience) plus 500 bonusPleasant officeNhe FriedrichstrasseWorking hours from Mon-Thu 8:30 a.m. 5 p.m., Friday until 3 p.m. Full time 37.5 hoursDevelopment opportunities in an international companyApplication:We look forward to receiving your application by email or WhatsAppIvonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-428738","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702889342000,"original_language":"deu"},{"slug":"2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-204237","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Telephone customer advisor m\/f\/d additional dental insurance","description":"To support the customer management team in the area of ​​supplementary dental insurance, we are looking for call center agents, telephone customer advisors m\/f\/d in customer service in Hamburg. As a call center agent, telephone customer advisor m\/f\/d you can expect: Tasks Advising existing and new customers on the topic Supplementary dental insurance by telephone and email (no cold calling) Creation of individual offers for the dental supplement area Collection and maintenance of customer data as well as responsibility for applications Interface function between customers and insurance companies Support in the permanent development of the comparison offer Qualification Commercial training (e.g. office clerk or insurance specialist ) or also like insurance career changerFirst experience in customer adviceHigh customer orientation as well as a confident and friendly demeanor on the telephoneResponsible, conscientious and structured way of workingHands-on mentality and strength of implementation with a focus on detailEnthusiasm for digital business modelsBenefitsPermanent employment contractWorking hours from Monday to Friday between 8 a.m. and 8 p.m.Salary 30 a.m. to 32 p.m.Intensive and individual trainingProfessional qualifications in the health insurance sectorWorking independently in a dynamic working environmentCentral location with excellent transport connections and a view of the AlsterSubsidy for the HVV ProfiCardIndividual development and further training opportunitiesFriendly working environment with a first-name culture, shared lunch breaks and many team eventsHave we aroused your interest? Then we look forward to receiving your application. You are welcome to apply by email or WhatsApp. If you have any questions, Ivonne Wresch will be happy to help you. 0152\/33605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-204237","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702889342000,"original_language":"deu"},{"slug":"sachbearbeiter-versicherung-vz-und-tz-moglich-mo-fr-hamburg-314574","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Clerk m\/f\/d insurance VZ and TZ possible. Mon-Fri","description":"Do you want to work for a leading online comparison portal? We are looking for employees\/clerks m\/f\/d to support the back office team in the insurance sector. We look forward to receiving your application as a career changer m\/f\/d insurance clerks full-time or part-time from 16 hours\/week. Task-independent review of Insurance applicationsSupport with telephone inquiries from existing customers (m\/f\/d)Communication with insurance companies is an interface between customer advisors (m\/f\/d) and external insurance companiesQualificationAn independent, reliable and detail-oriented way of working is what sets you apartIdeally - initial experience in clerical processing etc. ( possibly through internships or working student positions) high customer orientation as well as a confident and friendly demeanor in telephone and written contactBenefitsCentral workplace - home office days possibleOffice working hours between 9 a.m. and 5 p.m. 30,000 p.a.more than 30 days vacation possiblequalified trainingHave we aroused your interest? Then we look forward to receiving your application. We would be happy to send you an email or WhatsApp on 0152\/33605774 (CV is sufficient). If you have any questions, Ivonne Wresch will be happy to help you. Telephone 0152\/33605774 Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/sachbearbeiter-versicherung-vz-und-tz-moglich-mo-fr-hamburg-314574","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702889342000,"original_language":"deu"},{"slug":"telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-429263","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Telefonischer Kundenbetreuer m\/w\/d 2*pro Woche Home Office Schichtzulagen ab 18 Uhr","description":"Wollen Sie als Kundenbetreuer m\/w\/d fr ein Hotelvergleichsportal arbeiten?Als Kundenberater m\/w\/d erwartet Sie:AufgabenSie betreuen die Kunden bei Fragen und Problemen am Telefon oder per Mail und kmmern sich dabei professionell und freundlich um eine schnelle und zufriedenstellende LsungSie sind verantwortlich fr die fachliche Prfung und Bewertung von KundenanliegenSie stellen die zgige Abwicklung und den Abschluss der Kundenanfragen in enger Zusammenarbeit mit den nationalen und internationalen Partnern sicherSie haben stets ein offenes Ohr fr die Kunden und schaffen es, bei Rckfragen zu Buchungen  per Telefon und E-Mail  kulante Lsungen zur Zufriedenheit der Kunden zu findenGemeinsam mit dem Team wirken Sie an der internen Qualittssicherung mit, um eine fehlerfreie Bearbeitung sicherzustellenZur Weiterentwicklung der internen Prozesse, arbeiten Sie eng mit den Experten zusammenQualifikationBerufserfahrung im Dialogmarketing, in der Touristik \/ Hotelbranche (z.B. Reservierungsabteilung) oder im telefonischen KundenkontaktIdealerweise bringen Sie eine abgeschlossene Ausbildung im kaufmnnischen oder touristischen Bereich mitIn Beratungsgesprchen mit den Kunden zeichnen Sie sich durch ein freundliches, serises und lsungsorientiertes Auftreten aus  Sie bringt so schnell nichts aus der RuheSie sind ein echter Teamplayer (m\/w\/d), haben Spa am gemeinsamen Erfolg und bringen eigene Ideen einSchriftlich und mndlich berzeugen Sie mit verhandlungssicheren Deutschkenntnissen sowie mit sicheren EnglischkenntnissenVersierter Umgang mit den gngigen PC- und InternetanwendungenZeitliche Flexibilitt Randarbeitszeiten zwischen 8 und 22 Uhr abzudecken (Frh-\/Mittel-\/Sptschicht) sowie Bereitschaft zur Arbeit an Wochenenden und Feiertagen (5-Tage-Woche)Benefitsunbefristeter Arbeitsvertrag, eine attraktive Vergtung fr Wochenend-, Feiertags- und Sptschichten sowie jhrliche Prmien fr besondere Erfolge. Die bernahme von Verantwortung wird zustzlich honoriert (z.B. Wochenend-Schichtleitung). Eine bezuschusste betriebliche Altersvorsorge und viele weitere Vergnstigungen gibt es obendrauf.Der Schichtplan wird, unter der Bercksichtigung von Wnschen, mind. vier Wochen im Voraus erstellt. Gerarbeitet wird 3 Tage die Woche gemeinsam im Office  an den brigen 2 Tagen ist mobiles Arbeiten mglich (Home Office).Einen Laptop fr mobiles Arbeiten, zwei Bildschirme oder individuelles Equipment wie eine ergonomische Maus oder Noise-Cancelling-Kopfhrer? Kein Problem!Individuelle Frderung durch Fortbildungen sowie regelmige Feedbackgesprche. Durch ein starkes und nachhaltiges Wachstum werden langfristige Perspektiven in der Fach- und Fhrungslaufbahn geboten.Zentraler Standort direkt am Stadthafen. Dank Zuschuss zum Job-\/Deutschlandticket und Fahrrad-\/ eBike-Leasing kommen Sie klimaneutral und gnstig ins Bro.Kostenlose Getrnke, Msli und frisches Obst sorgen fr Energie. Mehrmals wchentlich gibt es ein kostenloses, abwechslungsreiches Mittagessen.Attraktives Sportprogramm durch einen Personaltrainer: Halten Sie sich fit durch Yoga, Rckenfit, Bootcamp-Training oder auch zwischendurch in der Bewegten Pause.Es herrscht ein kollegiales und freundschaftliches Umfeld. Bei regelmigen Office Partys, Teamevents und Sommer- und Weihnachtsfeier feiern wir zusammen.Haben wir ihr Interesse geweckt? Dann freuen wir uns auf ihre Bewerbung. Gerne auch per Whats App 015233605774Ivonne Wresch steht Ihnen gerne bei Fragen zur Verfgung. 01523\/3605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-429263","tags":["Customer Service"],"job_types":[],"location":"Münster","created_at":1702889342000,"original_language":"eng"},{"slug":"junior-referent-finance-berlin-113584","company_name":"univativ GmbH","title":"(Junior) Referent (m\/w\/d) Finance","description":"As soon as possible, until July 1st, 2024, with an option to extend | 40 hours per week | Berlin | Finance | Career starter, experienced professional | 42,000 to 55,000 per year | Project ID A202344832_2Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Have you successfully completed your studies in economics or your commercial training, are communicative and are you enthusiastic about the financial industry? Are you also good at using SAP and have a high sense of responsibility? Then we are looking for you as a (junior) speaker (m\/f\/d) in the financial sector. Our well-known customer from the financial sector is looking for reinforcements at the earliest possible date. As part of your work, you will advise the individual departments regarding budget planning, generate reports and process provisions. If you are looking for a responsible and analytical task, then an exciting future awaits you in this area.TasksAdvising the departments on budget planningExecuting reportsProcessing provisionsAccounting and creating orders using SAPCalculating depreciationQualificationA completed degree in economics or business administration, one Completed commercial training or comparableFirst experience in the financial sector is desirableIn-depth knowledge of working with SAP FI\/COFunctional knowledge of spoken and written GermanA high level of communication strength as well as an analytical and structured way of workingBenefitsAn annual salary between 42,000 and 55,000 The possibility of working remotely from home for 50% of the timeVarious further training opportunities in our e-academyCorporate shopping and discounts for selected fitness studiosUp to 2,000 bonus for recommending friends We were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-referent-finance-berlin-113584","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702885744000,"original_language":"nds"},{"slug":"hotel-operations-manager-hamburg-272515","company_name":"numa","title":"Hotel Operations Manager - Hamburg (m\/f\/d)","description":"ABOUT NUMAHey! We're numa. We're a dynamic, diverse hospitality brand that's offering uniquely designed apartments for the modern traveler. We specialize in the beauty of convenience and the delight of a design, with a totally digital guest experience and properties designed with intention.Numa properties are located in the most exciting and vibrant neighbourhoods across Europe. We're not just disrupting the hospitality industry for our guestsbehind the curtain, we're shaking up the way hotels operate. We've built a proprietary technology and data platform that makes running a hospitality operation more efficient than ever. We offer consistent quality and an unmatched guest experience.ABOUT THE ROLE:In this mission critical role you and your team will be representing numa in the actual hospitality units, making sure every guest feels welcomed and taken care of, you will be in charge of ensuring the best service experience possible. You Will Focus On:Ensure numa guest experience standards are consistently executedEnsure the day to day operation of the allocated hospitality units within the numa standards and legal frameworkManage relationship with third-party service providers and vendors and ensure service level agreements are in place and regular quality control inspections are conductedEnsure a proactive maintenance and upkeeping program to protect and safeguard the physical conditions of the allocated unitsContribute actively to develop and deliver the numa brand and product on propertyBe responsible for managing conversion and cost levels though the implementation of PAR levels and proactive business planningEnsure that all local legal requirements, permits and operational backup systems are constantly maintainedABOUT YOUProven track record of hotel operations preferably from a housekeeping or front office backgroundFinancial understanding of cost control procedures and inventory managementFirst leadership experience in managing small teams and external partnersGood understanding of respective local market and business fluctuationsAbility to work under pressure, well organized and hard workingAbility to multitask and keep an overview in a fast paced work environmentVery good English and German language skills are requiredABOUT OUR OFFERJoin an agile work environment with flat hierarchies where your ideas make an impact from the very beginningBuild your own success story based on what you do well and how you want to growElevate your physical and mental wellness with our monthly benefit allowancesGet to know your internationally diverse team during our events and retreatsSpend a free night at your nearest numa stay upon starting and enjoy a 30% employee discount on personal stays in the coolest neighbourhoods in Europenuma values the diversity of the people it hires and serves. Diversity at our company means fostering a workplace in which individual differences are recognised, appreciated, respected and responded to in ways that fully develop and utilise each person's talents and strengths. We therefore welcome applications from people of all races, ethnicities, disability statuses, ages, religions, gender identities, and sexual orientations.For more information on the processing of your personal data, please see our Privacy Notice.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/numa\/hotel-operations-manager-hamburg-272515","tags":[],"job_types":[],"location":"Hamburg, Hamburg, Germany","created_at":1702885513000,"original_language":"eng"},{"slug":"produktionsplaner-munich-112443","company_name":"Isar Aerospace Technologies GmbH","title":"Productionsplaner (m\/w\/d)","description":"Your missionYour responsibilities include, among others, the following tasks:Planning and prioritizing components\/assemblies monitoring and ensuring on-time productionCreating work plans and work processesPreparation and creation of project-related documentsContinuous improvement of work processesSupporting the departments to ensure compliance with deadlinesInterface work between project management, design, production and assemblyWhat you bringMaster's or bachelor's degree in mechanical engineering, or comparableexperience in work preparation\/production planningExperience in dealing with ERP and MES systemsExperience with Excel (VBA, Pivot)Technical understanding of various departments such as CNC and additive manufacturingFluent business skills in German and EnglishWhy you should get started with us should30 days vacationSubsidized lunchIndividual training budgetVirtual company sharesSubsidized gym membership (Qualitrain)Company pension planWe also offer:Rental clothing with laundry serviceFlexible working hoursFree snacks and fruitFree drinks and coffeeBreak area with fully equipped kitchenParking spaces directly in front of the houseRegular subsidized team eventsPersonal and team bonus systemFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isar-aerospace-technologies-gmbh\/produktionsplaner-munich-112443","tags":[],"job_types":[],"location":"Munich, Bavaria, Germany","created_at":1702885513000,"original_language":"deu"},{"slug":"quality-inspector-munich-407761","company_name":"Isar Aerospace Technologies GmbH","title":"Quality Inspector (m\/w\/d)","description":"Your missionYour field of activity includes the following tasks:Inspection of internal products and those of our suppliers using visual and map inspection according to drawings or specificationsAssessment of components for internal quality requirementsDocumentation and processing of orders in the systemIndependent creation and execution of simple measurement programs on measuring devices (including Faro-Arm, Keyence) Carrying out material and material certificate testingAssisting in the continuous process optimization of work processesEnsuring order and cleanliness in the workplaceCommunicating the test results internallyInstalling and issuing new measuring equipmentWhat you bring with youSuccessfully completed technical vocational training in a plastics or metal processing area or comparableFirst professional experience in quality testing desirableGood knowledge of reading and interpreting of technical drawings, as well as a good general technical understandingGood knowledge of measuring with manual measuring equipmentVery high quality awarenessResilience, flexibility and ability to work in a teamHigh motivation to take on complex challengesGood knowledge of German required, knowledge of English is an advantageWhy you should start with us30 days of vacationSubsidized lunchIndividual training budgetVirtual company sharesSubsidized gym membership (Qualitrain)Company pension planWe also offer:Rental clothing with laundry serviceFlexible working hoursFree snacks and fruitFree drinks and coffeeBreak area with fully equipped kitchenParking spaces directly in front of the houseRegular subsidized team eventsPersonal and team bonus systemWho we areIsar Aerospace is a pioneer of the New Space industry with the aim of enabling better, faster and more cost-effective access to space Our mission is to contribute to the democratization of space to improve life on Earth today and for future generations. We are a fast-growing company dedicated to providing sustainable and environmentally friendly launch options for small and medium-sized satellites and constellations orbit to deliver. The company is privately funded by world-leading technology investors with strong commitment and support. Our team is made up of dedicated and talented people with a passion for innovation in space. We are building revolutionary rockets that will change the space industry forever. Would you like to find out more about us? Then visit www.isaraerospace.com Note: Due to high volume of applications, we cannot get back to all candidates. If you have not heard from us within 2-4 weeks, please consider that your application has been unsuccessful for the current openings. However, in line with our GDPR policy, we will keep your details and will let you know if\/when a suitable position comes up.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isar-aerospace-technologies-gmbh\/quality-inspector-munich-407761","tags":[],"job_types":[],"location":"Munich, Bavaria, Germany","created_at":1702885513000,"original_language":"deu"},{"slug":"team-lead-workplace-berlin-313842","company_name":"Parloa","title":"Team Lead Workplace (f\/m\/d)*","description":"YOUR MISSION:As the Team Lead Workplace (f\/m\/d*), your mission is to create a thriving work environment, ensuring the success of the organization and the satisfaction and growth of its employees. You will oversee and coordinate various aspects of the workplace, contributing to the smooth and effective operation of the Berlin office, with a global perspective in mind. Your ultimate goal is to shape a positive and engaging experience for everyone in the workplace.IN THIS ROLE YOU WILL:Guard Parloa's culture by maintaining a welcoming workplace, enhancing our operational plans and workflows, and creating a cohesive workplace experience across all our offices.Collaborate with various stakeholders at Parloa, both external and internal, to ensure an excellent employee experience.Plan and execute various team-building activities in collaboration with your team, to promote employee engagement and satisfaction.Keep Parloa compliant in all things workplace, to ensure a safe and healthy work environment for all of us.Lead our amazing workplace team and ensure they are growing with Parloa by providing coaching, guidance, and development opportunities.Align the team's day-to-day work with the overall company goals, through OKR initiatives, projects, and the overall team vision creation and communication.Own our Workplace reporting, analyzing relevant data to make informed decisions.WHAT YOU BRING TO THE TABLE:Fluent in both German and English, with a knack for effective communication.Proven expertise in time, project, and event management.Resourceful and adaptable, thriving in navigating workplace challenges.Tech-savvy, with proficiency in g-cloud software and collaboration tools.Dedicated to delivering outstanding service to internal teams and employees.Adept at stakeholder management, building and nurturing positive relationships.Regular office attendance in our vibrant Berlin office.NICE TO HAVE:Basic understanding of budgeting and expense management.Familiarity with relevant employment laws and regulations.WHAT'S IN IT FOR YOU?Be part of a dynamic, driven team of +20 nationalities with flat hierarchies and collaborative company cultureAttractive compensation package with equity.Training and development budget which can be used for conferences and attending development courses to ensure continuous professional growth.Flexible working hours, 28 vacation days and workation opportunitiesRegular team events, game nights, and other social activitiesAnd last but not least: a beautiful office with flair in the heart of Berlin with all the conveniences, such as adjustable desks, social area, fresh fruits, cereals and drinks.Is something missing here? Reach out and let's talk about what else you need for your ideal next growth opportunity.Your recruiting process at Parloa:Recruiter video call  Meet your manager  Challenge Task  Expert interview(s)  Meeting the team  Founder interviewWhy Parloa?Join Parloa in revolutionizing customer communication with Artificial Intelligence! We're a leading Conversational AI platform collaborating with industry giants, both as partners and clients. Our mission is to create a comprehensive customer solution for businesses worldwide, and we're committed to achieving this by having people and AI join forces.We were founded in 2017 in Berlin, and since then we've become one of the most innovative SaaS companies in the market. By leveraging our cutting-edge conversational AI platform, we are enabling businesses to have meaningful conversations with their customers. We're committed to achieving this by combining top-notch technical engineering with innovative leadership and the belief that every single team member can have a massive impact on our future.By joining Parloa, you'll have the opportunity to be part of a dynamic and innovative team that's revolutionizing an entire industry. We're passionate about growing together and creating opportunities for personal and professional development. With our recent 20 million Series A investment, we're expanding globally and looking for talented individuals to join us on this exciting journey.Do you have questions about Parloa, the role, or our team before you apply? Please feel free to get in touch with our .Parloa is committed to upholding the highest data protection standards for our clients' and employees' data. All our employees are instrumental in ensuring the utmost care, GDPR, and ISO compliance, including ISO 27001, in handling sensitive information.* We provide equal opportunities to all qualified applicants regardless race, gender, sexual orientation, age, religion, national origin, disability status, socioeconomic background and other characteristics.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parloa\/team-lead-workplace-berlin-313842","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702885513000,"original_language":"eng"},{"slug":"senior-hr-operations-manager-cologne-386645","company_name":"SoSafe GmbH","title":"Senior HR Operations Manager","description":"EinleitungDu brennst fr state-of-the-art HR Organisationen? Dich zeichnet ein serviceorientiertes Mindset aus? Du bist bist kontaktfreudig und hast Lust auf ein dynamisches Umfeld mit einem hochmotivierten Team?Bei SoSafe hast du die Chance, den aufregenden Weg vom Startup zur fhrenden Cyber-Security Software in Europa aktiv mitzugestalten und untersttzt dabei, das Internet etwas sicherer zu machen.Deine AufgabenGemeinsam mit Deinen Sparring Partner:innen im HR-Team bist du die erste Anlaufstelle bei allen Anliegen im Personalmanagement (u.a. Contract, Compliance, Guidelines, Reports, Benefits) - sowohl fr die Mitarbeiter in Deutschland als auch in unseren internationalen Gesellschaften oder die, die ber Employer of Record eingestellt sind. Du entwickelst und setzt reibungslose und skalierbare Prozesse um - vom Onboarding bis hin zum Offboarding unserer Mitarbeitenden.Du bist fr die Entwicklung und Kommunikation von neuen Guidelines, Policies und Prozessen verantwortlich.Du bernimmst Ownership fr eigene Projekte in Deinem Bereich und navigierst diese selbststndig bis zum Ziel (z.B. Einfhrung vom neuen Employer of Record, Auswahl und Einfhrung vom neuen HRIS)Du stellest einen reibungslosen Wissenstransfer & die Dokumentation im HR-Team sicherDu bist Ansprechpartner:in fr arbeitsrechtliche ThemenDu arbeitest eng mit internen (Payroll, HRBP, Talent Acquision Teams etc.) und externen Partnern (Anwlte, Employers of Record, Relocation Agency etc.)Dein ProfilDu verfgst bermindestens 5 Jahre Arbeitserfahrung im Deutschen als auch internationalem Personalmanagement Du hast ein abgeschlossenes Studium in Wirtschafts-\/Sozialwissenschaften, Rechtswissenschaften, Psychologie oder eine vergleichbare Qualifikation mit HR-BezugDu weit wie man skalierbare und effiziente Prozesse in einem schnell wachsenden und internationalen Unternehmen einfhrt. Deine positive Can do\"- & Service-Mentalitt kombiniert mit einer gewissenhaften, strukturierten Arbeitsweise lassen Dich im agilen Arbeitsumfeld so richtig aufblhenDir bereitet es Freude, eigenstndig zu arbeiten, Du hast aber genauso groen Spa daran, dich im Team auszutauschen.Du beherrschst Deutsch und Englisch flieend in Wort und SchriftWarum wir?Eigenverantwortliches Arbeiten im Team und steile Entwicklungsmglichkeiten in einem stark wachsenden Unternehmen im Bereich Cyber-Security \/ IT-Sicherheit 33 Tage Urlaub Maximale Flexibilitt: Arbeite von deinem Home-Office ausMobility Package (subventioniertes Fahrrad oder PNV-Zuschuss)Betriebliche AltersvorsorgeOption auf einen KiGa Platz durch unsere Kooperation SoSafe x FRBEL\"Jede Menge wchentliche (virtuelle und physische) Networking-Formate wie \"Team Bootcamp\", Coffee Chat Roulette und Tech Talksber 20 Communitys, die unsere Safeys zusammenbringen und fr vertrauensvolle Beziehungen sorgen. Wir lernen voneinander und haben einen echten Einfluss darauf, wie wir unseren Arbeitsplatz gestalten wollen ber unsMach mit uns gemeinsam die digitale Welt ein Stckchen sicherer! Als eines der am schnellsten wachsenden Security Awareness Scale-Ups weltweit, stellen den Menschen in den Mittelpunkt  und definieren mit unserem lernpsychologischen Ansatz den Status quo im Bereich digitale Sicherheit komplett neu.Mit starkem VC-Funding im Rcken sind wir auf der Suche nach weiteren motivierten Teamplayern, die uns bei unserer ambitionierten Mission und internationalen Expansion untersttzen. Bei SoSafe bernimmst du Verantwortung fr deine Arbeit und dein Wachstum und boostest deine Karriere in das nchste Level!Wenn du etwas bewegen mchtest, dir ein aufgeschlossenes Umfeld, das Wert auf Vielfalt und Gemeinschaft legt, wichtig ist und du mit deinem Tun eine Sinnhaftigkeit verknpfen mchtest, dann knnte SoSafe genau der richtige Arbeitsplatz fr dich sein!Bist du unser*e nchste*r Cyber Security Held*in?Werde Teil unserer Erfolgsgeschichte und bewirb dich jetzt!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sosafe-gmbh\/senior-hr-operations-manager-cologne-386645","tags":[],"job_types":[],"location":"Cologne, North Rhine-Westphalia, Germany","created_at":1702885513000,"original_language":"eng"},{"slug":"senior-hr-operations-manager-berlin-292908","company_name":"SoSafe GmbH","title":"Senior HR Operations Manager","description":"EinleitungDu brennst fr state-of-the-art HR Organisationen? Dich zeichnet ein serviceorientiertes Mindset aus? Du bist bist kontaktfreudig und hast Lust auf ein dynamisches Umfeld mit einem hochmotivierten Team?Bei SoSafe hast du die Chance, den aufregenden Weg vom Startup zur fhrenden Cyber-Security Software in Europa aktiv mitzugestalten und untersttzt dabei, das Internet etwas sicherer zu machen.Deine AufgabenGemeinsam mit Deinen Sparring Partner:innen im HR-Team bist du die erste Anlaufstelle bei allen Anliegen im Personalmanagement (u.a. Contract, Compliance, Guidelines, Reports, Benefits) - sowohl fr die Mitarbeiter in Deutschland als auch in unseren internationalen Gesellschaften oder die, die ber Employer of Record eingestellt sind. Du entwickelst und setzt reibungslose und skalierbare Prozesse um - vom Onboarding bis hin zum Offboarding unserer Mitarbeitenden.Du bist fr die Entwicklung und Kommunikation von neuen Guidelines, Policies und Prozessen verantwortlich.Du bernimmst Ownership fr eigene Projekte in Deinem Bereich und navigierst diese selbststndig bis zum Ziel (z.B. Einfhrung vom neuen Employer of Record, Auswahl und Einfhrung vom neuen HRIS)Du stellest einen reibungslosen Wissenstransfer & die Dokumentation im HR-Team sicherDu bist Ansprechpartner:in fr arbeitsrechtliche ThemenDu arbeitest eng mit internen (Payroll, HRBP, Talent Acquision Teams etc.) und externen Partnern (Anwlte, Employers of Record, Relocation Agency etc.)Dein ProfilDu verfgst bermindestens 5 Jahre Arbeitserfahrung im Deutschen als auch internationalem Personalmanagement Du hast ein abgeschlossenes Studium in Wirtschafts-\/Sozialwissenschaften, Rechtswissenschaften, Psychologie oder eine vergleichbare Qualifikation mit HR-BezugDu weit wie man skalierbare und effiziente Prozesse in einem schnell wachsenden und internationalen Unternehmen einfhrt. Deine positive Can do\"- & Service-Mentalitt kombiniert mit einer gewissenhaften, strukturierten Arbeitsweise lassen Dich im agilen Arbeitsumfeld so richtig aufblhenDir bereitet es Freude, eigenstndig zu arbeiten, Du hast aber genauso groen Spa daran, dich im Team auszutauschen.Du beherrschst Deutsch und Englisch flieend in Wort und SchriftWarum wir?Eigenverantwortliches Arbeiten im Team und steile Entwicklungsmglichkeiten in einem stark wachsenden Unternehmen im Bereich Cyber-Security \/ IT-Sicherheit 33 Tage Urlaub Maximale Flexibilitt: Arbeite von deinem Home-Office ausMobility Package (subventioniertes Fahrrad oder PNV-Zuschuss)Betriebliche AltersvorsorgeOption auf einen KiGa Platz durch unsere Kooperation SoSafe x FRBEL\"Jede Menge wchentliche (virtuelle und physische) Networking-Formate wie \"Team Bootcamp\", Coffee Chat Roulette und Tech Talksber 20 Communitys, die unsere Safeys zusammenbringen und fr vertrauensvolle Beziehungen sorgen. Wir lernen voneinander und haben einen echten Einfluss darauf, wie wir unseren Arbeitsplatz gestalten wollen ber unsMach mit uns gemeinsam die digitale Welt ein Stckchen sicherer! Als eines der am schnellsten wachsenden Security Awareness Scale-Ups weltweit, stellen den Menschen in den Mittelpunkt  und definieren mit unserem lernpsychologischen Ansatz den Status quo im Bereich digitale Sicherheit komplett neu.Mit starkem VC-Funding im Rcken sind wir auf der Suche nach weiteren motivierten Teamplayern, die uns bei unserer ambitionierten Mission und internationalen Expansion untersttzen. Bei SoSafe bernimmst du Verantwortung fr deine Arbeit und dein Wachstum und boostest deine Karriere in das nchste Level!Wenn du etwas bewegen mchtest, dir ein aufgeschlossenes Umfeld, das Wert auf Vielfalt und Gemeinschaft legt, wichtig ist und du mit deinem Tun eine Sinnhaftigkeit verknpfen mchtest, dann knnte SoSafe genau der richtige Arbeitsplatz fr dich sein!Bist du unser*e nchste*r Cyber Security Held*in?Werde Teil unserer Erfolgsgeschichte und bewirb dich jetzt!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sosafe-gmbh\/senior-hr-operations-manager-berlin-292908","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702885513000,"original_language":"eng"},{"slug":"streaming-backend-engineer-berlin-407444","company_name":"Zattoo ","title":"Streaming Backend Engineer","description":"YOUR FUTURE, ON DEMANDThe ideal blend of stability and flexibility. A genuinely human employer that cares for people and the planet. True autonomy to shape what comes next, for us and you. This is the perfect platform to take your career where you want.Back in 2005, we pioneered Europe's first TV streaming service. Today, we're the world's first certified climate neutral TV streaming provider. 3 million users across three countries. Over 230 colleagues of 47 nationalities. We're the grown-up start-up, helping to shape a better future since day one. That hasn't changed, even if the world has. We're friendly, international, inclusive  and our people say we're reliable and transparent, too. It's why they trust us and believe in what we do.THE ROLEBecome a part of the core team that maintains, extends and improves our streaming backend based on state of the art technology. Collaborate with a highly skilled and passionate team of multi-national engineers to build and operate our CDN services.THE STREAMING BACKEND TEAMOur team develops the software which drives our carrier-grade Content Delivery Network, covering the full processing chain for stream packaging, caching, encryption and delivery. We work closely with the Playback team - our counterpart to bring streaming features into applications, with the Ads Backend team - whose engineers focus on our solutions for server-side dynamic ad insertion, and the Video Backend team - which takes care of content ingest, transcoding and storage.WHAT YOU'LL DOImprove our HTTP streaming stack (DASH, HLS) and experiment with new technologiesSecure sensible content with fine-grained access control and DRM technologiesSolve the scalability challenges of a global Content Delivery NetworkImprove fault tolerance of our platformDevelop high-quality, clean and maintainable codeCollaborate with stakeholders and engineers across the companyWHAT YOU'LL BRINGExpert knowledge in C\/C++ and\/or Golang programmingExcellent understanding of operating system \/ Linux fundamentalsExpertise and ideas to build highly concurrent and distributed systemsExperience diagnosing and troubleshooting complex systems using test tools, network management systems and error reporting systemsDesire and abilities to learn new technologies and programming languagesComfortable working with remote colleagues and multidisciplinary teamsExperience in development and support of production systems with 24x7 operationsBonus:Experience with video streaming (HLS, MPEG-DASH...) technologiesExperience with distributed data stores such as Scylla or ClickHouseExperience with container management such as Kubernetes, Docker or LXCWHY JOIN US?At Zattoo, you're always on firm ground with real freedom to explore. You'll have the support and opportunity you need to go far, while you're helping us create a sustainable and entertainment-filled future for all.WHAT WE OFFER YOUReward: strong market competitive salaryRecharge: 30 days vacation plus public holidaysRegulate:trust based flexible working hours and the option for remote work worldwide for up to 8 weeks per year Plus:We'resharing:Free access to the best streaming experience on the marketWe're developing: Your own development budget, German classes and Zattoo all-companyhack daysWe're inclusive: 'Zattooies' are a fun, engaged, and diverse team made up of 47 nationalitiesWe're healthy: Health checks, team sports, organic fruit, vegan optionsand more!We're responsible: We are carbon neutral, an active employee Green team, discounted BVG tickets and free bike rentalsWe're sociable: Acalendar of events with fireside chats, lunches, in-house bar, BBQ's, monthly socials, summer party and an annual off-site eventZattoo enables our users to view indiscriminately and we reflect that in our team too. Regardless of race, gender, sexual orientation, religion, national origin, age, disability or any other characteristic protected by law we encourage everyone to apply and will give everyone equal consideration. We are an equal opportunities employer, join us and help build a diverse team dedicated to the future of TV.You can learn more about us at:https:\/\/zattoo.comFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/zattoo\/streaming-backend-engineer-berlin-407444","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702885513000,"original_language":"eng"},{"slug":"senior-sales-manager-advertising-berlin-remote-germany-202579","company_name":"Zattoo ","title":"Senior Sales Manager Advertising - Berlin \/ Remote (Germany)","description":"YOUR FUTURE, ON DEMANDThe ideal blend of stability and flexibility. A genuinely human employer that cares for people and the planet. True autonomy to shape what comes next, for us and you. This is the perfect platform to take your career where you want.Back in 2005, we pioneered Europe's first TV streaming service. Today, we're the world's first certified climate neutral TV streaming provider. 3 million users across three countries. Over 230 colleagues of 47 nationalities. We're the grown-up start-up, helping to shape a better future since day one. That hasn't changed, even if the world has. We're friendly, international, inclusive  and our people say we're reliable and transparent, too. It's why they trust us and believe in what we do.THE ROLEZattoo is creating the future of television, live and on demand. We build Apps for mobile, web and big screen on systems like Apple, Android, Samsung, Amazon Fire TV, Xbox One and many more.TV streaming is growing fast and the Zattoo platform is becoming increasingly popular for consumers but also for advertisers. With Zattoo's Connected TV and Dynamic Ad Substitution offerings advertisers discover real TV advertising alternatives. Due to the ever increasing demand we want to grow our Advertising Team in Germany.As a member of the Advertising Team you'll manage Zattoo's premium video and display inventory using direct and programmatic sales channels. In close cooperation with the Head of Sales Germany you'll work with media agencies and direct clients to actively develop Germany's advertising landscape. Besides the daily business you'll be involved in projects around pricing, process optimization, product development and Dynamic Ad Substitution.You will find Zattoo to be a comfortable place to work at with our flat hierarchies, pragmatic decision making, fast approval paths and willingness to take risks. As a member of a small advertising team, you will benefit from a high degree of independence, allowing you to bring and directly implement your own ideas. This position is especially interesting for candidates who enjoy directly seeing the impact of their work on a daily basis.WHAT YOU'LL DOEffectively present Zattoo as a highly relevant premium publisher and technological leader towards certain media agencies and direct clients in GermanyDevelop sustainable agency and advertiser relationships and provide regular updates of Zattoo's advertising portfolio, especially in terms of Connected TV and Dynamic Ad Substitution.Create convincing presentation decks and use them as one of your most important tools to pitch for new businessCreate meaningful reports and analysesContribute to the revenue goal Germany by being the first contact person for certain media agencies and direct clients and consulting them towards productive collaborationsTake responsibility for the complete sales cycle from acquisition through price negotiations to providing the complete campaign order package to the ad operations team to be able to set up the campaign in the ad serverRepresent Zattoo at business events and trade fairsCollaborate closely with the ad operations and product teamWHAT YOU'LL BRINGExperience in digital and\/or TV ad sales or digital mediaExperience in the programmatic advertising ecosystemPassionate about becoming the trusted advisor of media agencies and clients, listening to clients needs and creating and selling tailored offers aligned with internal prioritiesExisting network of digital media agencies and clientsStrong organizational and interpersonal written and verbal communication skillsKeen perception and analytical thinkingYou're always up-to-date with new trends in the digital video advertising landscape and in programmatic advertisingFluent in written and spoken German and EnglishBonus:Experience with CRM Tools like Salesforce andExperience with Google Ad ManagerWHY JOIN US?At Zattoo, you're always on firm ground with real freedom to explore. You'll have the support and opportunity you need to go far, while you're helping us create a sustainable and entertainment-filled future for all.WHAT WE OFFER YOUReward: strong market competitive salaryRecharge: 30 days vacation plus public holidaysRegulate: trust based flexible working hours and the option for remote work worldwide for up to 8 weeks per year Plus:We'resharing:Free access to the best streaming experience on the marketWe're developing: Your own development budget, German classes and Zattoo all-companyhack daysWe're inclusive: 'Zattooies' are a fun, engaged, and diverse team made up of 47 nationalitiesWe're healthy: Health checks, team sports, organic fruit, vegan optionsand more!We're responsible: We are carbon neutral, an active employee Green team, discounted BVG tickets and free bike rentalsWe're sociable: Acalendar of events with fireside chats, lunches, in-house bar, BBQ's, monthly socials, summer party and an annual off-site eventZattoo enables our users to view indiscriminately and we reflect that in our team too. Regardless of race, gender, sexual orientation, religion, national origin, age, disability or any other characteristic protected by law we encourage everyone to apply and will give everyone equal consideration. We are an equal opportunities employer, join us and help build a diverse team dedicated to the future of TV.You can learn more about us at:https:\/\/zattoo.comFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/zattoo\/senior-sales-manager-advertising-berlin-remote-germany-202579","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702885513000,"original_language":"eng"},{"slug":"senior-customer-success-manager-latam-hamburg-402974","company_name":"Appinio ","title":"(Senior) Customer Success Manager - LatAm (m\/f\/d)","description":"Allow us to introduce ourselvesHello there! We're Appinio, the fastest (and coolest) market research platform. On a mission to make the world a little more fact-based, we help companies understand how consumers think and make better data-driven decisions.We started out in Hamburg back in 2014 but we're now humbled to call the world our playground, with over 200 employees spread across 25 cities (we're remote-first), 2000+ international clients and a panel reach of 7 million, globally.Want to be a part of the Appinio movement? Your mission as a (Senior) Customer Success ManagerAs Appinio continues to revolutionize and conquer the market research industry, we are dedicated to continuously delivering exceptional experiences to our clients. Our Customer Success Team plays a fundamental role in this mission and supports clients to fully leverage the power of our platform. As we continue to grow, we are seeking a talented (Senior) Customer Success Manager (m\/f\/d) based in LatAm to join our team.As a (Senior) Customer Success Manager, your role will be pivotal in establishing and nurturing robust client relationships, encouraging Appinio's platform utilization, and maximizing customer value. You'll have the unique opportunity to take charge of a major customer in the FMCG industry, while also working with additional clients to contribute to our Latam region's success. Collaboration is key, and you'll closely work with our Sales, Product, and Operations teams in Latin America, as well as our Global Customer Success team, to harmonize strategies and ensure a seamless customer journey. This position offers an exciting opportunity to be part of a dynamic and innovative team in a growing market.What you'll be doingServe as the primary point of contact for our key account in the FMCG industry in LatAmBuild and maintain strong relationships with key stakeholders within the client's organizationUnderstand the client's business goals and objectives and work to align our services with themProactively identify opportunities for account expansion and value-add servicesMonitor customer health, usage patterns, and satisfaction levelsCollaborate with the Product team to provide customer feedback and help shape product enhancementsYou will thrive in this role ifYou have a proven track record in managing large accounts, especially in the LatAm region, with a preference for experience within the FMCG industryYou have extensive experience in customer success, coupled with strong consultancy and technical savvyYou have demonstrated success in driving customer satisfaction and retentionYou have a background in the market research industryYou have commercial capabilities and a deep understanding of financial account managementYou have product knowledge and proficiency in using customer success toolsYou have data analysis and reporting skillsYou have excellent communication and interpersonal skillsYou have problem-solving and conflict resolution skillsYou have strategic thinking and account planning abilitiesYou are based in LatAmWhat's in it for you?Flexibility Policy- meaning there is no hard cap on the number of vacation daysUdemy L&D Platform-full access to 22,000+ courses and certifications to deepen your knowledge as your career progressesAll the hardware you need andyour own MacBookThis post not only outlines our ideal candidate but also serves as an inspiration for what this role can evolve into. Even if you consider yourself an 80% fit but have a genuine passion for this position, we encourage you to apply. We're eager to hear from individuals who share our enthusiasm.Appinio is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.Learn more about us:appinio.com LinkedIn Xing Kununu InstagramFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/appinio\/senior-customer-success-manager-latam-hamburg-402974","tags":[],"job_types":[],"location":"Hamburg, Hamburg, Germany","created_at":1702885512000,"original_language":"eng"},{"slug":"kaufmannischer-mitarbeiter-lohnabrechnung-berlin-194042","company_name":"Workstation Customer Care","title":"Commercial employee (m\/f\/d) payroll accounting","description":"We are looking for employees (m\/f\/d) with experience in payroll accounting for our customer in Berlin-Mitte. Your area of ​​responsibility: Supporting colleagues in the use of the payroll program. Telephone and written information on the use of individual program modules. Monitoring and entering into legal changes. General correspondence and Sending information materialYou convince us with: Sound commercial training or relevant professional experience Experience in the area of ​​payroll accounting, preparatory payroll accounting Ideally experience with payroll accounting programs Advanced PC user skills in MS Office Basic knowledge of English Strong communication and team skills Structured, independent and conscientious way of working We offer: A future-proof , attractive workplace, manageable team size with short decision-making processes. Intensive training to ideally prepare you for your activities. Extensive social benefits. We look forward to receiving your application and to an initial discussion together. We look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kaufmannischer-mitarbeiter-lohnabrechnung-berlin-194042","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702882142000,"original_language":"deu"},{"slug":"mitarbeiter-rechnungserfassung-berlin-20772","company_name":"Workstation Customer Care","title":"Employee invoice entry (m\/f\/d)","description":"We are looking for a commercial employee (m\/f\/d) for administration, part-time 20 hours \/ week.Your area of ​​responsibility:Processing and shipping of contract documentsInvoice captureProject tasksYour profile:Commercial trainingFirst professional experienceSecure MS Office knowledgeReliabilityIndependent working styleTime flexibility (8 a.m. to 5 p.m., in 2 shifts )We are pleased to meet you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-rechnungserfassung-berlin-20772","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702882142000,"original_language":"deu"},{"slug":"kundenberater-tarifauskunft-arabisch-berlin-194337","company_name":"Workstation Customer Care","title":"Kundenberater Tarifauskunft Arabisch - m\/w\/d","description":"Fr die nachfolgende Stelle suchen wir Mitarbeiter (m\/w\/d) zur Festanstellung bei unserem Kunden. Als fhrender Anbieter von Kundenkontaktlsungen mit insgesamt 6.000 Mitarbeitern prsentiert sich unser Unternehmen auch in Deutschland als einer der Marktfhrer. Im Produktportfolio ist die gesamte Leistungspalette der Kundenbetreuung vereint und wird durch ein umfassendes IT- und Serviceangebot ergnzt. Mit ca. 1.000 Mitarbeitern in Berlin\/ Brandenburg ist es ber viele Jahre gelungen, durch Innovation, Kompetenz und Kundenorientierung die Stellung am Markt zu etablieren und auszubauen. Die Mitarbeiter sichern dabei durch eine hohe Serviceorientierung das Wachstum des Unternehmens. Wir suchen eine motivierte Persnlichkeit als Kundenbetreuer (m\/w\/d) eines internationalen MobilfunkunternehmensAufgaben:Tarifberatung fr Neu- und BestandskundenDurchfhrung von Rufnummer- bzw. KartentauschPrfung des Auftragsstatus bei Endgert und Ersatzkarte, zzgl. SendeverfolgungVersand von ErsatzkartenSperrung und Einrichtung von DienstenBeantwortung von RechnungsnachfragenAllgemeine Beratung zu Sonderdiensten (WAP, GPRS, UMTS)Allgemeine Beratung zu Endgerten und ZubehrAnschlieende Sach- und Nachbearbeitung der TelefonateAnforderungen:Berufserfahrung in kaufmnnischen Bereichengutes sprachliches Ausdrucksvermgen auf Deutsch UND Arabischgute PC-Kenntnisseserviceorientiertes AuftretenVerantwortungsbewusstsein und Engagementstrukturierte und zielorientierte Arbeitsweisezeitliche FlexibilittWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kundenberater-tarifauskunft-arabisch-berlin-194337","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702882142000,"original_language":"eng"},{"slug":"mitarbeiter-lohnabrechnung-fur-industrieunternehmen-berlin-50103","company_name":"Workstation Customer Care","title":"Payroll employee for industrial companies (m\/f\/d)","description":"Our client is looking for an experienced employee (m\/f\/d) in payroll accounting. Bring what you need: Experience in carrying out payroll accounting Experience in accounting for commercial employees necessary Independent and structured way of working as well as a team player Good user knowledge in dealing with SAP In-depth knowledge of Labor, payroll tax and social security lawWhat will you do:Payroll accounting for a defined group of employeesCalculation of time wages as well as piecework and group wagesEmployee advice on billing issuesMonitoring of time managementChecking continued payment of wages in the event of illnessAdvice of employees on wage-related issuesAdministrative and organizational activities in day-to-day businessPreparation of contribution statements, wage tax registrations and certificatesWe look forward to hearing from you to get to know each other! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-lohnabrechnung-fur-industrieunternehmen-berlin-50103","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702882142000,"original_language":"nds"},{"slug":"burokaufmann-rechnungsprufung-magdeburg-324464","company_name":"Workstation Customer Care","title":"Office clerk (m\/f\/d) auditing","description":"For our client we are looking for a clerk (m\/f\/d) for invoice auditing, including the following tasks: Checking incoming invoices and credit notes for factual and mathematical accuracy Clarification of differences and ambiguities with the relevant internal contacts Monitoring of incoming payments Clarification of discrepancies and deviations Support of the administrative Day-to-day business For this position as an office clerk (m\/f\/d) invoice auditing, we would like you to have: Completed commercial vocational training or comparable professional experience, e.g. as an office clerk (m\/f\/d) or accounting specialist (m\/f\/d).Good PC knowledgeStructured and correct way of workingDeadlines and reliabilityGood knowledge of MS Office applicationsUnderstanding of numbersFirst professional experience in auditing is an advantage but not a requirementWe offer:Extensive and paid trainingFixed salary without variable componentsA varied job in an international companyProfessional structures incl. works councilInternal further training and development opportunitiesGood cohesion in the team and fun at workWe look forward to meeting you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-rechnungsprufung-magdeburg-324464","tags":["Business Operations"],"job_types":[],"location":"Magdeburg","created_at":1702882142000,"original_language":"deu"},{"slug":"burokaufmann-okologischer-tourismus-homeoffice-berlin-235952","company_name":"Workstation Customer Care","title":"Office Clerk Ecological Tourism - Home Office (M\/F\/D)","description":"This position can be carried out 80% of the time from home - the company would like to welcome you to the office once a week so that contact is not lost. In this respect, you should not live too far from the Berlin district of Spandau. Our client is a tour operator and specializes in sustainable, ecologically valuable tourism. For this purpose, our customer operates a travel portal on which holidaymakers can quickly and interactively find out about travel areas, travel arrangements and prices. The potential customer does not always find what they are looking for and calls the hotline provided - and then reaches you (m\/f\/d). Our customer attaches great importance to the quality of the advice - so there are no time limits for discussions. The aim of your contact with the customer is to give the customer exactly the holiday experience they are looking for. Your tasks as a travel consultant (m\/f\/d): You are the first point of contact for customers who want to book a trip. You approach each individual customer individually and ask for his exact ideasYou describe the destination area, select according to the menu and number of stars, advise on child-friendly or child-free hotels and take the customer's flight times into account. You advise the customer in detail and offer alternative offersOur requirements: good linguistic expression, good PC skills, service-oriented demeanor, sense of responsibility and commitment, structured and goal-oriented Working styleFlexibilityPersuasivenessWe look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-okologischer-tourismus-homeoffice-berlin-235952","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702882142000,"original_language":"nds"},{"slug":"neukundenbetreuung-technik-homeoffice-potsdam-397565","company_name":"Workstation Customer Care","title":"New customer support technology home office Potsdam m\/f\/d","description":"Our client is a large internet provider who wants to ensure that its new customers have the best possible start with the new contract. This means that there are no technical obstacles and the customer (m\/f\/d) can use all functions and devices from the first minute. However, not every customer has the necessary understanding of, for example, installing a router or downloading applications from the Internet. This is where you (m\/f\/d) come into play.What will you do in this position?You help customers put end devices into operationYou support them with downloading softwareYou activate applications for useYou order the shipping of replacement devicesYou carry out line tests through you: You understand how modern technical devices work You can listen well and empathize with problems You are helpful and patient You can work in shifts You always stay up to date with technical developments Alternatively, the position can take place in our client's offices or at your home Home office. The training takes place in the company at the location. So that you don't lose contact with the company, you should work in the company about once a week. We look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/neukundenbetreuung-technik-homeoffice-potsdam-397565","tags":["Customer Service"],"job_types":[],"location":"Potsdam","created_at":1702882142000,"original_language":"deu"},{"slug":"burokaufmann-reklamationsbearbeitung-berlin-101272","company_name":"Workstation Customer Care","title":"Office clerk complaints processing (m\/f\/d)","description":"When looking for a job, we offer you (m\/f\/d) exciting customers, interesting and diverse development opportunities as well as a very good network based on our many years of experience. We are looking for long-term part-time employees (m\/f\/d) for various customers. Our customers work in the areas of online retail, tourism, online video stores and various other industries. You can expect an intensive and paid induction\/training period, professional coaching as well as good and exciting development opportunities. Your tasks: Existing customer support: Recording customer concerns and final case processing Order acceptance and product advice on the corresponding customer requirements Identification and Analysis of customer requestsProcessing order processingCreation and processing of customer master dataWhat you bring with you:Professional experience in a service-oriented working environmentVery good communication skills and enjoy dealing with customers by email and telephoneWe offer you:Employee leasing as an alternative to getting to know the customer company for 3 months with takeoverIntensive induction \/ paid trainingGood development opportunitiesExcellent Employee supportWe look forward to receiving your application and to being able to support you in finding the right job! We look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-reklamationsbearbeitung-berlin-101272","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702882142000,"original_language":"deu"},{"slug":"junior-bankkaufmann-im-homeoffice-berlin-258659","company_name":"Workstation Customer Care","title":"Junior bank clerk in the home office (m\/f\/d)","description":"Do you have a commercial career or do you have commercial basics and are interested in entering the banking services segment? Then the position of service employee (m\/f\/d) in the service center (inbound) is just right for you and the perfect first step into the world of finance! This entry-level position (junior) in the banking sector can be carried out nationwide from the home office. You will be tasked with the following tasks: telephone customer advice inbound in connection with all products and services of the credit institutions, e.g. telephone banking (payment transactions), building savings, inquiries about checking accounts, master data control\/maintenance of the document details Independently carrying out the follow-up work, such as reporting and keeping statistics What you bring with you: commercial training (m\/f\/d) or professional experience in a commercial profession (m\/f\/d) initial professional experience at a financial service provider is advantageous, but not mandatory, high communication skills, high level of customer and service orientation, very good knowledge of German, IT affinity, we look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/junior-bankkaufmann-im-homeoffice-berlin-258659","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702882142000,"original_language":"deu"},{"slug":"burokaufmann-sekretariatsservice-magdeburg-144567","company_name":"Workstation Customer Care","title":"Office clerk (m\/f\/d) secretarial service","description":"Office clerk (m\/f\/d) looking for secretarial service (home office possible after training).Your tasks:Organization of further training, appointment coordinationPreparation and follow-up of seminars, general secretarial tasksYour profile:Completed commercial trainingFirst professional experience desirableVery good PC skillsVery good German skillsGood English skillsA friendly team & intensive training are waiting to you. We look forward to getting to know you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-sekretariatsservice-magdeburg-144567","tags":["Business Operations"],"job_types":[],"location":"Magdeburg","created_at":1702882142000,"original_language":"deu"},{"slug":"internship-automation-software-tester-quality-assurance-at-iot-startup-dusseldorf-139884","company_name":"Livello GmbH","title":"Internship Automation Software Tester \/ Quality Assurance at IoT Startup (m\/f\/d)","description":"We are looking for a new team member for our software testing and quality assurance of our Smart Kiosks.Must-have requirement: Mandatory internship for universityLocation: Dsseldorf-BilkStart: by arrangement \/ immediatelyTasksDesigning and executing test plans, test cases, and test scripts for various software applicationsCollaborate with the development team to understand software requirements and identify potential areas for automation testingConducting review meetings, preparing summary reports and communicating with the software teamError tracking and bug reporting to developers and other team membersPerform manual and automated tests to ensure software functionality, usability, and performance meet quality standardsDocument and report software defects, track their status, and work closely with developers to resolve issuesContribute to the continuous improvement of the software testing process by suggesting innovative ideas and best practicesRequirements6 months mandatory internship required by the universityGood knowledge of QA processes, methodologies, standards and strategiesKnowledge of any automated testing framework (Cypress, TestNG, Robot Framework, Selenium etc.)Basic knowledge of any programming language (preferable JavaScript, also accepted Java, Python etc)Basic handling of Jira for ticket management and Confluence for documentationIdeally: Docker, Git, CI\/CD, API Testing (Postman), Agile ScrumBenefitsA responsible position in a fast-growing and highly innovative start-upAn agile and diverse team with colleagues from all over the worldEnglish speaking open work environment, with flat hierarchies and short decision-making pathsDog-friendly office in a prime location with lots of shopping\/restaurant options nearbyAdvanced technology stack leveraging cutting-edge IoT hardware and softwareCreative freedom for own ideas, projects and personal developmentTeam building, learning and start-up eventsLivello is building the future of autonomous retail and smart inventory management. We are developing a revolutionary IoT Platform and telemetric Smart Kiosks with state-of-the-art smart shelving and monitoring technology, leveraging the newest technologies and engineering principles, relying on concepts like automation, autoscaling, resilience, real-time monitoring, sensor fusion, computer vision, machine learning and deep analytics. Our stack consists of modern Javascript, Typescript, Node.Js, React & Redux, Docker, containers, client libraries, and GraphQL, all built on a microservice-based Kubernetes architecture, all supported by the strengths of the Google Cloud Platform. We strongly believe in the power of CICD and integrate and deploy our applications with modern CICD tools from Gitlab.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/livello-gmbh\/internship-automation-software-tester-quality-assurance-at-iot-startup-dusseldorf-139884","tags":["Quality Assurance","Inspection"],"job_types":["Internship","entry"],"location":"Düsseldorf","created_at":1702864195000,"original_language":"eng"},{"slug":"net-entwickler-mit-leib-und-seele-bremen-351564","company_name":"Intercon Solutions GmbH IT & Engineering Experts","title":".Net developer with heart and soul! (m\/f\/d)","description":"I am looking for a qualified .Net developer with passion and commitment, because one of our most modern and future-oriented customers is waiting for you in the heart of Bremen. Among other things, flexibility is very important and this means you can enjoy a pleasant and relaxed working atmosphere with first-class challenges. Tasks the development of tailor-made solutions in order to keep the company active in the market an important part of the team in order to analyze effective optimizations and optimal concepts the binding of external ones API using developed services and interfacesQualification knowledge in the following areas is advantageous: .NET and MS SQL Good knowledge of German (from C1) and knowledge of spoken and written EnglishBenefitsFlexible and relaxed working hours (remote possible)An excellent and future-oriented companyA team with fantastic motivation and the possibility of self-designBike leasing & company fitnessAffordable tariff and exciting discounts for internal products and useEfficient further training opportunitiesAttractive salary packageRetirement provisionAssistance at Housing SearchDB Germany TicketDo I have your absolute attention and have aroused your interest?Then welcome to the world of opportunities and unexpected possibilities. There is always a tailor-made option for you. You just have to have the courage! Contact me for detailed information to tackle the further process.Mohammad Al JouboriConsultant IT RecruitingLandline: +49 211 24958 274Mobile: +49 151 72455 437Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/intercon-solutions-gmbh-it-engineering-experts\/net-entwickler-mit-leib-und-seele-bremen-351564","tags":["Remote","Software Development"],"job_types":[],"location":"Bremen","created_at":1702864195000,"original_language":"deu"},{"slug":"it-support-manager-all-genders-teilzeit-munich-341348","company_name":"Parkdepot","title":"IT Support Manager (all genders) - part time","description":"Your new roleAre you ready to join us on an exciting road trip? We are an aspiring startup and have set ourselves the goal of turning parking space management on its head. With our innovative technology, we are ready to transform mobility and open up new paths. Imagine acting as IT support for our employees for a product that revolutionizes the way parking spaces are managed. This means you have a significant influence on the future of urban mobility. With your interest in IT support, you will strengthen our position as a market leader, while as a working student in IT management (all genders) you will achieve new successes together with our team. What to expect IT support: You support our employees in managing systems and devices, with IT problems, as well as with the technical setup of live or streaming events. Onboarding: You are part of the People & Culture team and take care of our people in close coordination Partner with the IT onboarding of new colleagues and offer them an unforgettable onboarding experienceInstallation and maintenance: You install and maintain our internal standard software\/hardwareIT Security: You support our internal cyber security projectProcess optimization: You optimize internal processes by you discover new and efficient ways and implement themProjects: Depending on your current requirements and personal talents and interests, we determine your tasks and projects togetherInspire us byYour background: You are studying (business) computer science, mathematics or a comparable course of studyYour experience : Ideally, you have already gained initial practical experience in the IT environment, for example through an internship or a working student positionIT Guru: You are characterized by your IT affinity and your high interest in technical solutionsYour strengths: You have a high level of Reliability, sense of responsibility and independenceCommunication talent: You have excellent communication skills in EnglishLocation: You work on-site with our team in MunichWhat we offer youFlexibility: With our flexible working model you can adapt your work rhythm individually.Workation: Work in inspiring places during your workation for fresh impulses .Security: Your job security is guaranteed by our profitable business model.Success sharing: Benefit from our Virtual Stock Option Plan (VSOP) and participate in Parkdepot's success.Measurable goals: With our OKRs, your influence on our product and company success is directly measurable. Events: Celebrate our successes together at our legendary team events and OKR parties. Food: Fresh coffee from our portafilter machine around the clock for your energy and productivity. Discover the diversity of Bella&Bona, our online cafeteria, help yourself to our fruit basket or have breakfast at the Mslibar.Health: We support your health and fitness with EGYM to keep you active.Development: Use our language courses or in-house courses to to learn new skills.Dress code: Dress the way you feel most comfortable.Innovation through diversityRegardless of your background, your origin, your gender identity or your individual requirements, it is your personality that interests us. That's why we create a culture of cooperation and respect in which every team member has a say, can develop personally and feels valued.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parkdepot\/it-support-manager-all-genders-teilzeit-munich-341348","tags":["Software Development"],"job_types":["berufseinstieg"],"location":"Munich","created_at":1702864195000,"original_language":"deu"},{"slug":"werkstudent-all-genders-it-support-management-munich-352895","company_name":"Parkdepot","title":"Werkstudent (all genders) IT Support Management","description":"Your new roleAre you ready to join us on an exciting road trip? We are an aspiring startup and have set ourselves the goal of turning parking space management on its head. With our innovative technology, we are ready to transform mobility and open up new paths. Imagine acting as IT support for our employees for a product that revolutionizes the way parking spaces are managed. This means you have a significant influence on the future of urban mobility. With your interest in IT support, you will strengthen our position as a market leader, while as a working student in IT management (all genders) you will achieve new successes together with our team. What to expect IT support: You support our employees in managing systems and devices, with IT problems, as well as with the technical setup of live or streaming events. Onboarding: You are part of the People & Culture team and take care of our people in close coordination Partner with the IT onboarding of new colleagues and offer them an unforgettable onboarding experienceInstallation and maintenance: You install and maintain our internal standard software\/hardwareIT Security: You support our internal cyber security projectProcess optimization: You optimize internal processes by you discover new and efficient ways and implement themProjects: Depending on your current requirements and personal talents and interests, we determine your tasks and projects togetherInspire us byYour background: You are studying (business) computer science, mathematics or a comparable course of studyYour experience : Ideally, you have already gained initial practical experience in the IT environment, for example through an internship or a working student positionIT Guru: You are characterized by your IT affinity and your high interest in technical solutionsYour strengths: You have a high level of Reliability, sense of responsibility and independenceCommunication talent: You have excellent communication skills in EnglishLocation: You work on-site with our team in MunichWhat we offer youFlexibility: With our flexible working model you can adapt your work rhythm individually.Workation: Work in inspiring places during your workation for fresh impulses .Security: Your job security is guaranteed by our profitable business model.Success sharing: Benefit from our Virtual Stock Option Plan (VSOP) and participate in the success of Parkdepot.Measurable goals: With our OKRs, your influence on our product and company success is directly measurable. Events: Celebrate our successes together at our legendary team events and OKR parties. Food: Fresh coffee from our portafilter machine around the clock for your energy and productivity. Discover the diversity of Bella&Bona, our online cafeteria, help yourself to our fruit basket or have breakfast at the Mslibar.Health: We support your health and fitness with EGYM to keep you active.Development: Use our language courses or in-house courses to to learn new skills.Dress code: Dress the way you feel most comfortable.Innovation through diversityRegardless of your background, your origin, your gender identity or your individual requirements, it is your personality that interests us. That's why we create a culture of cooperation and respect in which every team member has a say, can develop personally and feels valued.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parkdepot\/werkstudent-all-genders-it-support-management-munich-352895","tags":["Software Development"],"job_types":["Internship","hilfstätigkeit \/ student"],"location":"Munich","created_at":1702864195000,"original_language":"deu"},{"slug":"werkstudent-technical-operations-analytics-munich-77234","company_name":"Parkdepot","title":"Werkstudent (m\/w\/d) Technical Operations Analytics","description":"Your new roleAre you ready to join us on an exciting road trip? We are an aspiring startup and have set ourselves the goal of turning parking space management on its head. With our innovative technology, we are ready to transform mobility and open up new paths. Imagine controlling our system's performance analytics, revolutionizing the way parking spaces are managed. This means you have a significant influence on the future of urban mobility. With your interest in professional performance analysis, you will strengthen our position as a market leader, while as a working student (all genders) in Technical Operations Analytics you will achieve new successes together with our team. What to expectPerformance analysis: You will analyze the performance of our system together with our system performance team Parking space monitoring systems and identify anomalies in detail. Further development of processes and tools: You support the active improvement of existing processes. To do this, you use dashboards and analysis tools and further develop them with an increase in quality: You support the implementation of measures to solve problems with license plate recognition and pursue the goal of constantly optimizing quality and incorporating findings into new parking areas. Developing software features: You help, necessary ones Define software features and check their effectiveness after implementation by our tech teamInspire us byYour background and experience: You are already a registered student in the field of computer science, mechatronics, electrical engineering, mechanical engineering, or a comparable course of study.Ambitious: You would like to gain your first practical experience , actively contribute your knowledge and deepen your skills in technical product development and data analysisYour availability: You can support us for around 20 hours per week, including on weekendsCreative and independent: Independent work and solution-oriented thinking are just as much your strengths as good spatial skills Imagination and technical interestWhat we offer youFlexibility: With our flexible working model you can adapt your work rhythm individuallyWorkation: Work in inspiring places during your workation for fresh impulsesSecurity: Your job security is guaranteed by our profitable business modelMeasurable goals: With our OKRs your influence on our product and company success can be measured directly.Events: Celebrate our successes together at our legendary team events and OKR parties.Food: Fresh coffee from our portafilter machine around the clock for your energy and productivity. Discover the diversity of Bella&Bona, our online cafeteria, help yourself to our fruit basket or have breakfast at the MslibarHealth: We support your health and fitness with EGYM to keep you activeDevelopment: Use our language courses or in-house courses to learn new skillsDress code : Dress the way you feel most comfortableInnovation through diversityRegardless of your background, your origin, your gender identity or your individual requirements, it is your personality that interests us. That's why we create a culture of cooperation and respect in which every team member has a say, can develop personally and feels valued.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parkdepot\/werkstudent-technical-operations-analytics-munich-77234","tags":["Project Management"],"job_types":["Teilzeit (unbefristet)","internship","hilfstätigkeit \/ student"],"location":"Munich","created_at":1702864195000,"original_language":"deu"},{"slug":"solution-architect-german-speaking-leipzig-344311","company_name":"Cuculus GmbH","title":"Solution Architect (m\/f\/d) - German Speaking","description":"Shape the utilities market of the future with us!Join our team in Leipzig, Erfurt, or Ilmenau, or work remotely in full time as Solution Architect (m\/f\/w).What is the role about?Analyzing complex requirements for effective problem-solving and evaluating technology environments and client specifics.Developing tailored solutions for business needs, formulating solution strategies aligned with business objectives, as well as designing complex architectures and applications.Being responsible for the management of tasks and activities for successful solution implementation and monitoring of technological processes.Collaborating with project managers and supporting project management, as well as communicating with customers\/stakeholders, and providing technical support.Being responsible for monthly representation to discuss the project strategy with team members.Contributing to training sessions, reviewing technical task progress, supporting issue resolution, managing customer communication, and preparing solution architecture for projects.You fit in with us, ifYou hold an apprenticeship\/study in the IT \/ TK environment.You have at least 8 years of experience as a consultant, requirement engineer, or solution architect, ideally in the smart meter or energy market software domain.You have a confident knowledge of English and German.You have a sound technical understanding of complex software solutions.You possess a good understanding of the software development process.You are able to create architecture for complex software solutions like energy monitoring systems including reporting, vending, and billing.Whats in for you?Working in an internationally acting and constantly growing technology company.Flat hierarchies and the chance to really make a difference and see your ideas grow into real projects.A permanent employment contract with fair conditions and flexible working hours and the possibility to work from home - no ifs and buts.A pleasant, informal and open working environment with modern equipment, fresh fruit and drinks for free as well as regular team events and workshops.Other benefits including e.g. day-care allowance, bike leasing and company pension scheme.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/cuculus-gmbh\/solution-architect-german-speaking-leipzig-344311","tags":["Project Management"],"job_types":["professional \/ experienced"],"location":"Leipzig","created_at":1702860543000,"original_language":"eng"},{"slug":"social-media-webdesigner-niebull-220949","company_name":"MSP Nord GmbH","title":"Social Media- \/ Webdesigner","description":"MSP Nord GmbH is looking for a creative and experienced media designer for digital and print media who would like to strengthen our team in Niebll. As a media designer, you take responsibility for the conception, design and implementation of appealing designs for both digital and printed media. You take on the design for both in-house media as well as the implementation of customer projects in the print and online sectors. Tasks Design of print media: development and implementation of layouts for brochures, flyers, posters and other printed materials.Digital design: creation of graphics, illustrations and visual content for websites, social media platforms and other digital channels.Creative conception: collaboration with the marketing team to develop creative concepts, that effectively communicate the company message.Media production: Preparation of print materials, file conversions and ensuring print quality.Image editing: Professional editing and retouching of image materials for various media.QualificationsTraining: Completed training as a media designer or comparable qualification.Experience: Demonstrable professional experience in the design of print media. and digital media.Software knowledge: Confident use of common graphic design tools such as Adobe Creative Suite (InDesign, Photoshop, Illustrator).Creativity: An eye for design aesthetics, creativity in concept development and implementation.Communication skills: Ability to work together in a team and communicate with various departments .BenefitsJob bikeBonus systemMembership GymRegulated working hoursGermanyTicketIf you are passionate about creating innovative designs, have a flair for aesthetics and are looking for the challenge of being part of a dynamic team, we look forward to receiving your application. Please send your CV, a portfolio with work samples and a cover letter toWe look forward to welcoming you to our creative MSP Nord team!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/msp-nord-gmbh\/social-media-webdesigner-niebull-220949","tags":["Media","Screen and Web Design"],"job_types":[],"location":"Niebüll","created_at":1702846145000,"original_language":"deu"},{"slug":"softwaretester-qa-engineer-ettlingen-131353","company_name":"ScriptRunner Software GmbH","title":"Softwaretester \/ QA Engineer (m\/w\/d)","description":"Become part of the team At ScriptRunner we are proud to change the world with our innovative software solution. With passion, perseverance and fun, we work in a team of currently 25 employees to ensure that our product remains first-class and is technologically ahead. As a leading company in our industry, we are looking for a passionate and experienced software tester!Your tasksConception, planning and execution of automated but also manual software testsClose collaboration in an agile development teamCreation of test conceptsEvaluation and documentation of test resultsEnsuring software quality through identification, documentation and tracking of software errors and defectsYours BackgroundExperience in conducting automated testing for software applications.Good knowledge of using test automation tools and frameworks (e.g. Pester and Cypress)Solid knowledge of software development and programming.Understanding of agile development methods such as Scrum.Experience with PowerShell and Microsoft infrastructures.Excellent problem-solving skills and a passion for quality.Good communication skills and teamwork.Good knowledge of EnglishWhat awaits you with usWe enjoy thinking up, trying out, implementing, optimizing or discarding together and learning from it. Everyone can take initiative to advance themselves, their team members and ScriptRunners. With us, the best ideas that help shape the future win. Everything else that is important, such as home office, flexible working hours, attractive remuneration or first-class equipment, is a matter of course for us.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/scriptrunner-software-gmbh\/softwaretester-qa-engineer-ettlingen-131353","tags":["Automation","Development","Engineering","QA","IT","QA\/Test Engineer","Automation Engineer"],"job_types":[],"location":"Ettlingen","created_at":1702843869000,"original_language":"deu"},{"slug":"remote-conversion-analyst-berlin-148970","company_name":"Peak Ace AG","title":"Conversion Analyst (m\/w\/d)","description":"Main tasks As part of our CRO team, you will take care of the strategic planning and implementation of successful CRO concepts for customers of different sizes, from SMB to enterprise. You will deepen your specialized know-how in the areas of heuristic analysis of conversion funnels (behavioral economics, consumer psychology , conversion design) as well as quantitative and qualitative analysis of user behavior. You independently carry out extensive potential analyzes for optimizing the conversion rate on landing pages and throughout the entire conversion funnel. You develop A\/B test concepts and roadmaps and implement them in collaboration with our conversion designers At the same time, you support our internal teams Organic Search, SEA & Paid Social Advertising with your knowledge of CRO consulting. You create evaluations and automated reports or dashboards and derive concrete recommendations for action for our customers. You are informed about current developments and Stay up to date with trends in your own specialist area and proactively bring your own ideas into daily workflows and new projects. The intensive work and expansion of a professional tool stack around A\/B testing tools, heatmap tools, survey software, Google Analytics & Data Studio, Hubspot, Unbounce etc. rounds off your area of ​​responsibility. You support sales processes and advise your current and future customers regarding conversion rate optimization. Your profile. Ideally, you have 2 years of practical experience as a conversion optimizer and are interested in the world of online marketing and digital analysis. Your studies include You have successfully completed a focus on (online) marketing, psychology or media studies with an analytical focus, or an equivalent qualification. You have a very good understanding of numbers and analytical thinking as well as an interest in cognitive psychological topics and behavioral economics. You are familiar with A\/B testing tools (e.g. Optimizely, Google Optimize, VWO, A\/B Tasty) and have good knowledge of Google Analytics. You impress with very good German and English skills, both spoken and written. A high level of communication skills, initiative and team spirit, as well as fun exploring new subject areas to complete your profileWhat we offer youFlexibility: Choose the working model that suits you and work either in our Berlin office or at a location of your choice in Germany. You can also work remotely abroad for up to six weeks a year.Individual development: Your personal growth is important to us! We will design your individual development plan together and discuss it in regular feedback meetings. Peak Ace Academy: Take advantage of our internal and external training opportunities to achieve your development goals and shape your own career path. Work-life balance: Find your ideal rhythm with flexible working hours, part-time options and 28 vacation days per year (Christmas Eve and New Year are additional days off days).Well-being: We support you even in difficult times. Our partner, the Frstenberg Institute, offers you and your family members competent help and advice in the area of ​​mental health. Diverse customers: Work with international customers from different industries on innovative campaigns and contribute your ideas to grow together and rethink digital marketing. Strong together: Become part of a team of unique and passionate digital marketing experts. You work together on challenging projects, can exchange ideas and learn from each other.Think about the future: Peak Ace subsidizes your savings contribution to the company pension plan with an additional 20%.Office life: In our Berlin office you will find everything you need to work first-class Technical equipment, fruit, drinks, a free lunch prepared by our kitchen team and plenty of space to work with your colleagues. Do you feel addressed? Then we look forward to receiving your detailed application documents (cover letter, CV, relevant certificates, desired salary, next possible starting date; formatted in PDF format) via our online application form.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/peak-ace-ag\/remote-conversion-analyst-berlin-148970","tags":["Remote","KPIs","Performance Marketing","Online Marketing","Online Marketing Manager","Performance Marketing Manager"],"job_types":[],"location":"Berlin","created_at":1702843869000,"original_language":"deu"},{"slug":"junior-e-mail-content-marketing-manager-all-genders-berlin-471139","company_name":"Digital Career Institute GmbH","title":"Junior E-Mail & Content Marketing Manager (all genders)","description":"Hey Digital Native - Lust auf einen coolen Job?Wen wir suchen:Einen Marketing Rockstar, der nicht blo E-Mails verschickt, sondern epische Geschichten erzhlt, die unsere Zielgruppe in Deinen Bann ziehen.Dein Spielplatz? Die digitale Welt der Weiterbildung - in der Du mit Worten jonglierst und jeden Klick zu einem Abenteuer machst.Was wir bieten:Eine Kultur, die Kreativitt frdert und Innovation belohnt. Ein Team, voller Marketing-Gurus die genauso ideenreich sind wie Du. Einen Platz im Rampenlicht, indem Dein Input nicht nur gehrt, sondern auch gefeiert wird.Ganz vieles also - aber vor allem einen bedeutsamen Purpose hinter Deiner Arbeit!Deine ToDos:E-Mail Marketing:Konzipiere, erstelle und versende spannende E-Mail-Kampagnen zur Reaktivierung und Qualifizierung von Leads.Help where its needed - untersttze den E-Mail Customer Support.Content Erstellung:Entwickle kreativen Content, der nicht nur informiert, sondern unsere Zielgruppe fesselt!Zusammen mit der weltbesten Marketing-Crew, erstellst Du fundierte Konzepte, Strategien und Inhalte, die unsere Konkurrenz vor Neid erblassen lassen.Du stellst sicher, dass wir eine konsistente Markenbotschaft in allen unseren Marketingmaterialien vermitteln.Analyse und Reporting:Du hast ein Auge frs Wesentliche - berwache, analysiere und reporte Deine KPIs - welche Handlungsempfehlungen schlgst Du vor?Du kennst Dich aus mit CRM-Tools: Verantworte Deinen Spielbereich und pflege unsere Datenbank.Auf Nummer Sicher gehen - fhre A\/B-Tests zur Optimierung von E-Mail-Performances durch.,Deine SkillsMust haves:Ein Studium oder eine Ausbildung im Bereich Marketing, Kommunikation, Wirtschaft oder in vergleichbaren Richtungen.Sehr gute Deutsch- und Englischkenntnisse (min. C1).Du berzeugst uns mit:Technischem Know-How: Die geheimen Knste von E-Mail-Marketing-Tools (bevorzugt Hubspot) und Content-Erstellung sind eine Deiner leichtesten bungen.Deinem Interesse an den digitalen Trends von heute und morgen, und daran, es gerne in Deine Arbeit einflieen zu lassen.Unsere Teilnehmer:innen kommen aus ber 125+ Nationen: Dein brillantes Gespr fr Kulturen, Worte und Story-Telling ist ein dickes Plus.,Deine BenefitsFreiraum, was Deine Kreativitt angeht - jede Idee ist willkommen!Ideen-Entwicklung unter Palmen? Klar! Nutze die Gelegenheit auf 2x Workation im europischen Ausland.Power Dich aus bei einem der Kurse von unserem Partner Urban Sports oderbe Achtsamkeit mit einer Meditation von Nilo Health - unserem Partner fr mentale Gesundheit.Komm regelmig zu unseren Events und feier Dich, dein Team und die gesamte Company fr die Lessons learned & Erfolge!Haben wir Dich berzeugt?Dann schick uns Deine kreativste Bewerbung und zeig uns, dass Du der Marketing Rockstar bist, nach dem wir suchen!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/digital-career-institute-gmbh\/junior-e-mail-content-marketing-manager-all-genders-berlin-471139","tags":["Customer Support","Hubspot","E-Mail Marketing","IT","KPIs","CRM","Content Marketing","Marketing"],"job_types":[],"location":"Berlin","created_at":1702843869000,"original_language":"eng"},{"slug":"pflichtpraktikum-recruiting-ab-januar-2024-teilzeitpraktikum-fur-3-monate-moglich-all-genders-cologne-222784","company_name":"PMI Growth Group","title":"Mandatory internship in recruiting, from January 2024, part-time internship possible for 3 months - all genders","description":"Are you looking for a compulsory internship that also includes a psychologist as proof of your internship? We are looking for reinforcements for our recruiting team from January 2024! Tasks Creation of lead lists with potential candidates Customization of individual cover letters & A\/B testing of different formats Recruiting-as-a-Service for our customers Cover letters from potential candidates via LinkedIn & three steps further You want a dynamic start-up environmentBenefitsA steep learning curve because you can just do it with us - Your manager is always there for you, can give you direct feedback, but above all you can contribute your own ideasYoung, motivated people & dedicated team who want to transform the old school HR area from a non-profit to a profitable area regular & unique team events & evenings flexible working hours & by arrangement you can also work from home in a focused manner Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/pmi-growth-group\/pflichtpraktikum-recruiting-ab-januar-2024-teilzeitpraktikum-fur-3-monate-moglich-all-genders-cologne-222784","tags":["Recruitment and Selection"],"job_types":["Internship"],"location":"Cologne","created_at":1702842544000,"original_language":"deu"},{"slug":"referent-der-unternehmensentwicklung-ab-sofort-in-teil-vollzeit-hamburg-397363","company_name":"TauRes Gesellschaft für Investmentberatung mbH","title":"Corporate development consultant (m\/f\/d) - now part-time\/full-time","description":"Tasks: You provide support for comprehensive projects as part of corporate development. You participate in the development of concepts and solutions. The operational support of the project management portfolio, including the establishment of a well-founded project management knowledge pool, is also part of your area of ​​activity. You research working methods and methods (e.g. agile working methods , OKR etc.) and create concepts.You will also provide organizational support for workshops on process recordings in the specialist departments.Your tasks will also include operational support and identification of market trends and competitor positioning.RequirementsYou have completed commercial vocational training and qualified further training or a completed degree. Ideally, you already have experience in agile project management. You have strong organizational talent and networking skills. Teamwork, a high level of initiative and solution-oriented work are also among your strengths. Good communicative skills and a confident writing style characterize you. You are confident in using MS Office, especially Word and Excel.What we offerA positive and motivated team that welcomes you with open arms and wants to make a difference.A unique and open corporate culture in which participation is not only possible, but also encouraged will be.An exciting and varied job in a stable and successful growth company.A great working atmosphere in which we support each other and count ideas from all employees.Real work-life balance Mobile working, flexible working hours and a permanent employment relationship ensure a healthy Balance in a modern working world.Excellent further training and advancement opportunities.Complete coverage of the Deutschlandticket as well as numerous other benefits such as JobRad, discounted memberships, ergonomic workplaces, employee offers.ContactTauRes Gesellschaft für Investmentberatung mbHTimo ArndtHead of Human ResourcesAmsinckstrae 4020097 Hamburg Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/taures-gesellschaft-fur-investmentberatung-mbh\/referent-der-unternehmensentwicklung-ab-sofort-in-teil-vollzeit-hamburg-397363","tags":["Project Management"],"job_types":["berufseinstieg"],"location":"Hamburg","created_at":1702842544000,"original_language":"deu"},{"slug":"personalsachbearbeiter-gummersbach-145912","company_name":"einundfünfzig ejo GmbH","title":"Human Resources Administrator (m\/f\/d)","description":"We are looking for a human resources clerk or clerk as a clerk in the office for our full-time staff with experience as a clerk for office management but also career changers. Tasks Your tasks include: SV immediate registration and certification system, personnel recruiting, registering employees in the guard register in accordance with 34a of the regulations, creating employee ID cards, managing uniforms and distributeCreation of contracts PersonnelCommunication with authorities and third partiesOrganizational activitiesQualificationWe want the following qualifications:Friendliness, teamwork, reliability and trustworthinessCompleted commercial vocational trainingSeveral years of professional experienceBasic knowledge in the area of ​​social security and payroll taxSelf-employed and service-oriented way of workingVery good PC knowledge, especially in MS OfficeIndustry experience is a great advantageBenefitsType of position : Full-time, part-timeWorking hours: 40 per weekWorking hours: Monday to FridayPart-time: approx. 20 hours, working hours by arrangementWe offer:Company further trainingFree drinksEmployee discountDiscounts on company products\/servicesAdditional paymentHealth bonusWe look forward to receiving your complete application and your possible starting date by email Mr. Yaqoub will be happy to help you by phone at 0171-1661111. Type of position: Full-time, vocational training Location of work: Gummersbach Benefits: Company training Free drinks Employee discount Discounts on company products\/services Professional experience: Microsoft Office: 3 years (desirable)Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/einundfunfzig-ejo-gmbh\/personalsachbearbeiter-gummersbach-145912","tags":["Recruitment and Selection"],"job_types":["berufserfahren"],"location":"Gummersbach","created_at":1702835344000,"original_language":"deu"},{"slug":"senior-sales-talent-acquisition-manager-berlin-488502","company_name":"Digital Career Institute GmbH","title":"Senior Sales Talent Acquisition Manager (m\/w\/d)","description":"Chatbots' favorite phrase: I read your job advertisement with great interest. What is yours? Are you looking for a challenge where you can actively contribute to the company's growth with your commitment? Then today it's about you - because we are looking for a Senior Sales Talent Acquisition Manager (as soon as possible) to support our recruiting team ( f\/m\/d) in Berlin or Hamburg.Your ToDosYou will be responsible for the entire recruiting process with a focus on our sales positions and will provide advice to our hiring managers.If necessary, you will be able to quickly read up on other job profiles and take over the recruiting process.You have mastered the ABCs of recruiting, enjoy active sourcing and the use of new technical possibilities.Creativity in recruiting is very important to us - you develop new strategies and implement them in consultation with your team lead .,Your Must-Have SkillsYou have several years of professional experience in the area of ​​sales recruiting.Professional experience in a fast-paced environment, ideally in a startup.Your way of working can be described in three words: solution-oriented, pragmatic and hands-on.Through your organized and structured approach , you are able to be responsible for several projects in parallel and keep an eye on the KPIs.Nice-to-haveIdeally, you have completed training or studies with a focus on human resources\/HR.You have a strong service spirit.Fluent German and English skills., Your BenefitsHybrid working model and workation within the EU by arrangement.A great team that supports each other in the challenges.Regular workshops, events and parties.The chance to have a crisis-proof job with purpose and opportunities for further development.Find more English Speaking Jobs in Germany on Arbeitsnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/digital-career-institute-gmbh\/senior-sales-talent-acquisition-manager-berlin-488502","tags":["Talent Acquisition","Sourcing","Human Resources Manager","Recruiter"],"job_types":[],"location":"Berlin","created_at":1702833071000,"original_language":"deu"},{"slug":"remote-mitarbeiter-in-finance-berlin-409153","company_name":"Vertama GmbH","title":"Finance employee","description":"Vertama GmbH is a Berlin-based IT and platform specialist that develops industry-specific digital products for quick and easy data collection. Our platform offers all the possibilities of a WebAppEngine that transforms analog workflows into digital processes and accelerates all services related to B2B and B2C communication. We are still in our development phase, but we already have a solid customer base with over 40 hospitals, but we are growing and are looking for you to strengthen us in the finance department (m\/f\/d). With the High-Tech Founders Fund, we have a strategic and very solid investor on board alongside other partners, which will now allow us to grow more quickly. As a permanent full-time or part-time position, your tasks with us: You will support our customers and partners in all payment-related matters and manage and monitor debtor accounts for a defined customer group. Your daily tasks include recording and monitoring incoming payments, processing payment differences, dunning and controlling changes to customer master data. You clarify open items, check direct debits and collections and also take on the booking of travel expenses and incoming invoices. You participate in coordination, monthly, quarterly and annual financial statements. As a member of our finance team, you will not only work with international interfaces and external partners. You have the opportunity to get involved in projects, support the further optimization of our processes and thus develop further. You support us in our reporting tasks to our shareholders You support us in general commercial administrative activities________________________________________What you bring with you You have successfully completed commercial vocational training. You have already gained professional experience in the area of ​​accounting. You are confident in using MS Office and DATEV. You have excellent written and spoken German skills and can also communicate in English. You have an independent, reliable and structured way of working, patience and the ability to work in a team. With your analytical thinking, you ensure order and structure in your area. What you can expect from us is a varied activity with a high level of personal responsibility, a cooperative working atmosphere in a well-coordinated team in an exciting start-up, an open corporate culture with flat hierarchies, appropriate remuneration and flexible Working time models and family-friendly working conditions A dynamic, success- and future-oriented working environment in a modern workplace with very good connections to public transportFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/vertama-gmbh\/remote-mitarbeiter-in-finance-berlin-409153","tags":["Remote","DATEV","Accounting","Finance Manager","Accountant"],"job_types":[],"location":"Berlin","created_at":1702833071000,"original_language":"deu"},{"slug":"talent-success-manager-berlin-190129","company_name":"Empion","title":"Talent Success Manager (m\/w\/d)","description":"Wir bei Empion automatisieren Headhunting. Unsere Vision ist es, allen Talenten ein individuelles Recruiting Erlebnis zu ermglichen. Mit unserem KI-gesteuerter Robo-Advisor automatisiert Empion die Jobsuche und legt den Fokus dabei nicht nur aus Skills, sondern auch auf Persnlichkeit und Prferenzen.Unser TeamDu bist ein essentieller Teil unseres dynamischen, vielfltigen und zukunftsorientierten Teams mit einem Bro im Herzen von Berlin - mit der berhmtesten Nachbarin Deutschland! Als Teil unseres Talent Success Teams hast du die Mglichkeit, Talenten dabei zu helfen, ihren kulturell passenden Arbeitgeber und Traumjob zu finden. Dabei setzen wir uns fr ein faires, sicheres und inklusives Arbeitsumfeld ein.Bei Empion setzen wir uns fr ein faires, sicheres und integratives Arbeitsumfeld ein, das Vielfalt schtzt und ein ausgewogenes Geschlechterverhltnis frdert.Deine Aufgaben: Du identifizierst potenzielle Talente und gehst kreativ auf sie zu, um sie fr unsere spannenden Positionen zu begeistern. Dabei nutzt du eine vielfltige Mischung von Kanlen wie LinkedIn, Xing, Indeed und Social-Media-Plattformen. Du begleitest verschiedene Prozesse, erstellst Kennzahlen und bernimmst eigenstndige Projekte. Du baust einen Talentpool qualifizierter Kandidat:innen auf und pflegst langfristige Beziehungen. Du fhrst initiale kulturelle Interviews mit interessierten Kandidat:innen und baust kontinuierlich unsere Talent Pipeline aus. Du arbeitest eng mit unseren Partnerunternehmen zusammen und pflegst langfristige Beziehungen. Du holst aktiv Feedback von Kandidat:innen im Bewerbungsprozess sowie von Partnerunternehmen ein. Du bist fr verschiedene Stellen in verschiedenen Branchen verantwortlich.Dein Profil: Du besitzt erste Kenntnisse\/Interesse der neuesten Sourcing-Techniken, -Trends und -Tools und hast Freude daran, neue Sourcing-Anstze und -kanle zu entwickeln und umzusetzen. Du hast bereits Erfahrung\/Interesse mit LinkedIn, Xing sowie CV-Datenbanken, Jobbrsen und Social-Media-Kanlen und sie gehren zu deinem tglichen Geschft. Du bist zielstrebig und teamorientiert und kannst effektiv und einfhlsam mit Kandidat:innen, Kolleg:innen und Partnerunternehmen kommunizieren. Du zeichnest dich durch Agilitt, Flexibilitt, Kreativitt und die Fhigkeit aus, dich schnell neuen Herausforderungen und Gegebenheiten anzupassen. Du verfgst ber flieende Deutsch- und sehr gute Englischkenntnisse in Wort und Schrift.Was wir bieten: Umfeld: Eine familire, authentische und internationale Atmosphre in einem motivierten und freundlichen Team. Startup: Schnelllebiges, stark wachsendes Unternehmen mit groer Vision. Flexibilitt: Die Mglichkeit eines hybriden Arbeitsmodells. Standort: Ein Bro im Herzen von Berlin (Museuminseln) mit gesunden Snacks, Obst und Getrnken und einer sehr berhmten Nachbarin. Vielfalt: Ein diverses Team (in Bezug auf Geschlecht, Nationalitt, Alter, Sprachen)  Englisch als Unternehmenssprache. Socializing: Regelmige Teamevents und alle zwei Wochen \"Thirsty Thursdays\" bei uns im Bro. Spa: Teamevents fr zustzlichen Spa.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/empion\/talent-success-manager-berlin-190129","tags":["Interviews","Social Media","Sourcing","Human Resources Manager","Recruiter"],"job_types":[],"location":"Berlin","created_at":1702833071000,"original_language":"eng "},{"slug":"remote-senior-devops-engineer-giessen-102288","company_name":"Schunk Group","title":"Senior DevOps Engineer (m\/w\/d)","description":"You (m\/w\/d) build it, you run it, gestalte die Zukunft des digitalen Zeitalters aktiv mit!Wir von der iDA haben es uns auf die Fahne geschrieben, die Arbeitswelt Stck fr Stck zu optimieren, zu modifizieren und natrlich auch zu digitalisieren.WIE WIR DAS MACHEN?Zum einen, indem wir Open-Source-Lsungen einsetzen, zum anderen, indem wir Moira benutzen. Moira ist unsere hauseigene Software, die vornehmlich als Middleware fungiert und genau dort ansetzt, wo es ntig ist: Bei der Datenverarbeitung. Mit Moira knnen Daten funktionalisiert und gewinnbringend genutzt oder aufbereitet und zugnglich gemacht werden. Einsatzmglichkeiten gibt es so viele wie Herausforderungen.WO WIR DAS MACHEN?Bei produzierenden Unternehmen genauso wie bei Dienstleistern. Die Flexibilitt von Moira macht uns zu Allroundern und berall dort, wo eine digitale Infrastruktur besteht, knnen wir auch agieren. Und falls keine existiert, dann helfen wir sie zu etablieren.WER DAS MACHT?Wir. Wir sind ein crossfunktionales Team, das aus Generalisten und Spezialisten, Quereinsteigern und Nerds, Innovativen und Kreativen besteht. Wir wachsen mit unseren Aufgaben und lernen jeden Tag dazu.DEINE ROLLE: Design \/ Bereitstellung \/ Pflege und Wartung von funktionierenden Softwareplattformen Weiterentwicklung und Verbesserung der Produkte Dokumentation von Fehlerbehebung Administration mit Hyperscalern Betrieb von containerisierten AnwendungenDEIN PROFIL: Ein abgeschlossenes Studium der *-Informatik oder Vergleichbares Nachweisbare, mehrjhrige Erfahrung in Konzeption, Aufbau, berwachung und Betrieb von IT-Systemarchitekturen Nachweisbare Erfahrung in Administration mit Hyperscalern (idealerweise Azure) Orchestrierung und Betrieb von containerisierten Anwendungen Application Monitoring Linux-Kenntnisse und Erfahrung mit Virtualisierung Interesse an neuen Technologien Teamfhigkeit und Hands-on MentalittDER TECH STACK: Sprache: Java \/ C# \/ C++ \/ Rust \/ Go Backend: Java Frontend: React Weiteres \/ Tools: Docker \/ Kubernetes \/ GitOps \/ Azure DevOps \/ CI\/CD Infrastructure-as-Code: Terraform \/ SALT \/ Puppet \/ AnsibleDEINE BENEFITS: Kaffee, Tee und eine groe Auswahl an Kaltgetrnken Groartiges Betriebsklima und die Mglichkeit alle Offices zu nutzen Startup Spirit und Konzern Sicherheit Flexible Arbeitszeit und Home-Office-Regelung Weiterbildungsmglichkeiten Betriebliche Altersvorsorge 30 Tage UrlaubWir konnten Dein Interesse wecken? Dann freuen uns auf Deinen CV im online Bewerbungsformular.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schunk-group\/remote-senior-devops-engineer-giessen-102288","tags":["Remote","Jenkins","Docker","Java","Azure","Cloud computing","Kubernetes","DevOps"],"job_types":[],"location":"Giessen","created_at":1702833071000,"original_language":"eng"},{"slug":"beraterin-schwerpunkt-vermogensanlage-iv-brandenburg-391637","company_name":"Sparda-Bank Berlin","title":"Consultant with a focus on investment (f\/m\/div)","description":"Sparda-Bank Berlin belongs to its members and not to shareholders. With more than 400,000 members, we are one of the largest cooperative banks in Germany. This creates security and trust. For our Berlin\/Potsdam market, based in 14776 Brandenburg an der Havel (Steinstrasse 63), we are looking for you as a consultant with a focus on asset investment (f\/m\/div) Employment type: full-time, permanent, from now on This is what awaits you: Active, event- and needs-oriented, cross-channel advice to private customers on the bank's products and services, especially in asset investment. Implementation of various sales activities, in particular qualified appointments for existing and new customers in outbound. Identification of potential and qualified transfer to the appropriate advisors the network partners Implementation of needs-oriented private customer advice in the sense of cooperative advice as well as sale of cross-channel products and services Result-oriented product conclusion within the standardized product range by means of cross-channel process routes Acceptance of standardized operational business cases in day-to-day business Compliance with service and consulting standards Acceptance of project and special tasks What excites us about you: You have one Completed banking training or a comparable qualification. We also expect several years of professional experience in the sales department of a bank as well as proven sustainable sales success. You have a good knowledge of the standardized product range, especially in the securities and pensions area. We require in-depth product and process knowledge. An affinity We require sales and production routes that can be concluded directly. We offer you: A permanent employment relationship in a bank that is different. 30 vacation days per year, as well as days off on bank holidays (24. and 31.12.) of each year, plus various occasions for special and additional leave. An attractive standard remuneration (13 salaries) including fringe benefits such as capital-forming benefits (40 per month\/full-time), company pension scheme, long-term accounts. For us, full-time corresponds to one 39 hours\/week.On your birthday, your working hours are reduced to 5 hours so that there is enough time to celebrate.The possibility of mobile working (any location, e.g. from home; approx. 60-80% or 3-4 days a week) , as well as the opportunity to work in our modern locations. Extensive IT equipment (including peripherals). Continuous development of your own professional and personal skills (e.g. Sparda scholarship = support for part-time studies). Many employee conditions for selected bank products and our network partners. Team and sporting events, company health management and other benefits such as our BenefitBox. By signing the Diversity Charter, we are committed to an unbiased work culture. We have no place for any form of discrimination; Diversity is welcome and desired.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sparda-bank-berlin\/beraterin-schwerpunkt-vermogensanlage-iv-brandenburg-391637","tags":["Banking Industry","Account Manager"],"job_types":[],"location":"Brandenburg","created_at":1702833071000,"original_language":"deu"},{"slug":"beraterin-schwerpunkt-finanzierung-iv-berlin-413473","company_name":"Sparda-Bank Berlin","title":"Consultant with a focus on financing (f\/m\/div)","description":"Sparda-Bank Berlin belongs to its members and not to shareholders. With more than 400,000 members, we are one of the largest cooperative banks in Germany. This creates security and trust.For our Berlin\/Potsdam market, based in 12163 Berlin (Schlostrae 97), we are looking for you as a consultant with a focus on financing (f\/m\/div)Type of employment: full-time, permanent, available immediately That's expected you: Active, event- and needs-oriented, cross-channel private customer advice on products and services, especially in the private financing sector (private, construction financing and modernization loans) Implementation of various sales activities, in particular qualified appointments for existing and new customers in outbound Identification of potential and qualified transfer to the appropriate consultants * inside and the association partners Carrying out needs-oriented private customer advice in the sense of cooperative advice as well as selling cross-channel products and services Result-oriented product conclusion within the standardized product range using cross-channel process routes Acceptance of standardized operational business cases in daily business Compliance with service and consulting standards Acceptance of project and special tasks What excites us about you: You have one Completed banking training or a comparable qualification. We also expect several years of professional experience in the sales department of a bank as well as demonstrable, sustainable sales successes. You have good knowledge of the private financing business, especially in private, construction financing and modernization loans. We require in-depth product and process knowledge. We require an affinity for direct sales and production routes. We offer you: A permanent employment relationship in a bank that is different. 30 days of vacation per year, as well as days off on bank holidays (24. and 31.12.) of each year, plus various occasions for special and additional leave. An attractive standard remuneration (13 salaries) including fringe benefits such as capital-forming benefits (40 per month\/full-time), company pension scheme, long-term accounts. For us, full-time corresponds to one 39 hours\/week.On your birthday, your working hours are reduced to 5 hours so that there is enough time to celebrate.The possibility of mobile working (any location, e.g. from home; approx. 60-80% or 3-4 days a week) , as well as the opportunity to work in our modern locations, as well as the opportunity to work in our brand new and ultra-modern locations in Berlin. Extensive IT equipment (including peripherals). Continuous development of your own professional and personal skills (e.g. Sparda scholarship = funding part-time studies).Many employee conditions for selected products from the bank and our network partners.Team and sports events, company health management and other benefits such as our BenefitBox.By signing the Diversity Charter, we are promoting a work culture free of prejudice. We have no place for any form of discrimination; Diversity is welcome and desired.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sparda-bank-berlin\/beraterin-schwerpunkt-finanzierung-iv-berlin-413473","tags":["Banking Industry","Account Manager","Sales Manager"],"job_types":[],"location":"Berlin","created_at":1702833071000,"original_language":"deu"},{"slug":"remote-junior-devops-berlin-379257","company_name":"JLink temp experts GmbH","title":"Junior DevOps (m\/f\/d)","description":"What are your Responsibilities:Monitoring applications and infrastructure alerts and reacting quickly.Monitoring SLO alerts and Error Budgets for the applications.Participate and manage Incident Response Flow for the applications.Identifying and implementing automation opportunities to ensure success.Closing open support tickets by adhering to SLAs.Co-ordinate with various stakeholders to carry out blameless postmortems.What qualifies you for this role:Hands on experience on Linux Platforms.Knowledge on technology stack that includes Kubernetes, Docker, PostgresSQL,Grafana, Prometheus, Gitlab, Terraform, Jira, Confluence and more.Work experience in IT operations or production support model.Knowledge on any scripting language Python, Bash Scripting, Go or Perl.Team player, flexible and ready to work in (Incentive-Based) 24x7 support model.What can you expect:Enjoy working in energetic and inclusive environment where you explore, learn and contribute.Be part of Operations Team which works very closely with talented and experiences Site Reliability Engineers.Agile working in self-organised teams (Scrum, Kanban)Intensive Knowledge exchange with experienced colleagues.Working on platforms that includes Kubernetes OpenShift, Docker, PostgresSQL,Grafana, Prometheus, ElasticSearch, Gitlab, Jira, Terraform and more.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jlink-temp-experts-gmbh\/remote-junior-devops-berlin-379257","tags":["Remote","Perl","Scripting Language","ElasticSearch","Confluence","Kanban","Bash","Automation"],"job_types":[],"location":"Berlin","created_at":1702833071000,"original_language":"eng "},{"slug":"full-stack-developer-tubingen-294872","company_name":"DeepScenario GmbH","title":"Full-Stack Developer","description":"DeepScenario is a deep tech start-up with the vision to bring automated systems safe to the road. The fast-growing start-up provides highly accurate real-world traffic data to accelerate the development of automated systems. DeepScenarios product helps automotive industry customers to train, test, and validate their self-driving algorithms in challenging scenarios.We are looking for a talented full-stack developer to join our dedicated team of experts. You will help us design and implement a scalable web application enabling our customers to interact with our product.Your ResponsibilitiesImplement APIs to interface with our cloud computing pipeline to ensure fast and frictionless use of our productDesign and build visually appealing front-end applications and maintainable back-end solutionsApply best practices for web development and leverage cutting-edge frameworksInteract with a team of developers, machine learning engineers, and industry expertsYour Qualifications+3 years of practical experience in front- and back-end developmentDeep experience in web development and modern frameworksHands-on experience with AWS, SaaS solutions, and serverless applicationsTeam player with passion to work in an intercultural environmentHigh degree of autonomy and excellent problem-solving skillsYour BenefitsBe part of an investor-backed company with a dedicated team of expertsTake one of the most important roles in a deep tech start-upPossibility to work in Stuttgart or remoteGreat team spirit in an agile environmentGet a highly attractive compensation packageInterested? Contact Us!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deepscenario-gmbh\/full-stack-developer-tubingen-294872","tags":["JavaScript Developer","Front-end Developer"],"job_types":[],"location":"Tübingen","created_at":1702833071000,"original_language":"eng"},{"slug":"head-of-tech-all-genders-berlin-481395","company_name":"Digital Career Institute GmbH","title":"Head of Tech (all genders)","description":"Your tasks as Head of TechnologyStrategic tech topicsDevelopment, planning and development of the tech area - in line with the corporate and IT strategy.Planning and responsibility for budget planning for the entire tech area.Further development of the tech environment and business intelligence (BI) You are a decision-maker and are responsible for the topic of Business Intelligence (BI) as well as the AWS \/ Data Warehouse infrastructure. Responsible for the further development and networking of the IT tools currently used (e.g. Make \/ Integromat) Analysis and development of platforms, learning management systems (LMS ) and teacher deployment planning as well as topics related to artificial intelligence (AI) Development and implementation of technological roadmaps and tech architectures Adaptation of existing tools into the organization (e.g. Technical CRM) as well as ownership of our website Employee responsibility Discipline and professional leadership of an internationally positioned team. Resource planning for the individual project topics.Your skillsProfessional experienceLong years of professional and leadership experience as a CDO, CTO, CIO or Head of TechSuccessfully completed university degree in information technology, o...Several years of experience in the area of ​​business intelligence (BI) and master in dealing with Tableau methods Know-how in development and Production processesYou are an entrepreneurial managerial personality with creativity and a sense for what is possible and find pragmatic solutions. A person with and affinity for automation, digitalization and AI service-oriented, has a hands-on mentality and a clear communication style at all hierarchical levels in German and English (C1 )Nice-to-haveExperience in the industry environmentEducation \/ (IT) further training providers are an advantageExperience in product management is desirableYour benefitsWe offer you 29 days of vacation and the possibility of work placements within other European countries.An all-round, worry-free package during your first days! You will be warmly welcomed during your onboarding and accompanied step by step into the world of DCI. Work in a company where diversity, appreciation and the shared spirit allow us to achieve our goals together. You are important to us. We therefore want to promote your mental and physical health as much as possible. Our partners such as nilo.health and Urban Sports Club help us with this. Be part of a valuable mission. We offer people a perspective through education and help them discover their potential. We celebrate ourselves! Be there when we celebrate our progress and successes at team events and parties. About usAs a tech school, we at the Digital Career Institute have been offering a wide range of continuing education courses since 2016. We have already helped numerous people to make a new start and find a job in the digital working world. From the original initiative to create new future prospects for refugees, we have developed into an established tech institute for people of all nationalities and origins. Together with a highly qualified team of over 250 employees, we all work on one mission: to offer the best possible training for interested people in order to enable them to get a job in the digital industry.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/digital-career-institute-gmbh\/head-of-tech-all-genders-berlin-481395","tags":["Business Intelligence","IT","AWS","Artificial Intelligence","Solution Architect","Engineering Manager","Chief Technology Officer"],"job_types":[],"location":"Berlin","created_at":1702833071000,"original_language":"deu"},{"slug":"remote-full-stack-entwickler-ki-friedrichshafen-316389","company_name":"ai-predict.de","title":"Full-Stack Entwickler KI (m\/w\/d)","description":"Wir entwickeln fr unsere Kunden innovative Lsungen vom Prototypen bis zu in die IT-Landschaft integrierten Anwendungen. Insbesondere in den Bereichen Rezepturen in der Spezialchemie setzen wir KI-setups ein, um hochkomplexe Problemstellungen umsetzbar zu lsen.Wir erleben gerade eine faszinierende Wachstumsphase von Grndung bis zu ersten Projekten. Was jetzt noch fehlt ist ein talentierter Softwareentwickler KI (m\/w\/d), der mit Knowhow, Leidenschaft und Kreativitt mitwirkt, ai-predict als technologiefhrende Company mitzuentwickeln.Deine AufgabenDu entwickelst als Fullstackentwickler unsere MachineLearning Pipeline fr Rezepturen und Energie weiterDu entwickelst die Architektur der MachineLearning Pipeline weiterDu nimmst Kundenanforderungen auf und setzt diese im Team in der Machine Learning Pipeline um.Du entwickelst umsetzbare Lsungen  auch mit dem Kunden- und entwickelst diese weiter.Du hast Interesse an Forschungsprojekten.Dein ProfilAbgeschlossenes Hochschulstudium im Bereich Informatik, Mathematik, Statistik oder PhysikMindestens 2 Jahre Berufserfahrung in der SoftwareentwicklungBerufserfahrung in der agilen Softwareentwicklung und SoftwarearchitekturGute bis sehr gute Kenntnisse und Erfahrungen in Python, TypescriptGute bis sehr gute Kenntnisse und Erfahrungen Webtechnologie Angular, Angular Material UI, ExpressJS,Erfahrung in der ProjektarbeitSehr gute Deutsch- und EnglischkenntnisseUnsere LeistungenKreative und lebendige Arbeitsatmosphre und einen sonnigen Arbeitsplatz am Bodensee oder im HomeofficeVerantwortungsvolle und herausfordernde Aufgaben mit Kundenkontakt und die Mglichkeit sich individuell weiterzuentwickelnEin dynamisches Team mit flachen HierarchienFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ai-predictde\/remote-full-stack-entwickler-ki-friedrichshafen-316389","tags":["Remote","Python Developer","Data Engineer","JavaScript Developer"],"job_types":[],"location":"Friedrichshafen","created_at":1702833071000,"original_language":"eng"},{"slug":"remote-java-engineering-lead-berlin-472874","company_name":"Labforward","title":"Java Engineering Lead  (m\/f\/d)","description":"Your missionLead our Java Engineering TeamRequired tech stackJavaJavaScript and\/or TypeScriptDelivering containerized applicationsCloud infrastructure for one major provider eg: AWS, Azure, Google CloudOne CI tool - CircleCI, Jenkins, Travis, etcOne relational database - MySQL, Postgres, etcOne modern frontend framework - React, Angular, Aurelia, etc One build tool - Gradle, Maven, etcExperience with all below are preferred, but not required:KubernetesElasticsearchRedisMinIOApplication SecurityKey challenges for this role - Are you up for it?Efficiently onboard to an established team and take over leadership role supporting our Java software productsLead future development effort in our Labfolder electronic lab notebook (ELN)Guide the team through the transition process from some remaining portions of legacy front-end and back-end code towards modern and maintainable implementationsSupport our cloud and on-premises customersYour profileYou have completed Bachelor or Master degree in STEM (preferably in CS)You are an effective Manager as well as an open, honest, and respectful communicator who can confidently lead and grow the teamYou are a pragmatic problem-solver, goal-focused and results-orientedYou are excited to work in an international environment - expected advanced level of EnglishJob experienceAt least 5 years of technical experience with at least 2 years of experience in team managementLanguage proficiencyEnglish: Fluent to business fluent (C1)What we offerWorking for a dynamic company in the heart of laboratory innovation initiatives with a diverse and international team.If youre from abroad, we support your relocation to Germany with support of a specialized agency.Office, home office or hybrid: Depending on the role and requirements, we offer flexible work models.Tailored onboarding, training and career development: We help you get up to speed in your new role quickly and support your growth.Modern work equipment (Apple laptops etc.), so that you are well prepared for your work.28 days of annual leave and flexible schedule with core working hours from 10 to 4pm.Contribution to public transportation in Berlin or bike-sharing.Company Pension Plan.Regular team & company events as well as learning and development activities.Location: Berlin, Alt-Treptow district, close to Treptower Park stationWorking hours: Full time (40h\/week)Salary: 65-75k\/yearWhy Labforward?The Labforward team is a dynamic, multidisciplinary and international group of professionals dedicated to transforming the landscape of scientific research and laboratory management. Comprising experts in fields ranging from software development and data science to life sciences and engineering, the Labforward team is united by a shared passion for innovation and a deep commitment to advancing scientific discovery as well as chemical and pharmaceutical development.Our Mission, Vision and products matter - the solutions we develop assist laboratory teams, streamlining their planning, execution and documentation, thereby clearing the path for groundbreaking discoveries, innovative drug development and eco-friendly chemicals. We create the laboratory of the future together, as a team but also together with our customers and partners.Our Employees matter - Labforward fosters an environment of learning, allowing you to grow into your role. With flexible hours, remote working policies and career development we aim to provide the best possible working environment for our employees to thrive.Our Culture matters - we are a growing international and diverse company: our team is supportive, agile and inclusive.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/labforward\/remote-java-engineering-lead-berlin-472874","tags":["Remote","Team Management","Gradle","Data Science","Azure","Maven","Leadership","ElasticSearch"],"job_types":[],"location":"Berlin","created_at":1702833071000,"original_language":"eng "},{"slug":"key-account-manager-vertriebsmitarbeiter-aussendienst-neu-isenburg-13589","company_name":"Chip 1 Exchange","title":"Key Account Manager (m\/f\/d) \/ Field Sales Representative (m\/f\/d)","description":"Dedicated to Progress Welcome to Chip 1We are Chip 1 Exchange GmbH & Co. KG from Neu-Isenburg. We know that there is a lot between good ideas and progressive action. Since our founding in 2001, we have continuously developed our entrepreneurial vision and are now experts in the global distribution of electronic components. Microchips, transistors, LEDs and much more, our customers worldwide rely on the reliable supply of our first-class technology. The decisive factor for our success is our continuity and the commitment of our over 300 outstanding employees. We want to grow and are therefore looking for passionate key account managers (m\/f\/d) \/ Field Sales Representative (m\/f\/d)Your missionAre you a passionate salesperson, like to be on the go and always strive to recognize customer needs before they are even expressed? Then this is the right position for you! You will be responsible for expanding our regional presence. Through your customer-oriented and proactive nature, you will retain customers in the long term and successfully expand them with our solution and service portfolio. You will create meaningful activity reports in the relevant sales area. You will develop and present customer-specific presentations. You will be responsible for keeping an eye on your sales, margin and growth targets. You will be responsible for your work always takes place in close cooperation with the Inside Sales TeamYour skill packageSeveral years of professional experience in field salesProfound market knowledge of the semiconductor industry and experience in the area of ​​customer management systems (CRM)High level of self-organization, strong analytical skills, strong solution-orientedHigh presentation skills and interpersonal skillsFluent German and knowledge of spoken and written English Our must-haves for you Team: flat hierarchies, short information and decision-making channels, regular team building events Working environment: varied customer network as well as a challenging job, with a lot of creative freedom Personal development: in-depth training and tailor-made further training concepts Further highlights: company pension plan , discounted membership to EGYM Wellpass as well as an in-house fitness studio, company health management, employee benefits and much more. See for yourself! We are eagerly awaiting your documents and look forward to a lively exchange with you. If you have any questions, please do not hesitate to contact us. We look forward to hearing from you! Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/chip-1-exchange\/key-account-manager-vertriebsmitarbeiter-aussendienst-neu-isenburg-13589","tags":["Account management","Sales Management","communication skills","Account Manager"],"job_types":[],"location":"Neu-Isenburg","created_at":1702833071000,"original_language":"deu"},{"slug":"senior-full-stack-entwickler-cologne-342069","company_name":"crossbuilders","title":"(Senior) Full Stack Entwickler (M\/W\/D)","description":"crossbuilders ist ein Company Builder mit Fokus auf Financial Services und Insurance mit Sitz im Klner Rheinauhafen. Wir entwickeln kreative digitale Geschftsmodelle und fhren diese bis in die technische Umsetzung fort. Fr unseren Bereich Solution Engineering suchen wir Dich ab sofort als Untersttzung. Wenn Du Erfahrung in Tech-Themen und Full-Stack Softwareentwicklung hast, freuen wir uns auf Deine Bewerbung!Deine Aufgaben:Entwicklung von Finanzapplikationen und Microservices im Bereich Banken & VersicherungenUntersttzung in agilen Produktentwicklungen in Form von Ideen, Konzepten und FeedbackBetreuung der Deployment-Pipelines und aktiver Austausch mit DevOps-KollegenProfessionelle Umsetzung von Software- und Weiterentwicklung sowie eine Offenheit gegenber anderen Programmiersprachen wie Java oder PythonDein Profil:Du entwickelst leidenschaftlich gerne und hast eine Neugierde fr neue TechnologienDu hast sehr gute Kenntnisse in der (agilen) Softwareentwicklung (JavaScript, Node.js, Typescript), mit automatisiertem Testen sowie mit Continuous Integration\/ Continuous DeliveryDu bringst gute Kenntnisse mit verschiedenen Software- und Systemarchitekturen, vor allem mit verteilten Systemen (Microservices, Self-Contained Systems) und Containertechnologien mitDu hast idealerweise Erfahrung in der Arbeit mit Docker und GitlabDu kommunizierst proaktiv mit Kolleginnen und Kollegen und bist ein Team-PlayerDeine Soft-Skills:Du hast eine strukturierte Vorgehensweise und kannst Ideen klar vermittelnDu lst gerne Probleme und schreckst vor Herausforderungen nicht zurckDu findest kreative Lsungen und bist ideenreichWas wir Dir bieten:Die Mglichkeit, in einem agilen Team an innovativen Lsungen zu arbeitenDeine Fhigkeiten kontinuierlich im Team und durch professionelle Fortbildungen weiterzuentwickelnDie Vorzge von viel Eigenverantwortung, mobilem Arbeiten und flexiblen ArbeitszeitmodellenEine leistungsgerechte Vergtung und weitere Benefits wie deine WunschhardwareFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/crossbuilders\/senior-full-stack-entwickler-cologne-342069","tags":["Docker","Microservices Architecture","Python","Banking Industry","Software architecture","TypeScript","JavaScript Developer","Node.js Developer"],"job_types":[],"location":"Cologne","created_at":1702833071000,"original_language":"eng "},{"slug":"junioroperations-specialist-m-f-d-berlin-481611","company_name":"F&P Stock Solution GmbH","title":"(Junior)Operations Specialist (m, f, d)","description":"We are looking for a passionate and competent (Junior)Operations Specialist (m, f, d) to join our team. In this operations position you will work closely with our suppliers, buying team, warehouse management and accountingWhat we are offering you:Opportunity to take responsibility and actively shape our processes with your ideasShort decision-making processes and flat hierarchiesTable tennis rounds and regular team eventsFree coffee, tea and waterFlexible working hours, home office possible two days a weekShopping events for employees: discounts (75% off RRP) on our range of shoes, textiles and accessories from brand-name companiesA monthly shopping voucher in the amount of 50Payment of a Deutschlandticket for public tranport, alternatively we pay a subsidy for travel costs should you arrive by car (parking spaces on site)How you contribute to our success story:As an Operations Specialist, you will be an integral part of our Operations Department, providing crucial support in various operational aspects. Your key responsibilities will include:Purchase Order Processing:Efficiently handle the processing of purchase orders, ensuring accuracy and timeliness.Collaborate with suppliers and internal stakeholders to resolve any discrepancies in orders.Data Analysis:Utilize advanced Excel skills to analyze data of offers provided by suppliersProvide insights and recommendations to enhance operational efficiencyProduct Management:Planning & processing own company productsProcess Optimzation:Constantly review our processes and research and implement innovative solutions and tools for department and companyInbound Planning:Work closely with the logistics team to plan and coordinate inbound of purchase ordersOptimize supply chain processes to enhance efficiency and reduce lead timesPayment Handling:Collaborate with the Accounting Department to ensure seamless payment processes.Verify and reconcile invoices, resolving any issues to maintain accurate financial records.You have the following set of expertise:Completed education or studies as well as at least 2 years of professional experience in relevant areasProficient in Microsoft Excel and affinity to numbersStrong analytical and problem-solving skills with acute attention to detailExcellent communication and interpersonal skills to collaborate effectively with internal teams and external partners.Fluency in English is enough, German beneficialPassion for working in a start-up environmentWe are looking forward to your application. CV is only required.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/fp-stock-solution-gmbh\/junioroperations-specialist-m-f-d-berlin-481611","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702831744000,"original_language":"eng"},{"slug":"technischer-zeichner-bzw-technischer-systemplaner-elektrotechnik-cad-system-eplan-elcad-hamburg-180884","company_name":"Regel- und Elektroanlagenbau Dresden GmbH","title":"Technical draftsman or technical system planner (m\/f\/d) electrical engineering CAD system EPLAN\/ELCAD","description":"We, Regel- und Elektroanlagenbau Dresden GmbH, have been a medium-sized service company for 25 years with a portfolio of complete services in the construction of electrical, measurement, control and regulating systems. The company has 2 locations. The headquarters with the switchgear production and the assembly department are located at the Dresden location and the planning office is located in Hamburg. Tasks: Creation of electrical documentation (circuit diagrams, terminal plans, parts lists, device assembly plans, etc.) for individual switchgear (not series production) according to templates from the designers, using a CAD system EPLAN P8 2.x or ELCAD 7.xRevision of AS-Built documentation, as well as the adoption of red changes in existing drawingsThe area of ​​responsibility includes both modernizations\/expansions of existing systems as well as new systemsLight secretarial workQualificationCompleted vocational training as a technical draftsman or technical system plannerGood knowledge of electrical engineering EPLAN P8 2.xKnowledge of ELCAD 7.x would be advantageous: routine use of MS Office applications, team-oriented thinking with flexibility, enthusiasm and resilience as well as an independent, disciplined and reliable way of working. Basic knowledge of English is desirable, but not absolutely necessary. Benefits: a demanding and varied area of ​​responsibility in a collegial manner and friendly working atmosphere, regular training, professional exchange, etc. permanent position with 13 monthly salaries per year with market-oriented pay 38.5 hours per week with flexitime model 30 days of annual vacation good local transport and highway connections control and electrical system construction Dresden GmbH Engineering Hamburg Michael Modi \/ Klaus Brockamp Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/regel-und-elektroanlagenbau-dresden-gmbh\/technischer-zeichner-bzw-technischer-systemplaner-elektrotechnik-cad-system-eplan-elcad-hamburg-180884","tags":["Engineering"],"job_types":["Vollzeit (unbefristet)"],"location":"Hamburg","created_at":1702831744000,"original_language":"deu"},{"slug":"werkstudentin-unternehmensaufbau-operations-berlin-483262","company_name":"emjul","title":"Working student in company development\/operations","description":"We are looking for a committed working student to support our team in the development and implementation of our projects. As an aspiring digital agency with a focus on Fintech, Real Estate and Blockchain, we offer you the opportunity to work in an exciting and future-oriented environment. Tasks Support in setting up the company Setting up the processes Setting up digital infrastructure (MS Office, Hubspot, Mailchimp, ... etc.) Communication with all team members to coordinate the strategy and processesAnalysis of data and measurement of the success of the published contentQualificationYou should be able to speak and write German and English fluently.Experience with digital tools such as MS office, CRM or similarAbility to familiarize yourself with digital products relatively quickly You should be a Have a good feel for current trends and topics.BenefitsAbove-average payFlexible working hoursWe offer you a challenging and varied job in a motivated team. You have the opportunity to further develop your skills and make a significant contribution to the success of our company. We look forward to your application. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/emjul\/werkstudentin-unternehmensaufbau-operations-berlin-483262","tags":["IT"],"job_types":["Working student","hilfstätigkeit \/ student"],"location":"Berlin","created_at":1702824542000,"original_language":"deu"},{"slug":"embedded-entwickler-karlsruhe-automatisierungstechnik-164391","company_name":"AURELLY TECHNOLOGIES GmbH","title":"Embedded developer (m\/f\/d) Karlsruhe, automation technology","description":"We support our customers in the development of innovative technologies in the automotive, drive technology, automation technology, testing and measurement technology, mechanical engineering, medical technology and electronics industries. We are looking for an embedded software developer (m\/f\/d) for the Karlsruhe area. Tasks Requirements analysis, specification and design of software components Analysis of supplied software packages with regard to existing functionality, subset formation and portability to target systems Embedded development for Simatic communication processors in the Assembler programming language and C integration the PROFINET I\/O functionalityImplementation and execution of the module and integration tests of the software componentsConducting reviewsCollaboration in a multinational teamQualificationCompleted studies in electronics, electrical engineering, technical computer science or a comparable course of study (University, FH, TU, BA)Profound experience in the development of complex software solutions in the embedded environment Confident use of the Assembler and C programming languages ​​Know-how in the use of PROFIBUS\/PROFINET is an advantage Good knowledge of spoken and written English Analytical and systematic way of working Used to master daily challenges in multicultural teams Benefits Exciting development projects in an international environment Collaboration with leading Industrial customersState-of-the-art development environmentsProject-driven further trainingExpansion of knowledge through alternating projectsExtra-tariff salaryTravel allowanceChristmas holiday bonusCompany pension provisionCompany eventsAre you interested in this challenge? Then we look forward to receiving your application.You can also find more exciting challenges for developers on our jobs page.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/aurelly-technologies-gmbh\/embedded-entwickler-karlsruhe-automatisierungstechnik-164391","tags":["Software Development"],"job_types":[],"location":"Karlsruhe","created_at":1702824542000,"original_language":"deu"},{"slug":"netzwerk-security-tester-karlsruhe-automatisierungstechnik-424350","company_name":"AURELLY TECHNOLOGIES GmbH","title":"Network Security Tester (m\/f\/d) Karlsruhe, automation technology","description":"We support our customers in the development of innovative technologies in the automotive, drive technology, automation technology, testing and measurement technology, mechanical engineering, medical technology and electronics industries. We are looking for a network security tester (m\/f\/d) for the Karlsruhe area.TasksSetting up and carrying out network tests for industrial communication componentsCreation of test scenariosIdentification of weak points and creation of protocolsAutomation of the testsCreation of the associated software applicationsLogging of the testsCollaboration with other teams in the development departmentQualificationSuccessfully completed Study of (technical) computer science, information technology or electrical engineering (university, university of applied sciences, BA) Solid experience in testing techniques and test methods Sound network knowledge from layer 2 to layer 4 according to the ISO-OSI model Knowledge of network technologies such as TCP\/IP, routing, switching and FirewallingExperience with tools such as Metasploit, Nessus, Nmap or WiresharkGood programming experience with C#Good knowledge of spoken and written EnglishAnalytical and systematic way of workingUsed to master daily challenges in multicultural teamsBenefitsExciting development projects in an international environmentCollaboration with leading industrial customersState-of-the-art development environmentsProject-driven further trainingExpanding knowledge through alternating projectsExtra-tariff salaryTravel allowanceChristmas holiday bonusCompany Retirement planningCompany eventsYou are interested in this challenge? Then we look forward to receiving your application.You can also find more exciting challenges for developers on our jobs page.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/aurelly-technologies-gmbh\/netzwerk-security-tester-karlsruhe-automatisierungstechnik-424350","tags":["Software Development"],"job_types":[],"location":"Karlsruhe","created_at":1702824542000,"original_language":"deu"},{"slug":"praktikant-werkstudent-data-science-aachen-133428","company_name":"Circonomit GmbH","title":"Praktikant \/ Werkstudent Data Science (w\/m\/d)","description":"About Circonomit:Good data for a greener tomorrow, a new perspective on sustainability and finance. Circonomit offers a fresh perspective on sustainability and finance. We empower companies, regardless of size or industry, to efficiently and transparently construct vital environmental data for their products and business processes. Together, we forge a path towards a more sustainable and prosperous future.  Who we are:We are Circonomit, an ambitious team of engineers and business professionals who share a common goal: to comprehensively revolutionize sustainable practices and behaviors in the industry for better environmental and economic decisions worldwide. We are cultivating a pioneering One-Stop-Solution for effortlessly and swiftly creating product and production-related environmental datasets at scale, as easy as playing with Lego bricks. In doing so, we directly address the megatrends of the climate crisis and digitalization. Our aspiration to establish the world's environmental data infrastructure will define the industry standard for collecting and organizing corporate environmental data. What sets us apart in the market is our framework for utilizing real data and seamlessly integrating environmental insights with financial optimizations.To safeguard the planet while fortifying the economic backbone of our society, we empower companies with genuine automation driven by cutting-edge technology.AufgabenAbout the Role:As an intern or working student, you will play an integral role in our development team. This is not just an internship for bystanders; it's a meaningful and value-adding position. We find ourselves at a pivotal moment, experiencing strong growth, solid financial footing, and the ambition to elevate our team to the next level. Join us from the outset and evolve with the teamwe're seeking a long-term relationship.  Circonomit is a young company with exceptional potential to make a real impact. As one of the initial employees in your domain, you'll have the chance to work closely with the entire team, including the founders. Confronting a variety of challenges will allow you to imprint your personal touch on the company. Operating in a cross-functional environment and taking on tasks beyond your core responsibilities is second nature to you, motivating you to achieve peak performance. You are adept at engaging with stakeholders (internal\/external) across all subject areas and contributing your expertise in a highly dynamic environment.QualifikationSome Key-strength you should bring with:Be in love with (the power of) data.Have at least some experience with data-heavy apps and\/or ELT processes.Develop and evolve data models.Help to design and implement AI-powered recommender.Write data pipelines: ingest, transform, and combine information from various sources to power our app.Write web crawlers.Have first expertise with dbt and dvc.Have first expertise with ML tasks, embeddings and semantic search.Have problem-solving skills and ability to work under pressure.High level of commitment to the team, continuous learning and development as well as taking responsibility for your own work.  Some Information you should also know:Circonomit's operating language is both German and English.Circonomit is a remote friendly company, but the real magic happens, when like minded people get together. Being located in or around Berlin would be a plus.The duration or time limit of the position is flexible, but it should be a minimum of 3 months to ensure mutual added value. We are always open to establishing long-term employment relationships.This role reports directly to the CTO\/CPO.The Tackstack we use:Programming should be fun. Circonomit uses modern, cutting-edge technologies:Typescript, PythonReact (Next.js) and SolidJSPostgreSQL and SQLiteHono RPC for end-to-end typesafe APIVitest and Playwright for testingTerraform (cdktf) for provider-agnostic cloud deploymentsAPIs on LLM, GPT AppsAs we are a young company of course, our tech stack is constantly evolving- We are always open to incorporate input from new hires on tools that they are passionate about.BenefitsWhat we offer to you:Belonging and Purpose - be part of the sustainable future and contribute to this important development, we are really passionate and take our values seriously.Development - a steep learning curve, both personally and professionally.Value-driven culture - we are really proud of our open culture.Ownership - Take responsibility and thrive with it.Modern working culture - flexible work hours and trust in your ability to deliver, empowering you to take control of your own personal balance.Remote & Hybrid work approach enabling a good balance between working from home and the office.Competitive and fair compensation package.Technology - State of the art equipment.A multicultural team.Our Principles:At Circonomit, we're committed to navigating our journey guided by a distinct set of principles. We believe in having a clear actionable standard set for daily action a set of guiding stars that illuminate our path forward aligned with our vision and values. These principles aren't just words on paper; they're the essence of how we operate daily. They embody our collective values, define our behaviors, and steer our decision-making processes. They're the unwavering standards that anchor us in our pursuit of excellence. By embracing these principles, we empower each team member to act with confidence and purpose. They serve as our North Star, offering direction, alignment, and a constant reminder of who we are and what we stand for.  React to other peoples messages in group chats at a minimum once daily so everyone knows we are on the same page especially the person that put in the work. Alignment and appreciation is key.Minimize communication overhead, make up your mind before meetings and conversation and if sending over information on any channel give a one sentence note on the rationale behind.Stay humble in discussions. Be aware when a strong opinion or absolutistic statement arises that is often an unvalidated hypothesis. Our only job then is to clearly state the problem and test with the market. In most cases there is neither a right or wrong or black and white. Be proactive and own. Especially in the early days, we require leaders, not followers, taking responsibility on their topics, setting and keeping the bar high.Keep up a healthy effective communication. Everyone is responsible to pause and cut interaction immediately that runs into the wrong direction, both the person that started it and the person that continues. Be on time, always, it's about respect for other people and the team's output. In any case there is any unforeseen delay, we give a written notice as early as we know to be late.Only have intended meetings. Come in with a clear goal\/problem statement, leave with an outcome delivery plan\/solution. If meetings do not add value to your work or you can not add value to the conversation, you are allowed and encouraged to leave.Execute with care and diligence. Keep files clean, check your spelling, document your work, deliver on a standard like if you were speaking in front of 1000 people or selling a book to 1M readers.Neutralize weaknesses. Everyone has them, be always kind to yourself, however do not accept them to affect the team's standard to drop. Use tools to support you, the new digital age has it all, or discuss with the team on how someone with a strength in this field can support you.Present a problem always with a solution draft If hitting a roadblock, take time to clearly state the problem and figure out some possible solution before interacting with the team for help. This is a thing of respect and ownership, others are not meant to fix the problem one is responsible for. Meet the Stellar Minds Behind Our Startup! At the heart of our dynamic startup are two visionaries, Dana and Erik, whose passion and expertise set the tone for our journey. Supported by the incredible talents of Jonas and Adrian, our team is a vibrant blend of diverse skills and shared values.Dana, our spirited co-founder, is a fitness enthusiast with a penchant for yoga and a love for the arts. Her fascination with both mathematics and human relationships adds a unique dimension to our approach, reflecting the harmony of logic and empathy.Erik, the technological maestro of our team, finds joy in the thrill of cycling, the heights of climbing, and the depths of engaging podcasts. His tech-savvy mind is the driving force behind our innovations, shaping the future of our venture.Jonas, a dedicated advocate for food sharing, brings a compassionate touch to our mission. His commitment to sustainability and community resonates in every aspect of our work, fostering a sense of responsibility that goes beyond business.Adrian, our artistic soul, expresses his creativity through the medium of oil paintings. His brushstrokes add color to our workspace, embodying the essence of our startup's imagination and originality.Our startup isn't just a workplace; it's more as high-performance sports-team united by a common purpose. The office exudes warmth, with at least one set of bedding always on standby and cabinets stocked with  100kg of ingredients for communal meals, from hearty lentil dishes to flavorful rice and couscous bowls.And because balance is key, our team ensures that fitness is woven into our daily routine through random push-up challenges and a sixpack bet. This unique blend of passion, creativity, and camaraderie is what sets us apart, fueling our motivation and propelling us towards success. Welcome to the spirited world of our startup!   Please also note:Research indicates that men typically apply to jobs when they meet about 60% of the criteria, whereas women and other members of marginalized groups often apply only if they fulfill every requirement. Therefore, if you possess most of the qualifications but don't meet every single point on the job description, we encourage you to reach out. We'd love to have a conversation and explore whether you could be an excellent fit for the role.  We look forward to hearing from you.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/circonomit-gmbh\/praktikant-werkstudent-data-science-aachen-133428","tags":["Data Scientist"],"job_types":["Working student","berufseinstieg"],"location":"Aachen","created_at":1702820945000,"original_language":"eng"},{"slug":"praktikant-werkstudent-software-development-aachen-373535","company_name":"Circonomit GmbH","title":"Praktikant \/ Werkstudent Software Development (w\/m\/d)","description":"About Circonomit:Good data for a greener tomorrow, a new perspective on sustainability and finance. Circonomit offers a fresh perspective on sustainability and finance. We empower companies, regardless of size or industry, to efficiently and transparently construct vital environmental data for their products and business processes. Together, we forge a path towards a more sustainable and prosperous future.  Who we are:We are Circonomit, an ambitious team of engineers and business professionals who share a common goal: to comprehensively revolutionize sustainable practices and behaviors in the industry for better environmental and economic decisions worldwide. We are cultivating a pioneering One-Stop-Solution for effortlessly and swiftly creating product and production-related environmental datasets at scale, as easy as playing with Lego bricks. In doing so, we directly address the megatrends of the climate crisis and digitalization. Our aspiration to establish the world's environmental data infrastructure will define the industry standard for collecting and organizing corporate environmental data. What sets us apart in the market is our framework for utilizing real data and seamlessly integrating environmental insights with financial optimizations.To safeguard the planet while fortifying the economic backbone of our society, we empower companies with genuine automation driven by cutting-edge technology.AufgabenAbout the Role:As an intern or working student, you will play an integral role in our development team. This is not just an internship for bystanders; it's a meaningful and value-adding position. We find ourselves at a pivotal moment, experiencing strong growth, solid financial footing, and the ambition to elevate our team to the next level. Join us from the outset and evolve with the teamwe're seeking a long-term relationship.  Circonomit is a young company with exceptional potential to make a real impact. As one of the initial employees in your domain, you'll have the chance to work closely with the entire team, including the founders. Confronting a variety of challenges will allow you to imprint your personal touch on the company. Operating in a cross-functional environment and taking on tasks beyond your core responsibilities is second nature to you, motivating you to achieve peak performance. You are adept at engaging with stakeholders (internal\/external) across all subject areas and contributing your expertise in a highly dynamic environment.QualifikationSome Key-strength you should bring with:Ideally some proven experience as a developer.Ideally experience in development of SaaS solutions in the B2B environment.Comfortable speaking with customers clearly to understand requirements.Experience with programming language, data processing and frameworks (see our Tech-Stack below) with solid understanding of databases since this is one crucial part of our product solution.Experience with large, enterprise-grade applications.High level of commitment to the team, continuous learning and development as well as taking responsibility for your own work.  Some Information you should also know:Circonomit's operating language is both German and English.Circonomit is a remote friendly company, but the real magic happens, when like minded people get together. Being located in or around Berlin would be a plus.The duration or time limit of the position is flexible, but it should be a minimum of 3 months to ensure mutual added value. We are always open to establishing long-term employment relationships.This role reports directly to the CTO\/CPO.  The Tackstack we use:Programming should be fun. Circonomit uses modern, cutting-edge technologies:Typescript, PythonReact (Next.js) and SolidJSPostgreSQL and SQLiteHono RPC for end-to-end typesafe APIVitest and Playwright for testingTerraform (cdktf) for provider-agnostic cloud deploymentsAPIs on LLM, GPT Apps  As we are a young company of course, our tech stack is constantly evolving-  We are always open to incorporate input from new hires on tools that they are passionate about.BenefitsWhat we offer to you:Belonging and Purpose - be part of the sustainable future and contribute to this important development, we are really passionate and take our values seriously.Development - a steep learning curve, both personally and professionally.Value-driven culture - we are really proud of our open culture.Ownership - Take responsibility and thrive with it.Modern working culture - flexible work hours and trust in your ability to deliver, empowering you to take control of your own personal balance.Remote & Hybrid work approach enabling a good balance between working from home and the office.Competitive and fair compensation package.Technology - State of the art equipment.A multicultural team.Our Principles:At Circonomit, we're committed to navigating our journey guided by a distinct set of principles. We believe in having a clear actionable standard set for daily action a set of guiding stars that illuminate our path forward aligned with our vision and values. These principles aren't just words on paper; they're the essence of how we operate daily. They embody our collective values, define our behaviors, and steer our decision-making processes. They're the unwavering standards that anchor us in our pursuit of excellence. By embracing these principles, we empower each team member to act with confidence and purpose. They serve as our North Star, offering direction, alignment, and a constant reminder of who we are and what we stand for.  React to other peoples messages in group chats at a minimum once daily so everyone knows we are on the same page especially the person that put in the work. Alignment and appreciation is key.Minimize communication overhead, make up your mind before meetings and conversation and if sending over information on any channel give a one sentence note on the rationale behind.Stay humble in discussions. Be aware when a strong opinion or absolutistic statement arises that is often an unvalidated hypothesis. Our only job then is to clearly state the problem and test with the market. In most cases there is neither a right or wrong or black and white. Be proactive and own. Especially in the early days, we require leaders, not followers, taking responsibility on their topics, setting and keeping the bar high.Keep up a healthy effective communication. Everyone is responsible to pause and cut interaction immediately that runs into the wrong direction, both the person that started it and the person that continues. Be on time, always, it's about respect for other people and the team's output. In any case there is any unforeseen delay, we give a written notice as early as we know to be late.Only have intended meetings. Come in with a clear goal\/problem statement, leave with an outcome delivery plan\/solution. If meetings do not add value to your work or you can not add value to the conversation, you are allowed and encouraged to leave.Execute with care and diligence. Keep files clean, check your spelling, document your work, deliver on a standard like if you were speaking in front of 1000 people or selling a book to 1M readers.Neutralize weaknesses. Everyone has them, be always kind to yourself, however do not accept them to affect the team's standard to drop. Use tools to support you, the new digital age has it all, or discuss with the team on how someone with a strength in this field can support you.Present a problem always with a solution draft If hitting a roadblock, take time to clearly state the problem and figure out some possible solution before interacting with the team for help. This is a thing of respect and ownership, others are not meant to fix the problem one is responsible for. Meet the Stellar Minds Behind Our Startup! At the heart of our dynamic startup are two visionaries, Dana and Erik, whose passion and expertise set the tone for our journey. Supported by the incredible talents of Jonas and Adrian, our team is a vibrant blend of diverse skills and shared values.Dana, our spirited co-founder, is a fitness enthusiast with a penchant for yoga and a love for the arts. Her fascination with both mathematics and human relationships adds a unique dimension to our approach, reflecting the harmony of logic and empathy.Erik, the technological maestro of our team, finds joy in the thrill of cycling, the heights of climbing, and the depths of engaging podcasts. His tech-savvy mind is the driving force behind our innovations, shaping the future of our venture.Jonas, a dedicated advocate for food sharing, brings a compassionate touch to our mission. His commitment to sustainability and community resonates in every aspect of our work, fostering a sense of responsibility that goes beyond business.Adrian, our artistic soul, expresses his creativity through the medium of oil paintings. His brushstrokes add color to our workspace, embodying the essence of our startup's imagination and originality.Our startup isn't just a workplace; it's more as high-performance sports-team united by a common purpose. The office exudes warmth, with at least one set of bedding always on standby and cabinets stocked with  100kg of ingredients for communal meals, from hearty lentil dishes to flavorful rice and couscous bowls.And because balance is key, our team ensures that fitness is woven into our daily routine through random push-up challenges and a sixpack bet. This unique blend of passion, creativity, and camaraderie is what sets us apart, fueling our motivation and propelling us towards success. Welcome to the spirited world of our startup!   Please also note:Research indicates that men typically apply to jobs when they meet about 60% of the criteria, whereas women and other members of marginalized groups often apply only if they fulfill every requirement. Therefore, if you possess most of the qualifications but don't meet every single point on the job description, we encourage you to reach out. We'd love to have a conversation and explore whether you could be an excellent fit for the role.  We look forward to hearing from you.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/circonomit-gmbh\/praktikant-werkstudent-software-development-aachen-373535","tags":["Software Development"],"job_types":["Working student","berufseinstieg"],"location":"Aachen","created_at":1702820945000,"original_language":"eng"},{"slug":"it-systemadministrator-in-niebull-76075","company_name":"MSP Nord GmbH","title":"IT system administrator (m\/f\/d) in Niebüll","description":"We have been working as an IT service provider on Sylt for 20 years now and have currently grown to a small team of 6 colleagues. We are planning to further expand our services in the coming months and therefore urgently need the support of motivated colleagues who would like to accompany us in this project. We offer a wide range of services that are just as diverse as our clientele here on Sylt.Beratung and maintenance is just as much a part of our tasks as the commissioning of complex network environments. In addition to mostly corporate customers, our long-standing customers also include many properties owned by second home owners.TasksAdministration and further development of Windows networksRemote maintenance for our customers with maintenance contracts.Delivery and configuration of hardware and software for the customerSoftware distribution and patch managementUser and authorization management (Microsoft Active Directory )Virtualization (VMware ESXi)Repair and recovery ordersQualificationSuccessful completion as an IT specialist for system integration or comparableBroad knowledge of Microsoft Windows environmentsInterested in familiarizing yourself with new topics and productsGood knowledge of spoken and written GermanSystematic, goal-oriented and independent workBenefitsBonus systemFitness studioGermany ticketJobrad4-day week possibleWE OFFER:Attractive position in a successful service companyLong-term cooperation and a secure jobFlat hierarchies and short decision-making processesA cooperative working atmosphere in a motivated teamBONUS SYSTEM | 4 days a week possible Look forward to an attractive, permanent job in Niebll, near the North Sea island of Sylt. Nice colleagues and other benefits are waiting for you. We are happy to provide you with advance information by telephone. Please email us detailed application documents including salary expectations and earliest starting date Please send us a PDF to m.schlueter(at)msp-nord.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/msp-nord-gmbh\/it-systemadministrator-in-niebull-76075","tags":["IT"],"job_types":[],"location":"Niebüll","created_at":1702820945000,"original_language":"deu"},{"slug":"regulatory-affairs-specialist-international-freiburg-im-breisgau-202327","company_name":"Kopani Consulting GmbH","title":"Regulatory Affairs Specialist (m\/w\/x) International","description":"Our customer is a globally operating, medium-sized family business in medical technology based in Freiburg. The company enjoys an excellent reputation for its innovative technologies and high-quality products. Due to its constant growth, we are looking for a Regulatory Affairs Specialist (m\/f\/x) International. Tasks Creation and processing of international approval dossiers for medical devices Execution of international registrations for medical devices of all classifications, in collaboration with local representatives Support and maintenance of existing approvals Maintenance of a product approval database Contact person for the countries in the area of ​​responsibility Preparation of documents for attestation and legalizationIdentification of the regulatory requirements for worldwide approvalsAnalysis and evaluation of regulatory changes and developments in connection with the countries servedSupport in the implementation of regulatory requirements across the entire process chainQualificationScientific or technical studies or professional trainingExperience in the field of active medical technology and regulatory affairsVery good communication skills and enjoyment on international exchangeVery good knowledge of English and German (min. C1) spoken and written Knowledge of using ERP systems (SAP) is an advantageBenefitsAn individual induction program with an annual budget for further trainingFlexible working hours and the possibility of working from home up to 60%The continuous growth of the company gives you long-term development opportunities and a future-proof job AvailableFree yoga and English coursesFlat hierarchies, an attractive salary and a practiced open-door policy contribute to a pleasant working atmosphereKopani Consulting is a human resources consultancy with over ten years of experience in recruiting and advising specialists and managers from the pharmaceutical and medical technology industries. Thanks to this experience, we can support experts and customers individually and discreetly. Please send us your detailed application documents including desired salary and earliest possible start date to Justus Windwehr.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kopani-consulting-gmbh\/regulatory-affairs-specialist-international-freiburg-im-breisgau-202327","tags":["Engineering"],"job_types":["berufserfahren"],"location":"Freiburg im Breisgau","created_at":1702817345000,"original_language":"deu"},{"slug":"2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-180595","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Telephone customer advisor m\/f\/d additional dental insurance","description":"To support the customer management team in the area of ​​supplementary dental insurance, we are looking for call center agents, telephone customer advisors m\/f\/d in customer service in Hamburg. As a call center agent, telephone customer advisor m\/f\/d you can expect: Tasks Advising existing and new customers on the topic Supplementary dental insurance by telephone and email (no cold calling) Creation of individual offers for the dental supplement area Collection and maintenance of customer data as well as responsibility for applications Interface function between customers and insurance companies Support in the permanent development of the comparative offer Qualification Commercial training (e.g. office clerk or insurance specialist ) or also like insurance career changerFirst experience in customer adviceHigh customer orientation as well as a confident and friendly demeanor on the telephoneResponsible, conscientious and structured way of workingHands-on mentality and strong implementation skills with a focus on detailEnthusiasm for digital business modelsBenefitsPermanent employment contractWorking hours from Monday to Friday between 8 a.m. and 8 p.m.Salary 30 a.m. to 32 p.m.Intensive and individual trainingProfessional qualifications in the health insurance sectorWorking independently in a dynamic working environmentCentral location with excellent transport connections and a view of the AlsterSubsidy for the HVV ProfiCardIndividual development and further training opportunitiesFriendly working environment with a first-name culture, shared lunch breaks and many team eventsHave we aroused your interest? Then we look forward to receiving your application. You are welcome to apply by email or WhatsApp. If you have any questions, Ivonne Wresch will be happy to help you. 0152\/33605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-180595","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702813742000,"original_language":"deu"},{"slug":"2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-135784","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Telephone customer advisor m\/f\/d additional dental insurance","description":"To support the customer management team in the area of ​​supplementary dental insurance, we are looking for call center agents, telephone customer advisors m\/f\/d in customer service in Hamburg. As a call center agent, telephone customer advisor m\/f\/d you can expect: Tasks Advising existing and new customers on the topic Supplementary dental insurance by telephone and email (no cold calling) Creation of individual offers for the dental supplement area Collection and maintenance of customer data as well as responsibility for applications Interface function between customers and insurance companies Support in the permanent development of the comparison offer Qualification Commercial training (e.g. office clerk or insurance specialist ) or also like insurance career changerFirst experience in customer adviceHigh customer orientation as well as a confident and friendly demeanor on the telephoneResponsible, conscientious and structured way of workingHands-on mentality and strength of implementation with a focus on detailEnthusiasm for digital business modelsBenefitsPermanent employment contractWorking hours from Monday to Friday between 8 a.m. and 8 p.m.Salary 30 a.m. to 32 p.m.Intensive and individual trainingProfessional qualifications in the health insurance sectorWorking independently in a dynamic working environmentCentral location with excellent transport connections and a view of the AlsterSubsidy for the HVV ProfiCardIndividual development and further training opportunitiesFriendly working environment with a first-name culture, shared lunch breaks and many team eventsHave we aroused your interest? Then we look forward to receiving your application. You are welcome to apply by email or WhatsApp. If you have any questions, Ivonne Wresch will be happy to help you. 0152\/33605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-135784","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702813742000,"original_language":"deu"},{"slug":"telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-175780","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Telefonischer Kundenbetreuer m\/w\/d 2*pro Woche Home Office Schichtzulagen ab 18 Uhr","description":"Wollen Sie als Kundenbetreuer m\/w\/d fr ein Hotelvergleichsportal arbeiten?Als Kundenberater m\/w\/d erwartet Sie:AufgabenSie betreuen die Kunden bei Fragen und Problemen am Telefon oder per Mail und kmmern sich dabei professionell und freundlich um eine schnelle und zufriedenstellende LsungSie sind verantwortlich fr die fachliche Prfung und Bewertung von KundenanliegenSie stellen die zgige Abwicklung und den Abschluss der Kundenanfragen in enger Zusammenarbeit mit den nationalen und internationalen Partnern sicherSie haben stets ein offenes Ohr fr die Kunden und schaffen es, bei Rckfragen zu Buchungen  per Telefon und E-Mail  kulante Lsungen zur Zufriedenheit der Kunden zu findenGemeinsam mit dem Team wirken Sie an der internen Qualittssicherung mit, um eine fehlerfreie Bearbeitung sicherzustellenZur Weiterentwicklung der internen Prozesse, arbeiten Sie eng mit den Experten zusammenQualifikationBerufserfahrung im Dialogmarketing, in der Touristik \/ Hotelbranche (z.B. Reservierungsabteilung) oder im telefonischen KundenkontaktIdealerweise bringen Sie eine abgeschlossene Ausbildung im kaufmnnischen oder touristischen Bereich mitIn Beratungsgesprchen mit den Kunden zeichnen Sie sich durch ein freundliches, serises und lsungsorientiertes Auftreten aus  Sie bringt so schnell nichts aus der RuheSie sind ein echter Teamplayer (m\/w\/d), haben Spa am gemeinsamen Erfolg und bringen eigene Ideen einSchriftlich und mndlich berzeugen Sie mit verhandlungssicheren Deutschkenntnissen sowie mit sicheren EnglischkenntnissenVersierter Umgang mit den gngigen PC- und InternetanwendungenZeitliche Flexibilitt Randarbeitszeiten zwischen 8 und 22 Uhr abzudecken (Frh-\/Mittel-\/Sptschicht) sowie Bereitschaft zur Arbeit an Wochenenden und Feiertagen (5-Tage-Woche)Benefitsunbefristeter Arbeitsvertrag, eine attraktive Vergtung fr Wochenend-, Feiertags- und Sptschichten sowie jhrliche Prmien fr besondere Erfolge. Die bernahme von Verantwortung wird zustzlich honoriert (z.B. Wochenend-Schichtleitung). Eine bezuschusste betriebliche Altersvorsorge und viele weitere Vergnstigungen gibt es obendrauf.Der Schichtplan wird, unter der Bercksichtigung von Wnschen, mind. vier Wochen im Voraus erstellt. Gerarbeitet wird 3 Tage die Woche gemeinsam im Office  an den brigen 2 Tagen ist mobiles Arbeiten mglich (Home Office).Einen Laptop fr mobiles Arbeiten, zwei Bildschirme oder individuelles Equipment wie eine ergonomische Maus oder Noise-Cancelling-Kopfhrer? Kein Problem!Individuelle Frderung durch Fortbildungen sowie regelmige Feedbackgesprche. Durch ein starkes und nachhaltiges Wachstum werden langfristige Perspektiven in der Fach- und Fhrungslaufbahn geboten.Zentraler Standort direkt am Stadthafen. Dank Zuschuss zum Job-\/Deutschlandticket und Fahrrad-\/ eBike-Leasing kommen Sie klimaneutral und gnstig ins Bro.Kostenlose Getrnke, Msli und frisches Obst sorgen fr Energie. Mehrmals wchentlich gibt es ein kostenloses, abwechslungsreiches Mittagessen.Attraktives Sportprogramm durch einen Personaltrainer: Halten Sie sich fit durch Yoga, Rckenfit, Bootcamp-Training oder auch zwischendurch in der Bewegten Pause.Es herrscht ein kollegiales und freundschaftliches Umfeld. Bei regelmigen Office Partys, Teamevents und Sommer- und Weihnachtsfeier feiern wir zusammen.Haben wir ihr Interesse geweckt? Dann freuen wir uns auf ihre Bewerbung. Gerne auch per Whats App 015233605774Ivonne Wresch steht Ihnen gerne bei Fragen zur Verfgung. 01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-175780","tags":["Customer Service"],"job_types":[],"location":"Münster","created_at":1702813742000,"original_language":"eng"},{"slug":"2300-2800eur-provision-sales-agent-telefonischer-kundenberater-berlin-429383","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2800€ + commission sales agent\/telephone customer advisor m\/f\/d","description":"Would you like to work for an international company that is one of the market-leading independent service providers in the field of fuel card solutions in Germany? We are looking for telephone customer advisors, sales agents, call center agents, telephone customer advisors m\/f\/d in outbound, customer service. The team in Berlin is expanded and you can work as a telephone customer advisor (m\/f\/d) for the internal sales department. As a telephone customer advisor, sales agent, call center agent, telephone customer advisor m\/f\/d you can expect: tasks customer advice inbound and outbound telephony ( B2B) Offer creation and processing Existing customer support (B2B) E-mail and fax processing Qualifications Ability to work in a team Friendly demeanor Experience in sales, ideally in telephone sales Loyalty Efficient, fast way of working Knowledge of PC applications and office programs Business-fluent knowledge of German Benefits Fixed salary (negotiable, at least 2300 - 2800) plus uncapped bonus ( on average 300-500 in the first quarter), when quarterly targets are achieved, the basic salary and bonus payments increase. Pleasant office in 10117 Berlin (near Friedrichstrasse S-Bahn station) Working hours from Monday to Thursday 8:30 a.m. to 4:45 p.m. on Friday until 3 p.m. (37 .5 hours)Development opportunities in an international companyApplicationHave we aroused your interest? We look forward to receiving your application documents. Feel free to email or WhatsApp.Ivonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2800eur-provision-sales-agent-telefonischer-kundenberater-berlin-429383","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702813742000,"original_language":"deu"},{"slug":"2500eur-mitarbeiter-terminierung-berlin-217588","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ employee m\/f\/d scheduling","description":"Would you like to work for an international company that is one of the market-leading independent service providers in the area of ​​fuel card solutions in Germany? We are looking for Telephone Customer Advisors, Call Center Agents, Telephone Customer Advisors m\/f\/d in the area of ​​existing customers.As Telephone Customer Advisors, Call Center Agents, Telephone customer advisor m\/f\/d awaits you:TasksCustomer satisfaction surveyNeeds assessmentScheduling for the sales teamQuality managementExpanding your own portfolio through customer loyalty and customer recommendationsQualificationIdeally, first or several years of experience in existing customer care and telephonyStrong communication, enthusiasm and teamwork skillsGood self-organizationGood MS Office knowledgeFluent in GermanBenefits2500 (negotiation bar)Pleasant Office in 10117 Berlin (near Friedrichstrasse S-Bahn station) Working hours from Monday to Thursday 8:30 a.m. 4:45 p.m. on Friday until 3 p.m. (37.5 hours) Development opportunities in an international company Application Have we aroused your interest? We look forward to receiving your application documents. Feel free to email or WhatsApp.Ivonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-mitarbeiter-terminierung-berlin-217588","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702813742000,"original_language":"deu"},{"slug":"2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-184745","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2600€ + 500€ bonus Telephone customer advisor m\/f\/d","description":"Would you like to work for an international company that is one of the market-leading independent service providers in the field of fuel card solutions in Germany? The team in Berlin is being expanded and we are looking for customer advisors\/clerks m\/f\/d in inbound. Tasks Customer support Quotation creation and processing Final processing of all customer inquiries E-mail - and fax processingInterface to other departmentsQualificationsAbility to work in a teamFriendly demeanorPleasant voiceKnowledge of spoken and written German at a native speaker levelEfficient, fast way of workingFun on the phoneMS Office skills in particularExcellent English skills for internal communicationBenefits2300 2600 gross (negotiable professional experience) plus 500 bonusPleasant officeNhe FriedrichstrasseWorking hours from Mon-Thu 8:30 a.m. 5 p.m., Friday until 3 p.m. Full time 37.5 hoursDevelopment opportunities in an international companyApplication:We look forward to receiving your application by email or WhatsAppIvonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-184745","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702813742000,"original_language":"deu"},{"slug":"2500eur-call-center-agent-mo-fr-375-stunden-berlin-107845","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Call Center Agent m\/w\/d Mo-Fr 37,5 Stunden","description":"Would you like to work for an international company that is one of the market-leading independent service providers in the field of fuel card solutions in Germany? The team in Berlin is being expanded and we are looking for a call center agent, clerk, telephone customer advisor m\/f\/d in customer service - no call Center.As a call center agent, clerk, telephone customer advisor m\/f\/d you can expect:TasksAccount managementCustomer supportCustomer adviceCustomer recoveryQuotation creation and processingCase-final processing of all customer inquiriesQualificationsAbility to work in a teamFriendly demeanorPleasant voiceKnowledge of spoken and written German at a native speaker levelEfficient, fast way of workingKnowledge of PC applications and office programsFun on the phoneBenefits2500 - 3000 Pleasant office near FriedrichstrasseWorking hours from Mon-Thu 8:30 a.m. to 5 p.m., Friday to 3 p.m. Full time 37.5 hoursDevelopment opportunities in an international groupApplication:We look forward to receiving your application by email or WhatsAppIvonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-call-center-agent-mo-fr-375-stunden-berlin-107845","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702813742000,"original_language":"deu"},{"slug":"junior-produktmanager-marking-neu-isenburg-169499","company_name":"HoPa Talents","title":"Junior Product Manager (m\/f\/d) Marking","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksProduct specialist for our customersTechnical support for our customers and internal sales teamsConducting application testsOrganizing and conducting training eventsSupport with product launches and commissioningQualificationA state-certified technician , a completed degree or comparableConfidence in using MS OfficeExperience in the field of electrical engineeringVery good knowledge of German and EnglishHigh technical affinityBenefitsFrom day one you will be an integral part of the team with your own tasks. You will be introduced to everyday work by your colleagues and taken by the hand. In our internal ACADEMY, we use the strengths of our employees to improve our daily work and promote collaboration across departmental boundaries. This includes, among other things, correct telephone calls, IT training and also communication coaching. You set the pace: promotions are possible every six months, it can happen very quickly and after 3-4 years you already have the chance for your first management responsibility. We recruit our managers from within our own ranks. This means you have your career in your own hands. Our managing director sets the best example. He still remembers his time as a junior sales manager with a sensor case in Tokyo. You can expect a permanent employment contract with 30 days of vacation per year and special leave for extraordinary life events. We have a transparent salary system so that we are always clear where the journey is going. You determine the amount of the annual salary increase based on your own performance. We bring the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/junior-produktmanager-marking-neu-isenburg-169499","tags":["Engineering"],"job_types":[],"location":"Neu-Isenburg","created_at":1702810143000,"original_language":"deu"},{"slug":"software-tester-stockelsdorf-463178","company_name":"HoPa Talents","title":"Software Tester (m\/w\/d)","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksExecution of manual and automated software tests in the C# environmentCreation of test specifications, test plans and test casesEnsuring high code quality by analyzing the Test results and subsequent optimization of the solutions Implementation of quality assurance and documentation during development Further development and optimization of test tools and processes Support in reviewing requirements Close communication and collaboration with the product owner and developers Qualification Successfully completed training as an IT specialist (m\/f\/d), completed Study of (business) informatics or. Several years of professional experience as a software tester. Ideally, good knowledge of C# and initial programming experience. Certification ISTQB Foundation Level. Very good knowledge of MS Office. High level of commitment, teamwork and communication skills, as well as a technical affinity and a precise way of working Word and writingBenefitsDiversity of perspectives through a wide variety of industries and customersAn international and collegial working environmentFlexible working modelOptimal compatibility of private life and workIndividual further training as well as quarterly feedback and development discussionsVarious career models (specialist, expert and\/or management career) to suit your individual strengths and ambitionsExtra-legal allowances for Company pension scheme and corporate benefits platform with exclusive employee discounts for numerous shopsFor your health: ergonomic workplaces, active breaks during working hours, changing offers through company health promotion, various company sports groupsWe bring the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/software-tester-stockelsdorf-463178","tags":["IT"],"job_types":[],"location":"Stockelsdorf","created_at":1702810143000,"original_language":"deu"},{"slug":"softwareentwickler-anwendungsentwickler-stockelsdorf-303085","company_name":"HoPa Talents","title":"Software developer \/ application developer (m\/f\/d)","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksOur software takes care of everything from image capture and data collection to fully automatic evaluation and data storage on our server systems. Further development of the products in our software ecosystemImplementation of customer-specific software modules and adaptationsInclusion in the processes of conception, development and commissioning at the customerIntegration of hardware components (e.g. for image capture or X-ray control)Interface to the customer, other departments and external service providersQualificationCompleted training as an IT specialist for application development or a completed degree in the field of computer science, software development or similar training with at least 3 years of professional experience in the described area of ​​responsibility Very good programming knowledge in C#\/WPF Knowledge of Xamarin (cross-platform app development) desirable Knowledge of web development, web server desirable Systematic, structured and solution-oriented way of thinking and working as well as strong team and communication skills High quality awareness paired with innovative spirit and creativityVery good knowledge of German and good EnglishBenefitsDiversity of perspectives through a large variety of industries and customersAn international and collegial working environmentFlexible working modelOptimal balance between private life and workIndividual further training as well as quarterly feedback and development discussionsVarious career models (specialist, expert and\/or management career) suitable to your individual strengths and ambitions, supra-legal subsidies for company pension schemes and corporate benefits platform with exclusive employee discounts for numerous shops. For your health: ergonomic workplaces, active breaks during working hours, changing offers through company health promotion, various company sports groups. We bring the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/softwareentwickler-anwendungsentwickler-stockelsdorf-303085","tags":["IT"],"job_types":[],"location":"Stockelsdorf","created_at":1702810143000,"original_language":"deu"},{"slug":"service-engineer-hamelin-271113","company_name":"HoPa Talents","title":"SERVICE ENGINEER (M\/W\/D)","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksCommissioning, troubleshooting and general overhaul of gearboxesIndependent and responsible commissioning of gearboxes (new and service gearboxes), including the appropriate documentation.Troubleshooting and General overhaulIndependent troubleshootingAnalysis and evaluation of transmission malfunctions, development of an appropriate action plan, initiation of appropriate activitiesPerforming dismantling, reassembly, repairs, general overhaul on siteInspection of parts for damage and reusabilityDisposition and monitoring of third-party workshops and provided helpers and aids (cranes\/hoists, slings, etc.)Create a qualified assembly reportQualificationCompleted at least 3 years of specialist training as an industrial mechanic and additional training related to the operationProfessional experience in gearbox assemblyKnowledge of electrical engineering and controlsMS Office knowledgeGood knowledge of spoken and written EnglishGeneral knowledge of shipbuilding or ship operations is an advantage Unrestricted flight and tropical suitabilityBenefits35h week collective agreement Capital-forming benefits Company pension scheme Canteen Company daycare Sports and fitness offersWe bring the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/service-engineer-hamelin-271113","tags":["Engineering"],"job_types":[],"location":"Hamelin","created_at":1702810143000,"original_language":"deu"},{"slug":"servicetechniker-sonderanlagenbau-stockelsdorf-48867","company_name":"HoPa Talents","title":"Service technician (m\/f\/d) special systems construction","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksInstallation of industrial X-ray systems for our customersMaintenance and servicing of industrial X-ray systems for our customersRetrofitting of our customers' existing X-ray systemsConducting customer training and acceptanceTelephone customer support in In the event of a fault, commissioning in the factory, radiation protection measurements in the factory and on site at our customers' sites and starter knowledge desirableMS Office (MS Word, MS Excel, MS Outlook)Secure in negotiations, strong communication skills as well as a strong customer and service orientationResponsible and independent way of workingVery good knowledge of German and good EnglishBenefitsDiversity of perspectives through a large number of industries and customersAn international and collegial working environmentIndividual further training and quarterly Feedback and development discussionsVarious career models (professional, expert and\/or management career) to suit your individual strengths and ambitionsExtra-legal subsidies for company pension schemes as well as corporate benefitsPlatform with exclusive employee discounts for numerous shopsFor your health: ergonomic workplaces, active breaks during working hours, changing offers through company health promotion, various company sports groupsWe bring the best to the best! - Apply now. If you have any questions, please do not hesitate to contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/servicetechniker-sonderanlagenbau-stockelsdorf-48867","tags":["Remote","Engineering"],"job_types":[],"location":"Stockelsdorf","created_at":1702810143000,"original_language":"deu"},{"slug":"technischer-produkttrainer-nuremberg-480107","company_name":"HoPa Talents","title":"Technical product trainer (m\/f\/d)","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksMain technical contact for customersInterface between customers, sales and the technical teamCommissioning, instruction and training of the hardware and software for the customerDevelopment of application solutions and Evaluation of optimization potential Develop application solutions with the 3D measuring scanner and present and communicate these both internally and to customers Creation of training documents for internal and external customer training Qualifications Completed technical studies, training or further education as a state-certified technician (m\/f\/d) Car driving license You like a mix of office work and travel (approx. 50 percent)Very good knowledge of German and EnglishYou are enthusiastic about technical products and interested in economic relationshipsBenefitsAn integral part of the team from day oneFurther training opportunities in the internal academyVersatile development and promotion opportunitiesEarly talent is recruited from within your own ranksTransparent salary systemRegular bonus paymentsPermanent employment contract and 30 days of vacation are more attractive Company car with fuel card also for private useWe bring the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/technischer-produkttrainer-nuremberg-480107","tags":["Remote","Engineering"],"job_types":[],"location":"Nuremberg","created_at":1702810143000,"original_language":"deu"},{"slug":"inbetriebnahme-servicetechniker-mit-fachrichtung-maschinenbau-im-bereich-sondermaschinenbau-fur-die-draht-und-kabelindustrie-dusseldorf-313687","company_name":"HoPa Talents","title":"Commissioning \/ service technician (m\/f\/d) specializing in mechanical engineering in the area of ​​special machine construction for the wire and cable industry","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksInstallation, functional testing and final acceptance of wire and cable production systems on the test field. Implementation or coordination of system installation and commissioning as well as technical customer acceptance at home and abroad Participation in the improvement and further development of the systems in close cooperation with the design departmentsInstruction of the operating and maintenance personnel Carrying out system inspections, repairs and service workQualificationCompleted training as an industrial mechanic (m\/f\/d) or comparable with further training as an industrial master \/ mechanical engineering technician ( m\/f\/d) or a similar vocational training with several years of professional experience Knowledge of special machine construction for the wire and cable industry is an advantage High willingness to work in field service worldwide and to flexible working hours Good knowledge of spoken and written English Communication and team skills Benefits Attractive earning potential through special services in field service Individual training for the upcoming Tasks with subsequent freedom for your own initiativesContinuous training and further education of our employeesLow employee fluctuation due to our positive and motivating working atmosphereFamily business and traditional company with a spirit of innovationContinuously high investments in the development of new, innovative products as well as in machines, organizational resources and facilities to increase efficiencyVery good working conditions in a working environment, that is technologically at the cutting edgeWe bring the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/inbetriebnahme-servicetechniker-mit-fachrichtung-maschinenbau-im-bereich-sondermaschinenbau-fur-die-draht-und-kabelindustrie-dusseldorf-313687","tags":["Remote","Engineering"],"job_types":[],"location":"Düsseldorf","created_at":1702810143000,"original_language":"deu"},{"slug":"projektleiter-stockelsdorf-476914","company_name":"HoPa Talents","title":"Project manager (m\/f\/d)","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksProject management of industrial X-ray systemsInterface function between technical and commercial departments Central contact person for our international customers and international sales representativesCoordination of projects in all mattersCreation of Project planning and processing of orders Monitoring of budgets and schedules Observation and assessment of project risks as well as initiation of measures Control and coordination of the project team in coordination with the department heads Implementation, moderation and documentation of project meetings QualificationSuccessfully completed technical studies or further training as a technicianProfessional experience in project business and a broad basic technical understanding Knowledge in Project management in mechanical or plant engineering is an advantage. Ideally, experience in special plant construction. Organizational talent and flexibility, resilience even in challenging situations. Business thinking, responsibility and quality awareness. Self-responsible, independent and solution-oriented work. Self-confident personality with persuasive power and excellent communicative skills. and English skillsBenefitsDiversity of perspectives through a wide variety of industries and customersAn international and collegial working environmentFlexible working modelOptimal compatibility of private life and workIndividual further training as well as quarterly feedback and development discussionsVarious career models (specialist, expert and\/or management career) to suit your individual strengths and ambitionsExtra-legal subsidies for the company Retirement provision and corporate benefits platform with exclusive employee discounts for numerous shopsFor your health: ergonomic workplaces, active breaks during working hours, changing offers through company health promotion, various company sports groupsWe bring the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/projektleiter-stockelsdorf-476914","tags":["Engineering"],"job_types":[],"location":"Stockelsdorf","created_at":1702810143000,"original_language":"deu"},{"slug":"kfz-mechaniker-kfz-mechatroniker-grossbeeren-182060","company_name":"HoPa Talents","title":"Automotive mechanic \/ automotive mechatronics technician (m\/f\/d)","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksMaintenance, maintenance and repair of manufacturer-independent commercial vehicles as well as their bodies, including welding and straightening workFault diagnosis with modern diagnostic devices on various mechanical, electronic , hydraulic and pneumatic systemsAssembly of vehicle parts and usual activities in the workshopQualificationTraining as a vehicle mechanic, mechatronics engineer, locksmith or metalworker (preferably with a focus on commercial and agricultural vehicles) or a comparable qualification with professional experience Newcomers are welcomeFirst experience with commercial vehicles (trucks, Trucks, trailers) desirable Craftsmanship and basic technical understanding A good portion of healthy humor :) Benefits Permanent employment contract after the probationary period Earnings: Attractive salary package 30 days of vacation per year Subsidized company pension scheme Referral bonus of up to 3,000 euros Regulated working hours 8 hours a day No Saturday work (depending on location) Future-proof workplace Very good working atmosphere Inter We bring further training opportunities the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechaniker-kfz-mechatroniker-grossbeeren-182060","tags":["Engineering"],"job_types":[],"location":"Grossbeeren","created_at":1702810143000,"original_language":"deu"},{"slug":"kfz-mechaniker-kfz-mechatroniker-langenau-186492","company_name":"HoPa Talents","title":"Automotive mechanic \/ automotive mechatronics technician (m\/f\/d)","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksMaintenance, maintenance and repair of manufacturer-independent commercial vehicles as well as their bodies, including welding and straightening workFault diagnosis with modern diagnostic devices on various mechanical, electronic , hydraulic and pneumatic systemsAssembly of vehicle parts and usual activities in the workshopQualificationTraining as a vehicle mechanic, mechatronics engineer, locksmith or metalworker (preferably with a focus on commercial and agricultural vehicles) or a comparable qualification with professional experience Newcomers are welcomeFirst experience with commercial vehicles (trucks, Trucks, trailers) desirable Craftsmanship and basic technical understanding A good portion of healthy humor :) Benefits Permanent employment contract after the probationary period Earnings: Attractive salary package 30 days of vacation per year Subsidized company pension scheme Referral bonus of up to 3,000 euros Regulated working hours 8 hours a day No Saturday work (depending on location) Future-proof workplace Very good working atmosphere Inter We bring further training opportunities the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechaniker-kfz-mechatroniker-langenau-186492","tags":["Engineering"],"job_types":[],"location":"Langenau","created_at":1702810143000,"original_language":"deu"},{"slug":"kfz-mechaniker-kfz-mechatroniker-landsberg-336730","company_name":"HoPa Talents","title":"Automotive mechanic \/ automotive mechatronics technician (m\/f\/d)","description":"The Hamburg company \"HoPa Talents GmbH\" and its team are the experts for first-class recruitment of specialists and managers. Through its clever strategies, an ingenious master plan and an exclusive coaching concept, it guarantees for every employee and employer to get the most out of it.HoPa Talents connects companies and talents and offers innovative solutions that are optimally and individually adapted to the respective requirements.TasksMaintenance, maintenance and repair of manufacturer-independent commercial vehicles as well as their bodies, including welding and straightening workFault diagnosis with modern diagnostic devices on various mechanical, electronic , hydraulic and pneumatic systemsAssembly of vehicle parts and usual activities in the workshopQualificationTraining as a vehicle mechanic, mechatronics engineer, locksmith or metalworker (preferably with a focus on commercial and agricultural vehicles) or a comparable qualification with professional experience Newcomers are welcomeFirst experience with commercial vehicles (trucks, Trucks, trailers) desirable Craftsmanship and basic technical understanding A good portion of healthy humor :) Benefits Permanent employment contract after the probationary period Earnings: Attractive salary package 30 days of vacation per year Subsidized company pension scheme Referral bonus of up to 3,000 euros Regulated working hours 8 hours a day No Saturday work (depending on location) Future-proof workplace Very good working atmosphere Internal Further training offersWe bring the best to the best! - Apply now. If you have any questions, please contact Mr. Michel Deistler on 01575 242 91 09. We look forward to hearing from you and your application. Your HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechaniker-kfz-mechatroniker-landsberg-336730","tags":["Engineering"],"job_types":[],"location":"Landsberg","created_at":1702810143000,"original_language":"deu"},{"slug":"event-manager-in-vollzeit-teilzeit-homeoffice-kiel-68033","company_name":"buchner consulting gmbh","title":"Event manager (m\/f\/d) full-time \/ part-time - home office","description":"Together with your team, you will create the basis for further training to guarantee personal and professional development for successful therapists. You pass on your practical know-how together online and at live events (trade fairs\/conferences). Curious?Then be sure to read on now, because we are looking for you as an event manager (m\/f\/d) with prompt leadership responsibility in the event team as soon as possible full-time or part-time from 30 hours in Kiel!TasksOption for prompt team leadership as a team leader after trainingPlanning event dates Customer communication Budget planning & monitoring Coordination of program developmentCreating events in the individual systemsEvent supportRecruitment and support of speakers, lecturers and consultantsClose communication and coordination with other teamsNegotiation of external services (hotel, shipping company, online provider, etc.)QualificationIdeally you have You can already gain experience in the event sector, preferably from the hotel industry. You have confidence in coordinating event processes. A small willingness to travel for in-person events, conferences and trade fairs. Independent and solution-oriented way of working. Basic technical understanding. Benefits. Here are the first highlights with us: flexible working hours & home office in rotation Sufficient parking options directly on the Kiel River. Additional company health insurance and company pension scheme. Use of personal training (employer-financed). Dogs are welcome in the office. 30 days of vacation per year. Individual company bike for leasing. Nuts, fruit and drinks are available to all of us. 150 net inflation compensation until December 2024And much more!WHY BUCHNER?You work in a great team that supports you at all times. We live values ​​and care for each other. You get a crisis-proof workplace and a modern working environment. We are happy to celebrate our successes together, and of course we offer various benefits, e.g. B. company pension schemes and health promotion. And to really show off: We really have the most beautiful rooms in all of Kiel, right on the Frde with the most wonderful view! Apply now and become part of the team!Questions?Ask your questions to the employee management team on 0431 \/ 72000-470.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/buchner-consulting-gmbh\/event-manager-in-vollzeit-teilzeit-homeoffice-kiel-68033","tags":["Management","Team Leader"],"job_types":["berufseinstieg"],"location":"Kiel","created_at":1702810143000,"original_language":"afr"},{"slug":"werkstudent-business-operations-berlin-242623","company_name":"Sirius Music Communications GmbH","title":"Werkstudent Business Operations (f\/m\/x)","description":"What is SIRIUSOur mission is to become the #1 Global Music School and make learning an instrument accessible to everyone worldwide. We find the perfect teacher for every student worldwide. Our unique technology, tailored for 1-on-1 online music lessons, digitally connects teachers and students for high-quality music lessons. What can you expect?We are a team of passionate musicians, entrepreneurs and technology enthusiasts. Our goal is to reinvent the way we learn & make music. We are ambitious, creative and diverse and are looking for like-minded people to join us in our mission to build the #1 Global Music School. Start time: immediately!TasksManagement of the onboarding process, identification of improvement opportunities and their implementationSetup of a forecast model for capacity planningOnboarding of new music teachers and students on the SIRIUS platformProcessing of incoming applications and conducting introductory interviewsManagement of the music teacher community, support with incoming customer inquiries via E -Email, telephone, WhatsApp from music teachersQualificationYou are currently enrolled at a universityYou have strong organizational skills and are able to set priorities appropriately and effectivelyYou have an analytical approach and enjoy setting up structures and processes and developing the area independentlyYou are communicative and Fluent in spoken and written GermanYou are interested in music and are enthusiastic about the topicYou are looking for a dynamic environment and a challenging jobYou have the capacity to work at least 15 hours per weekBenefitsTo take on a lot of responsibility and help shape the path of an early-stage startupAn exciting one Startup atmosphere with highly motivated colleagues and a fantastic office in the middle of KreuzbergHybrid work culture and the possibility of working remotelyExtensive further training opportunitiesRegular team events and concert visits (e.g. Berlin Philharmonic Orchestra) as well as free drinks, snacks and breakfast during the week If you would like to build the #1 Global Music School with us, then let's talk! We are looking forward to your application. The position doesn't exactly fit, but you would like to work with us? Then just contact us and we'll see what we can do for you. It's hard to find good people and we're happy about every application.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sirius-music-communications-gmbh\/werkstudent-business-operations-berlin-242623","tags":["Business Operations"],"job_types":["Working student","hilfstätigkeit \/ student"],"location":"Berlin","created_at":1702810143000,"original_language":"sun"},{"slug":"customer-service-high-end-kitchen-utensils-berlin-365228","company_name":"Workstation Customer Care","title":"Customer Service High End Kitchen Utensils (m\/f\/d)","description":"Our customer sells branded everyday products (such as juicers, coffee machines or contact grills) as well as the matching accessories: e.g. Glasses, carafes or flavors. The latest trends can be found here first. Our customer is characterized by an excellent delivery service. To support the extensive and demanding customer base, we are looking for you (m\/f\/d) to enlarge the existing customer support team.Your job in this customer service role:Purchase order managementAdvise customers on costs, alternatives and discountsAssistance in the operation of the devices, if something should not workHelp with the operation of the online shopCustomer master data maintenance (e.g., address, bank details)active approach of promotions and special pricesFor this customer support job you bring along:routine in dealing with customer inquiriesService and goal-oriented actionideally multitasking capable, but at least stress resistantteam player, self-motivating and responsibletemporal flexibilityfluent in DanishWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/customer-service-high-end-kitchen-utensils-berlin-365228","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702799343000,"original_language":"eng"},{"slug":"buchhaltungsservice-tlw-von-zu-hause-berlin-109647","company_name":"Workstation Customer Care","title":"Accounting service partly from home - m\/f\/d","description":"Our client is a financial service provider operating throughout Europe who takes care of invoicing and payment posting for a wide range of companies from various industries. We are looking for active support (m\/f\/d) to support these customers in the use of the software offered - both in data collection and evaluation as well as in user support. Typical tasks that you will take on: Creation of lists, e.g. Open itemsSetting dunning blocksCreating goodwill credits\/chargeback processingAccount management, allocation to the chart of accountsPayment allocation and write-offsWhat you bring with you:Commercial understandingExperience in dealing with modern application systemsProfessional workWillingness to share knowledge and continuously learnOpenness to changing conditionsOpenness in working methods with minimal bureaucracyWe look forward to getting to know you! Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/buchhaltungsservice-tlw-von-zu-hause-berlin-109647","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702799343000,"original_language":"deu"}]