[{"slug":"senior-java-anwendungsentwickler-koln-hybrid-bonn-231476","company_name":"Intercon Solutions GmbH IT & Engineering Experts","title":"Senior Java Application Developer (m\/f\/d) - Cologne hybrid","description":"Are you looking for a new challenge in software development?You want to actively contribute your ideas in an agile development environment?Then this could be the right time for you to take the next step as a software developer and grow with a well-known company!TasksFurther development, implementation and testing existing components of the applicationRequirements analysis and design for product design and system architectureThe creation of technical conceptsTroubleshooting, analysis and bug fixingQualificationSuccessfully completed studies in information technology, training as an IT specialist for application development or comparableRelevant experience in: Java, JavaScript, HTML\/CSS, XSLT, XML, AJAX, Hibernate, SQL, Tomcat, EclipseUser-friendly UI designExperience with system architecture\/designNice to have: Previous knowledge in the financial sectorBenefitsAttractive salaryMobile working30 vacation daysFlat hierarchiesPermanent permanent positionThis position is perfectly tailored to you?We would be happy to bring you together with our customer and provide you with lots of further information. IT consultant Cedric Baron is available to you at any time by email or telephone at: +49 211 95597688 and will support you throughout the entire process. Get to know your new employer in person in the next few days. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/intercon-solutions-gmbh-it-engineering-experts\/senior-java-anwendungsentwickler-koln-hybrid-bonn-231476","tags":["Software Development"],"job_types":[],"location":"Bonn","created_at":1702406944000,"original_language":"deu"},{"slug":"senior-java-anwendungsentwickler-bonn-hybrid-378129","company_name":"Intercon Solutions GmbH IT & Engineering Experts","title":"Senior Java Application Developer (m\/f\/d) - Bonn hybrid","description":"Are you looking for a new challenge in software development?You want to actively contribute your ideas in an agile development environment?Then this could be the right time for you to take the next step as a software developer and grow with a well-known company!TasksFurther development, implementation and testing existing components of the applicationRequirements analysis and design for product design and system architectureThe creation of technical conceptsTroubleshooting, analysis and bug fixingQualificationSuccessfully completed studies in information technology, training as an IT specialist for application development or comparableRelevant experience in: Java, JavaScript, HTML\/CSS, XSLT, XML, AJAX, Hibernate, SQL, Tomcat, EclipseUser-friendly UI designExperience with system architecture\/designNice to have: Previous knowledge in the financial sectorBenefitsAttractive salaryMobile working30 vacation daysFlat hierarchiesPermanent permanent positionThis position is perfectly tailored to you?We would be happy to bring you together with our customer and provide you with lots of further information. IT consultant Cedric Baron is available to you at any time by email or telephone at: +49 211 95597688 and will support you throughout the entire process. Get to know your new employer in person in the next few days. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/intercon-solutions-gmbh-it-engineering-experts\/senior-java-anwendungsentwickler-bonn-hybrid-378129","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Bonn","created_at":1702406944000,"original_language":"deu"},{"slug":"regular-technician-stuttgart-134573","company_name":"wu personal GmbH","title":"Regular Technician (m\/w\/d)","description":"As experts for IT personnel and commercial specialists in temporary employment and in service and work contracts, we support national and international well-known customers from the IT industry. Our customer is a leading cross-manufacturer IT service provider with 20,000+ employees worldwide. Become part of an independent provider of IT infrastructure services and solutions for large companies and the public sector. On behalf of our customer, we are looking for several employees (m\/f\/d) as soon as possible for the area of ​​work Regular Technician (m\/f\/d) TASKS Setting up and dismantling network equipment (e.g. access point, switch) Installation and commissioning of network components in distribution and server rooms as well as data centers and racksCabling of distribution and server rooms of power and network in copper or fiber opticInput of Cisco\/HP system images and rudimentary configuration on Cisco\/HP network devices according to specificationsProcessing of customer network incidents as well as call acceptance and documentation in the 1st and 2nd levelKNOWLEDGESCompleted Training or relevant experience in the IT environment in the last 3 yearsManufacturer certification or three years of practical experience in 2nd level supportExperience in processing IT tickets including finding solutions and experience in a ticket systemBasic network knowledge and experience in solving simple network problemsExperience in dealing with Outlook and other MS Office products as well as in the installation, repair and upgrade of hardware and softwareExperience in cabling and connecting IT devices as well as in carrying out technical work steps according to specified processesGood knowledge of spoken and written German and English iCar driving license (manual gearbox) SERVICESTariff-based contract (iGZ\/DGB )Fixed monthly salary including above-tariff payProject allowance from the first day of employmentVacation and Christmas bonus according to iGZRemuneration according to equal pay modelEmployee referral programPersonal supportFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wu-personal-gmbh\/regular-technician-stuttgart-134573","tags":["IT"],"job_types":[],"location":"Stuttgart","created_at":1702406944000,"original_language":"deu"},{"slug":"online-marketing-managerin-google-ads-hamburg-62746","company_name":"favineo GmbH","title":"Online Marketing Manager*in - Google Ads (m\/w\/d)","description":"Wir suchen neue Online Marketing Manager (m\/w\/d) fr den Bereich Google Ads, die uns beim Kampagnenmanagement und der Kundenbetreuung unserer E-Commerce Kunden untersttzen.Als Online Marketing Manager (m\/w\/d) arbeitest du eng mit unseren Kunden zusammen und setzt dich intensiv mit deren Geschftsmodellen auseinander. Nach der Einarbeitung bist du Experte und kannst die notwendigen Google Ads Kampagnen von Search, Display, Shopping ber Performance Max und Demand Gen bis hin zu YouTube aufsetzen. Du bist somit direkter Ansprechpartner fr sie rund um die Themen Strategie, Zielsetzungen, Performance, Budgeteinsatz und Berichterstellung.AufgabenDu entwickelst individuelle Strategien fr Online-Shops und betreust Google Ads Kampagnen fr maximale Profitabilitt, Umsatzsteigerung und Neukundengewinnung.Du betreust dein eigenes Kundenportfolio und tauschst dich regelmig mit dem Team zu aktuellen Kundencases, Mglichkeiten & Schwierigkeiten aus.Du lernst die Geschftsmodelle unserer Kunden intensiv kennen, analysierst Ergebnisse und leitest klare Handlungsempfehlungen innerhalb und auch auerhalb von Google Ads ab.Du kommunizierst proaktiv mit deinen Kunden und leitest Onboarding-, Biweekly-Calls und sonstige Termine mit spannenden Fhrungspersnlichkeiten.Du pflegst den Kontakt zu deinen Kunden fr langfristige und erfolgreiche Geschftsbeziehungen.Du bernimmst Verantwortung fr interne Prozesse und versuchst diese eigenstndig und durchdacht weiterzuentwickeln.Du bleibst auf dem neuesten Stand der Neuerungen im Google Ads Kosmos und die Besonderheiten im Zusammenspiel der verschiedenen Kampagnenarten.QualifikationDu hast idealerweise eine abgeschlossene Berufsausbildung oder einen Bachelor-Abschluss.Von Vorteil: Du hast bereits Erfahrung in der agenturseitigen Kundenbetreuung.Du hast Kenntnisse im Performance Marketing und hast bereits Google Ads Kampagnen umgesetzt.Du hast ein analytisches Verstndnis von Daten, erkennst Zusammenhnge und kannst Optimierungsmanahmen ableiten.Du versteht, worauf es im E-Commerce ankommt und kennst relevante KPIs wie CR, AOV & CLV.Du hast ein grundlegendes Verstndnis von den Zusammenhngen verschiedener Marketingkanle im Online-Marketing-Mix.Von Vorteil: Du hast Erfahrung im Umgang mit Conversion Tracking und Tools wie Google Analytics.Von Vorteil: Du kannst Skripte fr UGC Ads schreiben und sie mithilfe einer Videosoftware editieren.Du bist gewissenhaft, ordentlich und hast eine schnelle Auffassungsgabe.Du hast starke kommunikative Fhigkeiten und eine strukturierte Arbeitsweise.Du bist sehr proaktiv und bringst gerne neue Ideen ein.Du bist eigenverantwortlich und absolut zuverlssig.Du kannst bestehenden Prozessen folgen und diese aber auch weiterentwickeln.BenefitsFlexibles Arbeiten: flexible Arbeitszeiten und Remote-OptionenPrivate Entlastung: Wir zahlen deinen Weg zur Arbeit, dein Mittagessen und vieles mehr.Ausgezeichnete Lage: Moderne Brorume an der Elbe gegenber vom SPIEGEL-Gebude mit exzellenter Infrastruktur und Anbindung.Karrierechancen: ber die nchsten Jahre werden wir weiter wachsen und expandieren. Dazu bentigen wir weitere Experten und\/oder Fhrungskrfte.Eigenverantwortliches Arbeiten: Bei uns musst du keine Zeit absitzen, sondern kannst dich auf das Erreichen deiner Ziele fokussieren.Optimale Ausstattung: Du bekommst dein eigenes MacBook, das sowohl zum Arbeiten als auch fr den privaten Gebrauch zur Verfgung gestellt wird.Die favineo GmbH gehrt zu den Top 3% der Google Ads Agenturen in Deutschland mit Sitz im Herzen von Hamburg und wurde 2023 als Google Premium Partner ausgezeichnet.Mit unseren Google Ads Full-Funnel-Approach entwickeln wir Online-Shops in neue fave-Brands und steigern in drei klaren Phasen Profitabilitt, Umsatz und Neukunden.Unsere Kunden sind aufstrebende D2C-Shops, die im E-Commerce die Big Player von morgen sind.Um als Team weiter zu wachsen und noch mehr spannende Kunden betreuen zu knnen, suchen wir nun weitere Verstrkung! Uns ist am wichtigsten, dass du perfekt ins Team passt, den richtigen Spirit mitbringst und gemeinsam mit uns ber dich hinauswchst. Wenn du Lust hast in einer dynamischen und zielorientierten Umgebung zu arbeiten, dann passt du perfekt zu uns.Damit wir schon einmal einen ersten Eindruck von dir gewinnen knnen, flle bitte diesen Persnlichkeitsfragebogen aus: https:\/\/www.16personalities.com\/free-personality-testLade dein Ergebnis anschlieend als Dokument hoch.Wir freuen uns, dich bei einem ersten Gesprch besser kennenzulernen.Bis gleichPascal und das gesamte favineo TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/favineo-gmbh\/online-marketing-managerin-google-ads-hamburg-62746","tags":["Online Marketing"],"job_types":["Vollzeit (unbefristet)"],"location":"Hamburg","created_at":1702406944000,"original_language":"eng"},{"slug":"founder-associate-berlin-168635","company_name":"Shit2Power","title":"Founder Associate","description":"About Us:SHIT2POWER is a climate tech startup dedicated to transforming wastewater treatment plants into power plants. We are passionate about developing cutting-edge technology that economically incentivizes keeping fresh water in the cycle. Imagine a world where all global wastewater is recycled and used as a resource to generate renewable energy  that's the path we are forging.  We are a small, interdisciplinary team committed to creating a decentralized solution that turns scientific concepts into practical, scalable solutions. Our mission is to improve the status quo by connecting and reimagining these concepts, ultimately contributing to a sustainable future. We believe in an environment where the better argument prevails.  We're expanding our team and are currently seeking a dynamic and resourceful Founder Associate to join us on this exciting journey full-time.TasksResponsibilities:Work closely with the Co-Founders to provide operational support across various facets of the business.Manage and execute special projects as assigned, ensuring timely and successful completion. Conduct market research and analysis to contribute valuable insights for decision-making.Support the founding team during the fundraising process.Serve as a liaison between the CEO and other team members, facilitating effective communication and collaboration.Assist in the development and execution of key business initiatives and partnerships. Manage network by actively communicating with our stakeholders either on the phone, via mail, attending meetings as well as events. Handle confidential and sensitive information with discretion and professionalism.RequirementsRequirements:You are a generalist with a hands-on mentality and a master's degree in business administration or a similar field, or a bachelor's degree with outstanding achievements.You have proven experience in the startup environment, because you have worked full-time in a startup before.Exceptional organizational and multitasking skills. You see the work where others close their eyes. Getting things done gives you energy.Strong analytical and problem-solving abilities. This means you know how to set priorities and stick to them.Operational work is your preference compared to strategic work.Excellent verbal and written communication skills. Auch auf Deutsch, denn viele unserer Stakeholder sprechen deutsch (C1 German is a minimum).Ability to work independently and collaboratively in a fast-paced environment.Proficient in standard software tools (e.g. G-Suite environment).You do not shy away from building powerpoint presentations or use s-functions and other combinations to master excel-sheets. There will be many of these. Reporting Structure:The Founder Associate will report directly to the CEO and collaborate closely with other team members.Company Culture:At SHIT2POWER, we foster a collaborative and innovative culture. We value creativity, diversity, and a commitment to making a positive impact on the environment.BenefitsStart-up environment happens at high pace, plenty of tasks and a high learning curve.In order to remain calm and stay healthy we provide you with an Urban Sports Membership M.Opportunities for Growth:We want to help you to develop and grow towards your full potential.This role provides ample opportunities for professional development and career advancement within our rapidly growing company.Please note:Research shows that men apply to jobs when they meet an average of 60% of the criteria. Meanwhile, women and other members of marginalized groups often only apply if they check every box. So if you might have what it takes, but don't quite meet every single point on the job description, please get in touch either way. We'd love to have a chat and see if you could be a great fit. We are looking forward to hearing from you.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/shit2power\/founder-associate-berlin-168635","tags":["Business Operations"],"job_types":["professional \/ experienced"],"location":"Berlin","created_at":1702403344000,"original_language":"eng"},{"slug":"projektassistenz-finance-stuttgart-403372","company_name":"univativ GmbH","title":"Projektassistenz (m\/w\/d) Finance","description":"From now until April 1, 2024, with an option to extend | 20 hours per week | Stuttgart | Finance | Experienced professional, career starter | 17 to 19 per hour | Project ID D202345183_1Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you not only expect attractive development opportunities from your job, but also variety and a comfortable working atmosphere? No problem - a career with extraordinary opportunities awaits you with us! With your business studies you have the best prerequisites to master the diverse tasks in project management independently and in a structured manner. Our customer is a leading company in the financial sector. You can expect a collegial working atmosphere on a very professional level in our project. By working with different experts, you can develop your skills and pursue your passion in a modern working environment. Apply now!TasksYou will take on part of the control for the project to implement payment systemsThis includes creating, coordinating and updating project plansYou are also responsible for project controllingYou will also analyze processes and build new process structuresCommunication and coordination of tasks with various stakeholders in the project is also part of your tasksQualificationsYou have a degree in economics with a focus on finance or comparableIdeally, you have already gained initial experience in project management and payment transactionsIf you have a project certification at level D, that would also be desirableA good understanding of processes, talent in the organization of tasks and strong communication skills are also important skills that you should have. You speak German fluently. Benefits An hourly wage between 17 and 19. The possibility of working remotely from home. We will give you feedback on your application within 48 hours various projects Use your professional network with various customersTake advantage of your chance to win an attractive bonus of up to 2,000 euros for our Recruit a Friend programWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/projektassistenz-finance-stuttgart-403372","tags":["Finance"],"job_types":[],"location":"Stuttgart","created_at":1702403344000,"original_language":"nds"},{"slug":"influencer-marketing-manager-munich-303997","company_name":"mybacs","title":"Influencer Marketing Manager (m\/f\/d)","description":"About the positionAs an Influencer Marketing Manager (m\/f\/d), you will support the planning, implementation and control of our collaborations and work closely with our influencer management team and the brand team.Your tasksYour missionPlanning & implementation of performance-oriented influencer marketing -CampaignsContact with influencers and their managementResponsible management of influencer campaigns (research, selection, planning, coordination, implementation and controlling)Responsibility for your own campaign budget (planning, controlling)Expansion of the influencer network and sustainable maintenance of influencer relationshipsYour profileYour profileAt least 6 months of experience in Campaign Management Area InfluencerSpeaking for digital trends in influencer marketingInitiative and proactive action (#hands-on mentality)Solution-oriented, easily structured An organizational talentAnalytical skills for campaign evaluationVery good knowledge of Chrome (especially Sheets)Very good German and English skills, spoken and writtenWhy us? That's why we tackle challenges together with an ambitious team that believes in its mission to make health and daily well-being a lifestyle concept. A motivated, young team in the heart of Munich that wants to grow with top talent like you. Exciting products based on the latest scientific findings that Offer people great added valueCompetitive salary, equipment & annual coaching budget for your developmentFlexible working hours and vacationRegular events such as offsites, knowledge nights and team eventsBenefits such as your own Dailybacs subscription, fitness, food and wellness offersFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/mybacs\/influencer-marketing-manager-munich-303997","tags":["Marketing and Communication"],"job_types":["berufseinstieg"],"location":"Munich","created_at":1702403344000,"original_language":"deu"},{"slug":"php-typo3-developer-8766-sennfeld-454927","company_name":"alphacoders","title":"PHP\/Typo3 Developer (m\/w\/d) #8766","description":"Our partner is a nationwide engineering company that supports the expansion of telecommunications and digitalization in Germany. These include, among other things, the expansion of the mobile phone network and the expansion of fiber optics. The KorTech platform is used for project planning and is to be developed in-house in the future and used for internal and external planning of process landscapes in the telecommunications sector. Tasks Design, development, testing and maintenance of high-quality, scalable and secure back-end systems with Typo3 and PHP optimization and further development of existing web applicationsWorking on code reviews to ensure code quality and efficiencyContinuous improvement through researchQualificationExperience in backend development with PHPGood understanding of database technologies such as MySQLExperience in using GitLab and good knowledge of HTML, CSS and JavaScript is desirableKnowledge of Typo3 CMS is advantageousStrong communication and Ability to work in a team, as well as the ability to work independently and find creative solutions High willingness to learn and adaptability in a rapidly changing industry Benefits Fully remote or in Mnster 30 days vacation 40 hours\/week with flexitime Individual training opportunities Corporate benefits Job bike discounts at Ticketsprinter Sports offers (bouldering, yoga, urban sports club) Are you interested in more to find out about this position? Send us your application and, if possible, your current CV and other useful links such as Xing, LinkedIn or Github. We will get in touch with you as soon as possible. This job is not for you? Feel free to take a look at our other positions. We are always looking for new talent, experienced professionals and digital experts.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/alphacoders\/php-typo3-developer-8766-sennfeld-454927","tags":["Remote","Software Development"],"job_types":["berufserfahren"],"location":"Sennfeld","created_at":1702403344000,"original_language":"deu"},{"slug":"elektrofachkraft-dingolfing-118108","company_name":"SmartDec GmbH","title":"Elektrofachkraft (m\/w\/d)","description":"SmartDec GmbH, a leading company in the field of automation technology, is looking for a motivated and talented electrician (m\/f\/d). Our company is known for innovative solutions and we offer an excellent opportunity to work in a dynamic and growing environment. If you are looking for a challenging position with the opportunity for professional development, this could be the perfect opportunity for you. We look forward to hearing from you!TasksInstallation, commissioning of electrical systemsPerforming electrical repairs and troubleshootingTesting and measuring electrical devices and systemsCreating and updating technical documentationEnsuring compliance with safety regulations and standardsQualificationCompleted training as an electrician or comparable qualificationExperience in the automation mechanical engineering industry AdvantageGood understanding of electrical circuit diagrams and control systemsAbility to independently diagnose and troubleshoot electrical systemsWillingness to travelTeam spirit and flexibilityGood knowledge of spoken and written EnglishDriving license class BBenefitsAn exciting workplace in a pleasant, modern and collegial working atmosphere in a rapidly growing company.The opportunity to expand extensively through training\/further training offers to develop.You work with the latest technology and state-of-the-art networkingAn attractive remuneration, taking on responsibility and shaping the companyAre you looking for an exciting career in the field of automation technology? Become part of our team at SmartDec GmbH and develop your potential as an electrician!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/smartdec-gmbh\/elektrofachkraft-dingolfing-118108","tags":["Engineering"],"job_types":["berufserfahren"],"location":"Dingolfing","created_at":1702403344000,"original_language":"deu"},{"slug":"google-ads-performance-manager-freelancer-berlin-54101","company_name":"Beilmann Marketing GmbH","title":"Google Ads Performance Manager (m\/w\/d) Freelancer","description":"Your tasksYou work on the strategic planning, implementation and implementation of performance marketing campaigns in the SEA sectorYou develop new and innovative approaches to optimize their campaigns together with customersYou manage and optimize customers' Google Ads accounts with 100k adspendYou develop keywords and formulate ad textsYou develop new creatives together with our in-house production teamYour profileYou have initial experience in the SEA sectorYou have a good, technical understanding of online toolsYou are curious, committed, communicative and have a high degree of initiative and organizational skillsYou enjoy personal contact with customers and can handle complicated processes clarify more easilyYou work in a structured and conscientious mannerYou are a team playerYou have very good written and spoken German and English skillsWhy us?Why should you work with us?Our team works particularly well because we see friendly cooperation as the key to success. Do you share this philosophy and are a motivated, creative and enthusiastic person? Then you are exactly right with us! In our team, you will be fully involved in our work processes from day one and can immediately show what you can do. 100% remote work, flexible working hours, independent work, lots of freedom for your own ideas and creativity, opportunities for professional and personal development. Are you convinced? Then simply send your application! We look forward to getting to know you.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/beilmann-marketing-gmbh\/google-ads-performance-manager-freelancer-berlin-54101","tags":["Remote","Marketing and Communication"],"job_types":["Freelance","berufserfahren"],"location":"Berlin","created_at":1702403344000,"original_language":"deu"},{"slug":"bing-ads-performance-manager-freelancer-berlin-474314","company_name":"Beilmann Marketing GmbH","title":"Bing Ads Performance Manager (m\/w\/d) Freelancer","description":"Your tasksYou will work on the strategic planning, implementation and execution of performance marketing campaigns in the area of ​​Bing AdsYou will work with customers to develop new and innovative approaches to optimizing their campaignsYou will manage and optimize the Bing Ads of 4 existing accounts with a total of approx. 20k Adspend and set up new campaigns for approx. 3-4 accountsYour profileYou have good experience in the area of ​​Bing Ads and have already managed 50k AdspendYou work in a structured, conscientious, solution-oriented manner and have a high degree of initiativeTransparent work and communication is important to youYou have very good German and knowledge of spoken and written EnglishWhy us?HEY! Are you interested in exciting projects in an ambitious team? Then you've come to the right place! We help online shops make more sales with Google Ads and take over the complete production of display and video material. When it comes to search, display, shopping or YouTube Ads, we cannot be surpassed. Why should you work with us? Our team works particularly well because we see friendly cooperation as the key to success. Do you share this philosophy and are a motivated, creative and enthusiastic person? Then you are exactly right with us! In our team, you will be fully involved in our work processes from day one and can immediately show what you can do. 100% remote work, flexible working hours, independent work, lots of freedom for your own ideas and creativity, opportunities for professional and personal development. Are you convinced? Then simply send your application! We look forward to getting to know you.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/beilmann-marketing-gmbh\/bing-ads-performance-manager-freelancer-berlin-474314","tags":["Remote","Marketing and Communication"],"job_types":["Interim","berufserfahren"],"location":"Berlin","created_at":1702403344000,"original_language":"deu"},{"slug":"junior-technician-stuttgart-295054","company_name":"wu personal GmbH","title":"Junior Technician (m\/w\/d)","description":"As experts for IT personnel and commercial specialists in temporary employment and in service and work contracts, we support national and international well-known customers from the IT industry. Our customer is a leading cross-manufacturer IT service provider with 20,000+ employees worldwide. Become part of an independent provider of IT infrastructure services and solutions for large companies and the public sector. On behalf of our customer, we are looking for several employees (m\/f\/d) as soon as possible for the area of ​​responsibility Junior Technician (m\/f\/d) TASKS Installation, physical connection and basic repair of hardware Carrying out power-on tests as well as maintaining checklists and asset data IMAC services as well as adjustment of network parametersPC deliveries and image refueling under 10Call acceptance as well as documentation (1st level support)KNOWLEDGECompleted training or practical experience in the IT industryKnowledge of German, both orally and in writingHardware knowledge (especially using smartphones)Driving license class BENEFITSTariff-related contract (iGZ\/DGB)Fixed monthly salary included Non-standard payProject bonus from the first day of useVacation and Christmas bonus according to iGZRemuneration according to equal pay modelEmployee referral programPersonal supportFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wu-personal-gmbh\/junior-technician-stuttgart-295054","tags":["IT"],"job_types":[],"location":"Stuttgart","created_at":1702403344000,"original_language":"deu"},{"slug":"property-manager-hamburg-104070","company_name":"IMMO Capital","title":"Property Manager (f\/m\/d)","description":"Founded in 2017, we have assembled an experienced team of 150+ which includes successful entrepreneurs and industry leaders. We're an ambitious team from a diverse range of backgrounds, united by a single mission: to make residential real estate work for sellers, investors, communities, and residents.AufgabenTitle: (Senior) Manager, Property Management (f\/m\/d)Location: Hamburg, GermanyWorking: HybridAs a Property Manager (f\/m\/d) at IMMO, you will be responsible for the independent management of a portfolio of up to 400 units in up to 30 buildings. You master this task in cooperation with a Resident Manager who is responsible for tenant contact as well as letting.QualifikationWork closely with our Resident Managers who are the first point of contact for all our residents. Moreover, you will assist in dealing with resident enquiries, concerns and repair requests promptly and professionally, and maintain a positive relationship with our residents by mediating and resolving disputes.Be an integral part of developing internal tools and processes to improve our daily operations and collaborate with our Product team.Coordinate and oversee property maintenance, repairs and renovations, and regularly inspect properties to ensure they meet safety and maintenance standards.Develop and implement preventive maintenance plans to extend the life of properties.Lead the examination of applicants for our flats, and prepare and countersign the tenancy agreements. You will also be responsible for our receivables management for the portfolio you manage working closely together with our Accounting team.Develop and manage property budgets, including rent collection and expense management, the preparation and maintenance of accurate financial records and reports for owners.Be up to date on local, state and federal laws and regulations governing real estate, and ensure that properties comply with all safety rules and regulations. You also initiate and oversee eviction actions, if necessary.Manage relationships with external building managers, and hire, supervise and manage contractors, maintenance staff and other service providers.Obtain competitive bids for maintenance and repair projectsCarry out regular property inspections to identify and promptly rectify problems, document the condition of the properties, and make recommendations for necessary improvements.Stage 1: Recruiter screenStage 2: Hiring Manager - Skills interviewStage 3: Key Stack holder - Final InterviewFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/immo-capital\/property-manager-hamburg-104070","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Hamburg","created_at":1702403344000,"original_language":"eng"},{"slug":"it-systemadministrator-puchheim-426004","company_name":"SCANLAB GmbH","title":"IT System Administrator*","description":"Future laser technology - Grow with us! Bring your technical know-how and your passion for technology to us! Are you interested in working independently and in a customer-oriented manner with a hidden champion for high-performance laser scanning solutions? Are short decision-making processes important to you? Then welcome to SCANLAB! We turn laser beams into real tools and thus sustainably change the industry. Our products are key components in opening up new areas of application for the laser. It is only thanks to our dedicated employees that we are at the forefront of the industry. Our particularly cross-team collaboration makes it possible to ultimately create deflection and focusing systems for the high-precision positioning of laser beams. We combine development, production and sales at one location. Ready for a new challenge?TasksAdministration of the Microsoft client and server infrastructure, as well as cloud componentsImplementation of IT security measures in collaboration with the security teamPlanning and documentation of configuration changesElimination and documentation of malfunctionsFurther development and continuation of IT conceptsCollaboration and technical support within the framework of projectsPackaging of Software, as well as planning and implementing update rollouts, supporting and advising departments on various IT questions and problems. Qualifications, completed professional training as an IT specialist, system integration or comparable qualification, professional experience in system administration, security in dealing with common Microsoft systems, such as Windows Server, Active Directory, Windows 10, Microsoft 365 , Exchange ServerConfident use of the MS Office product rangeExperience in dealing with the virtualization platform VMwareKnowledge of endpoint management such as Baramundi, SCCM or comparableVery good knowledge of German in combination with good knowledge of EnglishBenefitsExciting work at an internationally active, established medium-sized industrial company with flat hierarchies and short decision-making processes .A lot of freedom for goal- and result-oriented work in a collegial, open and respectful working environment. Whether ergonomic workplaces, back exercises or multifunctional sports fields, we promote your health. Trust is important to us! We support freedom and flexibility in terms of working hours and home office as well as 30 days of vacation per year. Regular training in our own SCANLAB Academy. Annual staff interview with salary consideration. Coffee and drinks are free of charge, the daily fresh dishes (including vegetarian ones) in our employee restaurant are subsidized .Commitment to the environment, including through active resource conservation and green roofs, as well as e-charging stations and photovoltaics with the next construction phase.Modern office building well connected to the Munich S-Bahn network, sufficient parking spaces, bicycle parking spaces and shower facilities for everyone.In addition to an independent and goal-oriented Your personal strengths include teamwork, organizational skills and flexibility, as well as a communicative and confident demeanor. With us you can expect numerous development opportunities, plenty of freedom for goal- and result-oriented action, short decision-making processes and motivated and cooperative colleagues.* All descriptions in this job advertisement are applicable equally to all genders.If you feel addressed, we look forward to receiving your application with details of the earliest starting date and desired salary.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/scanlab-gmbh\/it-systemadministrator-puchheim-426004","tags":["IT"],"job_types":[],"location":"Puchheim","created_at":1702403344000,"original_language":"deu"},{"slug":"sales-marketing-specialist-munich-237570","company_name":"ADVICON AG","title":"Sales & Marketing Specialist (m\/w\/d)","description":"ADVICON is an auditing and tax consulting company so far so good. The way we work is what makes it special. You can expect great cooperation, respectful interaction, independent work and everything geared towards sustainability in your actions. Tasks Implementation of all marketing activities from maintaining the website to joint collaborations with partners and much more. m.Develop and implement sales strategiesDevelopment and implementation of marketing strategies and campaignsLead generationResponsibility for the creative external appearance of ADVICON AGResponsible for creating texts in the marketing areaFurther development and maintenance of the social media areaFurther development of the employer branding areaQualificationCommercial training and\/or at least 2 years of experience in a marketing department \/Sales support organization Ideally, you have already gained practical experience in sales or sales development. Strategic and goal-oriented way of working. Creativity and ability to design and create attractive advertising materials such as flyers, brochures, sales letters and videos. Advanced knowledge of operating social media platforms. Your strengths include your excellent communication skills and the ability to visualize and present your concepts and ideasEnvironmental and sustainability awarenessBenefitsLocation-independent working in an office at our locations: Munich, Berchtesgaden, MadeiraADVICON as a thought leader in the New Work orientation: modern, agile and mobile working environment as well as time-independent working in the home officeMaximum flexibility in the provision of services through digitalizationTechnical equipment for professional and private useWe live our sustainability philosophy in everyday life (e.g. B. E-mobility in business transportation) Further training opportunities and promotion of employee development Exciting team events Leasing option for bicycles and company bikes (e-bikes) We are now looking for a marketing & sales employee (m\/f\/d) full-time (40 hours per week) \/ Part time. We look forward to receiving your application and meeting you in person: info at advicon .taxFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/advicon-ag\/sales-marketing-specialist-munich-237570","tags":["Online Marketing"],"job_types":[],"location":"Munich","created_at":1702403344000,"original_language":"deu"},{"slug":"hr-specialist-munich-325191","company_name":"ADVICON AG","title":"HR Specialist (m\/w\/d)","description":"ADVICON is an auditing and tax consulting company so far so good. The way we work is what makes it special. You can expect great cooperation, respectful interaction, independent work and everything geared towards sustainability in your actions. Tasks First point of contact for all questions from colleagues regarding your area of ​​​​responsibility, you will work closely with the management. Supervision of colleagues from entry to exit of employment contracts, certificates, etc. as well as various correspondenceIntroduction of HR processes and creation of HR guidelinesJob advertisements, recruiting and applicant managementIndependent processing of internal payroll Contact person for special topics in payroll accounting in payroll tax and social security law of our colleagues in client accountingQualificationCompleted studies or at least 3 years Professional experience in the human resources sectorExperience in labor and contract lawVery good communication skillsEnjoy new tasks and confident use of MS OfficeProfessional and service-oriented demeanor when looking after our colleaguesEnvironmental and sustainability awarenessDATEV knowledge is an advantageBenefitsLocation-independent work in an office at our locations: Munich, Berchtesgaden, MadeiraADVICON as a thought leader in the New Work orientation: modern, agile and mobile working environment as well as time-independent working in the home officeMaximum flexibility in the provision of services through digitalizationTechnical equipment for professional and private use Team events and joint sports opportunities We live our sustainability philosophy in everyday life (e.g. B. E-mobility in business transportation, leasing option for bicycles and e-bikes) Open communication across all levels A team for which collective success is the priority Further training opportunities and promotion of employee development We are now looking for an HR Specialist (m\/f\/d) in Full time (40 hours per week). Preferably remote or hybrid. We look forward to receiving your application and getting to know you in person: application (a) advicon. taxFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/advicon-ag\/hr-specialist-munich-325191","tags":["Recruitment and Selection"],"job_types":[],"location":"Munich","created_at":1702403344000,"original_language":"deu"},{"slug":"softwareentwickler-mit-schwerpunkt-datenbankentwicklung-puchheim-239276","company_name":"SCANLAB GmbH","title":"Software developer* with a focus on database development","description":"Future laser technology - Grow with us! Bring your technical know-how and your passion for technology to us! Are you interested in working independently and in a customer-oriented manner with a hidden champion for high-performance laser scanning solutions? Are short decision-making processes important to you? Then welcome to SCANLAB! We turn laser beams into real tools and thus sustainably change the industry. Our products are key components in opening up new areas of application for the laser. Fascinating development tasks await you at the interface of precise mechanics, highly dynamic drive technology and highly precise optical sensors. We are looking for talented and motivated developers who want to help take our technology to a new level. If you recognize yourself in this description, then you are exactly the person we are looking for! Become part of our dedicated team and shape the future with us! Tasks Further development of a database-based information system Programming and expansion of the database (PostgeSQL\/Microsoft SQL Server) Analysis, evaluation and implementation of requirements from the specialist departments Maintenance and new development of internal application programs Coordination and execution of tests and documentation of the application programs as well as verification of the homogeneity of the database extensions Coordination of external service providers Qualifications Completed studies in the field of computer science, career changers or a well-founded training as an IT specialist for application development Relevant experience from database and application development Confident use of SQL and PL\/pgSQL or Transact- SQL desirableExperience in data consolidationGood knowledge of Python, C# and Result-oriented work in a collegial, open and respectful working environment. Whether ergonomic workplaces, back exercises or multifunctional sports fields, we promote your health. Trust is important to us! We support freedom and flexibility in terms of working hours and home office as well as 30 days of vacation per year. Regular training in our own SCANLAB Academy. Annual staff interview with salary consideration. Coffee and drinks are free of charge, the daily fresh dishes (including vegetarian ones) in our employee restaurant are subsidized .Commitment to the environment, including through active resource conservation and green roofs, as well as e-charging stations and photovoltaics with the next construction phase.Modern office building well connected to the Munich S-Bahn network, sufficient parking spaces, bicycle parking spaces and shower facilities for everyone.In addition to an independent and goal-oriented Your personal strengths include teamwork, organizational skills and flexibility, as well as a communicative and confident demeanor. With us you can expect numerous development opportunities, plenty of freedom for goal- and result-oriented action, short decision-making processes and motivated and cooperative colleagues.* All descriptions in this job advertisement are applicable equally to all genders.If you feel addressed, we look forward to receiving your application with details of the earliest starting date and desired salary.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/scanlab-gmbh\/softwareentwickler-mit-schwerpunkt-datenbankentwicklung-puchheim-239276","tags":["IT"],"job_types":[],"location":"Puchheim","created_at":1702403344000,"original_language":"deu"},{"slug":"it-support-1st-level-erfurt-277398","company_name":"wu personal GmbH","title":"IT Support (m\/w\/d) 1st Level","description":"We are experts for IT personnel and commercial specialists in temporary employment as well as in service and work contracts. Our customers are IT system houses, IT manufacturers and IT service providers. Our customer is a leading cross-manufacturer IT service provider with 20,000+ employees worldwide. Become part of an independent provider of IT infrastructure services and solutions for large companies and the public sector. On behalf of our customer, we are looking for several employees (m\/f\/d) for the area IT Support (m\/f\/d) 1st level as soon as possible. TASKS Accepting and processing incoming inquiries Creating, processing and solving tickets in the first line Supporting IT users in the hardware and software environmentMonitoring and tracking of tickets, processing the work listPassword resets and user administration according to instructions in or on various systems such as Exchange,KNOWLEDGETechnical understanding and system knowledgeCommunicative skillsSelf-confident use of the German language, spoken and writtenGood knowledge of EnglishGood knowledge of the office environmentIncreasing customer satisfaction through personal and Professional competenceFriendly and clear communication, high reliabilityBENEFITSSales-level contract (iGZ\/DGB)Fixed monthly salary including above-tariff paymentProject allowance from the first day of useVacation and Christmas bonus according to iGZRemuneration according to equal pay modelEmployee referral programPersonal supportFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wu-personal-gmbh\/it-support-1st-level-erfurt-277398","tags":["IT"],"job_types":[],"location":"Erfurt","created_at":1702403344000,"original_language":"deu"},{"slug":"first-level-support-dresden-370810","company_name":"wu personal GmbH","title":"First Level Support (m\/w\/d)","description":"We are experts for IT personnel and commercial specialists in temporary employment as well as in service and work contracts. Our customers are IT system houses, IT manufacturers and IT service providers. Our customer is a leading cross-manufacturer IT service provider with 20,000+ employees worldwide. Become part of an independent provider of IT infrastructure services and solutions for large companies and the public sector. On behalf of our customer, we are looking for several employees (m\/f\/d) as soon as possible for the area of ​​responsibility First Level Support (m\/f\/d) TASKS Accepting and processing incoming inquiries Creating, processing and solving tickets in the first line Supporting IT users in the hardware and software environmentMonitoring and tracking of tickets, processing the work listPassword resets and user administration according to instructions in or on various systems such as Exchange,KNOWLEDGETechnical understanding and system knowledgeCommunicative skillsSelf-confident use of the German language, spoken and writtenGood knowledge of EnglishGood knowledge of the office environmentIncreasing customer satisfaction through personal and Professional competenceFriendly and clear communication, high reliabilityBENEFITSSales-level contract (iGZ\/DGB)Fixed monthly salary including above-tariff paymentProject allowance from the first day of useVacation and Christmas bonus according to iGZRemuneration according to equal pay modelEmployee referral programPersonal supportFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wu-personal-gmbh\/first-level-support-dresden-370810","tags":["IT"],"job_types":[],"location":"Dresden","created_at":1702403344000,"original_language":"deu"},{"slug":"teamlead-frontend-8809-munich-120136","company_name":"alphacoders","title":"Teamlead Frontend (m\/w\/d) #8809","description":"Our partner is a profitable family business that is independent of investors. Your offer in a nutshell: Photos in the desired format and frame, customized with the highest quality, millimeter precision & with 24-hour express shipping. The difference to the competition: sustainable production, service, logistics, software development, marketing and creation are all under one roof at myposter. Tasks You are the innovation engine and team lead for the top-notch front-end development team. You rock the planning and development of new, Mega cool features for the online shopYour mission? You ensure that the frontend team's projects are an absolute hit! You coordinate the tasks, always keep a tight grip on development progress and lead the projects to success. As a tech junkie, you always have your finger on the pulse, test the latest front-end technologies and bring the hot trends to our team! You ensure with your innovative approaches and proven best practices to ensure that the front ends are always up to date. You are tireless in implementing continuous optimizations and refactorings. You are an absolute team player and in active exchange with backend, product management and QA you clarify requirements, work on ingenious solutions and rock them ProjectsTech Stack: Vue.js (Vuex, Vuex-ORM), JavaScript (ES6+), CSS3 (Sass), HTML5, Konva, Uppy, NPM, BEMTools: ESLint, stylelint, Vue CLI, Speedcurve, Webpack, Electron, LernaTests: Jest , Cypress, PercyLogging: Rollbar, Datadog, LogRocketContinuous Integration: JenkinsVersioning: Git, BitbucketDocumentation: ConfluenceQualificationYou have successfully completed your degree in computer science or a comparable trainingYou have several years of professional experience in software development, especially with modern frontend development around Vue.jsIdeally, you already have it lead a team or are highly motivated to get started as a managerYou have experience in automated testing and user experience designWith your hands-on mentality you proactively drive projects forward and inspire your team with your ideasYou speak German fluentlyBenefitsJobRad(E-)MINI leasing program, Regular management coaching & freely selectable training courses, etc. 2 days \/ week Home OfficeFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/alphacoders\/teamlead-frontend-8809-munich-120136","tags":["IT"],"job_types":["teamleitung"],"location":"Munich","created_at":1702399744000,"original_language":"deu"},{"slug":"performance-marketing-manager-8982-flensburg-439885","company_name":"Foxio Consulting GmbH","title":"Performance Marketing Manager (m\/w\/d) #8982","description":"Fr unseren Partner, eine Fullservice-Agentur fr crossmediale Kommunikation mit nordischem Charme und globaler Expertise, mit Sitz in Flensburg und Kiel suchen wir einen Performance Marketing Manager, der offen fr eine neue Herausforderung ist. Die Agentur hat es sich nicht nur zur Aufgabe gemacht, die Vision ihrer Kunden zu verstehen, sondern auch die Wege zu kennen, diese erfolgreich umzusetzen. Ein motiviertes Team und die Chance, das Unternehmen durch deine Expertise weiterzuentwickeln, warten auf dich!AufgabenEntwicklung und Betreuung von KampagnenKontinuierliches Monitoring sowie Verfolgung von relevanten KPIsEinsatz und Anwendung von Google Ads und Meta LinkedIn ToolsPlanung, Analyse und Steuerung von ganzheitlichen Strategien und ProjektenQualifikationErfahrung in der strategischen Ansprache von Zielgruppen Idealerweise Agenturerfahrung sowie Kenntnisse in der Tourismusbranche Problemlsungskompetenz und proaktiver Ansatz zur KampagnenoptimierungUmfassende Kenntnisse in der Anwendung von Google Ads und Meta ProgrammenBenefitsFamilienkompatible Arbeitszeiten Modernste Arbeitsplatzausstattung Betriebsinterne Weiterbildungen durch Schulungenattraktive Zusatzleistungen, wie eine Altersvorsorge ber die PresseversorgungGehe neue Wege und bewirb dich bei uns. Wir sind schon gespannt darauf, dich kennenzulernen.Hast du dich nicht wiedergefunden? Kein Problem. Komm auf unsere Website und schau dir weitere Angebote an. Wir sind immer auf der Suche nach Talenten, Professionals und Digital Experts, die bereit sind, sich neuen Herausforderungen zu stellen. Deine passende Route ist bestimmt auch dabei.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/foxio-consulting-gmbh\/performance-marketing-manager-8982-flensburg-439885","tags":["Online Marketing"],"job_types":["berufserfahren"],"location":"Flensburg","created_at":1702399744000,"original_language":"eng"},{"slug":"customer-success-manager-berlin-167180","company_name":"alphin","title":"Customer Success Manager (m\/w\/d)","description":"alphin is the leading marketing platform for local businesses in Europe and gives local businesses access to the most modern marketing methods. Our eight digital solutions are revolutionizing how local retailers understand and use marketing. alphin was founded in 2017. We now employ 90+ people in the DACH region and the UK. Our headquarters are in Berlin-Mitte and we have already convinced prominent investors such as SB21, Partech and HV Holtzbrinck Ventures about our company.Are you ready for the next career step?TasksYou are the central point of contact for our partners and the first point of contact for problem solutionsYou build sustainable and Establish trusting customer relationships and actively develop them. Carrying out software and product demos and solving customer cases are part of your everyday life. You schedule and organize meetings with our partners. You identify and have cross-selling, up-selling and retention opportunities Always have the right solution ready for our partnersYou respond professionally to customer feedback and ensure quick and satisfactory solutionsQualificationsYou love contact with people and are enthusiastic on the phone You have initial professional experience in supporting B2B customers, ideally in the SaaS areaYou have a lot of experience Affinity and interest in SaaS tech solutions and feel at home in the social media world You are empathetic and have a feel for customer needsYou speak German at a native level (C2) and have good English skillsYou have already worked with Salesforce and know the \"local\" market Customers\" (would be a \"plus\")BenefitsAt alphin we feel a strong connection to all the small businesses in our neighborhood. All these great people who enrich our lives every day with their ideas and creativity. We want to help them focus on what they really love - the perfect product, the perfect service, every day, while putting their marketing on autopilot. We want to give them the same opportunities to make their great work visible by giving them access to the digital tools of the big corporations. If you feel the same way, this is your opportunity to leave a mark on the universe! Monthly training budget at your discretion to specifically expand your skills and continuously develop yourself. A responsible role at the intersection of our most important departments with a high degree of autonomy and personal responsibility. Strategic and conceptual freedom to realize your vision of the ideal customer experience. An office in the heart of Berlin with a variety of leisure options such as table tennis and table football. Regular team events for a strong team feeling and positive exchange. Unlimited access to fresh fruit, drinks and a wide selection of cereals for an energetic working day. Employer subsidy for company pension provision to ensure your financial security for to support the future.We look forward to receiving your application.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/alphin\/customer-success-manager-berlin-167180","tags":["Customer Service"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702399744000,"original_language":"deu"},{"slug":"telefonischer-kundenbetreuer-im-erstattungsservice-nuremberg-431967","company_name":"Dr. Meindl u. Partner Verrechnungsstelle GmbH","title":"Telephone customer representative in the reimbursement service (m\/f\/d)","description":"Our services continue to be in high demand in the healthcare market. We are therefore looking for further reinforcement! As a medium-sized, owner-managed company, we have been billing fees for healthcare providers (doctors, physiotherapists, alternative practitioners, clinics, etc.) since 1975. We reliably and competently relieve them of administrative tasks and create added value. Our company is characterized by constant growth, high customer satisfaction and a good working atmosphere. Do you love making phone calls and want to turn your passion into a career? Would you like to work in a family business where team spirit is just as important as a pleasant and familiar working atmosphere? Would you like to bring your own personality here and continue to grow with us? Then we are looking for you for our location in Nuremberg and nationwide in the home office as a telephone customer representative in the reimbursement service (m\/f\/d) in full or part-time tasks. You are the first point of contact for all concerns and questions from clients, payers or insurance companies about their invoices. The documentation and Preparation for further examinations in our specialist department is also part of your area of ​​responsibility. Maintaining our contact database rounds off your activity profile. Qualifications You have successfully completed commercial training, for example in office management, or a comparable qualification. You are characterized by your strong service orientation. You have strong communication skills and a very good one Expression is one of your strengths. You have a passion for telephone correspondence. Your way of working is structured and you have organizational talent. Ideally, you have already gained initial experience in customer contact. Good computer skills in the MS Office area round off your personality profile. Benefits You have the opportunity to work hybridly. If desired, the work can be carried out partially or entirely from home. You will have a secure job in a growing family business with regional ties. Our pleasant working atmosphere is characterized by our lived values ​​of honesty, fairness and reliability; our company culture is personal and family-oriented. You will receive a permanent, full-time or permanent employment contract Part-time with performance-related remuneration You can arrange your working hours flexibly and you will receive 30 days of vacation. You will be able to design your work on your own responsibility and independently with flexible work areas and areas of responsibility. You have the opportunity to contribute your own ideas for the further development of the company. This effort will be rewarded with a bonus. Good ones are waiting for you Development prospects and a diverse range of further training We also hold regular employee events such as the FunRun, a shared breakfast, various company outings, team meals, sporting events and much more. With our Corporate Benefits platform you receive a variety of discounts on well-known brands (from car leasing to theater visits to the new one Item of clothing) Your modern workplace is located in the center of the metropolitan city of Nuremberg, around the corner from the main train station. You enjoy working in a team, a good working atmosphere is just as important to you as a secure job with prospects in a well-known company in the metropolitan region in Germany's largest market. We have piqued your interest? Then send us your detailed application, stating your salary expectations and your earliest possible starting date. For questionsTel. 0911\/98478-200Important note: If you send us your application documents, e.g. by email, you agree that the data you have sent to us will be processed by us. Please see our data protection declaration for the scope and legal basis of data processing as well as your rights as a data subject .Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/dr-meindl-u-partner-verrechnungsstelle-gmbh\/telefonischer-kundenbetreuer-im-erstattungsservice-nuremberg-431967","tags":["Remote","Finance"],"job_types":[],"location":"Nuremberg","created_at":1702399744000,"original_language":"deu"},{"slug":"projektingenieur-bautechnik-erlangen-129410","company_name":"ZSI Services GmbH","title":"Project engineer (m\/f\/d) construction technology","description":"Location: ErlangenStart: ImmediatelyTasksPart of the project team in order to bring our customer's international energy projects to a successful project completion.Taking over the technical interaction with external partners (customers, engineering offices, authorities, construction companies, etc.) as well as with internal partners (building technology, project management, purchasing , etc.) Preparation of tender documents for construction and engineering services and conduct of technical contract negotiations up to the conclusion of the contract Coordination of the entire construction planning and ensuring that all requirements are taken into account Coordination and management of all executing companies involved in the construction Monitoring and responsibility for the dates, costs and quality of the entire construction process Qualification Qualification in the Specialization in civil engineering or a comparable fieldSeveral years of relevant professional experience in industrial and plant engineering, although applications with initial professional experience are also welcomeGood specialist knowledge in the various areas of civil engineering as well as good use of MS Office tools, ideally iTwoFluent German and English skills necessary and knowledge of others Languages ​​(French, Italian, Spanish) desirable Teamwork ability, assertiveness, initiative, communication skills as well as planning and organizational skills Willingness to travel worldwide on business Benefits Permanent employment contract with immediate entry opportunity Further development of your specialist skills Varied and demanding tasks Respectful treatment in an appreciative corporate culture We look forward to receiving your application! Any questions? Just give us a call!Your contact:Menny Slimistinou Recruiting Manager on behalf of ZSI technology GmbHTel.: 0 9187 70698 - 73Personal formulations in the job advertisement are to be viewed in a gender-neutral mannerFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/zsi-services-gmbh\/projektingenieur-bautechnik-erlangen-129410","tags":["Engineering"],"job_types":[],"location":"Erlangen","created_at":1702399744000,"original_language":"deu"},{"slug":"unterstutzung-im-research-und-business-development-dusseldorf-157207","company_name":"Osthues & Company GmbH","title":"Support in research and business development (m\/f\/d)","description":"We are Osthues & Company, a renowned consulting boutique that specializes in filling and evaluating management positions. Our focus is on qualified direct contact on behalf of clients. As an owner-managed company, we value flexibility and offer a dynamic working environment.TasksAs support in our team, you will take on a variety of tasks, including in the areas of:Conducting industry research using databases, the Internet and telephoneCreating target company listsPreparing business development discussionsIdentifying and approaching managers and specialistsMaintenance of the company's own databaseGeneral tasksQualificationWe are looking for an open and diversely interested, smart person with a meticulous way of working and strong communication skills who enjoys changing topics. With us, no two working days are the same.Ideally, you have:Basic knowledge of business contextsGood research and analysis skillsOrganizational skills and independent way of workingStrong communication skills and a confident demeanorInterest in personnel consulting, recruiting and talent managementBenefitsWe value flexibility and are open to support from interns, working students or career starters (m \/f\/d) full-time or part-time. After a training period, it is possible to carry out the work primarily in the home office.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/osthues-company-gmbh\/unterstutzung-im-research-und-business-development-dusseldorf-157207","tags":["Remote","Recruitment and Selection"],"job_types":["Working student","hilfstätigkeit \/ student"],"location":"Düsseldorf","created_at":1702399744000,"original_language":"sun"},{"slug":"influencer-relations-managerin-berlin-379462","company_name":"PlayTheHype","title":"Influencer Relations Manager:in","description":"Your tasksAs an influencer marketing manager, you are responsible for creator handling and communication in the area of ​​influencers Bring the faces: You are the direct interface between PlayTheHype and the influencers and\/or their managementDeal? You lead the negotiations for all collaborations within our campaignsYou know what needs to be done: You create briefings based on the requirements of our customersFull Circle: After the projects, you take over invoice handling as well as corresponding feedback sessions on the assets producedYour profileNot for the first time : You have professional experience in influencer marketing and\/or campaign handling as well as in carrying out projects in a marketing context. Socials are your thing: You are at home on Instagram, YouTube, TikTok and Co. and have a feel for trends and viral things. Everything is in your hands: analytical , communicative and organizational skills are what set you apartGrowing together: You work not only independently, but also collaboratively in a team. Why us? Do what we love: We are a young and dynamic team, we always work with new perspectives and have our hobby Made a careerWorking in the best location: Offices in Berlin Friedrichshain and on Hamburg's JungfernstiegBrands that suit you: We work with many cool brands and have already set up many successful campaigns (clients such as Sony, Adidas, Eurowings, funny-frisch and AboutYou ), here you have the opportunity to freely develop your interests and work in your best location: With us you also have the opportunity to work remotely - do you live in another city or would you like to work from another country for a longer period of time? lets go!Recreation is a must: with 30 days per year we offer you a lot of flexibility and your birthday is on top freeTrain(ing)? You will receive a subsidy for sports. If you wish, we will be happy to take over your gym membership with our partners or, alternatively, you can travel across the country at our expense with the 49 EURO ticketFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/playthehype\/influencer-relations-managerin-berlin-379462","tags":["Marketing and Communication"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702399744000,"original_language":"deu"},{"slug":"marketing-managerin-berlin-216101","company_name":"PlayTheHype","title":"Marketing Manager:in","description":"Your tasksLets get it on: Implementation of digital campaigns and the corresponding formatsWhat do we actually do? Copywriting for social media channels and editorial content planningYou know what's happening: content management and monitoringHaving the right nose: detecting trends and formatsNumbers don't lie: creating reportsYour profileNot a first: You already have experience in the production and implementation of digital CampaignsYou know what's behind it: Knowledge of content management systems and the ability to analyze performanceNever without my team: Teamwork, self-organization, problem-solving skills and willingness to learn are core elements for the jobWhy us?Do what we love: We are a young & dynamic team , always work with new perspectives and have turned our hobby into a career Working in the best location: Offices in Berlin Friedrichshain and on Hamburg's Jungfernstieg Brands that suit you: We work with many cool brands and have already set up many successful campaigns ( Customers such as Sony, Adidas, Eurowings, funny-frisch and About You), here you have the opportunity to develop freely in your interests. Work in your best location: With us, of course, you also have the opportunity to work remotely - you live in a different location City or would you like to work from another country for a longer period of time? lets go!Recreation is a must: with 30 days of vacation per year we offer you a lot of flexibility and your birthday is on top freeTrain(ing)? You will receive a subsidy for sports. If you wish, we will be happy to take over your gym membership with our partners or, alternatively, you can travel across the country at our expense with the 49 EURO ticketFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/playthehype\/marketing-managerin-berlin-216101","tags":["Marketing and Communication"],"job_types":["berufseinstieg"],"location":"Berlin","created_at":1702399744000,"original_language":"deu"},{"slug":"praktikant-im-online-marketing-heinsberg-402522","company_name":"sera Werke Heimtierbedarf J. Ravnak GmbH & Co.KG","title":"Praktikant (m\/w\/d) im Online-Marketing","description":"sera  We Love Fish!Wir sind ein mittelstndisches Familienunternehmen und einer der weltweit fhrenden Anbieter von Produkten fr Aquaristik, Terraristik und Gartenteich. Nach der Grndung im Jahr 1970 als Zwei-Personen-Betrieb haben wir uns rasch zu einem der Marktfhrer entwickelt und sind heute mit rund 200 Mitarbeitenden weltweit ttig. An unserem Hauptsitz in Heinsberg sind Verwaltung, Forschung und Produktion vereint. Verstrke unser Marketing-Team in Heinsberg ab sofort als:Praktikant (m\/w\/d) im Online-MarketingAufgabenDeine Aufgaben:Duerstellst zielgruppengerechten Content fr die sera Social Media-Kanle, die Webseite und den B2B-Newsletteruntersttzt bei der Betreuung der Social Media-Kanle, dem Influencer-Marketing und dem Social Media-Monitoringbist Teil unseres Video-Teams und bereitest unsere Youtube-Videos inhaltlich voruntersttzt bei Bedarf auch andere Marketing-Projekte (z. B. eLearning\/sera Academy)QualifikationDein Profil:Duist Student der Wirtschafts- oder Kommunikationswissenschaft oder absolvierst einen vergleichbaren Studiengangverfgst im Idealfall ber praktische Erfahrungen im Bereich Marketing, PR oder Unternehmenskommunikation besitzt eine Affinitt zu Online-Medien und im Idealfall auch zu einem unserer Segmente (Aquaristik\/Gartenteich\/Terraristik)hast ein gutes Sprachgefhl und Freude am SchreibenBenefitsDas bieten wir:Eigenstndiges Arbeiten und eigene Projekte im Online-MarketingAngemessene VergtungIntensive BetreuungNach Absprache: Mglichkeit einer Abschlussarbeit im Bereich Online-Marketingeine moderne IT-Infrastruktur ein voll ausgestattetes Videostudio fr kreative Social Media-Projekteeine firmeneigene eLearning-Plattform zur selbststndigen Einarbeitung in das Thema Aquaristik und unser ProduktsortimentEinblick in ein international agierendes, mittelstndisches Unternehmen der HeimtierbrancheHaben wir Dein Interesse geweckt?Fr alle Fragen steht Dir Cora Laudien gerne telefonisch unter 02452 9126-0 zur Verfgung. Schicke uns Deine Bewerbungsunterlagen gerne per Mail - ein Anschreiben ist nicht erforderlich.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sera-werke-heimtierbedarf-j-ravnak-gmbh-cokg\/praktikant-im-online-marketing-heinsberg-402522","tags":["Marketing and Communication"],"job_types":["Internship"],"location":"Heinsberg","created_at":1702399744000,"original_language":"eng"},{"slug":"finanzbuchhalter-kreditorenbuchhaltung-rosenheim-337995","company_name":"Zeel GmbH","title":"Financial accountant \/ accounts payable accounting (m\/f\/d)","description":"__Do you finally want to find your professional home? Here you and your colleagues pull together!__We are looking for a direct hire for a financial accountant \/ accounts payable accounting (m\/f\/d) in Rosenheim. Your new employer is an innovative, modern, nationwide mechanical engineering company. We are looking for reinforcements in accounting at the Rosenheim location with around 125 employees. You can expect independent work, professional and personal development and collegial teamwork, as well as an attractive salary package, flat hierarchies and a high-growth environment. As a financial accountant (m\/f\/d), you are an important part of the company and your team. Here you will be protected both professionally and personally. As a recruiting company, we help our customers find reinforcements for their team. This means that we support the company in its search and you will receive the permanent employment contract directly from our customer. Your future area of ​​responsibility You will independently take over the processing of accounts payable accounting, payment transactions and dunning as part of a team. In addition, you will also take care of travel and expense reports and provide support for the monthly and annual financial statementsYou are responsible for creating various evaluations and are involved when it comes to further optimizing the processes in the departmentYour profileYou have commercial training and have already gained professional experience in accountingYou can use the common MS Office programs You work independently, in a structured manner and your colleagues can rely on you. You are communicative and enjoy working in a motivated team. Do you recognize yourself? Even if not all of the points apply to you, we look forward to getting to know you and the possibility of working with you to speak to you! Benefits & MoreSecurity is provided by a permanent employment contract in a crisis-proof industry with an attractive salary package.Spa at work! You can expect a very good working atmosphere, open communication culture and flat hierarchies work-life balance! You get 30 days of vacation and thanks to the flextime model you can organize your own working hours. Get to the airport quickly thanks to structured onboarding according to an individual training concept. Here you stay \"up to date\" because your personal and professional training is promoted. Your advantages with Zeel. You are looking for a job and that's what you want like a fairy godmother at your side, giving you tips on which career step is right for you? Someone who will help you prepare your application documents optimally and prepare you for your interview. Maybe someone who knows how high you can set your salary? Then you are exactly right with us. We ensure that you present yourself optimally to your desired employer and that you have the best chance of being successful. Our promise to you__Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/zeel-gmbh\/finanzbuchhalter-kreditorenbuchhaltung-rosenheim-337995","tags":["Finance"],"job_types":[],"location":"Rosenheim","created_at":1702399744000,"original_language":"deu"},{"slug":"front-desk-office-manager-mind-25h-hamburg-195196","company_name":"GAIA AG","title":"Front Desk \/ Office Manager (m\/w\/d) mind. 25h","description":"GAIA AG is one of the world's leading companies in the field of digital health. With therapy software like deprexis, we set the standard for evidence and innovation. We combine therapeutic, scientific and technological expertise under one roof. We not only develop digital therapy support programs, but are also actively involved in providing care. Holistic and early care is a central concern for us. Together with our Germany-wide network, we can help patients quickly and at a low threshold. To support our team, we are looking for a committed and dynamic Front Desk \/ Office Manager (m\/f\/d) (m\/f\/d) - at least 25 hours as soon as possible. Your tasks: First face for our visitors and employees at the front deskComplete office management our beautiful officeCoordination of incoming mail and telephoneOrdering\/purchasing of office supplies and other necessary materialsTravel bookingsOrganization of eventsOccasional support for managementYour profile: High level of self-organizationResponsible way of workingForward thinking and actingStrong communication skills in exchange with peopleSelf-confident demeanorWant to rock the place and avoid chaos!Our offer: At With us you get the security of over 20 years of experience as a company operating on the market, coupled with the philosophy and agility of a startup. We also offer you: Independent work with creative freedomA permanent employment contractFlexible working hoursCompany pension schemeEGYM Wellpass (company fitness)Bike leasingFamily-friendly atmosphere with flat hierarchiesModern offices in Hamburg directly on the Fleet, with barbecue facilities, roof terraceFree drinks, snacks and social eventsFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/gaia-ag\/front-desk-office-manager-mind-25h-hamburg-195196","tags":["Finance"],"job_types":["Freelance"],"location":"Hamburg","created_at":1702399744000,"original_language":"deu"},{"slug":"junior-prozess-und-datenmanager-transport-und-verkehr-salzgitter-423484","company_name":"univativ GmbH","title":"(Junior) Process and Data Manager (m\/f\/d) Transport and Traffic","description":"As soon as possible, long-term, with option to extend, with option to take over | 36.25 hours per week | Salzgitter | Transport & Traffic | Career starter, experienced professional | 44,000 to 80,000 per year | Project ID A202345176_1Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Have you successfully completed your studies or training in computer science and ideally have initial professional experience in IT support? Do you also have an analytical and careful way of working and are you interested in the transport and traffic industry? Then we are looking for you as a (junior) process and data manager (m\/f\/d) as soon as possible. As part of your project assignment, you will actively work in IT support and be responsible for analyzing and resolving error messages. You are also responsible for carrying out user training. Our customer from the transport and traffic sector is looking for you to provide active support in a timely manner. In addition to individual support from univativ, exciting tasks await you in a renowned company. Sounds interesting? Then we look forward to receiving your application and getting to know you in person soon! Tasks Support with the introduction of system landscapes Taking over IT support Analysis and elimination of error messages Instructing users and carrying out user training Qualifications A completed degree in computer science, business administration or completed specialist vocational training First practical experience in IT supportA confident use of common MS Office applicationsIn-depth knowledge of SAPFunctional knowledge of spoken and written GermanA strong IT affinity as well as an analytical and careful way of workingBenefitsAn annual salary between 44,000 and 80,000The possibility of working remotely from home within Germany 2 days a weekPersonal project supportTravel allowance or Job ticket depending on the customerVarious training opportunities in our e-AcademyIndividual coaching as preparation for the presentation to the customerUp to 2,000 bonus for recommending to friendsWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-prozess-und-datenmanager-transport-und-verkehr-salzgitter-423484","tags":["IT"],"job_types":[],"location":"Salzgitter","created_at":1702399744000,"original_language":"nds"},{"slug":"full-stack-entwickler-100-remote-net-und-cloud-erfahrung-frankfurt-214015","company_name":"FNTIO","title":"Full-stack developer (m\/f\/d) 100% remote - .NET and cloud experience","description":"FNTIO is at the forefront of IT innovation and develops future-oriented cloud infrastructures. We combine technical excellence with business vision to provide tailored support to companies on their digital transformation journey. As part of our expansion, we are now looking for a qualified full-stack developer (m\/f\/d) with extensive knowledge of .NET and experience in the AWS Cloud area. Tasks Develop and implement full-stack solutions using .NET. Active in the Contribute to the design and implementation of cloud-based architectures using AWS.Create high-quality, reusable code.Optimize applications for performance, scalability and usability.Work closely with backend and DevOps teams for seamless API and service integration.Participate in code reviews, quality assurance and automated testing.Share and continuously improve agile development processes.QualificationsA degree in computer science or a comparable qualification.At least 3 years of experience in full-stack development with a focus on .NET.Experience with AWS or other cloud technologies.Familiarity with Git , Docker and Continuous Integration\/Delivery.Fluent in German and English.BenefitsA motivated team that promotes mutual growth and exchange.Market-based compensation and flexible working hours.The opportunity to work on exciting projects with the latest technologies.A respectful and supportive working environment that protects your ideas and innovations.Personal training and development opportunities.If you want to help shape the future in a technology-oriented company with flat hierarchies, you have come to the right place. Become part of a company that values ​​both the latest technologies and a positive corporate culture. Ready for this challenge? We look forward to getting to know you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/fntio\/full-stack-entwickler-100-remote-net-und-cloud-erfahrung-frankfurt-214015","tags":["Remote","Software Development"],"job_types":["berufserfahren"],"location":"Frankfurt","created_at":1702399744000,"original_language":"deu"},{"slug":"bodyshop-managerin-betriebsleiterin-in-lippstadt-375590","company_name":"Schmitz Solutions GmbH","title":"Bodyshop manager\/operations manager in Lippstadt","description":"Are you looking for a change? Are you a car professional with a strong personality and already have several years of leadership experience? Do you love dealing with people and want to inspire customers? Then you've come to the right place!! Our customer is a multi-brand master workshop with a team of over 30 employees. They are a reliable partner for their customers when it comes to complex accident damage, maintenance and wear repairs from a master hand. They adapt dynamically to the progress of the automotive industry and also offer their customers the expertise of a certified e-mobility specialist company. Your priority is and remains the satisfaction of your customers and the associated service! Technical equipment at the highest level combined with craftsmanship excellence is the foundation for their services. Join their team if you are as passionate about cars as they are. State-of-the-art technology, flat hierarchies, a great team and exciting tasks await you. They are now offering you a position as a body shop manager\/operations manager for their location in Lippstadt. Tasks Your responsibility is to organize and control the work procedures and processes in the workshop. You always keep an eye on the most important key figures and create regular reports for the management . For you, the focus is on achieving quantitative and qualitative goals. You lead and control a growing team of almost 30 employees, whereby regular communication with employees is particularly important to you. Monitoring and planning utilization is part of your routine. You are responsible to ensure a smooth, uniform business process and the constant adaptation, process optimization and further development of the company. You develop and implement quality strategies and service goals and optimize work processes to increase customer satisfaction. As a reinforcement between the workshop and customer areas, you mediate between customer wishes and the technical and organizational options of the company.QualificationsYou have technical and\/or commercial training and, ideally, a high affinity for the automotive industry.You are an open and dynamic manager with the ability to motivate your team and achieve the goals together.Your assertiveness and communication skills help you to motivate and lead people. You have broad process know-how in modern company processes in the commercial and technical areas, ideally in the automotive industry. Thinking on your own initiative and a structured and methodical way of working are a given for you. You excel a strong hands-on mentality as well as personal integrity, reliability and a sense of responsibility and approach problems in a solution-oriented manner.BenefitsA permanent position with a permanent employment contractTrust-based working hours are a given for our customerA performance-oriented remuneration with a success-based bonusA company car, also for private useFlat hierarchies of a family business with quick decision-making processes in a dynamic environment for the implementation of your ideasYour further training is important to our customers, which is why they define individual goals and training opportunities together with you. Diverse development opportunities within the group of companies and state-of-the-art working conditions with a company laptop, iPad and smartphone. If you would like to work in a dynamic company, then we are happy us about your application. Please send your documents to l.steffen(at)schmitz-solutions.de. We look forward to getting to know you! We are proud to be an inclusive company that protects the diversity and uniqueness of each individual. Regardless of gender, race, sexual orientation, disability or other personal characteristics, we warmly welcome all qualified applicants (m\/f\/d).Lea SteffenSchmitz Solutions GmbHl.steffen(at)schmitz-solutions.de0157\/92524257Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schmitz-solutions-gmbh\/bodyshop-managerin-betriebsleiterin-in-lippstadt-375590","tags":["Branch Management"],"job_types":["geschäftsleitung"],"location":"Lippstadt","created_at":1702399744000,"original_language":"deu"},{"slug":"specialist-performance-marketing-e-commerce-dusseldorf-461216","company_name":"ALDI E-Commerce GmbH & Co. KG","title":"Specialist Performance Marketing - E-Commerce (m\/w\/d)","description":"ALDI takes off online! We have been writing a success story in brick-and-mortar retail for more than 100 years. We want to build on this and further expand our ALDI ONLINE SHOP. As the inventor of the discount, our aim is to make shopping as easy as possible. We want to make a decisive contribution to this by setting up and expanding the ALDI ONLINE SHOP. Become part of our team and experience the start-up mentality paired with the POWER of ALDI! Tasks Control and coordination of performance marketing measures Focus on the areas: SEA, Shopping\/CSS, Social Paid, Affiliate Marketing Carrying out regular analyses, monitoring relevant performance KPIs and ensuring goal achievementProactive preparation and presentation of figures and findings, as well as the derivation of recommendations for action Development and expansion of performance marketing campaigns and the individual channelsContinuous observation of competition and trendsClose coordination with internal stakeholders and external service providersQualificationIdeally a successfully completed degree in the field of E -Commerce, online marketing, media and communication sciences, media management and\/or comparable training 2-3 years of professional experience on the company or agency side, preferably in the area of ​​e-commerce High level of pragmatism and enjoyment of a \"hands-on\" mentalityYou You attach great importance to quality, have a good understanding of complex relationships and are skilled at solving demanding challenges. You are analytical, data-driven and have experience with website tracking tools, e.g. Adobe Analytics. Ideally, you have already had initial experience with Google Ads , Search360 and the Meta Business ManagerYou are an organizational talent, have a reliable and independent way of working as well as initiativeBenefitsVersatile and demanding tasks in a growing start-up environmentOpportunity to help shape the future of Aldi e-commerceResponsibility from the startFlexible working hours and the possibility of partial mobile workingMore exciting Location in DsseldorfA high-performance and pleasant working environment in a team that looks forward to seeing youFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/aldi-e-commerce-gmbh-co-kg\/specialist-performance-marketing-e-commerce-dusseldorf-461216","tags":["Marketing and Communication"],"job_types":["berufserfahren"],"location":"Düsseldorf","created_at":1702399744000,"original_language":"deu"},{"slug":"it-techniker-berlin-220364","company_name":"wu personal GmbH","title":"IT Techniker (m\/w\/d)","description":"We are experts for IT personnel and commercial specialists in temporary employment as well as in service and work contracts. Our customers are IT system houses, IT manufacturers and IT service providers. Our customer is a leading cross-manufacturer IT service provider with 20,000+ employees worldwide. Become part of an independent provider of IT infrastructure services and solutions for large companies and the public sector. On behalf of our customer, we are looking for several employees (m\/f\/d) as soon as possible for the area of ​​IT technician (m\/f\/d) TASKSSetup and dismantling as part of installations and movesReturn transport and documentation of old devicesConnection of the client unit including peripheral device care of checklistsEnd user supportKNOWLEDGEHardware knowledge (PC, notebook and connected peripheral devices)Solution orientation, independent working style and service orientationExperience in support and installation of notebooks as well as desktop and mobile devices is desirableGood knowledge of spoken and written GermanDriving license (class B) is requiredPERFORMANCESTariff-based contract (iGZ\/DGB)Fixed Monthly salary including non-standard payProject allowance from the first day of employmentVacation and Christmas bonus according to iGZRemuneration according to the equal pay modelEmployee referral programPersonal supportFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wu-personal-gmbh\/it-techniker-berlin-220364","tags":["IT"],"job_types":[],"location":"Berlin","created_at":1702399744000,"original_language":"deu"},{"slug":"junior-it-support-techniker-berlin-174637","company_name":"wu personal GmbH","title":"Junior IT Support Techniker (m\/w\/d)","description":"We are experts for IT personnel and commercial specialists in temporary employment as well as in service and work contracts. Our customers are IT system houses, IT manufacturers and IT service providers. Our customer is a leading cross-manufacturer IT service provider with 20,000+ employees worldwide. Become part of an independent provider of IT infrastructure services and solutions for large companies and the public sector. On behalf of our customer, we are looking for several employees (m\/f\/d) as soon as possible for the area of ​​responsibility Junior IT Support Technician (m\/f\/d) TASKSSetup and dismantling as part of installations and movesProcessing of customer ordersConnection of the client unit including the peripheral device installation \/Refueling of PCs\/notebooks, dispensing, delivery and assembly of PCs\/notebooks according to the list or order systemKNOWLEDGEHardware knowledge (PC, notebook and connected peripheral devices)User experience with smartphonesBasic knowledge of a ticket systemClass B driving license requiredGood knowledge of spoken and written German SERVICESTariff-based contract (iGZ\/DGB) Fixed monthly salary including above-standard payProject allowance from the first day of employmentVacation and Christmas bonus according to iGZRemuneration according to equal pay modelEmployee referral programPersonal supportFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wu-personal-gmbh\/junior-it-support-techniker-berlin-174637","tags":["IT"],"job_types":[],"location":"Berlin","created_at":1702399744000,"original_language":"deu"},{"slug":"praktikum-im-bereich-ngo-und-projektmanagement-berlin-16155","company_name":"Charta der Vielfalt e.V.","title":"Internship in the area of ​​NGO and project management","description":"The Charter of Diversity e.V. is a non-profit organization in which our team advocates for the topics of diversity and inclusion in the world of work every day. In concrete terms, this means: How can diversity be implemented in companies, in companies, in the workplace? What prerequisites are needed for this on the political side? We as an association have three pillars for this: The charter document itself, which every employer and self-employed person can sign as a voluntary commitment. The Diversity Charter has now been signed by over 5,000 companies and institutions. Our 38 member organizations, with whom we work together every day to promote more diversity in the world of work. And our political projects such as the German Diversity Day or the DIVERSITY CHALLENGE, which aim to develop and implement concrete approaches for diversity in everyday working life. We are looking for an intern (all gender) full-time (40h\/week) from February 1st, 2024 ) for 6 months.During your internship, you will gain a lot of insight into the work of a non-profit organization that operates in the area of ​​tension between business and politics, between theory and work practice. We attach great importance to involving our interns in the content-related work.TasksYour tasks with us: You support us in current projects, especially in the project management of the German Diversity Day 2024. But also the charter signing process (research, shipping, sorting of the documents ) will accompany you. To do this, you will work with CRM and CMS programs such as Cobra and Typo3. You research current socially or politically relevant issues surrounding the topics of diversity and inclusion. You help with the preparations for various project phases. You will handle general inquiries relating to the Diversity Charter and various diversity topics.QualificationsThe internship is right for you if you: are a registered student and are interested in the topic of diversity, have the ability to work independently and have a high level of motivation, and are very good with MS Office You know the German language confidently, both spoken and written, can keep an overview and work in a structured way. And what is really important to us: you identify with the topics of diversity and inclusion and the values ​​of our association and you want to deal with them every day.BenefitsWe offer: Insights into the work of a non-profit organization in the area of ​​tension between social and economic challenges as well as current political decisions. A committed team that lives an organizational culture that is characterized by mutual respect and appreciation. A friendly working environment in our office in Berlin-Mitte and the possibility of mobile working upon arrangement. Clear support for your internship goals, but also plenty of space for personal development and participation in the content. Remuneration according to the type of internship (voluntary internship or compulsory internship) Become part of our dedicated team! We look forward to receiving your application by January 1st, 2024. The Diversity Charter e.V. offers a respectful working environment for all employees regardless of age, ethnic origin and nationality, gender and gender identity, physical and mental abilities, religion and worldview, sexual orientation and social background .We are very interested in diverse applicants. If you are interested in this task and the associated design and development opportunities, please send us your application documents (tabular CV and cover letter as a coherent PDF file without a photo) to bewerbung (at) charter-der-verkauf, stating your earliest possible starting date . de.If you have any questions about accessibility at the Charter of Diversity e.V., please contact dennis.pittack (at) charta-der-wandel. deFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/charta-der-vielfalt-ev\/praktikum-im-bereich-ngo-und-projektmanagement-berlin-16155","tags":["Marketing and Communication"],"job_types":["Internship"],"location":"Berlin","created_at":1702399744000,"original_language":"deu"},{"slug":"werbetechniker-schilder-und-lichtreklamehersteller-essen-498810","company_name":"Display-Messebau GmbH","title":"Advertising technician \/ sign and illuminated advertising manufacturer (m\/f\/d)","description":"We create space for contacts. As a full-service company in the area of ​​event and trade fair communication, we conceive, design, plan, organize and realize trade fair appearances, congresses, roadshows, showrooms, store openings and the like around the world. With dedicated employees, we have been designing and producing ourselves in our own studios and workshops using the latest CAD and CNC technology since 1979. In addition to many years of expertise and know-how, partner companies at home and abroad, we offer individual advice for every event Lots of creativity and passion as well as reliable execution by our strong team. Tasks Creation of layouts, graphic files and print templates using programs such as FreeHand, Photoshop, Illustrator, Office and FlexiSign Adaptation and modification of agency and customer files with regard to the production-technical conditions Implementation of graphic concepts and designs According to the specifications of the Design & Planning department, coordination of dates for the production and assembly of graphic elements with customers, agencies and the responsible project managers in-house. Obtaining offers according to self-determined requirements. Creating offers according to an independent preliminary calculation and offers from upstream suppliers. Constant contact with customers, agencies and suppliers throughout the entire planning -, production and assembly phasePreparation, production and further processing of large format digital printsShort-term implementation of customer requests or addition or change of graphics on the finished productSetting and plotting of texts and graphics using CAD computer systems as well as the necessary further processingLaminating on a wide range of materials such as KF board, Kmatex , plexiglass, vehicle lettering, etc.Full-surface lamination of complete foils and jet prints on large surfaces as well as further processing of color enlargements and architect's plansQualificationCompleted vocational training as a sign and illuminated advertising manufacturer or as a media designer or comparable qualification or career changer with appropriate professional experienceKnowledge in Dealing with the relevant software programs Knowledge of using MS Office products High level of personal responsibility and strong quality awareness Committed, careful and reliable way of working Team skills Benefits We offer you a varied and secure job in a medium-sized company in the Ruhr area with interesting projects and a long-term perspective. You can expect a permanent position Working relationship in a future-oriented and dynamic environment with flat hierarchies and short communication channels, a versatile job with a high degree of personal responsibility and team spirit, performance-related remuneration with Christmas and vacation pay, regular working hours and 30 days of vacation per year. We look forward to receiving your application! If this challenge appeals to you, we look forward to receiving your application documents (cover letter, CV, certificates) stating your salary expectations and the earliest possible starting date. If you have any questions, please contact Mr. Ronny Zech, Tel.: +49 201 83350-57.Display -Messebau GmbHHafenstrae 231-23545356 EssenFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/display-messebau-gmbh\/werbetechniker-schilder-und-lichtreklamehersteller-essen-498810","tags":["Graphic Arts and Communication Design"],"job_types":[],"location":"Essen","created_at":1702399744000,"original_language":"deu"},{"slug":"pflichtpraktikum-im-bereich-marketing-und-kommunikation-hanover-378142","company_name":"HTI BioIntelligence GmbH","title":"Mandatory internship in the field of marketing and communication (m\/f\/d)","description":"HTI BioIntelligence GmbH is a novel incubator for start-ups and an innovation center that seamlessly bridges the gap between knowledge, start-ups and industry in the areas of biotech, medtech and life science. We bring ideas to life and offer the perfect ecosystem, in which innovations can flourish. We are currently supporting 14 start-ups in our 1st batch and are looking for support in marketing to strengthen our team and to be able to better present the external appearance of our incubator. We offer the opportunity for a challenging compulsory internship in the area of ​​marketing and communication in our team. The internship offers a unique opportunity to gain practical experience in various aspects of marketing and to further develop your skills in a supportive environment. Tasks Support with content creation: Writing creative texts for different channels. Creating engaging content for social media Platforms.Market research: Carrying out research on current market and industry trends. Evaluation of data to identify target groups and potential. Event management: Collaboration in the organization and implementation of events and promotional activities. Coordination of marketing materials for events. Social media management: Maintenance and updating social media profiles.Analysis of social media metrics to improve online presence.Communication: Support with internal and external communication.Writing press releases and internal communications.Implementation of the marketing conceptUse of Google Ads and Co. for Placing advertising messages Placing paid advertising in social media channelsQualificationEnrolled student (m\/f\/d) in the field of marketing, communication or a similar field.Interested in marketing trends and digital communication.Good knowledge of MS Office, Canva, knowledge of other graphics programs desirableCreative and strong communication personality. Initiative, ability to work in a team and reliability.Knowledge of dealing with social media platforms.Experience with Google Ads and other marketing toolsVery good knowledge of spoken and written German and English.BenefitsThe activity may be carried out in a hybrid form. Individual home office days are possible. However, our office is very easy to reach in the heart of Hanover. Both by car and by public transport. We promote diversity and encourage people of all genders to apply. We value differences in experience and perspective and firmly believe that diversity leads to innovation. Please send us your detailed application including CV and certificates by December 21, 2023 at the latest. We look forward to welcoming you to our team and offering you the opportunity to gain valuable experience in the field of marketing and communications.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hti-biointelligence-gmbh\/pflichtpraktikum-im-bereich-marketing-und-kommunikation-hanover-378142","tags":["Marketing and Communication"],"job_types":["Internship"],"location":"Hanover","created_at":1702399744000,"original_language":"deu"},{"slug":"spring-boot-java-developer-germany-munich-91496","company_name":"Tidely GmbH","title":"Spring Boot Java Developer Germany","description":"Tidely offers a digital solution for professional liquidity management. We help companies answer questions such as:What is the current liquidity position?Which deposits or payments are due?How can the company ensure good financial decision-making?Your new team of Spring Boot Engineers is a group of highly skilled and experienced developers who are experts in building web applications using Spring Boot. We specialize in designing and developing scalable and robust web applications using Spring Boot's comprehensive set of features, such as auto-configuration, spring-data, and production-ready metrics.Our team follows best practices for software development, including Agile methodology and continuous integration and deployment. We are committed to delivering high-quality code that meets the needs of our clients and end-users.TasksWe collaborate closely with our clients to understand their requirements and provide innovative solutions that meet their business goals. We constantly collect user feedback and need help to transform the feedback into features.We expect you to:Design and develop high-quality code: As a Java Developer, you will be responsible for writing and maintaining high-quality code using Spring Boot's core concepts.Conduct code reviews: You will review code written by other team members to ensure that it meets quality standards, is maintainable, and follows best practices.Mentor and train team members: You will provide guidance and mentorship to junior, medior, senior developers and help them improve their skills.You will be working with:AWS.Srping Boot.Java 17.Kubernetes.Elasticsearch, redis, postgres, kafka.RequirementsAlready living in Germany is a must. Candidates outside of Germany will be declined. We are a startup and do not have the HR capacity to help expats come to Germany.Spring Boot knowledge and Spring Data experience are a must.JavaSpring Boot \/ Spring Data.AWSPostgreSQLGood English skills.BenefitsOptional equity offering.Remote (within Germany) or in Munich office.Flexible working hours.30 days of paid vacation.Individual development budget for trainings, joining conferences with the team, etc.Choose your hardware!Direct influence on the product, your opinion counts.Small international team of very good developers.Joining a startup as a Spring Boot Java Developer can be an exciting opportunity for you to be part of a dynamic team that is working on innovative solutions to solve real-world problems. Here are some reasons why you should consider joining our start-up:You will have the opportunity to work on cutting-edge technology and be part of a team that is pushing the boundaries of what is possible with Spring Boot.Our start-up culture is fast-paced, agile, and encourages creativity and innovation. You will have the freedom to experiment with new ideas and technologies to build world-class products.You will have a high level of autonomy and responsibility, which will enable you to grow your skills and take on leadership roles.Our start-up offers a flexible work environment that prioritizes work-life balance and encourages a healthy lifestyle.As a lead Spring Boot Java Developer, you will have the opportunity to work closely with our founding team and have a direct impact on the growth and success of the company.Joining our start-up as a lead Spring Boot Developer will give you the chance to be part of a fast-growing company that is disrupting the industry and making a difference in people's lives.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/tidely-gmbh\/spring-boot-java-developer-germany-munich-91496","tags":["Remote","Software Development"],"job_types":[],"location":"Munich","created_at":1702396145000,"original_language":"eng "},{"slug":"senior-java-entwickler-remote-in-deutschland-fulda-168507","company_name":"it-novum","title":"Senior Java developer (m\/f\/d) - remote in Germany","description":"Tasks These tasks await you with us. With your know-how, you will be involved in the entire development process from the receipt of the requirement to the development and handover. You will develop customer-specific solutions in the area of ​​Enterprise Information Management using modern Java frameworks (e.g. Spring, JUnit) and technologies (e.g. HG, Continuous Integration)You are responsible for handing over our operational solutions into the productive operations of our customers. Even after the handover, you are responsible for the operation, maintenance and support of the solutionsQualificationYou bring this knowledge and interests with you.You already have extensive experience in Java development and have knowledge of common frameworks such as Spring. You are familiar with web technologies such as HTML, CSS or JavaScript as well as databases (SQL) and their integration into Java applications (JDBC). You are interested in them Topics ECM & process digitalization and are ready to familiarize yourself with our supportYou are a flexible team player whose passion is solving tricky problemsYou master the English language so that you can communicate internationally in your fieldBenefitsWe offer youYou can choose your working hours flexibly during your flexitimeHome office and Presence can be flexibly designedA pleasant working atmosphere and a collegial teamPermanent employment contract, 30 days of vacation, company pension plan, capital-forming benefits, employee discounts and bike leasing with a company share of 50%A nice and modern office in Fulda including parking, within walking distance of the city centerCafeteria in the building, selection of fresh fruit and drinksContinuous development through seminars, workshops and internal knowledge transferFreedom to design your workplaceMany employee events from summer parties to health days with varied activitiesFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/it-novum\/senior-java-entwickler-remote-in-deutschland-fulda-168507","tags":["IT"],"job_types":["berufserfahren"],"location":"Fulda","created_at":1702396145000,"original_language":"deu"},{"slug":"unity-developer-ulm-92668","company_name":"TriCAT GmbH","title":"UNITY DEVELOPER m\/w\/d","description":"Wir sind ein fhrender Anbieter von Lsungen fr das Metaversum, welche die Themenfelder Kollaboration, Training und Lernen in Corporate Metaverses revolutionieren. Wir entwickeln und vermarkten Produkte und Dienstleistungen, die Menschen, Objekte und Informationen in virtuellen 3D-Welten vernetzen und interagieren lassen. Wir nutzen die neuesten Technologien und Innovationen im Bereich KI, XR und virtuelle 3D-Welten, um immersive und realittsnahe Erlebnisse fr unsere Kunden wie Porsche, Olympus, Bosch, Bundeswehr, Bayer, Siemens, Fraunhofer, Fresenius, ABP u.v.m., im B2B-Bereich zu schaffen.Wir sind 50 Menschen - und wachsen stetig.AufgabenDu wirst Client-Server Applikationen von der Idee bis zur Umsetzung entwickeln. Anhand eines Storyboards entwirfst und realisierst du Szenarien und Ablufe im Bereich Virtual- und Augmented Reality. Neben der Integration von VR\/AR-Hardware (z.B. Hololens, HTC Vive) in Prozesse entwickelst du mit den neuesten Technologien Prototypen und 3D Simulationen auf Basis aktueller Forschung. Zudem erstellst duSpezifikationen, komplexe Systemarchitekturen sowie Designs und Dokumentationen.QualifikationMUST HAVES Abgeschlossenes Studium oder vergleichbare Berufserfahrung im Bereich (Medien-)Informatik oder hnliche Fachrichtung Erfahrung in der Entwicklung mit Unity, Unity Editor Scripting und\/oder Unity UI Sehr gute Programmierkenntnisse mit C#, idealerweise auch C++ Grundlegendes Verstndnis fr Vektormathematik und 3D Modellierung (Grafik-, Video- und Audioproduktion) Hohe Eigeninitiative sowie strukturierte und teamorientierte Arbeitsweise Deutsch und\/oder Englisch auf mindestens B2-Niveau   NICE TO HAVE Kenntnisse im Bereich der Netzwerk-Protokolle und Sicherheit (https, ssl) sowie Erfahrung mit Animationen (2D\/3D)BenefitsWIR BIETEN DIReinen zukunftsorientierten Arbeitsplatz mit spannenden Aufgaben, attraktiven Zusatzleistungen und ausgeglichener Work-Life-Balance in einem tollen Team, das dich untersttzt und mit dir gemeinsam wchst. Und das in einer der angesagtesten Regionen im Stdteranking Deutschlands. Von FOCUS-BUSINESS sind wir fr 2019, 2020 und 2021 als Top-Arbeitgeber Mittelstand ausgezeichnet.Bereits in der Preboarding-Phase, also nach Vertragsunterzeichnung, erhltst du von deinem Paten bzw. deiner Patin einen detaillierten Onboarding-Plan mit genauen Zeiten und Ansprechpartnern deines Vor-Ort-Onboardings in Ulm fr einen unkomplizierten Einstieg bei uns. In diesem Plan bekommst du auerdem die Zugangsdaten zur TriCAT INFOTHEK. Dort findest du alle Informationen rund um TriCAT, die du fr deine ersten Tage bei uns bentigst.Sobald du deine TriCAT-E-Mail-Adresse erhalten hast, darfst du sofort am TriCAT-Vorteilsprogrammen teilnehmen.Passt die Ausschreibung perfekt oder in groen Zgen zu deinen Erwartungen? Dann freuen wir uns sehr ber deine Bewerbung!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/tricat-gmbh\/unity-developer-ulm-92668","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Ulm","created_at":1702396145000,"original_language":"eng"},{"slug":"ecm-bpm-engineer-remote-in-deutschland-fulda-73217","company_name":"it-novum","title":"ECM\/ BPM Engineer (m\/w\/d) - remote in Deutschland","description":"Tasks These tasks await you with us. With your know-how, you are involved in the entire development process from the acceptance of the requirement to the development and handover. As an integral part of our project team, you are a competent contact person for our customers and hand over our operational solutions to our customers, even after the Upon handover, you will be responsible for the operation, maintenance and support of the solutions. Qualifications You will bring these knowledge and interests with you. You have already gained extensive experience in Java development and have good knowledge of common frameworks such as Spring, Maven or something similar. You are familiar with how to use them with relational databasesYou are enthusiastic about getting in touch with customers and working togetherIdeally, you have experience with the concepts of an ECM\/DMS or knowledge of web development with e.g. AngularOptionally, you have knowledge of workflow engines and the graphic modeling language BPMN 2.0You are fluent in English , so that you can communicate internationally in your field of expertiseBenefitsWe offer youYou can choose your working hours flexibly during your flexitimeHome office and presence can be flexibly designedFree choice of hardware between Apple and LenovoPermanent employment contract30 days vacationContinuous development through seminars, workshops and internal knowledge transferExciting and varied tasks with the use of innovative technologiesCompany pension provision, Capital-forming benefitsEmployee discounts and bike leasing with a company share of 50%A beautiful and modern office in Fulda including parking, within walking distance of the city centerCafeteria in the building, selection of fresh fruit and drinks such as coffee, lemonade and a multi-level electronic water dispenserA pleasant working atmosphere and a friendly teamFreedom when designing your workplaceMany employee events from summer parties to health days with varied activitiesFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/it-novum\/ecm-bpm-engineer-remote-in-deutschland-fulda-73217","tags":["IT"],"job_types":["berufserfahren"],"location":"Fulda","created_at":1702396145000,"original_language":"deu"},{"slug":"marketing-manager-ulm-15767","company_name":"TriCAT GmbH","title":"MARKETING MANAGER m\/w\/d","description":"Wir sind ein fhrender Anbieter von Lsungen fr das Metaversum, welche die Themenfelder Kollaboration, Training und Lernen in Corporate Metaverses revolutionieren. Wir entwickeln und vermarkten Produkte und Dienstleistungen, die Menschen, Objekte und Informationen in virtuellen 3D-Welten vernetzen und interagieren lassen. Wir nutzen die neuesten Technologien und Innovationen im Bereich KI, XR und virtuelle 3D-Welten, um immersive und realittsnahe Erlebnisse fr unsere Kunden wie Porsche, Olympus, Bosch, Bundeswehr, Bayer, Siemens, Fraunhofer, Fresenius, ABP u.v.m., im B2B-Bereich zu schaffen. Wir sind 50 Menschen - und wachsen stetig.AufgabenBei TriCAT hast du die Mglichkeit, an spannenden und innovativen Projekten mitzuwirken und deine eigenen Ideen einzubringen. Du bist verantwortlich fr die Entwicklung, Durchfhrung und Auswertung von Marketingkampagnen, die unsere Marke und unser Image strken und unsere Kunden begeistern. Du arbeitest eng mit unseren Projektmanager:innen, Entwickler:innen, Designer:innen und Customer Success Experts zusammen. Du machst potentiellen Kunden Lust auf unser Produkt und berzeugst sie von den Vorteilen und dem Mehrwert, den wir ihnen bieten knnen. Es bleibt spannend  du bist verantwortlich fr:die Mitentwicklung und Umsetzung einer innovativen und ganzheitlichen Marketingstrategie.die Planung und Kontrolle von zielgerichteten Marketingkampagnen und den Einsatz spezifischer Marketinginstrumente.die Erstellung von Markt- und Wettbewerbsanalysen sowie das Aufspren von Trendthemen im Bereich virtuelle 3D-Welten, Corporate Metaverse und dem Einsatz von KI in diesen Bereichen.die Definition von klaren Marketing-KPIs fr die Erfolgsmessung und kontinuierliche Verbesserung.die Produktion von professionellen Content-Assets wie Newsletter, Whitepapers, Vorlagen, sowie Blog-Artikel.die Organisation von Messen und anderen Veranstaltungen.QualifikationMUST HAVESEin abgeschlossenes Studium im Bereich Marketing, Kommunikation, Medien oder eine vergleichbare Qualifikation.Mindestens vier Jahre Berufserfahrung in kundenorientierter Marketingfunktion, idealerweise in der IT-Branche.Fundierte Projekt- und strategische Marketingkenntnisse.Nachweisbare Erfolge in der Entwicklung und Umsetzung von Marketingstrategien.Du bist empathisch und kommunikativ und verargumentierst deine Ideen leidenschaftlich und problemlos in Deutsch und Englisch auch in greren Runden sowie bei Stakeholdern.Sehr gute Kenntnisse und Erfahrungen im Bereich Online-Marketing, Social Media, SEO, SEM, Content Marketing, E-Mail Marketing.Begriffe wie CMS, Lead Nurturing, Dynamic Ads sind dir nicht fremd.Du kennst dich in der digitalen Welt aus, verfolgst aufmerksam neue Trends und Entwicklungen und weit, wie sich unterschiedliche Zielgruppen darin bewegen.Kreativitt, Kommunikationsstrke, Teamfhigkeit und eine hohe Eigeninitiative zhlen zu deinen Strken.Sprache ist eins der wichtigsten Werkzeuge fr dich und du kannst Menschen mit deiner ausgeprgten Textstrke begeistern.Sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift.In Verbindung mit Kreativitt hast du eine analytische, strukturierte und konzeptionelle Denkweise und du arbeitest ergebnis- und kundenorientiert.BenefitsWIR BIETEN DIReinen zukunftsorientierten Arbeitsplatz mit spannenden Aufgaben, attraktiven Zusatzleistungen und ausgeglichener Work-Life-Balance in einem tollen Team, das dich untersttzt und mit dir gemeinsam wchst. Und das in einer der angesagtesten Regionen im Stdteranking Deutschlands. Von FOCUS-BUSINESS sind wir fr 2019, 2020 und 2021 als Top-Arbeitgeber Mittelstand ausgezeichnet.Bereits in der Preboarding-Phase, also nach Vertragsunterzeichnung, erhltst du von deinem Paten bzw. deiner Patin einen detaillierten Onboarding-Plan mit genauen Zeiten und Ansprechpartnern deines Vor-Ort-Onboardings in Ulm fr einen unkomplizierten Einstieg bei uns. In diesem Plan bekommst du auerdem die Zugangsdaten zur TriCAT INFOTHEK. Dort findest du alle Informationen rund um TriCAT, die du fr deine ersten Tage bei uns bentigst. Sobald du deine TriCAT-E-Mail-Adresse erhalten hast, darfst du sofort am TriCAT-Vorteilsprogrammen teilnehmen.Bis du bereit, dein volles Engagement und Wissen einzubringen?Dann sollten wir uns unbedingt kennenlernen!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/tricat-gmbh\/marketing-manager-ulm-15767","tags":["Marketing Manager"],"job_types":["berufserfahren"],"location":"Ulm","created_at":1702396145000,"original_language":"eng"},{"slug":"it-administrator-munich-375220","company_name":"CREAT GmbH","title":"IT Administrator (m\/w\/d)","description":"CREAT GmbH stands for Center for Research, Engineering & Advanced Technologies. Design, develop and industrialize innovative solutions for the next generation of vehicles with us. Our world is lighting systems for automobiles, E\/E systems and testing and in particular the associated engineering services. We are looking to support our rapidly growing team with immediate effect (or at one later date) in full-time or part-time as well as in a permanent position an IT administrator (m\/f\/d).TasksTaking responsibility for tasks in day-to-day business, such as inventory\/documentation, license management, monitoring network, monitoring of system resources and VPN location networking Coordination with our internal ones Departments on various IT topics Procurement of hardware and IT equipment Participation in exciting IT projects as well as optimization and implementation of new solutions Consideration of laws and standards, such as ISO 27001 and data protection, TISAX qualification Completed vocational training as an IT specialist or a comparable training\/studies Well-founded professional experience in IT AdministrationInitial knowledge of some of the following systems\/tools\/technologies: - Microsoft ActiveDirectory, Microsoft Exchange, Microsoft \/ Linux network (DNS, DHCP, routing, etc. - SAP B1 \/ HANA, VMware server virtualization, switch, firewall - backup, database server, Access points, printers, VoIPExcellent organizational, team and communication skillsVery good German and good written and spoken English skillsBenefitsFlexible and mobile working for the optimal balance of leisure, family and workFree space for your own ideas, made possible by our flat hierarchies and short decision-making processes across all levelsStronger Cohesion thanks to lots of fun at numerous events, including those across locations. Health promotion is important to us and is supported by a fitness subsidy with either Hansefit or EGYM Wellpass as well as bicycle leasing via JobRad. Versatile discounts through corporate benefits. Provision for your old age through a company pension scheme with a 33% employer subsidy. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/creat-gmbh\/it-administrator-munich-375220","tags":["IT"],"job_types":[],"location":"Munich","created_at":1702396145000,"original_language":"deu"},{"slug":"risikomanager-banking-munich-180028","company_name":"univativ GmbH","title":"Risikomanager Banking (m\/w\/d)","description":"From now until February 1, 2024, with an option to extend | 40 hours per week | Munich | Finance | Career starter, experienced professional | Project ID A202343900_5Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Are you communicative and work agile? Even in stressful situations, do you stay calm and keep an eye on what's important? Then our position in risk controlling is just right for you! Our customer is a leading financial company. You can expect a collegial working atmosphere on a very professional level in our project. By working with different experts, you can develop your skills and pursue your passion in a modern working environment. Apply now!TasksModeling of risks (credit, market, liquidity risk, etc.) or implementation and conception of stress testsFurther development of models and implementation of modeling via your own programmingAnalysis up to the implementation of regulatory requirements on methodological topicsEvaluation of financial products of all kinds ( both trading and loan portfolio)QualificationCompleted studies in (business) mathematics, physics, statistics or economics with a quantitative focusFirst experience with risk modeling in a bankCredit, liquidity and market riskPrevious experience as well as initial knowledge of modeling interest rate risks, as well as IFRS knowledge desirableGood Basic knowledge of programming (VBA) and financial products from a bankFluent in German and fluent EnglishBenefitsSpecial workplace in the heart of Munich near the main train stationPersonal project supportIndividual coaching as preparation for presentations to customersNetworking in various industriesYour entry into DAX companies and leading medium-sized companiesVarious further training opportunities in our e-AcademyWe could arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/risikomanager-banking-munich-180028","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702396145000,"original_language":"nds"},{"slug":"risikomanager-banking-operationelles-risikocontrolling-munich-73926","company_name":"univativ GmbH","title":"Risikomanager Banking (m\/w\/d) Operationelles Risikocontrolling","description":"From now until February 1, 2024, with an option to extend | 40 hours per week | Munich | Finance | Career starter, experienced professional | Project ID A202343902_5Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Are you communicative and work agile? Even in stressful situations, do you stay calm and keep an eye on what's important? Then our position as a clerk (m\/f\/d) in the area of ​​operational risk is just right for you! This project offers you a career start in a DAX-listed financial group. You can expect not only exciting activities and comprehensive insights into the services of a major bank, but also a promising career start in a modern environment. In addition, you benefit from the training opportunities through free workshops and training in our univativ academy! Task monitoring and control of quantitative risks of all kinds (credit, market, liquidity risk, etc.) Technical preparation of daily, monthly and ad hoc reports to monitor the Risks Familiarization with the bank's risk system landscape and other new systems Conducting data quality checks and creating corresponding comparisons and evaluations Qualifications Completed studies in business administration, economics, (business) mathematics, (business) informatics or a bank\/IT-related professional training IT system affinity, especially in MS Office and in Programming area (e.g. Access, Tableau VBA, SQL etc.)Initial knowledge of trading or credit business, risk controlling or data management, desirableHigh level of initiative and independent working styleFluent in German and fluent EnglishBenefitsSpecial workplace in the heart of Munich near the main train stationPersonal project supportIndividual coaching as preparation for the presentation at CustomersYour entry into DAX companies and leading medium-sized companiesNetworking in various industriesVarious further training opportunities in our e-AcademyWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/risikomanager-banking-operationelles-risikocontrolling-munich-73926","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702396145000,"original_language":"nds"},{"slug":"junior-techniker-ludwigsfelde-21598","company_name":"wu personal GmbH","title":"Junior technician (m\/f\/d)","description":"We are experts for IT personnel and commercial specialists in temporary employment as well as in service and work contracts. Our customers are IT system houses, IT manufacturers and IT service providers. Our customer is a leading cross-manufacturer IT service provider with 20,000+ employees worldwide. Become part of an independent provider of IT infrastructure services and solutions for large companies and the public sector. On behalf of our customer, we are looking for several employees (m\/f\/d) as soon as possible for the area of ​​responsibility Junior Technician (m\/f\/d) TASKSSetup and dismantling as part of installations and movesProcessing of customer ordersConnection of the client unit including the peripheral devicesInstallation\/refueling of PCs\/notebooks, deploying, delivering and setting up PCs\/notebooks according to the list or order systemKNOWLEDGEHardware knowledge (PC, notebook and connected peripheral devices)User experience with smartphonesBasic knowledge of a ticket systemClass B driving license requiredGood knowledge of spoken and written GermanBENEFITSTariff-based contract (iGZ\/DGB)Fixed monthly salary including above-tariff paymentProject allowance from the first day of useVacation and Christmas bonus according to iGZRemuneration according to equal pay modelEmployee referral programPersonal supportFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wu-personal-gmbh\/junior-techniker-ludwigsfelde-21598","tags":["IT"],"job_types":[],"location":"Ludwigsfelde","created_at":1702396145000,"original_language":"deu"},{"slug":"servicetechniker-im-oniste-support-kamenz-189522","company_name":"wu personal GmbH","title":"Service technician in Oniste Support (m\/f\/d)","description":"We are experts for IT personnel and commercial specialists in temporary employment as well as in service and work contracts. Our customers are IT system houses, IT manufacturers and IT service providers. Our customer is a leading cross-manufacturer IT service provider with 20,000+ employees worldwide. Become part of an independent provider of IT infrastructure services and solutions for large companies and the public sector. On behalf of our customer, we are looking for several employees (m\/f\/d) as soon as possible for the area of ​​service technician in Oniste Support (m\/f\/d) TASKS Installation of operating systems and applications Provision of classic IMAC services (Install, Move, Add, Change) Processing of individual ordersOnsite support in the client areaInstallation and configuration of PCs and notebooksKNOWLEDGEHardware knowledge (PC, notebook and connected peripheral devices)Solution orientation, independent working style and service orientationExperience in the independent installation, maintenance, repair and upgrade of hardware and softwareVery good knowledge of German and English requiredDriving license Class BENEFITS Collective agreement (iGZ\/DGB)Fixed monthly salary including above-tariff paymentProject bonus from the first day of useVacation and Christmas bonus according to iGZRemuneration according to equal pay modelEmployee referral programPersonal supportFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wu-personal-gmbh\/servicetechniker-im-oniste-support-kamenz-189522","tags":["IT"],"job_types":[],"location":"Kamenz","created_at":1702396145000,"original_language":"deu"},{"slug":"administrator-linux-bonn-164497","company_name":"wu personal GmbH","title":"Administrator Linux (m\/w\/d)","description":"We are experts for IT personnel and commercial specialists in temporary employment as well as in service and work contracts. Our customers are IT system houses, IT manufacturers and IT service providers. We are the personnel service provider for IT service providers. Our customer is Europe's largest telecommunications provider and offers comprehensive solutions and services for various industries such as automotive, telecommunications, finance, trade, media, energy and manufacturing as well as the public sector and healthcare. On behalf of our customer, we are looking for several employees (m\/f\/d) as soon as possible for the area of ​​responsibility Administrator Linux (m\/f\/d) TASKS Change and incident management Configuration, administration and troubleshooting of RedHat, Ubuntu and SLESTroubleshooting at system engineer level Roll-out of software via automated software distribution Ansible, PuppetData backup with Legato Networker, incl. troubleshooting at client levelSystem monitoring with NagiosScripting, Perl or Shell programming desirableKNOWLEDGESolid knowledge of Linux (Redhat, Ubuntu, SLES)At least two years of experience with operating systems and virtualizationsVery good knowledge of spoken and written German Knowledge of spoken and written English Willingness to pass an official safety check (S2-G) A certificate of good conduct must be provided before starting work Training takes place in Bonn, mobile working possible BENEFITS Fixed monthly salary Varied activities Prospect of project extension and\/or follow-up projects Personal support Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/wu-personal-gmbh\/administrator-linux-bonn-164497","tags":["IT"],"job_types":[],"location":"Bonn","created_at":1702396145000,"original_language":"deu"},{"slug":"sachbearbeiter-banking-non-financial-risikomanagement-munich-484394","company_name":"univativ GmbH","title":"Banking clerk (m\/f\/d) non-financial risk management","description":"From now until February 1st, 2024, with an option to extend | 40 hours per week | Munich | Finance | Career starter, experienced professional | Project ID A202343901_5Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Are you communicative and work agile? Even in stressful situations, do you stay calm and keep an eye on what's important? Then our position as a clerk in the banking environment (m\/f\/d) is just right for you! Our customer, a public law institution based in Munich, needs support to implement his project. You will gain insights into the processes of a successful company and gain valuable professional experience. Are you interested in getting started with us? Then apply now!TasksIdentification of gaps and support of their implementationTracking and compliance with regulatory framework conditions in the banking environmentTracking and testing with regard to the bank's process mapPreparation of cyber resilience stress testingQualificationCompleted studies or commercial trainingContact points in the area of ​​risk analysis and knowledge on the topics of business continuity management, information security & Outsourcing management within a bank would be desirableGood and self-confident communication with internal colleagues, especially in exchange with regard to accompanying process topicsProcess affinity and the urge to understand them holisticallyInterest in artificial intelligence and its regulatory framework in the banking environmentFluent in German and fluent EnglishBenefitsSpecial workplace in the heart of Munich near the main train stationA personal one Project supportIndividual coaching as preparation for the presentation to the customerVarious further training opportunities in our e-AcademyYour entry into DAX companies and leading medium-sized companiesNetworking in various industriesWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/sachbearbeiter-banking-non-financial-risikomanagement-munich-484394","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702396145000,"original_language":"nds"},{"slug":"people-operations-manager-hr-generalist-frankfurt-276984","company_name":"Clark Germany GmbH","title":"People Operations Manager \/ HR Generalist (m\/w\/d)","description":"CLARK, active since 2015, has a clear vision: to enable everyone to live a worry-free life. Our mission is to make insurance optimization easy for everyone. With our app, customers have a central place to manage and optimize their insurance contracts quickly, transparently and effortlessly. Our secret to success? An outstanding experience based on first-class technology and personal advice. With over half a million satisfied customers and more than 400 dedicated employees from over 40 nations, we are proud of our CLARKees. You will work in our offices in Berlin, Frankfurt, Saarbrücken or from home and contribute to implementing our mission on a daily basis. Building on our rise to becoming a unicorn, we would like you to accompany us on our path to success! We are now looking for you as our People Operations Manager \/ HR Generalist (m\/f\/d) to support our fantastic team. Your tasks: Contact person for employees for all HR inquiries. Participation in HR projects on a strategic and operational level. Creation and adaptation of HR documents (employment contracts, guidelines, etc.). Compilation of HR key figures (number of employees, fluctuation, etc .).Preparatory payroll accounting and HR controlling.Management of digital and analog files, as well as process optimization & administration in our HR systems (Personio, Leapsome).Support with attendance recording, attendance recording, on-\/offboarding and documentation of processes and policies in our Clark.net.What we are looking for:Several years of experience as an HR generalist or in a comparable position.University degree in human resources management or related disciplines.In-depth knowledge of labor, tax and social security law.Fluent written and spoken German and English.Professional Appearance with a strong service mentality.Excellent time management skills and independent working style.Experience with HR information systems, preferably Personio, as well as ability to work in a team and fit with the company values: Care, Simplicity & ReliabilityYour benefits:An environment with a strong culture and international colleagues from across the globe 40 different countriesFlexible working models, with home office and excellent offices in Berlin, Frankfurt and Saarbrücken and working from abroad for 183 days \/ yearCompany pension scheme and other personal insurance with top conditions Extensive range of exclusive discounts for employeesVarious further training programs (e.g. B. our Lunch & Learn Program) & mentors who support you every day 30 days of paid vacation and additional “impact” days to volunteer and make a difference Legendary team events with trips to Frankfurt, Berlin and Saarbrücken Diversity is important to us at CLARK at heartWe create an ideal working environment for committed, initiative-taking and talented people; Regardless of origin, identity, religion and age, we do everything we can to offer everyone the same chances and opportunities. Sounds exciting? It is! We look forward to getting to know you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/clark-germany-gmbh\/people-operations-manager-hr-generalist-frankfurt-276984","tags":["HR"],"job_types":[],"location":"Frankfurt","created_at":1702396145000,"original_language":"deu"},{"slug":"elektrotechniker-mit-perspektive-zum-sps-programmierer-dingolfing-296233","company_name":"SmartDec GmbH","title":"Electrical engineer with prospects for becoming a PLC programmer (m\/f\/d)","description":"SmartDec GmbH, a leading company in the field of automation technology, is looking for a motivated and talented electrical engineer with the prospect of becoming a PLC programmer (m\/f\/d). Our company is known for innovative solutions and we offer an excellent opportunity to work in a dynamic and growing environment. If you are looking for a challenging position with the opportunity for professional development, this could be the perfect opportunity for you. We look forward to hearing from you!TasksDevelopment and programming of customer-specific systems and machines with Siemens S7 in TIA PortalVisualization with WinCCCustomer supportCreation of technical documentationYou take on sub-project management with responsibility for deadlines, resources and resultsCommissioning and troubleshooting at the customer's site (at home and abroad)QualificationSuccessfully completed Vocational training in the technical areaExperience in the commissioning of automation systemsSolution-oriented way of working and the ability to work in a targeted mannerTeam spirit and flexibilityGood knowledge of spoken and written English.Driving license class BBenefitsAn exciting workplace in a pleasant, modern and collegial working atmosphere in a rapidly growing company.The possibility of extensive training\/further training offers You work with the latest technology and state-of-the-art networking An attractive salary, taking on responsibility and shaping the company Flexible working hours, home office Are you looking for an exciting career in the field of automation technology? Become part of our team at SmartDec GmbH and develop your potential as an electrical engineer with the prospect of becoming a PLC programmer! Find jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/smartdec-gmbh\/elektrotechniker-mit-perspektive-zum-sps-programmierer-dingolfing-296233","tags":["Engineering"],"job_types":[],"location":"Dingolfing","created_at":1702396145000,"original_language":"deu"},{"slug":"business-analyst-munich-127163","company_name":"univativ GmbH","title":"Business Analyst (m\/w\/d)","description":"From now on, long-term, permanent position | 40 hours per week | Munich | IT industry | Career starter, experienced professional | 50,000 to 60,000 per year | Project ID P202343547_6Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Are you familiar with the analysis of business processes? We are looking for a business analyst (m\/f\/d) who would like to get started with us to formulate complex requirements for processes and IT systems. Your placement will be with a successful consulting company. Through countless projects over more than 25 years, our partner has extensive specialist knowledge and specific skills in the areas of business and IT consulting. Around 500 employees accompany a wide range of customers on their way into the digital world and thus design effective IT solutions. Would you like to become part of an innovative work culture? Then apply directly to univativ!TasksAnalysis, evaluation and commissioning of system requirementsCreation of specialist concepts and analyzes (data and process models)Proactive process optimization to reduce complexity and costsCreation of test conceptsCollaboration on strategy topicsQualificationCompleted studies in business informatics, mathematics or business administrationExperience in the insurance industry desirableKnowledge of the common Methods and tools in analysis and designExperience as a business analyst is an advantageTechnical understanding and strong communication skillsNegotiation skills in GermanBenefitsAn annual salary between 50,000 and 60,000A permanent position directly with our customerFeedback within a very short timeNetworking in various industriesSupport from a personal talent coachVarious further training opportunities in our e-AcademyWe were able to arouse your interest ? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/business-analyst-munich-127163","tags":["IT"],"job_types":[],"location":"Munich","created_at":1702396145000,"original_language":"deu"},{"slug":"steuerfachangestellter-steuerfachwirt-mit-homeoffice-in-frankfurt-180485","company_name":"Stoneberg","title":"Tax clerk \/ tax specialist (m\/f\/d) with home office in Frankfurt","description":"I am pleased to be able to introduce you to an outstanding career opportunity at my partner law firm in Frankfurt. Are you a tax clerk or tax specialist (m\/f\/d), would you like to grow and take on tasks and responsibilities? Then you've come to the right place! Tasks Comprehensive and responsible support of accounting mandates Preparation of monthly reports (reports), annual financial statements and tax returns Review of tax assessments Correspondence with offices and authorities Assessment of tax issues Preparation of payroll and salary statements as well as answering tax and social security questions Qualifications Successfully completed training as a tax clerk (m \/f\/d) and, if necessary, further qualification as a tax specialist (m\/f\/d)Several years of professional experience in the tasks mentioned, ideally in a tax consultancy firm Confident use of DATEV and MS Office programs Very good knowledge of spoken and spoken English is desirable WritingProfound knowledge in the area of ​​taxes and accounting as well as in the application of HGB and tax lawBenefitsA self-responsible and varied area of ​​responsibilityAn attractive remunerationModern workplace with a central location in FrankfurtVery good connection to public transport Helpful team that wants to achieve goals together The possibility of working from homeSupport from internal and external Further trainingA long-term, professional perspectiveFlexible working hours and a modern workplace in a future-oriented companyIf you are looking for a challenging position in a dynamic environment and would like to further develop your skills in tax consulting, we look forward to receiving your application as a tax clerk (m\/f\/d) or tax specialist ( m\/f\/d).Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/stoneberg\/steuerfachangestellter-steuerfachwirt-mit-homeoffice-in-frankfurt-180485","tags":["Finance"],"job_types":[],"location":"Frankfurt","created_at":1702396145000,"original_language":"deu"},{"slug":"sachbearbeiter-ordermanagement-stuttgart-161237","company_name":"Zeel GmbH","title":"Sachbearbeiter Ordermanagement(m\/w\/d)","description":"Personalverwaltung ist de? ... aber nicht fr Dich!Wir suchen eine\/einenSachbearbeiter HR-Administration (m\/w\/d)in StuttgartInteressiertst Du Dich fr neue Technologien? Bist Du ein echter Teamworker, weltoffen und interkulturell interessiert? Im internationalen Umfeld wolltest Du schon immer einmal arbeiten?Worauf wartest Du noch - hier ist Deine Chance!  Unser Auftraggeber ist als europischer Software-Hersteller mit ber 20.000 Mitarbeitenden auf der ganzen Welt vertreten. Das Unternehmen entwickelt High-Performance Software fr hochrealistische Darstellungen von Design und Entwicklung bis zu Marketing und Vertrieb und ist Marktfhrer in seinem Sektor. Werde Teil eines Unternehmens, das die Nutzung virtueller Umgebungen antreibt und so fr mehr Nachhaltigkeit in den verschiedensten Branchen wie z.B. Energiewirtschaft, Medizintechnik, Transport oder Maschinenbau sorgt.Als Recruiting Company helfen wir unserem Kunden, Verstrkung fr sein Team zu finden und untersttzen das Unternehmen bei der Suche nach neuen Talenten.Das gibt es zu tunIm Ordermanagement berwachst Du das Bestellsystem, insbesondere kontrollierst und genehmigst Du Bestellungen und Verlngerungen von SoftwarelizenzenDu untersttzt die Vertriebsteams und Hndler im operativen Geschft. Dabei kmmerst Du Dich um nicht-technische Serviceanfragen der Hndler, schlgst Lsungen vor und stellst pnktliche Quartalsabschlsse sicherDu sorgst dafr, dass die Kundendaten korrekt, vollstndig und konsistent sind (Kunden Repository) und Vertriebsprozesse sowie Kundenvertrge eingehalten werden.Auch fr die ordnungsgeme Erstlieferung der Produkte (Licence Keys, Media- und Cloud Zugnge) bist Du verantwortlichDeine Ideen sind gefragt: Verbesserungvorschge zu den Betriebsablufe und Arbeitsmethoden sind herzlich willkommenDas bringst Du mitDu hast eine Ausbildung oder ein Studium im kaufmnnischen Bereich abgeschlossenWenn Du bereits Berufserfahrung im Sales Support im internationalen Kontext hast wre das ideal. Aber auch als aufgeschlossener Quer- oder Berufseinsteiger bist Du herzlich willkommenDu hast gerne Kontakt zu MenschenSehr gutes Deutsch und flieendes Englisch sind VoraussetzungDu bist fit in MS Office - insbesondere Excel und PowerpointDas ist unserem Mandanten wichtigWenn Du dich gerne um operative Aufgaben und Fragestellungen kmmerst, ein Auge frs Detail hast und Dich in einem professionellen, internationalen Geschtsumfeld wohl fhlst passt es perfekt!Du erkennst Dich wieder?Auch wenn nicht alle Punkte auf Dich zutreffen, freuen wir uns Dich kennenzulernen und ber die Mglichkeit einer Zusammenarbeit mit Dir zu sprechen! Basics & GoodiesGut verdienen: Attraktives Gehalt plus BonuszahlungenEin sicherer Job in einer Zukunftsbranche bei einem GrokonzernWork-Life Balance: Es gibt eine Gleitzeitregelung und Du kannst sicher 2 Tage pro Woche mobil arbeitenFreude bei der Arbeit mit netten Kollegen\/innen im internationalen UmfeldFachlich am Ball bleiben: Es gibt viele Weiterbildungsangebote und eine eigene Schulungsplattform mit ber 8.500 InhaltenBeruflich vorankommen mit Karriereprogrammen und natrlich den Chancen, die ein Wachstumsunternehmen bietetProfessionelle Ausstattung: Dich erwartet eine moderne, ansprechende ArbeitsumgebungAngenehmes Betriebsklima - hier wirst Du fachlich und persnlich geschtztKein Stau \/ keine Parkplatzsuche: Top Erreichbarkeit mit ffentlichen VerkehrsmittelnDeine Vorteile mit ZeelDu bist auf Jobsuche und wnschst Dir sowas wie eine gute Fee an Deiner Seite, die Dir Tipps gibt welcher Karriereschritt genau fr Dich der richtige ist? Jemand der Dir hilft, Deine Bewerbungsunterlagen optimal aufzubereiten und Dich auf Dein Vorstellungsgesprch vorbereitet. Vielleicht auch jemanden der wei, wie hoch Du Dein Gehalt ansetzen kannst? Dann bist Du bei uns genau richtig. Wir sorgen dafr, dass Du Dich optimal bei Deinem Wunscharbeitgeber prsentierst und Du die besten Chancen hast erfolgreich zu sein. Unser Versprechen an DichDu mchtest wechseln? Das bleibt unter uns! Deine Bewerbung wird mit hchster Diskretion behandelt. Vom ersten Bewerbungsschritt bis zur Vertragsunterzeichnung sind wir an Deiner Seite und beraten Dich whrend des gesamten Einstellungsprozesses - selbstverstndlich zu jederzeit kostenlos. Du hast Fragen? Dann greif zum Hrer oder schreib uns eine Mail.__Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/zeel-gmbh\/sachbearbeiter-ordermanagement-stuttgart-161237","tags":["HR"],"job_types":[],"location":"Stuttgart","created_at":1702396144000,"original_language":"eng"},{"slug":"senior-qa-engineer-baufinanzierung-munich-171869","company_name":"CHECK24","title":"(Senior) QA Engineer (m\/f\/d) Baufinanzierung","description":"Since 2014, CHECK24 Baufinanzierung has proudly pioneered innovation in a market traditionally centered around on-site services. We specialize in helping customers secure financing solutions tailored for their dream homes, online.  We are looking for a highly motivated (Senior) QA Engineer, eager to take ownership and keen to help automate our ever evolving QA environment in ways that will put a big smile on the faces of both Developers and Product Managers.  Since we value your time, this is what you would be working with: Java 17, Selenium, WebDriver\/Appium, PageObjects, TestNG, Maven, Jenkins, Jira, Bitbucket, Slack, Confluence and many others.  Interested? We are looking forward to your application as a (Senior) QA Engineer at CHECK24 Vergleichsportal Baufinanzierung GmbH.TasksTest Automation using Java, Selenium, WebDriver\/AppiumOwn your tasks end-to-end: from comprehension, through implementation and pull requests, to delivery into Production #agile #clean-codeParticipate in a rotational process for analyzing, prioritizing, and resolving failing tests #stability #shared-responsibility #kaizenAssist the QA Team keeping the projects technologically up-to-date and reducing technical debt #longterm-mentalityCoordinate with developers for app updates and with product managers for new test requirementsRequirementsMultiple years of development experience as a QA Engineer or Software DeveloperHighly proficient at Test Automation using Java, Selenium and WebDriverAppium experience for Android\/iOS is a plusEager to take ownership #not-just-a-cog-in-a-wheelVery good communication skillsEffective organizational and time management skillsFluent written and spoken English. German is a plusBenefitsStable, established online company with start-up energy, offering open-ended contractsDirectly impact the product, adding real value for our customersInternational, driven team in one location, not spread throughout the worldDiverse growth opportunities: soft skills workshops, leadership development, and technical certificationsEnjoy a flat hierarchy with minimal bureaucracyWell-connected office location, easily accessible by public transportVouchers for numerous CHECK24 products and a subsidized company pension schemeWe celebrate successes together at numerous eventsOffice perks including free coffee, tea, fruits, vegetables, muesli, milk, breakfast and lunch multiple times per weekFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/check24\/senior-qa-engineer-baufinanzierung-munich-171869","tags":["Quality Assurance","Inspection"],"job_types":["professional \/ experienced"],"location":"Munich","created_at":1702396144000,"original_language":"eng "},{"slug":"junior-marketing-manager-trade-marketing-hamburg-260078","company_name":"worqity","title":"Junior Marketing Manager (w\/m\/d) Trade Marketing","description":"As a Junior Marketing Manager (f\/m\/d) Trade Marketing, you are in good hands with our customer, an international trading group based in Norderstedt. Tasks Planning and control of national and international trade marketing campaigns Development and implementation of digital and stationary POS solutions Procurement of Advertising material Carrying out evaluations of trade marketing activities Controlling agencies, service providers and suppliers Qualifications Completed studies in the field of marketing \/ business administration or comparable qualification (first) professional experience in trade marketing Very good knowledge of German and English Strong communication skills and creativity Team skills and an analytical way of working complete your profile Benefits Permanent employment contract with an international trading company 30 days VacationAn annual salary between 38,000 - 42,000 gross p.a. (classification according to experience) with a 38.5-hour week Home office option (2-3 days \/ week) Flexible working hours Subsidy for the HVV ticket Further training offersAre you interested? Simply click on \"Apply now\" or apply directly via our online portal and we will find your new dream job together with you! Your contact: Gizem Kilinc Junior Recruitment Consultant Tel.: 040 46 898 07 0Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/worqity\/junior-marketing-manager-trade-marketing-hamburg-260078","tags":["Marketing and Communication"],"job_types":[],"location":"Hamburg","created_at":1702396144000,"original_language":"deu"},{"slug":"testmanager-munich-239474","company_name":"Q-Centric GmbH","title":"Testmanager (m\/w\/d)","description":"We are a young IT consulting company with a focus on agile and development-oriented quality assurance of software and products. The focus of our work is: Support in the transformation into automation, primarily in quality assurance Support in the realization of high-quality software products Development of test automation solutions and workflows Tasks Analysis, design and creation of test scenarios and test cases Execution of software tests in all test levels, as well as the associated documentation, analysis and Evaluation of test resultsCreation and presentation of test reportsOptimization and expansion of our existing agile or continuous integration environments for development and testingTechnical analysis of development and testing toolsOther area of ​​responsibility: Test planning including resource planning, error management, test object delimitation, test base definition, test execution and test evaluationContinuous improvement of agile test processes as well as consulting and coaching our Customers in this environment Further development of their own test processes\/workflows and tools Qualifications Completed studies in (business) computer science, mathematics, economics or a comparable education At least three years of experience with agile development methods as an IT test manager or Scrum Master Sound knowledge in the area of ​​test analysis and test design , test execution and test evaluation, you bring with you know-how in techniques such as test driven development or continuous integration, experience with test management and\/or test automation tools (Jira, XRay, TestRail, Selenium, Ranorex, etc.)ISTQB \"Certified Tester Foundation Level \" Certification and knowledge of insurance processes are an advantageVery good knowledge of German and EnglishAbility to adapt to changes, be proactive and take initiativeBenefitsInnovative and international environment with the most modern technologiesReimbursement of tickets or fuel vouchersFlexible working time models, health management, 30-day vacationIndividual further training and development and regular Team eventsNice office in Munich with perfect subway connections, business laptop & smartphone, free coffee, water and fruitAttractive salary based on your individual skills, professional experience and qualificationsSubsidy for company pension schemeThe security of a permanent positionTeam spirit, open doors, first-name culture, lived diversitySounds great? Then we look forward to receiving your application!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/q-centric-gmbh\/testmanager-munich-239474","tags":["Quality Assurance","Inspection"],"job_types":["berufserfahren"],"location":"Munich","created_at":1702396144000,"original_language":"deu"},{"slug":"senior-recruiting-specialist-bei-der-interim-group-in-berlin-382469","company_name":"interim Group - interim Group Leipzig GmbH","title":"Senior Recruiting Specialist (m\/w\/d) bei der interim Group in Berlin","description":"Nothing shapes the success of a company as clearly as its employees. That's why we, the interim Group, have specialized in finding the perfect employees for our customers. We see ourselves as a competent HR & recruiting agency for all companies from startups to corporations. As a consulting agency, we support the staffing of locations, offer social media recruiting via structured active sourcing processes, develop and\/or optimize recruiting strategies and relieve the burden on human resources departments, hiring managers and management. Tasks DO YOU SEE YOURSELF IN THIS ROLE? THEN YOU SHOULD BE INTERESTED IN THE FOLLOWING TASKS: Active sourcing and creative approach to candidates via the platforms XING, LinkedIn, etc. Social media channels Implementation of recruiting & HR projects from the start of the project until after the probationary period has been passed Regional recruiting at the customer's site Responsibility for the entire recruiting lifecycle Continuous development of recruiting \/ HR skills Participation in our team events (from laser tag, to spontaneous picnics in the park, to our legendary Christmas parties) Qualifications IN ADDITION TO YOUR INTEREST IN THE HR INDUSTRY, YOU SHOULD BRING THE FOLLOWING: Relevant professional experience in Recruiting area (including active sourcing) High customer orientation and fun in determining needs Enthusiasm for current and future recruiting and human resources methods IT affinity and quick comprehension Knowledge of German at native level and fluent EnglishBenefits THE FOLLOWING BENEFITS AWAIT YOU IN OUR TEAM: A quick one Promotion to team lead for our 2nd recruiting team in Berlin and individual training opportunities Flexible working time and work location models that fit your life A great team that is always at your side, even in challenging project situations Modern IT equipment with iPhone and MacBook Job Wheel Free time for volunteer activities DO YOU RECOGNIZE YOURSELF IN THE DESCRIPTION? THEN I LOOK FORWARD TO YOUR APPLICATION AND WILL ALSO BE AVAILABLE TO ANSWER YOU FOR ANY QUESTIONS.Linda Syrbe Managing Director RecruitingT: + 49 176 4787 5518Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/interim-group-interim-group-leipzig-gmbh\/senior-recruiting-specialist-bei-der-interim-group-in-berlin-382469","tags":["HR"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702396144000,"original_language":"deu"},{"slug":"werkstudent-it-intranet-frankfurt-282456","company_name":"univativ GmbH","title":"Werkstudent (m\/w\/d) IT - Intranet","description":"As soon as possible, until March 1st, 2024, with an option to extend | 20 hours per week | Frankfurt am Main | Transport & Traffic | Working student | 14 to 17 per hour | Project ID A202345180_1Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Are you studying (business) information technology and want to gain your first professional experience during your studies? IT is your passion and you want to further expand your expertise? Then we are looking for you as a working student (m\/f\/d) IT! We offer you an exciting career start in the project of our customer in the transport sector. In this responsible position you can contribute your knowledge and gain valuable practical experience. In addition to a promising career start, you benefit from the training opportunities through free workshops and training in our univativ academy! Task processing of required documentation Creation of intranet pages to provide information in the context of information security \"Mapping of processes in Jira Participation in meetings Qualification Ongoing studies in computer science, business informatics or comparable Business fluent German - and English skillsKnowledge of using Jira\/ConfluenceIndependent and proactive way of workingBenefitsAn hourly wage between 14 and 17 The possibility of working 80% remotely from homeUp to 2,000 bonus for recommending yourself to friendsIndividual coaching as preparation for the presentation to the customerVarious further training opportunities in our e-AcademyWe Were you able to arouse your interest? Great! We look forward to receiving your application. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/werkstudent-it-intranet-frankfurt-282456","tags":["IT"],"job_types":[],"location":"Frankfurt","created_at":1702396144000,"original_language":"nds"},{"slug":"junior-wirtschaftsingenieur-marktanalyse-automotive-hanover-235985","company_name":"univativ GmbH","title":"(Junior) Industrial Engineer (m\/f\/d) Market Analysis Automotive","description":"As soon as possible, until December 1st, 2024, with an option to extend | 40 hours per week | Hanover | Automotive industry | Career starter, experienced professional | 45,000 to 54,000 per year | Project ID W202345172_1Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Have you successfully completed your technical studies and have initial professional experience in the automotive industry? Do you also work reliably and independently? Then we are looking for you as a (junior) industrial engineer (m\/f\/d) with a focus on technical documentation. As part of your project assignment, you will work on competition analysis and technical development. The technical data from various competitor vehicle models is collected here and must be updated regularly. You are responsible for the regular maintenance and creation of data records in the CARS data warehouse module and are responsible for creating various data sheets. Our customer is one of the largest automobile manufacturers in the world. In addition to individual support from univativ, exciting tasks await you in a well-known company. Sounds interesting? Then we look forward to receiving your application and getting to know you in person soon! Tasks Continuous research, analysis and documentation of the current market situation for newly available vehicles Creation and maintenance of data records in the data warehouse module CARS Input, checking and processing of technical attributes Creation of package\/engine objects and Browsing dataDocumentation of sources and data setsQualificationA completed degree in industrial engineering, mechanical engineering, mechatronics or comparableFirst practical experience in, as well as a strong interest in, the automotive sectorA confident use of MS Office productsFluent in written and spoken GermanAn independent and independent way of workingBenefitsAn annual salary between 45,000 and 54000 The possibility of working 100% remotely from home within GermanyPersonal project supportIndividual coaching as preparation for the presentation to the customerVarious further training opportunities in our e-AcademyUp to 2,000 bonus for recommending to friendsWe were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-wirtschaftsingenieur-marktanalyse-automotive-hanover-235985","tags":["Engineering"],"job_types":[],"location":"Hanover","created_at":1702396144000,"original_language":"nds"},{"slug":"people-operations-manager-hr-generalist-berlin-399884","company_name":"Clark Germany GmbH","title":"People Operations Manager \/ HR Generalist (m\/w\/d)","description":"CLARK, active since 2015, has a clear vision: to enable everyone to live a worry-free life. Our mission is to make insurance optimization easy for everyone. With our app, customers have a central place to manage and optimize their insurance contracts quickly, transparently and effortlessly. Our secret to success? An outstanding experience based on first-class technology and personal advice. With over half a million satisfied customers and more than 400 dedicated employees from over 40 nations, we are proud of our CLARKees. You will work in our offices in Berlin, Frankfurt, Saarbrücken or from home and contribute to implementing our mission on a daily basis. Building on our rise to becoming a unicorn, we would like you to accompany us on our path to success! We are now looking for you as our People Operations Manager \/ HR Generalist (m\/f\/d) to support our fantastic team. Your tasks: Contact person for employees for all HR inquiries. Participation in HR projects on a strategic and operational level. Creation and adaptation of HR documents (employment contracts, guidelines, etc.). Compilation of HR key figures (number of employees, fluctuation, etc .).Preparatory payroll accounting and HR controlling.Management of digital and analog files, as well as process optimization & administration in our HR systems (Personio, Leapsome).Support with attendance recording, attendance recording, on-\/offboarding and documentation of processes and policies in our Clark.net.What we are looking for:Several years of experience as an HR generalist or in a comparable position.University degree in human resources management or related disciplines.In-depth knowledge of labor, tax and social security law.Fluent written and spoken German and English.Professional Appearance with a strong service mentality.Excellent time management skills and independent working style.Experience with HR information systems, preferably Personio, as well as ability to work in a team and fit with the company values: Care, Simplicity & ReliabilityYour benefits:An environment with a strong culture and international colleagues from across the globe 40 different countriesFlexible working models, with home office and excellent offices in Berlin, Frankfurt and Saarbrücken and working from abroad for 183 days \/ yearCompany pension scheme and other personal insurance with top conditions Extensive range of exclusive discounts for employeesVarious further training programs (e.g. B. our Lunch & Learn Program) & mentors who support you every day 30 days of paid vacation and additional “impact” days to volunteer and make a difference Legendary team events with trips to Frankfurt, Berlin and Saarbrücken Diversity is important to us at CLARK at heartWe create an ideal working environment for committed, initiative-taking and talented people; Regardless of origin, identity, religion and age, we do everything we can to offer everyone the same chances and opportunities. Sounds exciting? It is! We look forward to getting to know you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/clark-germany-gmbh\/people-operations-manager-hr-generalist-berlin-399884","tags":["HR"],"job_types":[],"location":"Berlin","created_at":1702396144000,"original_language":"deu"},{"slug":"people-operations-manager-hr-generalist-berlin-496009","company_name":"Clark Germany GmbH","title":"People Operations Manager \/ HR Generalist (m\/w\/d)","description":"CLARK, active since 2015, has a clear vision: to enable everyone to live a worry-free life. Our mission is to make insurance optimization easy for everyone. With our app, customers have a central place to manage and optimize their insurance contracts quickly, transparently and effortlessly. Our secret to success? An outstanding experience based on first-class technology and personal advice. With over half a million satisfied customers and more than 400 dedicated employees from over 40 nations, we are proud of our CLARKees. You will work in our offices in Berlin, Frankfurt, Saarbrücken or from home and contribute to implementing our mission on a daily basis. Building on our rise to becoming a unicorn, we would like you to accompany us on our path to success! We are now looking for you as our People Operations Manager \/ HR Generalist (m\/f\/d) to support our fantastic team. Your tasks: Contact person for employees for all HR inquiries. Participation in HR projects on a strategic and operational level. Creation and adaptation of HR documents (employment contracts, guidelines, etc.). Compilation of HR key figures (number of employees, fluctuation, etc .).Preparatory payroll accounting and HR controlling.Management of digital and analog files, as well as process optimization & administration in our HR systems (Personio, Leapsome).Support with attendance recording, attendance recording, on-\/offboarding and documentation of processes and policies in our Clark.net.What we are looking for:Several years of experience as an HR generalist or in a comparable position.University degree in human resources management or related disciplines.In-depth knowledge of labor, tax and social security law.Fluent written and spoken German and English.Professional Appearance with a strong service mentality.Excellent time management skills and independent working style.Experience with HR information systems, preferably Personio, as well as ability to work in a team and fit with the company values: Care, Simplicity & ReliabilityYour benefits:An environment with a strong culture and international colleagues from across the globe 40 different countriesFlexible working models, with home office and excellent offices in Berlin, Frankfurt and Saarbrücken and working from abroad for 183 days \/ yearCompany pension scheme and other personal insurance with top conditions Extensive range of exclusive discounts for employeesVarious further training programs (e.g. B. our Lunch & Learn Program) & mentors who support you every day 30 days of paid vacation and additional “impact” days to volunteer and make a difference Legendary team events with trips to Frankfurt, Berlin and Saarbrücken Diversity is important to us at CLARK at heartWe create an ideal working environment for committed, initiative-taking and talented people; Regardless of origin, identity, religion and age, we do everything we can to offer everyone the same chances and opportunities. Sounds exciting? It is! We look forward to meeting you!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/clark-germany-gmbh\/people-operations-manager-hr-generalist-berlin-496009","tags":["HR"],"job_types":[],"location":"Berlin","created_at":1702396144000,"original_language":"deu"},{"slug":"bilanzbuchhalter-munich-484789","company_name":"univativ GmbH","title":"Accountant (m\/f\/d)","description":"From now on, long term | 40 hours per week | Munich | Personnel services | Career starter, experienced professional | Project ID A202341612_8Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you have a high affinity for numbers and an analytical way of thinking and work in a goal-oriented manner? Then don't wait any longer and get started with univativ! We offer you exciting and innovative projects for our customers. If you are looking for a job with diverse development opportunities where you can contribute and further develop your knowledge and skills, this is the right project for you! Tasks Processing of external reporting including carrying out the closing entries Independent preparation of the monthly financial statements according to IFRS and the annual financial statements according to the HGB Preparation and coordination of the Required annual financial statement documentsAccompaniment of auditsOrganization of all processes in the accounting departmentsQualificationCompleted studies or commercial trainingAdditional qualification in accounting, desirableVery good HGB and tax law knowledgeStructured way of working and reliabilityNegotiation-fluent knowledge of GermanBenefitsFeedback within the shortest possible timeCorporate shopping and discounts for selected fitness studiosLong-term employment possibility with the option of a permanent contract employmentSupport from a personal talent coachVarious further training opportunities in our e-academyWe were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/bilanzbuchhalter-munich-484789","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702396144000,"original_language":"deu"},{"slug":"sachbearbeiter-zahlungsverkehr-munich-489862","company_name":"univativ GmbH","title":"Clerk (m\/f\/d) payment transactions","description":"From now on, long-term, with option to take over | 40 hours per week | Munich | Personnel services | Career starter, experienced professional | Project ID A202341611_9Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you have completed commercial training? Are you communicative and work agile? Even in stressful situations, do you remain calm and keep an eye on what's important? Then our position as a clerk (m\/f\/d) is just right for you! Our customer, a public law institution based in Munich, needs support to implement his project. You will gain insights into the processes of a successful company and gain valuable professional experience. Are you interested in getting started with us? Then apply now!TasksSupporting internal colleagues in international, large-value and express payment transactionsProcessing payments from all relevant customersIntroduction to the bank's relevant systemsEnsuring smooth payment transactionsQualificationCompleted studies in the field of economics or training as a bank clerkFirst knowledge of international payment transactions an advantageExcellent communication and team skillsCustomer orientation and service abilityFluent in German and EnglishBenefitsThe possibility of working remotely from homeAn annual salary between 40,000 and 50,000Personal project supportIndividual coaching as preparation for the presentation to the customerVarious further training opportunities in our e-AcademyWe were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/sachbearbeiter-zahlungsverkehr-munich-489862","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702396144000,"original_language":"deu"},{"slug":"controller-munich-256512","company_name":"univativ GmbH","title":"Controller (m\/w\/d)","description":"From now on, long term | 40 hours per week | Munich | Personnel services | Career starter, experienced professional | Project ID A202341614_8Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you impress with your great affinity for numbers and analytical thinking? Do you enjoy questioning critical data and deriving promising recommendations for action? Then let’s talk about vacancies with our customers! We work with companies from various industries and support you in your job search in controlling. Sounds good? I'm looking forward to hearing from you! In this exciting project with our customer in the personnel services sector, you will support a dynamic and committed team in a responsible position, get to know the industry comprehensively and work with different tasks, preparing and carrying out monthly and annual financial statements analysis of numbers and creation of evaluations Carrying out target\/actual comparisons Processing project controlling Budgeting and forecasting Qualifications Completed degree in business administration or comparable field Study focus or practical experience in the area of ​​controlling Very confident in using MS Office, especially MS Excel Numbers affinity and analytical way of thinking Business fluent German and fluent English skills Benefits Feedback within the shortest possible time Corporate shopping and discounts for selected fitness studiosLong-term employment opportunity with the option of permanent employmentSupport from a personal talent coachVarious further training opportunities in our e-academyWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/controller-munich-256512","tags":["Finance"],"job_types":[],"location":"Munich","created_at":1702396144000,"original_language":"deu"},{"slug":"pr-marketing-manager-berlin-142197","company_name":"advanced store GmbH","title":"PR \/ Marketing Manager (m\/w\/d)","description":"advanced store GmbH, founded in Berlin in 2008, offers data-driven and scalable digital marketing solutions. We act worldwide as a service provider for digital advertising in the areas of performance display ads, native ads and social media ads. We support customers in Germany, Austria and Switzerland, plan and coordinate online campaigns for them, analyze performance and develop optimization suggestions. We present our company at events and coordinate various marketing activities to further increase our awareness. Can you identify with this or is this just the right new challenge for you? Then become part of our team!TasksHere you will be passionately involved:Project management end-to-end: Responsibility for marketing campaigns (product marketing, brand marketing, sales promotions) from concept to briefing, rollout and review to all relevant customer touchpoints (online\/offline )Active participation in the positioning of the company in the public eye. Manage the company's homepage and social media channels. Support launch measures for new products in close cooperation with internal specialist departments, e.g. development, product management and controlling. Review for images and layouts. Commission and coordinate external service providers, such as agencies , photographers and printing companies Participation in external industry events Observation of trends and competition as well as the derivation of new marketing concepts for targeting customers. Qualifications You are a good fit for us if: You have completed training (ideally with a focus on marketing\/sales or comparable) You want to work dynamically, love quick decisions and Ideally, you have already gained several years of professional experience in marketing or PR. You have basic knowledge of SEA and SEO. You have experience in inbound and B2B marketing, as well as knowledge of lead generation. You are not a yes-man: We live by thinking about things differently You need someone who is brave enough to break new ground. You have a feel for trends, viral hits and current marketing topics. You speak German and English and are very good at speaking and writing. You are a team player with a creative, solution-oriented, independent and proactive way of working. Benefits. This is what we offer: The opportunity to work independently and implement your own ideasflat hierarchies & cooperative working atmosphereA boss who puts people firstModern office with a magnificent view over BerlinPossibility to work from anywhere, should working in the office not be your thingUnrestricted private life, thanks to flexible working hoursGrowing number of vacation days annually Automatic salary increase Advantages of various benefits (fitness, mobility, etc.) Regular team events, company celebrations and company trips Employee discounts from various companies Does that sound too good to be true? See for yourself and send us your detailed application with the next possible starting date.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/advanced-store-gmbh\/pr-marketing-manager-berlin-142197","tags":["Remote","Marketing Manager"],"job_types":[],"location":"Berlin","created_at":1702396144000,"original_language":"deu"},{"slug":"junior-talent-acquisition-manager-darmstadt-95824","company_name":"Ergotopia GmbH","title":"Junior Talent Acquisition Manager (m\/w\/d)","description":"Wir sind Ergotopia, ein E-Commerce Unternehmen in Deutschland mit der Vision,die Arbeitswelt happy, healthy & productive zu gestalten!  Unsere Grndungsgeschichte nimmt ihren Anfang 2014 mit unseren beiden CEOs Richard und Alex - und ihrer Infografik ber die Auswirkungen von dauerhaftem Sitzen. Diese ist der Ausgangspunkt fr einen Online Shop, mit dem Ziel, Rckenschmerzen zu verringern und ein schmerzfreies Leben zu ermglichen. Basierend auf dem Wunsch, einen ganzheitlichen Lsungsansatz zu entwickeln, hat sich um unser Portfolio der ergonomischen Brombel und Zusatzhelfer eine Ergotopia Welt entwickelt.Mit einem modernen E-Commerce Shop, digitalen Gesundheitslsungen und evidenzbasierten Inhalten untersttzen wir heute ber 200.000 Firmen- und Privatkunden dabei, das ideale Arbeits- und Lebensumfeld zu schaffen.Und zu uns knntest auch du gehren!AufgabenAt the end of the day, it all comes back to people.Du verstehst Mitarbeitende nicht als Human Resources, sondern als Talente, die es zu gewinnen gilt? Du hast Lust, deine Karriere im spannenden Recruiting & Employer Branding Umfeld zum Fliegen zu bringen?Dann haben wir einen Job fr dich!The Best Team Wins: Du screenst Bewerbungen und fhrst tiefgehende Erstgesprche. Dabei coachen wir dich, mit Business Knowhow und psychologischen Best Practices Entscheidungen treffen zu knnenWe call it Management: Du hast Lust darauf Talent Acquisition Prozesse ganzheitlich zu denken. Dazu gehren interne Absprachen mit Hiring Managern, die Auswahl der richtigen Interview Prozess Formate und konstante OptimierungenCandidate Experience: Du gehst fr deine Kandidaten die Extrameile. Wir arbeiten menschlich und mit Menschen und sorgen fr die besten Prozess- und KommunikationserfahrungenAttract Attract Attract: Active Sourcing und Employer Branding (Fokus LinkedIn & Career Page) sind fr dich keine Fremdworte. Du bist gespannt, hands-on einzutauchen und mitreiende Posts zu erstellen, die Talente anziehenOKRs: Du bernimmst Quartalsprojekte rund um Talent Acquisition, Employer Branding & Co, welche auf den Unternehmenserfolg einzahlenPeople & Culture: Als Team involvieren wir uns gemeinsam in verschiedenen People Themen wie Eventmanagement, Mitarbeiterentwicklung oder AdministrationQualifikationDu hast idealerweise erste Erfahrung im modernen Talent Acquisition und Employer Branding durch eine Anstellung, Praktika oder Werkittigkeit. E-Commerce sowie Start-Up Background ist von VorteilEinen Studienabschluss sehen wir gerne, das Studiengebiet ist fr uns weniger wichtig als konzeptionelles Denken und energievolle kommunikative FhigkeitenDu bewegst dich im Growth & Learning Mindset. Mit Offenheit fr Feedback, Neugierde und Leidenschaft nimmst du neue Themen und Projekte als positive Challenge anDu lebst Ownership. Verantwortung zu bernehmen und Dinge von A-Z durchzudenken liegt in deinem Naturell. Dazu berzeugst du mit einer hohen Selbstorganisation, Struktur bei gleichzeitiger Agilitt sowie dem Drive, richtig was zu bewegen. Dabei bringst du Teamspirit mit und involviert dich in gemeinsamen ProjektenDu fieberst darauf hin, einen Track of Record an besetzen Positionen mit glcklichen Kandidaten aufzubauen. Dabei sind Valuefit und Potenzial fr dich genauso relevant wie fachliche Kompetenzen. Eine nahbare, schnelle und positive Candidate Journey zu garantieren ist dein AnspruchDu identifizierst dich mit unserer Vision und Kernwerten und trittst als Ergotopia Ambassador nach innen und auen aufDu sprichst und schreibst Deutsch auf verhandlungssicherem Niveau sowie Englisch flieendBenefitsDein Beitrag auf dem Weg zu unserer Vision: Die (Arbeits)-Welt happy, healthy & productive zu gestaltenDie Chance, deine Karriere in einem der wachstumsstrksten Office Furniture E-Commerce Start-Ups Deutschlands auf das nchste Level zu hebenTop Coaching und Mentoring - auch in direkter Zusammenarbeit mit unserem C-LevelEin Team, welches wirklich ein Team ist. Spa garantiert! Validiert durch Office Vibe und KununuEdenred-Card mit monatlich 50,00 Euro steuerfreiem Sachbezug oder die Option auf einen EGYM WellpassCompany-Events, Afterwork Get Together sowie Teamevent-Budget auf AbteilungsebeneBroausstattung mit ergonomischen Brombeln, Klimaanlage, Office Dog Policy sowie Snacks & GetrnkeMitarbeiterrabatt auf unser Portfolio - auch fr Friends & Family sowie exklusive Rabatte durch einen Corporate Benefits ZugangInternes Mitarbeiterempfehlungsprogramm mit Incentivierung ber GehaltsbonusFlexible Arbeitszeiten und Hybridkultur (Mind. 1x pro Woche Office, bis zu 4x pro Woche Home Office) I Standort Darmstadt oder KlnEin monatliches Personal-Development-Budget von 50,00 Euro inklusive optionalem Bookbeat und Blinkist Abo, um dich in deinem Wachstum zu untersttzen30 Tage Urlaub, um die Welt zu entdeckenFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ergotopia-gmbh\/junior-talent-acquisition-manager-darmstadt-95824","tags":["HR"],"job_types":["berufseinstieg"],"location":"Darmstadt","created_at":1702396144000,"original_language":"eng"},{"slug":"product-manager-digital-health-cologne-392946","company_name":"BetterDoc GmbH","title":"Product Manager (m\/f\/d) Digital Health","description":"About this position\"Your help is hard to put into words, because you offer a service that you would think only millionaires get! If I could, I would give you 13 out of 10 points.\"- Heidrun, 74 years (for learning more on her case, please read until the end)Join BetterDoc's innovative Product Development Team, where your expertise as a Product Manager will revolutionize healthcare by connecting patients with the best possible medical care.The Product Development TeamOur mission is to serve 1 million customers in 2028. For that we built the software to acquire, admit and steer patients to physicians who can best treat themWe value curiosity and learning - to support this, we offer dedicated time for personal development and growth.We are proud to trust our people instead of controlling them. Our team organizes itself and reflects on how to improve our working mode.We depend on self-motivation. We offer a lot and count on you to grab what you need.Your missionIncrease scope, quality and completeness of healthcare provider data for productivity and automationEnsure viability and support desirability and feasibility of our productChoose the right opportunities for frequent experimentation and deliberate implementationEnhance and refine product metrics on our business and manage their life-cycleWork closely with data analytics colleagues and always have the latest on deviations, impact and trendsCollaborate with our product operations and contribute by inspiring and driving adoption of effective practisesBe a key driver of the product roadmap for your areas of responsibilityClosely collaborate with designers and strengthen our empathy for all personasYour profileMust-haveBachelor's degree or equivalent practical experience> 2 years of experience in product management or similar servant leadership experienceExperience effectively working cross-functionally with different teams and business units (eg: Product Management, QA, Engineering, UX\/UI, Operations, Business Development).Experience in driving the elements of the product development lifecycle such as discovery product vision, go-to-market strategy, requirements engineering, and product launch.Proficient use of BI or Analytics toolsAbility to present complex matters in simple termsPassion to engage and communicate with domain experts and customersExperience in software development, the possibilities of technology and deep understanding of the needs of engineers you've worked with previouslyStrong plusExperience in Data Handling, incl. Data Governance and MaintenanceExperience in the healthcare industry in GermanyAt BetterDoc, you will work to deliver value, not to fulfill a spec. We value curiosity, the will to learn and the drive to deliver great software. We look for people that want to see their influence on what was created and who are proud of their craft. Your place of work is in or within reasonable distance of Cologne to allow you to work closely with our management team even if most of the work is remote.Please be aware that if you do not live in a country belonging to the European Union or are planning to move to the EU, we cannot follow up on your application. What BetterDoc offers youAn organization built on trust instead of controlDedicated time for personal development and growthNo travel, Ready for remote work, Flexible working hoursAn interesting and challenging job with excellent development prospects and creative possibilities and the opportunity to raise the \"quality in health\" for millions of peopleDedicated time for personal developmentJob ticket for local transportation if you are based in CologneInternational working atmosphere in a motivated and high-caliber teamState of the art hardwareUsing our service for free... and last but not least: helping people like Heidrun:The senior citizen has been suffering from pain in her legs and feet when walking for several years. Her previous doctor diagnosed peripheral arterial occlusive disease in both legs.The patient underwent surgery to insert stents, but only a slight improvement was achieved. The 74-year-old is very unhappy with the results of the operation and her health situation.The specialist recommended by BetterDoc examines the senior citizen thoroughly and then suggests that the circulatory problems are caused by a narrowing of an abdominal artery. He refers her to hospital to have this clarified. An angiography is carried out there and the specialist's suspicions are confirmed: the patient has a severe narrowing of an abdominal artery, which is responsible for the pain in her legs.This can be removed by surgery and the patient's pain can finally be treated causally.Interested?You want to support us on our exciting mission and change the healthcare market? Then apply now! You can upload your application documents in our . Your contact person in Human Resources is Jonas Topp (). Our CTPO is Steffen Glomb. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/betterdoc-gmbh\/product-manager-digital-health-cologne-392946","tags":["Marketing and Communication"],"job_types":["professional \/ experienced"],"location":"Cologne","created_at":1702396144000,"original_language":"eng"},{"slug":"senior-bi-analyst-marketing-analytics-im-bereich-digital-health-cologne-92519","company_name":"BetterDoc GmbH","title":"Senior BI Analyst (m\/f\/d) - Marketing Analytics in the area of ​​Digital Health","description":"About this positionWho is the right doctor or clinic for my situation? Who has the most experience with my condition? Choosing the right doctor has a significant impact on the success of the treatment. We know from experience that internet research into the quality of doctors and clinics is time-consuming and frustrating for laypeople. Targeted marketing can hardly be distinguished from actual competence and quality. With BetterDoc, the patient has access to the crucial information: We find the best possible doctor for the personal situation, based on reliable data.Your tasksYou take responsibility for changing the healthcare system in Europe and beyond. You are part of a rapidly growing digital health company. With your work, you will help 1 million people in 2028 receive the best possible treatment from the right doctors or clinics. To achieve this, you will provide data technology to our employees and customers. In your role as (Senior) BI Analyst: You will significantly drive the conception and development of our marketing analytics and use your analytical and methodological expertise to optimize our marketing activities and address each patient in a targeted manner. You will provide and develop valuable data insights Deep data understanding to guide stakeholders and product teams to make the right business decisions. You will design, create and maintain meaningful dashboards to visualize data insights in Superset, provide datasets for a self-service BI and further develop existing dashboards. You will develop Our BI and analytical data warehouse continues and collects, analyzes and processes complex data. You can identify trends early on and notify other departments of anomalies and interesting developments. Will you help Data & Analytics in the coming years with your knowledge of augmented analytics or code to further develop interpreter.Do you drive automation and thus contribute significantly to the scaling of marketing channels?You will become part of a central platform team and work closely with all product teams to enable decentralized processing and use of data.You will report to the Head of Data & Analytics.Your profileMaster's degree in (bio)informatics, (bio)statistics, mathematics or a similar qualification related to data analyticsSeveral years of experience in visualizing marketing insights, key figures and trends with reporting tools such as Superset or Power BIBroad knowledge About possible BI solutionsComprehensive programming knowledge in SQLExtensive programming knowledge in Python or RYou have knowledge of current developments in the machine learning environment - scoring, cluster algorithms or segmentation are no foreign words for youExperience in evaluating business events from transactional systems is an advantageExpert knowledge in the areas of data modeling and data processes and OLAP cubesYou speak English fluently, German is a strong plus.You are a self-confident team player and have excellent written and oral communication skills, especially with stakeholders and managementYou are interested in data-driven issues in the field of medicine and within the healthcare systemWhat BetterDoc offers youAn interesting one and challenging work with excellent development prospects and creative opportunitiesFree space for creativity and personal developmentTraining and seminars to further deepen your knowledge and become a perfect expert in data engineeringThe chance to raise the topic of \"quality in medicine\" to a level that is unique in Europe and help millions of people with your workA motivated and top-class team (data scientists, developers, etc.)Possibility to participate in the long-term incentive programFlexible working hours & remote workInternational working atmosphereGermany ticket for local transport with a subsidy from BetterDocLatest hardware (Macbook Pro)Subsidy for Urban Sports Club company pension scheme (bAV) with 30% employer subsidy Additional flexibility through work actions within the EU Have we aroused your interest? Do you want to support us on our exciting mission and change the healthcare market? Then apply now! You can upload your application documents (letter of motivation, CV, certificates) to our application portal below. We look forward to seeing you! You can find further information on how to handle your data at: Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/betterdoc-gmbh\/senior-bi-analyst-marketing-analytics-im-bereich-digital-health-cologne-92519","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Cologne","created_at":1702396144000,"original_language":"deu"},{"slug":"consultant-crm-direktvermittlung-munich-109884","company_name":"univativ GmbH","title":"Consultant (m\/w\/d) CRM - Direktvermittlung","description":"As soon as possible, long-term, in permanent position | 40 hours per week | Munich | Personnel services | Experienced professional, career starter | 55,000 to 65,000 per year | Project ID P202343007_7Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you have a professional appearance, a strong team spirit and experience with CRM systems? Are your communication skills excellent in German and English? Then we are looking for you as a CRM manager (m\/f\/d) to manage small to larger projects. Apply now! In this exciting project with our customer in the personnel services sector, you will support a dynamic and committed team in a responsible position, thereby getting to know the industry comprehensively and working with different partner companies. Are you looking for a promising career start? Then send us your application today! Tasks Implementation of consulting projects with a focus on customer relationship management in different industries Support in the selection, introduction and implementation of new CRM processes and systems Analysis of requirements and development Understanding of comprehensive business processes Advice and support for our customers in the digital Transformation of customer management and CRMDevelopment and implementation of strategies and approach concepts in digital customer managementQualificationCompleted studies, preferably in business administration with a focus on marketing\/sales\/CRM or business informaticsFirst professional experience in CRM, customer value management, customer analytics and\/or customer experience managementVery good analytical and conceptual skills , problem-solving skills as well as an independent and systematic way of workingPresentation and communication skillsFluent in German and EnglishBenefitsAn annual salary between 55,000 and 65,000A permanent position directly with our customerThe possibility of working remotely from homeA personal project supportIndividual coaching as preparation for the presentation to the customerVarious further training opportunities in our e-AcademyWe could arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/consultant-crm-direktvermittlung-munich-109884","tags":["Marketing and Communication"],"job_types":[],"location":"Munich","created_at":1702396144000,"original_language":"deu"},{"slug":"junior-finance-executive-german-speaking-munich-402176","company_name":"Adriane Maps  GmbH","title":"Junior Finance Executive - German Speaking (m\/f\/x)","description":"Are you passionate about driving financial excellence in a dynamic environment? We're seeking a Junior Finance Executive to join our team and to assist in the strategic financial operations. You'll play a pivotal role in shaping and optimizing our financial processes, ensuring compliance with German regulations while implementing modern technological solutions.TasksOversee and refine operational and strategic control mechanisms to optimize financial performance.Lead robust accounting practices and ensure accurate, timely financial reporting.Drive financial planning initiatives and craft comprehensive reports for informed decision-making.Spearhead budgeting strategies and oversee their effective execution.Deliver concise reports on revenue and cost metrics to the CEO, enabling informed strategic decisions.Create and uphold processes in alignment with German legal standards.Design and implement measures leveraging modern technologies to optimize and automate financial processes in finance and accounting.RequirementsBA\/Masters degree in economics\/business administration.Minimum 2 years of relevant experience in finance, accounting, or banking.Proficient in DATEV for effective financial analysis and reporting. Knowledge Power BI will be considered an asset.Strong conceptual and analytical capabilities to drive strategic financial decisions.Confident in both German and English languages for effective communication.BenefitsFlexible working hours  were focused on getting the job done.Permanent employment in a fast-growing SaaS company step-changing the location intelligence industry.Awesome team and company events  because the fun part should not be neglected.Great company spirit: flat hierarchies, a lot of creative freedom, working independently, and, of course, a cool team.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/adriane-maps-gmbh\/junior-finance-executive-german-speaking-munich-402176","tags":["Finance"],"job_types":["executive"],"location":"Munich","created_at":1702396144000,"original_language":"eng "},{"slug":"automation-engineer-insurtech-hamburg-94801","company_name":"CHECK24","title":"Automation Engineer (m\/w\/d) InsurTech","description":"We at CHECK24 in Hamburg are growing and are looking for an Automation Engineer (m\/f\/d) InsurTech! Are you enthusiastic about the world of automation & would you like to take our internal services to the next level? Then we should definitely get to know each other! With us you can contribute your knowledge to the team and learn something new every day! Get an initial picture of what DevOps means at CHECK24:Agile working: in KanbanLarge company, small teams & short communication channelsTech stack: Python We look forward to receiving your application as an Automation Engineer (m\/f\/d) InsurTech at the CHECK24 comparison portal for Krankenversicherungen GmbH.TasksYou provide services, especially in the areas of on- and offboarding, centrally and thereby support more efficient use.You work closely with our helpdesk and 2nd-level teams to implement technical and professional projects. You will continuously monitor and analyze our applications to ensure an optimal user experience for our employees (m\/f\/d). Your responsibility is to automate our internal services, which will make processes more efficient and increase overall performance. You will support and develop relevant components for monitoring and Alerting to keep an eye on the status of our services at all times. In this way, you make a significant contribution to ensuring the stability and performance of our systems. You design and implement interfaces for communication with internal and external services, which ensures smooth interaction and data transfer. Qualifications Due to the professional experience you have gained, you have very good knowledge of development and scripting with Python. You have already been able to Gain experience in automationYou have good knowledge of the administration of Linux system environments (Ubuntu \/ Debian)Experience in dealing with virtual machines (e.g. Promox) and databases (e.g. MySQL) is an advantageBenefitsAttractive salary package: On top of that, we offer vouchers for numerous CHECK24 products , a subsidized company pension scheme and the full inflation compensation premium. Work-life balance: possibility of mobile working \/ home office (3 days in the office, 2 days flexible) as well as up to 4 weeks of mobile working from abroad possible. Modern infrastructure: regular retrospectives for continuous further development our joint collaborationDeveloper Experience: A large and unique developer community is looking forward to getting to know you! Deeply rooted in Hamburg's tech community, we regularly host a variety of meet-ups, code reviews and speakers on site. Extensive health package: flexible health budget and the opportunity to take part in our joint sporting activities (football, table football, Alster runs, back fitness on the roof terrace etc.) CHECKito spirit: With us you can expect a relaxed working environment with a first-name culture, regular drink-outs and cool team events! For a break, there is a table tennis table, table football, our grill on the roof terrace and the unique view over the Auenalster. We equip you with: Ergonomic workplace with modern equipment (such as MacBook, as well as additional screens) and a height-adjustable table from the first day. Sustainable mobility: Our central Location in the heart of Hamburg allows you to travel comfortably by public transport or bicycle. We offer you a very well-subsidized Germany ticket and support your company bicycle leasingFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/check24\/automation-engineer-insurtech-hamburg-94801","tags":["IT"],"job_types":[],"location":"Hamburg","created_at":1702392542000,"original_language":"nds"},{"slug":"consultant-marketing-digitalisierung-direktvermittlung-munich-338660","company_name":"univativ GmbH","title":"Consultant (m\/f\/d) Marketing & Digitalization - Direct placement","description":"From now on, long-term, with option to take over | 40 hours per week | Munich | Personnel services | Experienced professional, career starter | 50,000 to 60,000 per year | Project ID P202343006_7Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you like working in a variety of ways, are you creative but also analytically gifted? Then we are looking for you as a consultant (m\/f\/d) to develop your strengths and gain initial experience in marketing. In this exciting project with our customer in the field of personnel services, you will support a dynamic and committed team in a responsible position Position, you will get to know the industry comprehensively and work with different partner companies. Are you looking for a promising career start? Then send us your application today!TasksSupporting the customer's on-site consulting projects, with the topics of organizational and process optimizationPersonal and technical expertise for high customer loyalty and customer satisfactionDevelopment of qualified analyzes and innovative solutionsImplementation of company requirements and contribution to sustainable developmentManaging the Development and implementation of innovative conceptsOptimization of content skills and methodological know-howQualificationCompleted studies in the field of economics, marketing or comparableFirst practical experience in consulting and in the field of CRM, product innovation or marketingEnjoy interdisciplinary collaboration and solution-oriented workExcellent ability to work in a team with a great will to further developmentFluent in German and English skillsBenefitsAn annual salary between 50,000 and 60,000 The possibility of working remotely from homeIndividual coaching as preparation for the presentation to the customerPersonal project supportHybrid environments with varied tasksVarious training opportunities in our e-AcademyWe were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/consultant-marketing-digitalisierung-direktvermittlung-munich-338660","tags":["Marketing and Communication"],"job_types":[],"location":"Munich","created_at":1702392542000,"original_language":"deu"},{"slug":"public-relations-manager-schwerpunkt-redaktions-und-koordinationsaufgaben-munich-340051","company_name":"CHECK24","title":"Public Relations Manager (m\/f\/d) focus on editorial and coordination tasks","description":"Immerse yourself in the exciting world of e-commerce! If you have a fascination for digital business and at the same time have a communicative streak and love the written word, this position is perfect for you. Even in hectic times, do you keep an overview and keep a cool head? Perfect! Because exactly such characteristics are needed to enrich our new area at CHECK24 Services for Versicherungsvergleiche GmbH. We are not just looking for a (Senior) Public Relations Manager (m\/f\/d) for the InsurTech sector - we are looking for a creative and strategically thinking communications expert who is ready to redefine the boundaries of the insurance world with us. Your ability to convey messages clearly and convincingly will make a decisive contribution to positioning our innovative offering in the market. Join our team and actively shape the path of CHECK24 Services for Versicherungsvergleiche GmbH. Your application is the first step to becoming part of an exciting journey in which you can not only develop your skills, but also help shape the future of the insurance industry. Tasks Exciting PR projects and varied tasks in a dynamic e-commerce environment Content and text design of press releases and press releases, interviews, newsletters and PR plansProcessing of press inquiries as well as planning, coordination and checking of press releases and mailingsMaintaining and acquiring new press contacts (journalists, bloggers, influencers and business partners)Cross-product success control and monitoring of PR measuresQualificationA completed good degree in the field Communication sciences, public relations, media, journalismAlternatively, very well completed training as a public relations manager (m\/f\/d) with a focus on editorial and coordination tasks. At least three years of professional experience (volunteer\/trainee) in a PR agency or press office with the appropriate NetworkVery good Excel skills (e.g. a. Pivot tables, formulas, percentage calculation)Ability to analyze and enjoy working with numbersVery good knowledge of German and EnglishVery high level of communication skills and enjoyment in dealing with journalists and partnersBenefitsCreative thinking and expert knowledge of modern PR work as well as social media and influencer relationsAttractive salary package - vouchers for numerous CHECK24 products and a subsidized company pension scheme as well as the full inflation compensation premium. For your work-life balance, we offer you home office\/mobile working (3 days in the office, 2 days flexible) The opportunity to further develop your skills and knowledge and actively contribute to CHECK24 company success to contributeFlat hierarchies, demanding, challenging and varied tasks with creative freedom as well as direct communication channels to management Individual development and further training opportunities thanks to a broad training catalog and specialized personnel development for your career pathFood & Drinks: Free hot and cold drinks, various types of Msli, lunch twice a week and fresh fruit are a given for us. Our game area is a great place to take a break in between. When the weather is nice, you'll feel comfortable on our roof terraces above the roofs of Munich. We'll equip you with an ergonomic workplace with modern equipment (such as MacBook Air, as well as additional screens) and a height-adjustable table from day one. Sustainable mobility: Our central location allows you to travel comfortably public transport or bicycle - for this we offer you a very well subsidized Germany ticket and support your company bicycle leasingFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/check24\/public-relations-manager-schwerpunkt-redaktions-und-koordinationsaufgaben-munich-340051","tags":["Marketing and Communication"],"job_types":[],"location":"Munich","created_at":1702392542000,"original_language":"deu"},{"slug":"praktikant-human-resources-am-standort-berlin-261775","company_name":"allaboutHRLaw GmbH","title":"Human Resources Intern (m\/f\/d) at the Berlin location","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks We are now looking for someone to support our growing team \/n:Intern (m\/f\/d) Human Resources at the Berlin locationWhat will your tasks be?Support in the recruiting process (job placement, job updates, telephone interviews)Applicant management (scheduling and participation in the application process)Administrative day-to-day business, e.g. B. Creation of employment contracts (maintenance of personnel files and data, support of employees with questions, requesting personnel documents) Active participation in the onboarding process of new employees Independent take on of smaller projects Qualifications What sets you apart? Accurate, independent and structured way of working Communicative team player Resilience and friendliness Good user knowledge of all office programs You should have at least 3 months of time Previous knowledge of human resources is desirableBenefitsWhat do we offer you? Room for initiative, design and the opportunity to contribute your own ideas A high learning curve by taking on your own projects and demanding tasks Insights into the processes and structures of our customers Direct communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated team Are you convinced? Then become part of our success story! We look forward to receiving your complete application documents by email, stating the job title, location, possible start date and the desired duration of the internship. If you have any questions, please do not hesitate to contact us by email or telephone on 089 6429 2900Find Jobs in Germany on Work now","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/praktikant-human-resources-am-standort-berlin-261775","tags":["HR"],"job_types":["Vollzeit (temporär)","internship"],"location":"Berlin","created_at":1702392542000,"original_language":"deu"},{"slug":"linux-systemadministrator-frankfurt-133860","company_name":"univativ GmbH","title":"Linux Systemadministrator (m\/w\/d)","description":"As soon as possible, by May 1st, 2024, with the option to take over | 40 hours per week | Frankfurt am Main | Transport & Traffic | Career starter, experienced professional | 54,000 to 66,000 per year | Project ID A202344829_2Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. For our project we are looking for a system administrator (m\/f\/d) who is familiar with the administration and maintenance of servers and networks. Are you reliable, determined and sociable? There is no problem that you cannot solve? Then you are exactly the right person for this project. Our customer is a globally successful company in the transport sector and offers you a promising professional future. A wide range of tasks and a friendly working atmosphere await you. Does that sound interesting to you? Then become a part of univativ and turn your dreams into reality!TasksAutomated system provisioning with Ansible & Anaconda Kickstart for Red Hat Enterprise LinuxPatch management to regularly update RHEL systems and keep them up to dateMaintaining inventory lists, documentation and SLA reporting for IT systemsSystem & application monitoring through Icinga 1.9.2 and NRPEv3+4 as well as integration of new systems into monitoringSupport in switching to the GitOps model with GitLab as the central repository for the OpenShift Container Platform, including cluster management and optimization of applicationsQualificationCompleted studies in Computer science or comparableAt least 3 years of proven professional experience in the field of IT system administrationExcellent knowledge of Linux systems as well as in-depth experience in their administrationExperience in the planning and successful implementation of IT projects, including the introduction of new systemsResponsibility for the administration of servers and network infrastructure as well as the Support for the IT service desk and support for usersBenefitsAn annual salary between 54,000 and 66,000 Personal project supportVarious training opportunities in our e-AcademyWe were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/linux-systemadministrator-frankfurt-133860","tags":["IT"],"job_types":[],"location":"Frankfurt","created_at":1702392542000,"original_language":"deu"},{"slug":"praktikant-human-resources-am-standort-munchen-munich-22145","company_name":"allaboutHRLaw GmbH","title":"Intern (m\/f\/d) Human Resources at the Munich location","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks We are now looking for someone to support our growing team \/n:Intern (m\/f\/d) Human Resources at the Munich locationWhat will your tasks be?Support in the recruiting process (job placement, job updates)Applicant management (scheduling and participation in the application process)Administrative day-to-day business (maintenance of personnel files and data, support of the Employees with questions, requesting personnel documents)Active participation in the onboarding processIndependent takeover of smaller projectsQualificationWhat sets you apart? Accurate, independent and structured way of working Communicative team player Resilience and friendliness Good user knowledge of all office programs You should have at least 3 months of time Previous knowledge of human resources is desirableBenefitsWhat do we offer you?Room for initiative, creativity and the opportunity to contribute your own ideas A high learning curve Taking on your own projects and demanding tasks Insights into the processes and structures of our customers Direct communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated team Are you convinced? Then become part of our success story! We look forward to receiving your complete application documents by email, stating the job title, location, possible start date and the desired duration of the internship. If you have any questions, please do not hesitate to contact us by email or telephone on 089 6429 2900. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/praktikant-human-resources-am-standort-munchen-munich-22145","tags":["HR"],"job_types":["Teilzeit (temporär)","internship"],"location":"Munich","created_at":1702392542000,"original_language":"deu"},{"slug":"praktikant-human-resources-am-standort-leipzig-324259","company_name":"allaboutHRLaw GmbH","title":"Intern (m\/f\/d) Human Resources at the Leipzig location","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks To support our growing team we are looking for: Intern ( m\/f\/d) Human Resources at the Leipzig location What will your tasks be? Support in the recruiting process (job placement, job updates) Applicant management (scheduling and participation in the application process) Administrative day-to-day business (maintenance of personnel files and data, support of employees with questions, requests of personnel documents)Active participation in the onboarding processIndependent takeover of smaller projectsQualificationWhat sets you apart? Accurate, independent and structured way of working Communicative team player Resilience and friendliness Good user knowledge of all office programs You should have at least 3 months of time Previous knowledge of human resources is desirableBenefitsRoom for initiative, design and the opportunity to contribute your own ideasEnormous learning potential and steep learning curveDirect communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated team Highest possible individuality and flexible working hours that enable family and career compatibility Are you convinced? Then become part of our success story! We look forward to receiving your complete application documents by email, stating the job title, location, possible start date and the desired duration of the internship. If you have any questions, please do not hesitate to contact us by email or telephone on 089 6429 2900Find Jobs in Germany on Work now","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/praktikant-human-resources-am-standort-leipzig-324259","tags":["HR"],"job_types":["Internship"],"location":"Leipzig","created_at":1702392542000,"original_language":"deu"},{"slug":"praktikant-human-resources-am-standort-koln-cologne-245589","company_name":"allaboutHRLaw GmbH","title":"Intern (m\/f\/d) Human Resources at the Cologne location","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks We are now looking for someone to support our growing team \/n:Intern (m\/f\/d) Human Resources at the Cologne locationWhat will your tasks be?Support in the recruiting process (job placement, job updates)Applicant management (scheduling and participation in the application process)Administrative day-to-day business (maintenance of personnel files and data, support of the Employees with questions, requesting personnel documents)Active participation in the onboarding processIndependent takeover of smaller projectsQualificationWhat sets you apart? Accurate, independent and structured way of working Communicative team player Resilience and friendliness Good user knowledge of all office programs You should have at least 3 months of time Previous knowledge of human resources is desirableBenefitsWhat do we offer you?Room for initiative, creativity and the opportunity to contribute your own ideas A high learning curve Taking on your own projects and demanding tasks Insights into the processes and structures of our customers Direct communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated team Are you convinced? Then become part of our success story! We look forward to receiving your complete application documents by email, stating the job title, location, possible start date and the desired duration of the internship. If you have any questions, please do not hesitate to contact us by email or telephone on 089 6429 2900. Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/praktikant-human-resources-am-standort-koln-cologne-245589","tags":["HR"],"job_types":["Internship"],"location":"Cologne","created_at":1702392542000,"original_language":"deu"},{"slug":"praktikant-human-resources-am-standort-hamburg-493685","company_name":"allaboutHRLaw GmbH","title":"Intern (m\/f\/d) Human Resources at the Hamburg location","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks We are now looking for someone to support our growing team \/n:Intern (m\/f\/d) Human ResourcesWhat will your tasks be?Support in the recruiting process (job placement, job updates)Applicant management (scheduling and participation in the application process)Administrative day-to-day business (maintenance of personnel files and data, support of employees with questions , requesting personnel documents) Active participation in the onboarding process Independent takeover of smaller projects Qualification What sets you apart? Precise, independent and structured way of working Communicative team player Resilience and friendliness Good user knowledge of all office programs You should have at least 3 months of time Previous knowledge of human resources is desirable Benefits What can we offer you ?Room for initiative, design and the opportunity to contribute your own ideasA high learning curve by taking on your own projects and demanding tasksInsights into the processes and structures of our customersDirect communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated teamYou are convinced? Then become part of our success story! We look forward to receiving your complete application documents by email, stating the job title, location, possible start date and desired duration of the internship. If you have any questions, please do not hesitate to contact us by email or telephone on 089 6429 2900. Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/praktikant-human-resources-am-standort-hamburg-493685","tags":["HR"],"job_types":["Internship"],"location":"Hamburg","created_at":1702392542000,"original_language":"deu"},{"slug":"junior-hr-business-partner-in-teil-oder-vollzeit-hamburg-434562","company_name":"allaboutHRLaw GmbH","title":"(Junior) HR Business Partner (m\/f\/d) part-time or full-time","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks We are now looking for someone to support our growing team \/n:(Junior) HR Business Partner (m\/f\/d) part-time or full-timeWhat will your tasks be?Responsible support of a human resources departmentDetermination of personnel needs and recruitment of new employees in your area of ​​responsibilityConducting job interviews and contract discussions and employee discussionsAdvice to our employees, specialist and Managers in all human resources and labor law issuesParticipation in HR projects as well as in the optimization of all human resources processesPreparation of payrollQualificationWhat sets you apart? Completed (technical) university degree with a focus on human resources or a comparable qualification First relevant professional experience, possibly also through internships or working student positions Knowledge of human resources topics Business-fluent English skills Strong communication skills and advisory skills High level of social skills and confident appearanceBenefitsWhat do we offer? Room for initiative, design and the opportunity to contribute your own ideas Enormous learning potential and steep learning curve Direct communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated team Highest possible individuality and flexible working hours that make it possible to combine family and career If you are convinced, that your skills suit us and you would like to become part of our success story, we look forward to receiving your application documents by email, stating the location, possible starting date and your salary expectations.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/junior-hr-business-partner-in-teil-oder-vollzeit-hamburg-434562","tags":["HR"],"job_types":[],"location":"Hamburg","created_at":1702392542000,"original_language":"deu"},{"slug":"junior-hr-business-partner-in-teil-oder-vollzeit-berlin-415517","company_name":"allaboutHRLaw GmbH","title":"(Junior) HR Business Partner (m\/f\/d) part-time or full-time","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks We are now looking for someone to support our growing team \/n:(Junior) HR Business Partner (m\/f\/d) part-time or full-time at the Berlin locationWhat will your tasks be?Responsible for managing a human resources department at the customer, in particular recruiting new employees, including conducting interviewsAdvising managers on all personnel matters QuestionsSupport of employeesControl and, if necessary, introduction of performance managementParticipation in HR projects and in the optimization of all HR processesFocusing on and further developing an HR area of ​​your choiceQualificationsCompleted (technical) university degree with a focus on human resources or a comparable qualificationAt least 1 year of professional experience in HR , preferably in companies with 20-200 employeesFunctional English skillsSecure and convincing demeanor, proactivity, team and communication skillsConsultancy skills, structured and goal-oriented workBenefitsEnormous learning potential and steep learning curve, as you will look after several customer companiesDirect communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated team room for personal initiative, design and the opportunity to contribute your own ideas. Maximum individuality and flexible working hours that enable you to combine family and work, home office by arrangement. If you are convinced that your skills suit us and you would like to become part of our success story, we are happy on your application documents, stating the location, possible starting date and your salary expectations.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/junior-hr-business-partner-in-teil-oder-vollzeit-berlin-415517","tags":["HR"],"job_types":["Vollzeit (unbefristet)"],"location":"Berlin","created_at":1702392542000,"original_language":"deu"},{"slug":"hr-business-partner-in-teil-oder-vollzeit-munich-402451","company_name":"allaboutHRLaw GmbH","title":"HR Business Partner (m\/f\/d) part-time or full-time","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks We are looking to support our growing team in Munich Immediately one: (Junior) HR Business Partner (m\/f\/d) part-time or full-time What will your tasks be? Independent support of a human resources department Determining personnel needs and recruiting new employees in your area of ​​responsibility Conducting job interviews and contract discussions and employee discussions Advising our employees, specialist - and managers in all human resources and labor law issues Participation in HR projects as well as in the optimization of all human resources processesPreparation of payrollQualificationWhat sets you apart?Completed (technical) university degree with a focus on human resources or a comparable qualificationFirst relevant professional experience, possibly also through internships or Working student activityKnowledge of human resources topicsFluent in negotiating EnglishPronounced communication skills and advisory skillsHigh level of social skills and confident demeanorBenefitsWhat do we offer?Room for initiative, design and the opportunity to contribute your own ideasEnormous learning potential and steep learning curveDirect communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated teamHighest possible individuality and Flexible working hours that enable a work-life balance If you are convinced that your skills suit us and you would like to become part of our success story, we look forward to receiving your application documents by email to , stating the location and possible starting date and your salary expectations.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/hr-business-partner-in-teil-oder-vollzeit-munich-402451","tags":["HR"],"job_types":[],"location":"Munich","created_at":1702392542000,"original_language":"deu"},{"slug":"finance-manager-in-teil-oder-vollzeit-ab-10-20h-woche-leipzig-244299","company_name":"allaboutHRLaw GmbH","title":"Finance Manager (m\/f\/d) part-time or full-time from (10-20h\/week)","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks To build up our company, we are looking for people from the beginning of 2024 Leipzig location or remotely: Finance Manager (m\/f\/d) part-time or full-time from (10-20 hours\/week) What will your tasks be? Pre-accounting and booking of all business-relevant transactions Processing of incoming invoices Preparation of monthly financial statements and sales tax reports Preparation of Evaluations, e.g. B. Customer profitability calculationLiquidity planningIntroduction of other necessary financial processesPreparation of tax returns and balance sheets, ideally preparationFirst point of contact for our customers and employees in the area of ​​financeQualification What sets you apart? Several years of professional experience in the area of ​​finance and accountingExcellent analytical and strategic skillsEntrepreneurial thinking, hands-on mentality and great desire to create A way of working characterized by reliability and independence Strong IT affinitySecure use of MS Office and DatevYour profile is rounded off by strong communication skills, strong team spirit and commitmentBenefitsWhat to offer we? Room for initiative, design and the opportunity to contribute your own ideas Enormous learning potential and steep learning curve Direct communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated team Highest possible individuality and flexible working hours that make it possible to combine family and work If you are convinced that If your skills suit us and you would like to become part of our success story, we look forward to receiving your application documents by email to Tereza Sommerfeld, stating the possible starting date and your salary expectations.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/finance-manager-in-teil-oder-vollzeit-ab-10-20h-woche-leipzig-244299","tags":["Management","Team Leader"],"job_types":[],"location":"Leipzig","created_at":1702392542000,"original_language":"deu"},{"slug":"talent-acquisition-partner-recruiting-manager-bei-egym-munich-346","company_name":"interim Group","title":"Talent Acquisition Partner \/ Recruiting Manager (m\/w\/d) bei EGYM","description":"Strength training for the digital age, the state-of-the-art training concept at eGym.EGYM is a global technology leader in intelligent training solutions for the fitness and health industry. The comprehensive range of connected fitness devices and digital products can be integrated into third-party hardware and software, enabling complete integrated training with measurable results for users and operators. For businesses, EGYM offers subscription-based fitness and wellness solutions. Employees receive access to high-quality sports and health facilities as well as EGYM training programs and thereby benefit from improving their general health. To prevent costly illnesses, increase productivity and increase well-being. EGYM is headquartered in Munich with additional branches throughout Europe and a US headquarters in Denver, Colorado. Would you like to play a decisive role in shaping the future of EGYM as a growing company? Would you like to contribute your talent acquisition experience to an international and global team with locations in Germany, France and the USA to make our recruiting process even better? Then join our team in Munich as a Talent Acquisition Partner (m\/f\/d) and take on responsibility from day one. Give your career a workout and apply now!TasksYOUR DAILY WORKOUTYou support your hiring managers, especially from EGYM Wellpass, in finding the best candidates, from creating the job advertisement to selecting suitable recruiting channels and conducting interviews for the final decisionYou are responsible for the end-to-end recruiting for your positions and ensure an exceptional candidate experience up to the first day of work through appreciative communication with your applicants You use alternative personnel selection techniques and define best practices for EGYM You develop job-related strategies and Measures to attract the best talents to EGYM You will continuously develop our recruiting strategy by working on various projects (e.g. social recruiting or employer branding) and actively contributing and implementing your innovative ideas. You will act as a professional sparring partner Managers with all questions relating to recruitingQualificationYOUR FITNESS LEVELYou have at least 3 years of in-house recruiting experience in a fast-paced and international environmentYou know the latest recruiting trends and the best selection techniques and how to successfully attract highly sought-after talent on the personnel market for us You think analytically, make data-driven decisions and thus keep a cool head even in stressful times. You have a precise way of working, communicate positively, convincingly and to the point with all employees in the company. You have excellent written and oral language skills in German and English (Knowledge of French is a clear plus)BenefitsOUR TRAINING EQUIPMENTEnjoy the flair of an international company with colleagues who simply love their jobDevelop yourself further through regular feedback and become part of a team in which your ideas are heardEnjoy 30 days of vacation per year, Organize your working hours freely and benefit from a lot of flexibility - home office was part of the EGYM standard even before Corona Work remotely up to 4 weeks per year outside of Germany Benefit from our attractive company pension plan Secure a variety of great discounted offers, from fashion to leisure, in our benefit portal for employees Always keep a cool head with free coffee, tea and fruit in our ultra-modern and air-conditioned office and enjoy your lunch break on our large terrace. Train for free with EGYM Wellpass or alternatively use our in-house fitness studio for free with all EGYM equipment. Get on the pedals and take advantage of our bike leasing offer and keep fit on the way to work or in your free time. Contact person for questions and applications: Ms. Le Vi I +49 (0) 174 1584053 Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/interim-group\/talent-acquisition-partner-recruiting-manager-bei-egym-munich-346","tags":["Recruitment and Selection"],"job_types":["Vollzeit (unbefristet)","berufserfahren"],"location":"Munich","created_at":1702392542000,"original_language":"deu"},{"slug":"junior-hr-business-partner-in-teil-oder-vollzeit-esslingen-170977","company_name":"allaboutHRLaw GmbH","title":"(Junior) HR Business Partner (m\/f\/d) part-time or full-time","description":"allaboutHRLaw GmbH is a dynamic, rapidly growing consulting company that fully or partially takes over human resources work for start-ups, small and medium-sized companies, as HR as a service. We have already accompanied well-known start-ups on their way to becoming adult companies and have been supporting our customers for years. You can view references on our website. We are a team of highly motivated HR professionals working nationwide with a focus on the metropolitan areas of Berlin, Hamburg, Frankfurt\/Main, Leipzig, Dsseldorf and Munich and a cool office in Leipzig that covers all internal tasks. Tasks We are now looking for someone to support our growing team \/n:(Junior) HR Business Partner (m\/f\/d) part-time or full-time at the Esslingen locationWhat will your tasks be?Responsible support of a human resources department at the customer, in particular recruiting new employees, including conducting interviewsAdvising managers on all personnel matters QuestionsSupport of employeesControl and, if necessary, introduction of performance managementParticipation in HR projects and in the optimization of all HR processesFocusing on and further developing an HR area of ​​your choiceQualificationsCompleted (technical) university degree with a focus on human resources or a comparable qualificationAt least 1 year of professional experience in HR , preferably in companies with 20-200 employeesFluent English skillsSecure and convincing demeanor, proactivity, team and communication skillsAdvisory skills, structured and goal-oriented workBenefitsEnormous learning potential and steep learning curve, as you will look after several customer companiesDirect communication and flat hierarchies in a dynamic and exciting working environment with a highly motivated team room for personal initiative, design and the opportunity to contribute your own ideas. Maximum individuality and flexible working hours that enable you to combine family and work, home office by arrangement. If you are convinced that your skills suit us and you would like to become part of our success story, we are happy on your application documents, stating the location, possible starting date and your salary expectations.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/allabouthrlaw-gmbh\/junior-hr-business-partner-in-teil-oder-vollzeit-esslingen-170977","tags":["HR"],"job_types":["Vollzeit (unbefristet)"],"location":"Esslingen","created_at":1702392542000,"original_language":"deu"},{"slug":"mitarbeiter-in-der-produktentwicklung-qualitatssicherung-dormagen-252504","company_name":"CP-Pro Solutions GmbH","title":"Employee in product development \/ quality assurance (m\/f\/d)","description":"We at CP-Pro Solutions GmbH have been developing individual software with a focus on database-based software since 1992 and have been market leaders in the scaffolding industry for many years with our Gerstbau-Office software. Our company is characterized by many years of know-how and competent and comprehensive customer service. In our company-owned office building in Dormagen (Dsseldorf\/Kln metropolitan region), we are looking for an employee in product development\/quality assurance (m\/f\/d) to strengthen our 35-person team. .Tasks Participation in product development and quality assurance Participation in analysis, planning and implementation of IT projects including process modeling, data analysis and process optimization Creation of evaluations with SQL Creation and expansion of documentation and software manuals Qualification Completed training as an IT specialist for data and process analysis, as a software developer or comparable commercial subject Basic knowledge is an advantageUnderstanding of business and work organization contextsGood knowledge of spoken and written German, English is an advantageGood SQL knowledgeKnowledge of a programming language such as JavaScript, TypeScript or C#BenefitsA modern workplace in the newly renovated office building and the opportunity to work hybridOpen communication, flat hierarchies and a Happy working atmosphere Values ​​developed together with all employees, which are the basis of our warm and appreciative interaction An extensive further training offer with internal and external training Interested? Feel free to send us your application, Daniela Rausch is available to answer your questions throughout the entire application process. Find Jobs in Germany on Work now","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/cp-pro-solutions-gmbh\/mitarbeiter-in-der-produktentwicklung-qualitatssicherung-dormagen-252504","tags":["Quality Assurance","Inspection"],"job_types":[],"location":"Dormagen","created_at":1702392542000,"original_language":"deu"},{"slug":"junior-projektingenieur-wegerecht-hanover-243251","company_name":"univativ GmbH","title":"(Junior) Project Engineer (m\/f\/d) Right of Way","description":"January 1, 2024, permanent, permanent position | 38 hours per week | Hanover | Basic industry | Career starter, experienced professional | 55,000 to 65,000 per year | Project ID P202344802_2Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you have a degree in civil or environmental engineering? Are you also interested in the topic of rights of way and have perhaps already gained some professional experience? Then we are looking for you as a project engineer (m\/f\/d) in the right of way! As part of your work, you are responsible for obtaining rights to build gas pipelines and managing existing rights. In addition, you will check the contractual regulations and coordinate construction work. Our customer from the energy industry is looking for your active support starting next year. In addition to an exciting activity, you can deepen and contribute your knowledge. A motivated team and other exciting benefits await you. We convinced you? Then apply today!TasksControl, regulation and support of gas and hydrogen projectsProcurement, review, administration and mediation of rights of way and easementsCoordination of right-of-way issues for the implementation of construction workReview of contractual regulations and claims of third parties as well as coordination of service providersManagement of legal transactionsQualificationCompleted studies in the field of construction or Environmental engineering or comparableBasic knowledge of dealing with rights of way, real estate or land registration is an advantageWillingness for occasional business trips to the north of GermanyA high level of teamwork and communication skillsFluent in spoken and written GermanBenefitsAn annual salary between 55,000 and 65,000A permanent position directly with our customerThe possibility of working remotely from homeFlexible Working hours30 days of vacationIndividual training opportunitiesWe were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-projektingenieur-wegerecht-hanover-243251","tags":["Engineering"],"job_types":[],"location":"Hanover","created_at":1702392542000,"original_language":"deu"},{"slug":"head-of-software-development-ingolstadt-66649","company_name":"DONAT IT GmbH","title":"Head of Software Development Ingolstadt (w\/m\/d)","description":"We are DONAT IT GmbHDynamic and innovative! Under this motto, DONAT IT GmbH has been bringing a breath of fresh air to the IT industry since 1980. Since then, we have grown steadily not only in terms of our employees and locations, but also in our service portfolio. From an IT system house to a premium IT service provider for the automotive industry. One of our most important features is the expertise we have built up over the years in the areas of software development and support. This not only benefits our customers, but especially our employees, who, as specialized all-rounders, enjoy numerous opportunities for development. WE create IT. WE run IT. WE love IT.TasksYour main areas of activity:Strategic leadershipStaff development, personnel deployment and resource planningPersonal support and personnel discussionsTesting and quality assuranceLead developer in agile development projects (SCRUM)QualificationWhat can you inspire us with?Study of (business) informatics, or a comparable qualificationExperience in a management position in the field Software development is an advantageIdeally, industry knowledge in the automotive sector Strong communication and team skillsVery good written and spoken German and EnglishBenefitsThis is what you can expect from us:Very flexible working hours for an optimal work-life balanceCompany carBike leasing via JobradOpen welcome and first-name culture in a family environmentComprehensive Possibility to work mobile Permanent employment contract with 30 days of vacation with 37.5 hours of weekly working time Further employee benefits such as discounts from local partners (e.g. fitness studios, ERCI ice hockey tickets,...) Generous subsidy for the company pension plan Are you up for a new challenge? Then we look forward to receiving your application!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/donat-it-gmbh\/head-of-software-development-ingolstadt-66649","tags":["Software Development"],"job_types":["teamleitung"],"location":"Ingolstadt","created_at":1702392542000,"original_language":"deu"},{"slug":"junior-energieingenieur-erneuerbare-energien-wolfsburg-128791","company_name":"univativ GmbH","title":"(Junior) Energy Engineer (m\/f\/d) Renewable Energies","description":"As soon as possible, permanent, permanent position | 38.5 hours per week | Wolfsburg | Personnel services | Experienced professional, career starter | 50,000 to 65,000 per year | Project ID P202344480_3Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Do you have a degree in electrical or energy engineering? Are you also passionate about the topic of renewable energies and have you already gained professional experience in this area? Then we are looking for you! As part of your work, you are responsible for construction projects, carry out network calculations and are the first point of contact. Our customer, a regional energy supplier, is looking for your active support as soon as possible. A modern working environment awaits you as well as exciting activities in which you can contribute and deepen your knowledge. We convinced you? Then apply today! Tasks Planning, coordination and acceptance of construction projects for feeding in renewable energy Taking over the preliminary planning and weighing up proposals Ensuring the stability of the networks Carrying out network calculations Contact person for internal and external stakeholders Carrying out administrative project documentation Qualifications Completed studies in electrical engineering, energy supply, supply technology, industrial engineering or comparableSeveral years of practical experience in the planning and operation of distribution networks or systems or the energy sectorFluent in spoken and written GermanA strong analytical and decision-making ability as well as a goal-oriented and conceptual approachDriving license class BBenefitsAn annual salary between 50,000 and 65,000 A permanent position directly with our customerThe possibility of remote work to work at home30 days vacationIndividual training opportunitiesPossibility to use a job bikeWe were able to arouse your interest? Great! We look forward to your applicationFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-energieingenieur-erneuerbare-energien-wolfsburg-128791","tags":["Engineering"],"job_types":[],"location":"Wolfsburg","created_at":1702392542000,"original_language":"deu"},{"slug":"junior-referent-finance-hanover-67980","company_name":"univativ GmbH","title":"(Junior) Referent (m\/w\/d) Finance","description":"As soon as possible, permanent, permanent position | 39 hours per week | Hanover | Personnel services | Career starter, experienced professional | 45,000 to 50,000 per year | Project ID P202344479_3Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. Are you passionate about the financial industry and have you already gained some initial experience? Do you also have a high sense of responsibility? Then you are exactly right with us! As part of your activities, you will act as the first point of contact, carry out market analyzes and take part in projects. Our customer, a successful company in the financial sector, is looking for new talent as soon as possible who can contribute and deepen their knowledge. An exciting field of work awaits you with an office that is centrally located in Hanover. We convinced you? Then apply today! Tasks Carrying out market analyzes Taking over the reporting Contact person for internal stakeholders, credit institutions, insurance companies, external service providers and supervisory authorities Coordinating internal processes Participation in projects Qualification Completed training as a bank or savings bank clerk or a completed economics or law degree First experience in the financial sector Knowledge of MS Office ProductsFluent in German and fluent EnglishA high level of independent, analytical and structured working style as well as fun working in a team and a high willingness to learnBenefitsAn annual salary between 45,000 and 50,000A permanent position directly with our customerThe possibility of working remotely from home within Germany for 40%Flexible working hours30 days of vacationValues Germany ticket and the opportunity to use a job bike. Individual training and development opportunities. We were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-referent-finance-hanover-67980","tags":["Finance"],"job_types":[],"location":"Hanover","created_at":1702392542000,"original_language":"deu"},{"slug":"hr-payroll-specialist-stuttgart-448087","company_name":"univativ GmbH","title":"HR Payroll Specialist (m\/w\/d)","description":"From now on, permanently | 40 hours per week | Stuttgart | Personnel services | Career starter, experienced professional | 40,000 to 50,000 per year | Project ID A202345167_1Sunivativ is a project and personnel service provider that offers students and graduates exciting jobs at renowned companies. Your career is our mission, because your development is important to us. We are looking for colleagues for our dynamic teams in Stuttgart, Ulm, Mannheim and Karlsruhe. You will get to know our business from the ground up. Of course, we will train you in all administrative HR processes. In addition to responsible tasks, we also offer you many opportunities to develop both personally and professionally. We offer you a committed team with a collegial atmosphere, a variety of tasks and a permanent, full-time position. Are you interested and want to get started with us? Then apply now and become part of univativ!TasksYou are responsible for processing all necessary personnel documents from hiring to leaving the employee. When employees leave, you also create qualifying employment references. You make all the necessary preparations for payroll accounting. Your tasks will also include administrative support for project employees such as providing master data. The collection and maintenance of all data relevant to time management is your area of ​​responsibility. In addition, you will advise your colleagues on personnel law issues. Qualifications The A: Our perfect match! We rely on people with a wide range of interests who find employee support and payroll accounting exciting and if you are already dealing with one of these topics today, all the better. For us, it is not important whether you, as a graduate, have studied business administration, human resources management or another economics course . It is important to us that you enjoy learning a lot of new things and continue to expand your knowledge even after training. The O: your personality! Are you communicative and approach your teammates proactively. Are you well organized and an enthusiastic team player? Perfect!BenefitsAn annual salary between 40,000 and 50,000 We offer you a permanent position and extensive training opportunities.With us you can be who you are, you don't have to dress up or distort yourself. This is also what we mean by diversity. In all of this, we have a common goal: success as a team to which everyone contributes. In addition, you benefit from offers such as corporate shopping. We promote individual mobility: whether it's a bike leasing or a rail card. Our office is in the heart of Stuttgart. Our office is easy to reach with the “ffis”. Nothing is set in stone for us. We are open to fresh ideas and want to continually improve our business.Choose your place of work? You can only do this with us: Depending on where you live, you can work in our offices in Stuttgart, Ulm, Mannheim or Karlsruhe. We were able to arouse your interest? Great! We look forward to your applicationFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/hr-payroll-specialist-stuttgart-448087","tags":["HR"],"job_types":[],"location":"Stuttgart","created_at":1702392542000,"original_language":"deu"},{"slug":"senior-pr-berater-healthcare-cologne-247715","company_name":"signum brands gmbh köln","title":"Senior PR-Berater (Healthcare) (m\/w\/d)","description":"signum | brands is an owner-managed, independent PR agency for health communication in the heart of Cologne. As specialists in strategy and communication, we have been advising well-known companies and organizations in the B2B and B2C sectors for more than 20 years. Our renowned customers include: one of the leading companies in the healthcare industry. From classic media work to social media and blogger relations to content management: Our passion is the development and implementation of innovative communication concepts, always with the tailor-made technical expertise of our highly motivated team. Tasks Your area of ​​responsibility Management and expansion of several budgets with budget responsibility Team leadership Strategic advice and development of communication concepts Planning, managing, controlling projects and campaigns Creation and editing of target group-specific texts (e.g. summaries of studies, press releases, etc. for medical professionals, lectures and presentations) Opinion former projects (advisory boards, symposia, KOL management projects) Content conception (e.g. lectures, charts, speaker briefings, workshops, training courses, trade press conferences, podcasts) Collaboration in the development of our range of services through digital expertise Maintaining and expanding contacts with experts and specialist journalists Qualifications What you bring with you: Completed studies, preferably with a scientific background Professional experience in in healthcare communication and in the agency sector (familiarity with the medical and healthcare market) Strong strategic and conceptual thinking Experienced in consulting and conception as well as presentation Experience in the area of ​​digital communication \/ social media Strong communication and decision-making ability Personal commitment, independent work, confident appearance Passion for communication and out -out of the box thinkingBenefitsWhat we offer youYou work in a friendly and open-minded team with flat hierarchies and individual training and further education opportunities. You can expect varied and demanding tasks from our exciting and diverse customers, which will allow you to grow and develop further.A modern office in the heart of Cologne, with a great atmosphere JobTicket or givve CardCompany pension schemeFree on Rose Monday, Christmas Eve and New Year's Eve.Flexible working hours, possibility of mobile workingIf communication is your passion, you can start promptly and you would like to become part of our highly motivated team, then we look forward to it Your meaningful online application stating your earliest possible starting date and your salary expectations.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/signum-brands-gmbh-koln\/senior-pr-berater-healthcare-cologne-247715","tags":["Public Relations","Corporate Communication"],"job_types":["berufserfahren"],"location":"Cologne","created_at":1702392542000,"original_language":"deu"},{"slug":"studentische-aushilfe-im-finanzwesen-freiburg-im-breisgau-420723","company_name":"Hofmann Leasing GmbH","title":"Student assistant (m\/f\/d) in finance","description":"Would you like to make a contribution to a sustainable future? Do you have weekly working hours between 8 a.m. and 8 p.m.? Then become part of Hofmann Leasing. Hofmann Leasing GmbH is a company from Freiburg im Breisgau that has been around for over 20 years. We, as an in-house leasing company in the Bike Leasing Group, have specialized in sustainable economic goods and want to shape the mobility of tomorrow together with you! Tasks You work at Master data maintenanceYou are involved in customer account clarification, which has an impact on the entire companyYou support financial accounting with daily tasksQualificationYou work independently, responsibly and preciselyYou are studying economics or lawYou have very good knowledge of GermanYou are familiar with MS Office programs such as Outlook, Word, Excel is a household nameBenefitsSecurity: A permanent employment relationship in our successful company Value: Benefit from performance-oriented remuneration, flexible working hours and respectful communication. Growth: Develop your potential as part of a sustainable and up-and-coming leasing company Cohesion: Work in a team with a cooperative leadership style and short decision-making processes. Take on responsibility for an independent area of ​​responsibility with varied activitiesPromotion: Take advantage of our opportunities for further training and further education in your specialist area Employee benefits: Enjoy Attractive extras such as travel allowances, Hansefit membership, company bike leasing and much more. Do you want to be part of the future? Then you've come to the right place, apply now! We value and promote the diversity of our employees' skills and therefore welcome all applications regardless of age, gender, nationality, ethnic and social origin, religion, ideology, disability as well as sexual orientation and identity.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hofmann-leasing-gmbh\/studentische-aushilfe-im-finanzwesen-freiburg-im-breisgau-420723","tags":["Finance"],"job_types":["Working student","hilfstätigkeit \/ student"],"location":"Freiburg im Breisgau","created_at":1702392542000,"original_language":"deu"},{"slug":"customer-operations-assistant-manager-kronberg-37802","company_name":"afus GmbH","title":"Customer Operations Assistant Manager (m\/w\/d)","description":"We are a regional human resources management company with many years of experience in the market. Our focus is on recruitment and 'Temp-to-Perm'. In collaboration with numerous renowned customers from various industries in the Rhine-Main region, we support candidates in their search for a new professional perspective in attractive companies. Your tasks: Comprehensive research and response to all kinds of complaints while constantly adhering to our complaint principles, including all complaints , which are addressed to the Federal Financial Supervisory Authority (BaFin), the ombudsman or to our management Responsible response to inquiries and complaints on tax topics in cooperation with our tax and reporting department Complete processing and response to all inquiries and complaints regarding Active Consent refund requests and general terms and conditions\/ PLV contradictionsEnsuring and executing the ex-ante deposit cancellation processReporting risks and potential claims in coordination with the team managementNPS - Net Promoter Score, analysis of feedback, proactive contact with participating advisorsObjective and appropriate analysis of all complaints in accordance with policies and procedures Complaint processing Proper preparation and timely transmission of all complaint reports, including the annual BaFin complaint report, as well as continuous development of our reporting Development and support of suggestions for improvement to avoid complaints, to improve the customer experience and to optimize internal processes and systems Collaboration in various projects Your profile Completed training as a bank clerk (m\/ f\/d) or comparable degreeExperience in customer service and\/or complaint managementKnowledge of tax-relevant topicsFluent in German and EnglishHigh level of quality assurance and risk awarenessCustomer-oriented, cooperative and motivatedFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/afus-gmbh\/customer-operations-assistant-manager-kronberg-37802","tags":["Business Operations"],"job_types":[],"location":"Kronberg","created_at":1702392542000,"original_language":"deu"},{"slug":"fullstack-entwickler-mit-frontend-fokus-munich-138213","company_name":"bbv Software Services GmbH","title":"FullStack developer (m\/f\/d) with frontend focus","description":"bbv Software Service GmbH based in Munich is a software service provider that develops tailor-made software solutions. Our claim: We don't want to just hack something, we want to write clean software. We rely on maximum transparent communication and enable you to contribute your ideas and thus actively participate in the design and development of bbv. Our employees are important to us. That's why, in addition to various training and further education measures, you can also have a say in your involvement in customer projects. In plain language: With us, no one is put into a project against their will. And if, contrary to expectations, you become unhappy in a project, we will find a solution together. Tasks As a full stack developer (m\/f\/d) with a focus on frontend at bbv Software Services GmbH, an exciting and diverse range of tasks awaits you. Your mission? The design and optimization of user interfaces that not only impress, but also offer maximum user-friendliness. You move in an agile environment using the most modern frameworks, such as Angular.js, vue.js or React.js.QualificationsYour native language is TypeScript or JavaScriptOther programming languages ​​expand your thinkingThe most modern frameworks such as Angular, React and vue.js from scratch[[ For you, UX\/UI are not just four letters. Practical experience with agile development methods. Familiarity with clean code principles and practices such as TDD, CI. Good knowledge of German, as our customers' requirements are often written in German. If you then add your built applications with backend systems, we're really looking forward to it (REST API\/GraphQL API) - first experience in Java would be great here. Optionally, we're looking forward to: mastering the command line, helping to create blog posts about your field of activity, supporting the team in the further development of their work internal geek culture and if you stop by our monthly regulars' tableBenefitsRight of co-determination in project selectionIndependence in time and place - remote share of up to 94% per year possibleContinuing education measures that are individually tailored to you14 training days per yearInternal events such as our annual gathering (multi-day) , Focus Days and HackathonsVisits to specialist conferences (charged as working time)Visits to communities such as Meetups, JUG etc. (each charged with 2 hours of working time) Competent colleagues for the productive exchange of your ideas and experiencesDirect and transparent communication culture, practiced open error culture, flexible and complete overtime compensation, fixed salary ( without variable components - you know what you get)30 days vacationWould you like to contribute your expertise to us and become part of our successful team? Then apply with your CV and our colleague Nina will get in touch with you. Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/bbv-software-services-gmbh\/fullstack-entwickler-mit-frontend-fokus-munich-138213","tags":["Remote","Web Development"],"job_types":["berufserfahren"],"location":"Munich","created_at":1702392542000,"original_language":"deu"},{"slug":"quality-manager-vollzeit-hybrid-grafelfing-86987","company_name":"Buah GmbH","title":"Quality Manager (m\/f\/d) - full-time, hybrid","description":"Do you love quality and strive to constantly improve it? Then the position as Quality Manager at buah could be perfect for you! WHO WE AREWe are an up-and-coming start-up from Munich that has been producing healthy snacks since 2015 and has set itself the goal of becoming the #1 love brand for healthy snacks by 2031 to become in Europe. We are looking for makers to help us exceed our quality standards. Are you ready to create wow moments? You can choose whether you want to support us on site, hybrid or completely remotely. Tasks YOUR CONTRIBUTION TO THE SUCCESS STORY We are looking for you as a Quality Manager to independently take on a variety of tasks in our product team. You will work closely with purchasing, product development, operations and customer support. The following are the most important work results of your role: Sensory and physical testing of raw materials before and after filling Processing of complaints and coordination with customer support Data analysis to identify irregularities and derive opportunities for improvement Responsibility for Compliance with organic control and other certifications Auditing and training of our suppliers and packaging service providers Development of a new test plan to ensure analytical quality Conducting or commissioning shelf life tests and deriving measures Introduction, enforcement and tracking of new quality standards Analysis of our processes for risks to product quality Food law assessments Qualification WHAT YOU HAVE IN YOUR BAG A completed degree in the field of food technology\/chemistry, food safety, quality management or a comparable qualificationExperience (min. 3 years) in quality assurance, quality management or a similar function in the food industry or manufacturing sector Good knowledge of Excel\/Google Spreadsheet High quality understanding and an eye for detail A positive attitude and passion at work because you love what you do You live the \"hands-on\" \"on\" mentality and is not only committed to your goals, but also to the fact that we can only be successful as a team. You are solution-oriented and, when faced with challenges, pick up the phone to address things directly. Excellent analytical skills and logical thinking. Business fluent in German and fluent in English languageGeneral willingness to travel & driving license (visiting suppliers, co-packers, etc.)BenefitsWHAT WE CAN OFFER YOUResponsibility: Your chance to build a start-up and play a decisive role in its rapid growthShort decision-making processes: A young, dynamic working environment with flat hierarchiesHighly motivated team: We work value-oriented (We inspire. We are doers. We are professionals with heart. We are realistic optimists. We are honest & real.) Steep learning curve: Your opinion is sought and a steep learning curve is guaranteedTeam Events: Experience the cohesion of our team at joint team eventsWe are #lifelonglearners: You receive your own annual budget for workshops\/seminars to further your chosen career : worth 100 per monthHome office: Flexible home office optionsIf the requirements fit and you would like to get started together with us, then send us your detailed application documents, including the earliest possible start date and salary expectations.We look forward to getting to know you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/buah-gmbh\/quality-manager-vollzeit-hybrid-grafelfing-86987","tags":["Management","Team Leader"],"job_types":[],"location":"Gräfelfing","created_at":1702392542000,"original_language":"deu"},{"slug":"senior-software-engineer-c-typescript-100-remote-hanover-124050","company_name":"LYNQTECH GmbH","title":"Senior Software Engineer (C#\/Typescript) - 100% Remote","description":"Message from the development teamHi, we are looking for reinforcements for our platform team. We are currently working on building an Internal Developer Platform (IDP) - consisting of a variety of services, tools and libraries. It is important to us that you quickly take responsibility for parts of the IDP and enjoy developing strategies independently and implementing them in the organization. See you at the interview, Ole & Maxim Tasks You will work with us with this stack C # (.NET Core)GoTypescriptNodeJSExpress \/ Loopback (BFF Pattern)Docker & KubernetesAWS (e.g. Cloudfront & S3)CI\/CD (Drone, Jenkins)GithubProject management tools like Confluence & JiraAngular (latest version)QualificationYou will feel comfortable with us if you end-to-end -Take responsibility for your work.You are willing to share and impart knowledge across teams.You like to help shape and think beyond the horizon of the IDE.You have experience in dealing with microservice architectures.BenefitsYour benefits:We want you with everything your ideas, visions and nonsense in your head. We offer you a lot for this: the latest hardware, modern working models (we are particularly proud of our 100% remote jobs!) or current technologies. We support you individually in your personal and professional development. Whether regular feedback, individual training, company fitness, whatever. Grow with us - you wouldn't be the first person to make it from student work to permanent employment! Our office is large and air-conditioned, the drinks are cold, your seating is ergonomic and oh yes, there is a table tennis table and good music. Are you missing something? Spread your ideas! We don't just work together, we achieve great things. And we celebrate these successes. Team events, Christmas market, film evenings in the office, hanging out on the river - that's LYNQTECH too. What we expect from you: Getting to know your own team in the first 30 days. Technical and content onboarding. Warming up with architecture and infrastructure. The first commits.In the first three months, get an overview of the service architecture of the team and the company and take responsibility for areas of your own team.Work on librariesWork on internal toolingWork on multi-client capability & configuration managementWork on CI\/CD processesOwnership for sub-projectsIn the first yearFull overview of the service architecture & working methods of the company.Initiating and implementing your own projects in your area of ​​responsibility.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/lynqtech-gmbh\/senior-software-engineer-c-typescript-100-remote-hanover-124050","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Hanover","created_at":1702392542000,"original_language":"deu"}]