[{"slug":"softwareentwickler java nuremberg ","company_name":"isento GmbH","title":"Softwareentwickler (m\/w\/d) Java","description":"Any fool can write code that a computer can understand. Good programmers write code that humans can understand.  Martin FowlerDas siehst du genauso? Dann freuen wir uns darauf Dich kennenzulernen!Wir sind isento (portug.: frei) und realisieren IT-Projekte in Nrnberg von der Konzeption bis zum Rollout. Als Software Developer bringst Du Dich bei der Entwicklung mageschneiderter Lsungen fr die Herausforderungen unserer Kunden ein. Dabei leben wir Teamwork, Austausch und das permanente von- und miteinander Lernen. So entwickeln wir Software und auch uns selbst stets weiter.AufgabenDein Job bei isentoEntwickle Softwareanwendungen mit Java, Spring Boot und aktuellen Webtechnologien wie AngularAbwechslungsreiche Aufgaben im gesamten Software-Lifecycle: Konzeption, Architektur, Entwicklung, Test, Deployment, ...Gestalte mit und bernimm Verantwortung  ob in Deinem agilen Team oder darber hinausProjekte fr lokale Kunden und hauseigene ProduktentwicklungWeiterentwicklung durch projektbergreifenden Austausch und individuelle WeiterbildungQualifikationDas bringst Du mitLeidenschaft fr Softwareentwicklung, Motivation stetig dazu zu lernen und Dein Wissen zu teilenMehrjhrige Projekterfahrung in der SoftwareentwicklungIdentifikation mit agilen Werten und strukturierte ArbeitsweiseFundierte Kenntnisse in Java und sicher im Umgang mit Datenbanken, Cloud- und Webtechnologien, Git, DevOpsGute Deutschkenntnisse (mind. B2)BenefitsDas ist isentoFlache Hierarchen, flexible Arbeitszeiten und Home Office sind schon lange kein Alleinstellungsmerkmal mehr, sondern gehren fr uns zu einer modernen Arbeitskultur. Auf was Du Dich bei uns also sonst noch freuen kannst:Wir arbeiten als Team auf Augenhhe. Wir leben den offenen Austausch, bringen Eigeninitiative, neue Ideen, aber auch konstruktive Kritik ein. Wir lernen von- und miteinander, entwickeln uns zusammen weiter und feiern gemeinsam auf unserer Dachterrasse. Egal ob Rinder- oder Seitansteak, Couchpotato oder Adrenalinjunkie, mit Familie, Katze oder Kakadu  wir sind ein buntgemischtes Team, wir sind isento! Komm in unser Team und bringe Deine Individualitt ein. Wir freuen uns auf Dich!Was wir sonst noch bieten? Besuche unsere Website unter www.isento.deoder schicke Deine Bewerbung und wir lernen uns kennen!Was wir sonst noch bieten? Besuche unsere Website oder schicke uns Deine Bewerbungsunterlagen und wir lernen uns kennen!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/softwareentwickler-java-nuremberg-211904","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000},{"slug":"it fachinformatiker munich ","company_name":"MY Humancapital GmbH","title":"IT-Fachinformatiker (m\/w\/d)","description":"Suchen Sie einen zuverlssigen Partner, der Ihnen bei der Stellensuche in Mnchen hilft? Dann sind Sie bei der MHC goldrichtig! Profitieren Sie von der langjhrigen Erfahrung unserer Experten. Dank der vertrauensvollen Zusammenarbeit mit zahlreichen Unternehmen knnen wir Ihnen jederzeit mageschneiderte Jobmglichkeiten anbieten. Verzichten Sie auf das Schreiben zahlreicher Bewerbungen. Gemeinsam finden wir Ihren Traumjob  und das vllig kostenfrei!Im Auftrag unseres Kunden suchen wir Sie zum nchstmglichen Zeitpunkt als als IT-Fachinformatiker (m\/w\/d).AufgabenAls Fachinformatiker (m\/w\/d) fr Systemintegration konfigurieren und berwachen Sie alle NetzwerkkomponentenDabei kmmern Sie sich um die Einrichtung, Konfiguration und Instandhaltung von Servern, PC-Arbeitspltzen, Netzwerkdrucken und weiterer HardwareZudem stellen Sie die Systemverfgbarkeit sicher, indem sie technische Probleme analysieren und behebenDie Wartung sowie Optimierung der Systeme fllt zustzlich in Ihr zuknftiges AufgabengebietDank Ihrer Expertise werden Sie Projekte eigenstndig planen und umsetzenQualifikationSie haben eine erfolgreich abgeschlossene Ausbildung im IT-Bereich (z.B. zum Fachinformatiker (m\/w\/d) fr Systemintegration, Kaufmann (m\/w\/d) fr IT-Systemmanagement, IT-Systemkaufmann (m\/w\/d), )Alternativ verfgen Sie gerne auch ber ein Studium im IT-BereichIdealerweise haben Sie bereits Berufserfahrung in der IT-Administration sammeln knnenSie zeichnet vor allem Ihre Kenntnisse im Umgang mit Windows Servern und Linux Betriebssystemen ausSie verfgen ber eine ausgeprgte analytische Denkweise und berzeugen durch Ihre selbststndige, genaue und lsungsorientierte ArbeitsweiseSehr gute Deutsch- sowie gute Englischkenntnisse runden Ihr Profil abSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Andrej Oberdrfer gerne unter 089 954 287 112 zur Verfgung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/it-fachinformatiker-munich-30199","tags":["System and Network Administration"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"trainee hr im recruiting munich ","company_name":"MY Humancapital GmbH","title":"Trainee HR (m\/w\/d) im Recruiting","description":"Du hast Dein Studium erfolgreich beendet und mchtest nun endlich Deine Karriere starten? Dabei hltst Du Ausschau nach einem aufgeschlossenen Team, das Dich als wichtigen Bestandteil sieht? Grundstzlich mchtest Du nicht irgendeinen Job annehmen  Dir liegt viel mehr daran, den idealen Karriere-Einstieg zu finden? Dann bist Du bei uns goldrichtig!Als eines der wachstumsstrksten Jungunternehmen in Mnchen suchen wir Dich als Trainee (m\/w\/d) im HR, um diesen Aufschwung voranzutreiben. Dabei bist Du fester Bestandteil im HR und wirst innerhalb krzester Zeit Deine eigenen Projekte betreuen. Bei Deiner Bewerbung sind fr uns Deine Noten zweitrangig. Vielmehr ist uns wichtig, dass wir im Team ber uns hinauswachsen, gemeinsame Ziele erreichen und dabei Spa haben!AufgabenCandidate Experience: Du wirkst aktiv beim Aufbau und der Umsetzung einer modernen Candidate Journey mit  vom ersten Kontakt bis zum Onboarding trgst du Deinen Stempel mit auf. Recruiting 2.0: Du identifizierst neue Recruiting-Kanle und entwickelst im Team neue innovative Ideen fr die Talentsuche.Job-Coaching: Du planst mit Bewerbern individuelle Karrieremglichkeiten, fhrst eigenstndig Interviews und bereitest sie gezielt auf Vorstellungsgesprche vor.Active Sourcing: Mittels Direct Search grbst Du wahre Goldstcke aus! Du sprichst gezielt und passgenau potentielle Bewerber an und gewinnst Sie fr neue, spannende Jobmglichkeiten. Ideenmanagement: Deine Meinung ist gefragt! Denn die MHC entwickelt sich immer weiter  und zwar gemeinsam mit Dir! Bring Deine Ideen und Verbesserungsvorschlge ein und gestalte die Zukunft der MHC aktiv mit (bspw. Employer Branding, Prozessgestaltung, ). QualifikationNeben einem erfolgreichen Studium oder einer Ausbildung bringst Du idealerweise bereits Berufserfahrung im Recruiting mit. Zudem berzeugst Du noch mit einigen weiteren Charaktereigenschaften: Positives Mindset: Du liebst es Neues zu lernen und Verantwortung zu bernehmen. Dabei gehst Du auch gerne mal aus Deiner Komfortzone und wchst ber Dich hinaus. Fokus: Du weit, was Du mchtest, und bringst auch das ntige Durchsetzungsvermgen sowie ein hohes Ma an Eigeninitiative mit.  Lernbereitschaft: Fehler sind Teil des Lernens. Du bist mutig, probierst gerne Neues aus und denkst stets lsungsorientiert. Mit Spa bei der Sache: Auch die positive Vibes drfen bei Dir zu keinem Zeitpunkt zu kurz kommen. Du reit andere mit Deiner Energie mit und bist immer fr einen Lacher zu haben. BenefitsMonday is Funday Kultur: Gestalte auch Du ein Arbeitsumfeld, in dem Du Dich sonntags bereits auf Montag freust. Dabei warten sympathische Teamkollegen auf Dich, die Dich mit offenen Armen empfangen und mit Dir gemeinsam Erfolge feiern. Karriere-Booster: Dich erwartet ein individuelles, 18-monatiges Traineeprogramm, das Dich in nur kurzer Zeit zum Recruiting Spezialisten macht. Wir freuen uns, wenn Du auch danach bei uns bleibst und gemeinsam mit uns Deine weiteren Karriereschritte gehst.Monday-Meal: Lets start the week right! Freue Dich jeden Montag auf ein kostenloses, gesundes Mittagessen gemeinsam mit dem ganzen Team.  Onboarding & Mentoring: Dein Onboarding erfolgt durch eine professionelle und strukturierte Einarbeitung, bei der Dir ein fester Mentor immer zur Seite steht.Motiviertes Umfeld: Auf Dich warten sympathische Teamkollegen, die Dich mit offenen Armen empfangen und mit Dir gemeinsam Erfolge feiern.Purpose: Wir stellen bei einer Vielzahl von mittelstndischen und Grounternehmen im Raum Mnchen die wichtigste Ressource sicher  die Menschen, Kollegen und Mitarbeitenden.  Knowledge is Key: Getreu nach diesem Motto wirst Du regelmig an Seminaren, Webinaren und internen Coachings teilnehmen, um Deine persnliche und fachliche Weiterentwicklung stetig voranzutreiben. And so much more: Eigenes Surface-Gert, modernes Bro im Herzen Mnchens, coole Teamevents (Europapark, Suprise-Thursday, ), frisches Obst, Zugang zu exklusiven Firmenrabatten, Du mchtest Teil der Erfolgsgeschichte werden? Dann sende uns noch heute Deinen Lebenslauf zu und Du wirst zeitnah eine Rckmeldung erhalten. Bei Fragen zum Bewerbungsprozess steht Dir Franzi Wild jederzeit unter 089 954287 104 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/trainee-hr-im-recruiting-munich-304449","tags":["Recruitment and Selection"],"job_types":["Traineeship"],"location":"Munich","created_at":1702680542000},{"slug":"mitarbeiterin marketing performance marketing in teilzeit munich ","company_name":"FLUID Design GmbH","title":"Mitarbeiter:in Marketing | Performance Marketing (m\/w\/d) in Teilzeit","description":"FLUID ist eine preisgekrnte Design und Innovationsagentur im Herzen von Mnchen, Deutschland, mit einem Partnerbro in Los Angeles, Kalifornien.Wir sind ein multidisziplinres Team, das sich auf die Schnittstelle zwischen Digitalem und Physischem spezialisiert hat. Mit unserem breit gefcherten Wissen entwickeln wir Visionen und Strategien, Produkte und ganzheitliche Designlsungen fr Kunden aus den unterschiedlichsten Branchen, von innovativen Startups bis hin zu einigen der weltweit bekanntesten internationalen Marken und Unternehmen.Bei FLUID zu arbeiten bedeutet, Teil einer enthusiastischen und bunt gemischten Gruppe von kreativen Denkern zu sein, die eng zusammenarbeiten, um Vernderungen voranzutreiben und Ideen in die Realitt umzusetzen. Wir respektieren uns gegenseitig und teilen einen starken Teamgeist. Unser Office ist ein Ort zum Wohlfhlen und Kreativ-Werden und befindet sich in einem historischen Industriegebude im Herzen des Grtnerplatz-Viertels.Zur Verstrkung unseres Teams suchen wir zum nchstmglichen Zeitpunkt eine Marketing Mitarbeiter:in (m\/w\/d) mit Schwerpunkt auf Performance Marketing in Teilzeit (20h\/Woche).Gemeinsam mit Dir wollen wir unser (Performance-) Marketing auf das nchste Level heben und dafr sorgen, dass unsere existierenden und potentiellen Kunden noch mehr von uns und unseren Services erfahren, uns leichter finden und sich von unserem Angebot begeistern lassen.AufgabenBegleitung und Untersttzung unseres B2B Marketings im Bereich Online \/ Performance Marketing - von Social Media (v.a. LinkedIn und Instagram), Google Ads ber die Erstellung von Marketing Content bis hin zu Betreuung und Performance Tracking der Website mit Google Analytics 4 (oder einer anderen Analyse-Plattform)Im Einzelnen:Auswertung der Website Performance mit Google Analytics 4 - regelmiges Protokollieren & Zusammenfassen der DatenAbleitung von Handlungsempfehlungen aus Kampagnen und Website AnalyticsPflege und Update unserer Website (wir nutzen webflow)Betreuung unserer vielfltigen Kampagnen auf unseren Social Media Kanlen (insbesondere LinkedIn & Instagram) - dabei eigenverantwortliche Pflege unseres Instagram Accounts inkl. Erstellung von StoriesErfolgsanalyse unserer Social-Media-Kampagnen: routiniertes Tracken von Followerzahlen, Impressions, Engagement und anderen KPIsInhalte fr unsere Social Media Kanle vorbereiten und verffentlichen: Bild- und\/oder Videomaterial formatieren und bearbeiten, kleinere Texte verfassenAnalyse und ggfalls Optimierung unserer Google Ads Kampagnen inkl. Budgetkontrolle und HandlungsempfehlungenAnsprechpartner:in fr unsere externe Google Ads ExpertinAktives Mitwirken und Untersttzung bei der Erarbeitung von Marketing Content in Zusammenarbeit mit den verschiedenen Design Teams und deinem Team LeadUntersttzung bei Vorbereitung und Versand des Kunden-Newsletters (wir nutzen mailchimp)Untersttzung bei der Organisation von EventsPhotos erstellen bei FLUID Events wie Weihnachtsfeiern, Firmenjubilen etc.QualifikationDu bist fit im Umgang mit GA4 Du kennst Dich top aus mit Google AdsDu bist fit im Umgang mit den Social Media Kanlen, insbesondere InstagramDu bringst ausgezeichnete Kommunikationsfhigkeiten in Wort und Schrift mit (Deutsch und Englisch - unsere Inhalte kommunizieren wir hauptschlich auf Englisch)Erfahrung im Bereich paid social \/ insbesondere dem LinkedIn- Kampagnenmanager ist ein Plus, grundlegende SEO-Kenntnisse von VorteilEin hohes Ma an Engagement, Flexibilitt und EigenverantwortungSorgfltige, ziel- und lsungsorientierte ArbeitsweiseOffenheit und KommunikationsstrkeIdealerweise (kein Muss!) hast Du schon mal mit Online-Kollaborationsplattformen wie Miro gearbeitet, kennst Dich mit webflow aus, kennst das Newsletter-Tool mailchimp.BenefitsRegelmige Lunch Talks, gemeinsame Mittagessen und verschiedene Corporate Benefits wie ein jhrliches Budget fr Weiterbildung, betriebliche Altersvorsorge, ein Recruitment Bonus, gnstiges Einkaufen ber Corporate Benefits und vieles mehr. Die Chance, in einer unabhngigen Kreativagentur zu arbeiten, Dich bei uns wirklich einbringen und etwas in der Branche bewegen.Teil eines dynamischen, talentierten und erfahrenen Teams zu sein, mit Kollegen aus vielen unterschiedlichen Kulturkreisen.Klingt nach Dir? Wenn du Lust hast, unser Team mit viel Eigenverantwortung und Einsatz zu untersttzen, freuen wir uns sehr auf deine Bewerbung! FLUID frdert Chancengleichheit und Vielfalt am Arbeitsplatz. Alle qualifizierten Bewerber werden bei der Einstellung bercksichtigt, unabhngig von Alter, Geschlecht, Herkunft, Behinderung, Orientierung, Identitt, Religion.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/fluid-design-gmbh\/mitarbeiterin-marketing-performance-marketing-in-teilzeit-munich-345293","tags":["Marketing and Communication"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"system ingenieur munich ","company_name":"MY Humancapital GmbH","title":"System-Ingenieur (m\/w\/d)","description":"Suchen Sie einen zuverlssigen Partner, der Ihnen bei der Stellensuche in Mnchen hilft? Dann sind Sie bei der MHC goldrichtig! Profitieren Sie von der langjhrigen Erfahrung unserer Experten. Dank der vertrauensvollen Zusammenarbeit mit zahlreichen Unternehmen knnen wir Ihnen jederzeit mageschneiderte Jobmglichkeiten anbieten. Verzichten Sie auf das Schreiben zahlreicher Bewerbungen. Gemeinsam finden wir Ihren Traumjob  und das vllig kostenfrei!Im Auftrag unseres Kunden suchen wir Sie zum nchstmglichen Zeitpunkt als als Systemingenieur (m\/w\/d).AufgabenAls Systemingenieur (m\/w\/d) sind Sie zentraler Ansprechpartner fr interne Mitarbeitende sowie externe DienstleisterSie stellen die Umsetzung von technischen und architektonischen Anfoderungen sicherAuerdem sind Sie fr Konzeption, Konfiguration und Weiterentwicklung der Software zustndigDabei koordinieren Sie die Projekte mit internen Schnittstellen aus der IT und weiteren Fachbereichen Als Systemingenieur (m\/w\/d) stellen Sie auerdem den 1-st und 2-nd-Level-Support fr Ihren Aufgabenbereich sicherQualifikationSie haben eine erfolgreich abgeschlossene Berufsausbildung im IT-technischen Bereich (z.B. zum Fachinformatiker (m\/w\/d) fr Systemintegration, Kaufmann (m\/w\/d) fr IT-Systemmanagement, IT-Systemkaufmann (m\/w\/d), ) oder bringen ein entsprechendes Studium (z B. Wirtschaftsinformatik) mitBerufserfahrungen im IT-technischen Bereich sind wnschenswertAuch bringen Sie eine hohe IT-Affinitt mitPersnlich zeichnen Sie sich durch Ihre zuverlssige und strukturierte Arbeitsweise gepaart mit einer ausgeprgten Kundenorientierung ausGute Englischkenntnisse runden Ihr Profil abSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 112 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/system-ingenieur-munich-436891","tags":["IT"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"2nd level support sap munich ","company_name":"MY Humancapital GmbH","title":"2nd Level Support (m\/w\/d) - SAP","description":"Suchen Sie einen zuverlssigen Partner, der Ihnen bei der Stellensuche in Mnchen hilft? Dann sind Sie bei der MHC goldrichtig! Profitieren Sie von der langjhrigen Erfahrung unserer Experten. Dank der vertrauensvollen Zusammenarbeit mit zahlreichen Unternehmen knnen wir Ihnen jederzeit mageschneiderte Jobmglichkeiten anbieten. Verzichten Sie auf das Schreiben zahlreicher Bewerbungen. Gemeinsam finden wir Ihren Traumjob  und das vllig kostenfrei!Im Auftrag unseres Kunden suchen wir Sie zum nchstmglichen Zeitpunkt als 2nd Level Support (m\/w\/d) - SAP.AufgabenAls 2nd Level Support (m\/w\/d) sind Sie fr die Lsung technischer Probleme im Zusammenhang mit SAP zustndigDabei klassifizieren, ordnen und bearbeiten Sie Tickets in SAP Sie sind zustndig fr die Zugriffsberechtigungen und -freigaben in SAP innerhalb der Organisation Sie erstellen technische Tickets und leiten diese falls notwendig weiterAuch wirken Sie bei der Verbesserung und Weiterentwicklung von Prozessen mitQualifikationSie haben eine erfolgreich abgeschlossene Berufsausbildung im IT-technischen Bereich (z.B. zum Fachinformatiker (m\/w\/d) fr Systemintegration, Kaufmann (m\/w\/d) fr IT-Systemmanagement, IT-Systemkaufmann (m\/w\/d), ) oder bringen ein entsprechendes Studium (z B. Wirtschaftsinformatik) mit Alternativ bringen Sie Erfahrungen im IT-Bereich und im Umgang mit SAP mit Zudem bringen Sie Erfahrungen im Umgang mit SAP mit Als 2nd Level Support (m\/w\/d) zeichnen Sie sich durch Ihr technisches Verstndnis und Ihre Kommunikationsfhigkeit ausSehr gute Deutschkenntnisse runden Ihr Profil abBenefitsWork Life: Beim Arbeitgeber wird viel Wert daraufgelegt, Privatleben und Karriere unter einen Hut zu bekommen (bspw. Gleitzeit, Homeoffice-Mglichkeit, usw.)Weiterbildung: Wer rastet, der rostet. Dementsprechend wird groen Wert auf die Entwicklung der Mitarbeiter gelegtTeamspirit: Sympathische Kollegen, flache Hierarchien sowie zahlreiche MitarbeitereventsEinarbeitung: Sie erwartet eine individuelle und ausfhrliche Einarbeitung von erfahrenen MitarbeitendenSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/2nd-level-support-sap-munich-164460","tags":["IT"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"it projektleiter munich ","company_name":"MY Humancapital GmbH","title":"IT-Projektleiter (m\/w\/d)","description":"Suchen Sie einen zuverlssigen Partner, der Ihnen bei der Stellensuche in Mnchen hilft? Dann sind Sie bei der MHC goldrichtig! Profitieren Sie von der langjhrigen Erfahrung unserer Experten. Dank der vertrauensvollen Zusammenarbeit mit zahlreichen Unternehmen knnen wir Ihnen jederzeit mageschneiderte Jobmglichkeiten anbieten. Verzichten Sie auf das Schreiben zahlreicher Bewerbungen. Gemeinsam finden wir Ihren Traumjob  und das vllig kostenfrei!Im Auftrag unseres Kunden suchen wir Sie zum nchstmglichen Zeitpunkt als als IT-Projektleiter (m\/w\/d).AufgabenAls Projektleiter(m\/w\/d) sind Sie fr die Koordination und Steuerung smtlicher der IT-Projekte zustndigSie stehen dem Projektteam bei fachlichen und administrativen Fragen zu den Projekten zur SeiteAuerdem kmmern Sie sich um die Dokumentation des Projektfortschritts sowie die Erstellung von monatlichen ReportingsZudem fungieren Sie als zentrale interne Schnittstelle und Ansprechpartner fr projektbezogene Fragen im IT-BereichEbenfalls zu Ihrem Aufgabengebiet zhlt die Organisation von Workshops und Schulungen fr das IT-TeamQualifikationSie haben eine erfolgreich abgeschlossene Ausbildung im IT-Bereich (z.B. zum Fachinformatiker (m\/w\/d) fr Systemintegration, Kaufmann (m\/w\/d) fr IT-Systemmanagement, IT-Systemkaufmann (m\/w\/d), ) oder verfgen alternativ ber ein Studium im IT-BereichSie konnten bereits Erfahrung mit SAP, MS-Access oder anderen Datenbanken (z-B. SQL) sammeln Sie verfgen ber eine ausgeprgte analytische Denkweise und berzeugen durch Ihre selbststndige, genaue und lsungsorientierte ArbeitsweiseSie bringen auerdem mehrjhrige Berufserfahrung in einer leitenden Funktion oder der Leitung von IT-Projekten mitSehr gute Deutsch- sowie gute Englischkenntnisse runden Ihr Profil abBenefitsFlexibilitt: Freuen Sie sich auf flexible Arbeitszeiten sowie die Mglichkeit im Homeoffice zu arbeiten Onboarding: Sie erwartet eine professionelle Einarbeitung von den Experten der AbteilungArbeitgeber: Das Unternehmen bietet Ihnen ein dynamisches und internationales Arbeitsumfeld mit einzigartigen EntwicklungsmglichkeitenTeamspirit: Auf Sie wartet ein motiviertes, professionelles und eingespieltes Team, dass Sie mit offenen Armen empfngtSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/it-projektleiter-munich-364081","tags":["Project Management"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"junior it prozessmanager standorte hamburg ","company_name":"passport Business Engineering GmbH","title":"Junior IT-Prozessmanager (m\/w\/d)_Standorte: Hamburg","description":"Unser Kunde agiert als Management- und IT-Beratung und realisiert Projekte in den Bereichen Controlling, Business Intelligence und Data Analytics. Im Fokus stehen der Aufbau und die Optimierung von Kundenprozessen und -systeme mit dem Ziel, die Performance langfristig zu steigern.AufgabenRealisierung von Projekten in den Bereichen BI u. Data Analytics in einem Team aus 4-6 MitarbeiternDigitalisierung von Controlling-Prozessen im ffentlichen Sektor (Stdte, Kommunen oder Non-Profit-Organisationen)Stakeholdermanagement, Kommunikation mit den Kunden u. den ProjektmitarbeiternRequirements Engineering, Analyse von Kundenanforderungen Bau von Dashboards u. Planungslsungen, Perspektive bernahme TeilprojektleitungQualifikationStudium Wirtschaftswissenschaft, Wirtschaftsinformatik oder vergleichbarBerufserfahrung in der ffentlichen Verwaltung oder im Bereich NPOKenntnisse in den Bereichen BI u. Datenbanken (z.B. PowerBI, Board, Jedox)IT-Affinitt, Interesse an der Arbeit in der Beratunganalytische Denkweise, hohes Kommunikationsvermgengute DeutschkenntnisseBenefitsflexible Arbeitszeiten, 30 Tage UrlaubMischung aus Prsenzttigkeit und Home-Office mglichspannende Projekte und abwechslungsreiche Aufgaben flache Hierarchien und teamorientiertes ArbeitsumfeldFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/junior-it-prozessmanager-standorte-hamburg-137517","tags":["Information Systems"],"job_types":["berufseinstieg"],"location":"Hamburg","created_at":1702680542000},{"slug":"public services consultant standorte hannover hanover ","company_name":"passport Business Engineering GmbH","title":"Public Services Consultant (m\/w\/d) Standorte: Hannover","description":"Unser Kunde agiert als Management- und IT-Beratung und realisiert Projekte in den Bereichen Controlling, Business Intelligence und Data Analytics. Im Fokus stehen der Aufbau und die Optimierung von Kundenprozessen und -systeme mit dem Ziel, die Performance langfristig zu steigern.AufgabenRealisierung von Projekten in den Bereichen BI u. Data Analytics in einem Team aus 4-6 MitarbeiternDigitalisierung von Controlling-Prozessen im ffentlichen Sektor (Stdte, Kommunen oder Non-Profit-Organisationen)Stakeholdermanagement, Kommunikation mit den Kunden u. den ProjektmitarbeiternRequirements Engineering, Analyse von Kundenanforderungen Bau von Dashboards u. Planungslsungen, Perspektive bernahme TeilprojektleitungQualifikationStudium Wirtschaftswissenschaft, Wirtschaftsinformatik oder vergleichbarBerufserfahrung in der ffentlichen Verwaltung oder im Bereich NPOKenntnisse in den Bereichen BI u. Datenbanken (z.B. PowerBI, Board, Jedox)IT-Affinitt, Interesse an der Arbeit in der Beratunganalytische Denkweise, hohes Kommunikationsvermgengute DeutschkenntnisseBenefitsflexible Arbeitszeiten, 30 Tage UrlaubMischung aus Prsenzttigkeit und Home-Office mglichspannende Projekte und abwechslungsreiche Aufgaben flache Hierarchien und teamorientiertes ArbeitsumfeldFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/public-services-consultant-standorte-hannover-hanover-20474","tags":["Information Systems"],"job_types":["berufserfahren"],"location":"Hanover","created_at":1702680542000},{"slug":"sap experte freelancer  remote munich ","company_name":"MY Humancapital GmbH","title":"SAP Experte (m\/w\/d) Freelancer - 100% Remote","description":"Unser Partnerunternehmen sucht Sie als \"SAP Experte (m\/w\/d)\" fr Ihr Headquarter im Herzen von Mnchen. Sie suchen nach einer abwechslungsreichen Ttigkeit in und einem krisensicherem Arbeitsplatz? Dann sollten Sie sich diese einmalige Chance nicht entgehen lassen!AufgabenAls SAP Consultant (m\/w\/d) bringen Sie sich aktiv in die Implementierung und Weiterentwicklung der SAP-Architektur einMit Ihrem Know-how untersttzen und beraten Sie die Fachabteilungen bei allen Fragen rund um SAPZustzlich erarbeiten Sie neue Lsungen fr die Einfhrung leistungsfhigerer ProzesseDas Erstellen von System- und Prozessdokumentationen fllt ebenso in Ihren Aufgabenbereich Zudem identifizieren Sie im Rahmen von Prozessanalysen Optimierungspotenziale fr unsere KundenQualifikationSie haben ein abgeschlossenes Studium in der (Wirtschafts-) Informatik oder verfgen ber eine Ausbildung im IT-Bereich (z.B. IT-Systemkaufmann (m\/w\/d), Informatikkaufmann (m\/w\/d), ) mit entsprechender Erfahrung Darber hinaus begeistern Sie sich fr Innovationsmglichkeiten in SAP und mchten im SAP-Umfeld langfristig arbeitenIdealerweise haben Sie bereits Erfahrung in der IT-Beratung mit SAP sammeln knnenSie verfgen ber eine ausgeprgte, analytische und lsungsorientierte ArbeitsweiseSehr gute Deutsch- sowie gute Englischkenntnisse runden Ihr Profil abBenefitsWork Life: Beim Arbeitgeber wird viel Wert daraufgelegt, Privatleben und Karriere unter einen Hut zu bekommen (bspw. Gleitzeit, Homeoffice-Mglichkeit, usw.)Weiterbildung: Wer rastet, der rostet. Dementsprechend wird groen Wert auf die Entwicklung der Mitarbeiter gelegtTeamspirit: Sympathische Kollegen, flache Hierarchien sowie zahlreiche MitarbeitereventsEinarbeitung: Sie erwartet eine individuelle und ausfhrliche Einarbeitung von erfahrenen MitarbeitendenSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/sap-experte-freelancer-100-remote-munich-121460","tags":["Remote","Consulting","Engineering"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"public services consultant standorte hamburg ","company_name":"passport Business Engineering GmbH","title":"Public Services Consultant (m\/w\/d) Standorte: Hamburg","description":"Unser Kunde agiert als Management- und IT-Beratung und realisiert Projekte in den Bereichen Controlling, Business Intelligence und Data Analytics. Im Fokus stehen der Aufbau und die Optimierung von Kundenprozessen und -systeme mit dem Ziel, die Performance langfristig zu steigern.AufgabenRealisierung von Projekten in den Bereichen BI u. Data Analytics in einem Team aus 4-6 MitarbeiternDigitalisierung von Controlling-Prozessen im ffentlichen Sektor (Stdte, Kommunen oder Non-Profit-Organisationen)Stakeholdermanagement, Kommunikation mit den Kunden u. den ProjektmitarbeiternRequirements Engineering, Analyse von Kundenanforderungen Bau von Dashboards u. Planungslsungen, Perspektive bernahme TeilprojektleitungQualifikationStudium Wirtschaftswissenschaft, Wirtschaftsinformatik oder vergleichbarBerufserfahrung in der ffentlichen Verwaltung oder im Bereich NPOKenntnisse in den Bereichen BI u. Datenbanken (z.B. PowerBI, Board, Jedox)IT-Affinitt, Interesse an der Arbeit in der Beratunganalytische Denkweise, hohes Kommunikationsvermgengute DeutschkenntnisseBenefitsflexible Arbeitszeiten, 30 Tage UrlaubMischung aus Prsenzttigkeit und Home-Office mglichspannende Projekte und abwechslungsreiche Aufgaben flache Hierarchien und teamorientiertes ArbeitsumfeldFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/public-services-consultant-standorte-hamburg-486525","tags":["Information Systems"],"job_types":["berufserfahren"],"location":"Hamburg","created_at":1702680542000},{"slug":"inhouse sap consultant munich ","company_name":"MY Humancapital GmbH","title":"Inhouse SAP Consultant (m\/w\/d)","description":"Unser Partnerunternehmen sucht Sie als \"Inhouse SAP Consultant (m\/w\/d)\" fr Ihr Headquarter im Herzen von Mnchen. Sie suchen nach einer abwechslungsreichen Ttigkeit in und einem krisensicherem Arbeitsplatz? Dann sollten Sie sich diese einmalige Chance nicht entgehen lassen!AufgabenAls SAP Consultant (m\/w\/d) bringen Sie sich aktiv in die Implementierung und Weiterentwicklung der SAP-Architektur einMit Ihrem Know-how untersttzen und beraten Sie die Fachabteilungen bei allen Fragen rund um SAPZustzlich erarbeiten Sie neue Lsungen fr die Einfhrung leistungsfhigerer ProzesseDas Erstellen von System- und Prozessdokumentationen fllt ebenso in Ihren Aufgabenbereich Zudem identifizieren Sie im Rahmen von Prozessanalysen Optimierungspotenziale fr unsere KundenQualifikationSie haben ein abgeschlossenes Studium in der (Wirtschafts-) Informatik oder verfgen ber eine Ausbildung im IT-Bereich (z.B. IT-Systemkaufmann (m\/w\/d), Informatikkaufmann (m\/w\/d), ) mit entsprechender Erfahrung Darber hinaus begeistern Sie sich fr Innovationsmglichkeiten in SAP und mchten im SAP-Umfeld langfristig arbeitenIdealerweise haben Sie bereits Erfahrung in der IT-Beratung mit SAP sammeln knnenSie verfgen ber eine ausgeprgte, analytische und lsungsorientierte ArbeitsweiseSehr gute Deutsch- sowie gute Englischkenntnisse runden Ihr Profil abBenefitsWork Life: Beim Arbeitgeber wird viel Wert daraufgelegt, Privatleben und Karriere unter einen Hut zu bekommen (bspw. Gleitzeit, Homeoffice-Mglichkeit, usw.)Weiterbildung: Wer rastet, der rostet. Dementsprechend wird groen Wert auf die Entwicklung der Mitarbeiter gelegtTeamspirit: Sympathische Kollegen, flache Hierarchien sowie zahlreiche MitarbeitereventsEinarbeitung: Sie erwartet eine individuelle und ausfhrliche Einarbeitung von erfahrenen MitarbeitendenSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/inhouse-sap-consultant-munich-421437","tags":["Consulting","Engineering"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"junior softwareentwickler java nuremberg ","company_name":"isento GmbH","title":"(Junior) Softwareentwickler (m\/w\/d) Java","description":"Programming isnt about what you know; its about what you can figure out. - Chris PineDas siehst du genauso? Dann freuen wir uns darauf Dich kennenzulernen!Wir sind isento (portug.: frei) und realisieren IT-Projekte in Nrnberg von der Konzeption bis zum Rollout. Als Software Developer bringst Du Dich ein bei der Entwicklung mageschneiderter Lsungen fr die Herausforderungen unserer Kunden. Dabei bist Du nie auf Dich alleine gestellt, denn wir leben Teamwork, Austausch und das permanente von- und miteinander Lernen. So entwickeln wir Software und auch uns selbst stets weiter.AufgabenDein Job bei isentoEntwickle Softwareanwendungen mit Java, Spring Boot und aktuellen Webtechnologien wie AngularSichere die Softwarequalitt mit Unit-Tests, Code-Reviews oder beim Pair ProgrammingGestalte mit und bernimm Verantwortung  ob in Deinem agilen Team oder darber hinausProjekte fr lokale Kunden und hauseigene ProduktentwicklungEin isento-Buddy fr all deine Fragen beim EinstiegWeiterentwicklung durch individuelle Weiterbildung und teambergreifenden AustauschQualifikationDas bringst Du mitLeidenschaft fr Softwareentwicklung und Motivation stetig dazu zu lernenStudium oder Ausbildung im IT-Bereich oder Talent als Quereinsteiger:inIdentifikation mit agilen Werten und strukturierte ArbeitsweiseGute Kenntnisse in Java und bestenfalls erste Erfahrungen in aktuellen Cloud- und Webtechnologien, Datenbanken, Git und MavenGute Deutschkenntnisse (mind. B2)BenefitsDas ist isentoFlache Hierarchen, flexible Arbeitszeiten und Home Office sind schon lange kein Alleinstellungsmerkmal mehr, sondern gehren fr uns zu einer modernen Arbeitskultur. Auf was Du Dich bei uns also sonst noch freuen kannst:Wir arbeiten als Team auf Augenhhe. Wir leben den offenen Austausch, bringen Eigeninitiative, neue Ideen, aber auch konstruktive Kritik ein. Wir lernen von- und miteinander, entwickeln uns zusammen weiter und feiern gemeinsam auf unserer Dachterrasse. Egal ob Rinder- oder Seitansteak, Couchpotato oder Adrenalinjunkie, mit Familie, Katze oder Kakadu  wir sind ein buntgemischtes Team, wir sind isento!Komm in unser Team und bringe Deine Individualitt ein. Wir freuen uns auf Dich!Was wir sonst noch bieten? Besuche unsere Website oder schicke uns Deine Bewerbungsunterlagen und wir lernen uns kennen!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/junior-softwareentwickler-java-nuremberg-36790","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000},{"slug":"it support munich ","company_name":"MY Humancapital GmbH","title":"IT-Support (m\/w\/d)","description":"Unser Partnerunternehmen sucht Sie als \"IT-Support (m\/w\/d)\" fr ihr Headquarter in Mnchen. Dabei handelt sich um ein zukunftsorientiertes Wirtschaftsunternehmen aus dem ffentlichen Dienst. In den vergangenen Wochen und Monaten haben sie ein starkes Wachstum hingelegt, sodass das Team nun weiteren Zuwachs sucht. Wenn Sie sich selbst als Organisationstalent und IT-affin beschreiben, ist die Stelle genau die richtige fr Sie!AufgabenAls IT-Support (m\/w\/d) untersttzen Sie die Fachabteilungen bei der Abwicklung von Strungsmeldungen und Service RequestsSie sind verantwortlich fr die Bearbeitung von eingehenden Anfragen im Rahmen des 1st- und 2nd-Level SupportsDabei erfassen und bearbeiten Sie relevante Stammdaten in bestehenden DatenbankenZudem stellen Sie die Weiterleitung der Antrge an den 3rd Level Support sicherDarber hinaus kmmern Sie sich als IT-Mitarbeiter Service Desk (m\/w\/d) um die Koordination der ServicespezialistenQualifikationSie haben eine abgeschlossene Ausbildung im Bereich Informatik bspw. als Fachinformatiker (m\/w\/d), IT-Systemelektroniker (m\/w\/d) oder IT-Manager (m\/w\/d) Zudem konnten Sie idealerweise bereits Erfahrungen im IT-Support oder Service Desk sammeln Ihre analytischen Fhigkeiten sowie eine ausgeprgte Lsungsorientierung zeichnen Sie aus Durch Ihre strukturierte und zuverlssige Arbeitsweise behalten Sie stets alle relevanten Projekte im berblick Ein sicherer Umgang mit den gngigen MS-Office-Anwendungen sowie gute SAP-Kenntnisse, idealerweise in der Nutzung des SAP Solution Managers runden Ihr Profil abBenefitsModerner Arbeitgeber: Das Unternehmen erhielt bereits zahlreiche Auszeichnungen als attraktiver Arbeitgeber Flexibilitt: Genieen Sie die Freiheit durch flexible Arbeitszeiten sowie die Mglichkeit im Homeoffice zu arbeiten Onboarding: Sie erwartet eine professionelle Einarbeitung von den Experten der AbteilungVerpflegung: Ihre ausgewogene Ernhrung ist dank des firmeninternen Restaurants gesichert Gesundheit: Neben hhenverstellbaren Schreibtischen, gibt es ein breites Sportangebot sowie kostenfreies ObstSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/it-support-munich-240040","tags":["Helpdesk"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"it prozessmanager standorte hannover hanover ","company_name":"passport Business Engineering GmbH","title":"IT-Prozessmanager (m\/w\/d)_Standorte: Hannover","description":"Unser Kunde agiert als Management- und IT-Beratung und realisiert Projekte in den Bereichen Controlling, Business Intelligence und Data Analytics. Im Fokus stehen der Aufbau und die Optimierung von Kundenprozessen und -systeme mit dem Ziel, die Performance langfristig zu steigern.AufgabenRealisierung von Projekten in den Bereichen BI u. Data Analytics in einem Team aus 4-6 MitarbeiternDigitalisierung von Controlling-Prozessen im ffentlichen Sektor (Stdte, Kommunen oder Non-Profit-Organisationen)Stakeholdermanagement, Kommunikation mit den Kunden u. den ProjektmitarbeiternRequirements Engineering, Analyse von Kundenanforderungen Bau von Dashboards u. Planungslsungen, Perspektive bernahme TeilprojektleitungQualifikationStudium Wirtschaftswissenschaft, Wirtschaftsinformatik oder vergleichbarBerufserfahrung in der ffentlichen Verwaltung oder im Bereich NPOKenntnisse in den Bereichen BI u. Datenbanken (z.B. PowerBI, Board, Jedox)IT-Affinitt, Interesse an der Arbeit in der Beratunganalytische Denkweise, hohes Kommunikationsvermgengute DeutschkenntnisseBenefitsflexible Arbeitszeiten, 30 Tage UrlaubMischung aus Prsenzttigkeit und Home-Office mglichspannende Projekte und abwechslungsreiche Aufgaben flache Hierarchien und teamorientiertes ArbeitsumfeldFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/it-prozessmanager-standorte-hannover-hanover-311109","tags":["Information Systems"],"job_types":["berufserfahren"],"location":"Hanover","created_at":1702680542000},{"slug":"java entwickler sap munich ","company_name":"MY Humancapital GmbH","title":"Java Entwickler (m\/w\/d) - SAP","description":"Unser Partnerunternehmen sucht Sie als \"Java Entwickler (m\/w\/d) - SAP\" fr Ihr Headquarter im Herzen von Mnchen. Sie suchen nach einer abwechslungsreichen Ttigkeit in und einem krisensicherem Arbeitsplatz? Dann sollten Sie sich diese einmalige Chance nicht entgehen lassen!AufgabenEntwicklung und Implementierung von Java-Anwendungen in Verbindung mit SAP-SystemenAnpassung und Erweiterung von SAP-Modulen unter Verwendung von Java-TechnologienIntegration von Java-Anwendungen mit SAP-Schnittstellen und -DatenbankenMitarbeit in Projekten zur Einfhrung oder Weiterentwicklung von SAP-LsungenErstellung von technischer Dokumentation und Schulung von Mitarbeitern bei BedarfZusammenarbeit mit anderen Entwicklern, SAP-Experten und dem IT-TeamQualifikationSie haben ein abgeschlossenes Studium in der (Wirtschafts-) Informatik oder verfgen ber eine Ausbildung im IT-Bereich (z.B. IT-Systemkaufmann (m\/w\/d), Informatikkaufmann (m\/w\/d), ) mit entsprechender Erfahrung Darber hinaus begeistern Sie sich fr Innovationsmglichkeiten in SAP und mchten im SAP-Umfeld langfristig arbeitenIdealerweise haben Sie bereits Erfahrung in der IT-Beratung mit SAP sammeln knnenSie verfgen ber eine ausgeprgte, analytische und lsungsorientierte ArbeitsweiseSehr gute Deutsch- sowie gute Englischkenntnisse runden Ihr Profil abBenefitsWork Life: Beim Arbeitgeber wird viel Wert daraufgelegt, Privatleben und Karriere unter einen Hut zu bekommen (bspw. Gleitzeit, Homeoffice-Mglichkeit, usw.)Weiterbildung: Wer rastet, der rostet. Dementsprechend wird groen Wert auf die Entwicklung der Mitarbeiter gelegtTeamspirit: Sympathische Kollegen, flache Hierarchien sowie zahlreiche MitarbeitereventsEinarbeitung: Sie erwartet eine individuelle und ausfhrliche Einarbeitung von erfahrenen MitarbeitendenSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/java-entwickler-sap-munich-421699","tags":["Software Development"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"it prozessmanager standorte hamburg ","company_name":"passport Business Engineering GmbH","title":"IT-Prozessmanager (m\/w\/d)_Standorte: Hamburg","description":"Unser Kunde agiert als Management- und IT-Beratung und realisiert Projekte in den Bereichen Controlling, Business Intelligence und Data Analytics. Im Fokus stehen der Aufbau und die Optimierung von Kundenprozessen und -systeme mit dem Ziel, die Performance langfristig zu steigern.AufgabenRealisierung von Projekten in den Bereichen BI u. Data Analytics in einem Team aus 4-6 MitarbeiternDigitalisierung von Controlling-Prozessen im ffentlichen Sektor (Stdte, Kommunen oder Non-Profit-Organisationen)Stakeholdermanagement, Kommunikation mit den Kunden u. den ProjektmitarbeiternRequirements Engineering, Analyse von Kundenanforderungen Bau von Dashboards u. Planungslsungen, Perspektive bernahme TeilprojektleitungQualifikationStudium Wirtschaftswissenschaft, Wirtschaftsinformatik oder vergleichbarBerufserfahrung in der ffentlichen Verwaltung oder im Bereich NPOKenntnisse in den Bereichen BI u. Datenbanken (z.B. PowerBI, Board, Jedox)IT-Affinitt, Interesse an der Arbeit in der Beratunganalytische Denkweise, hohes Kommunikationsvermgengute DeutschkenntnisseBenefitsflexible Arbeitszeiten, 30 Tage UrlaubMischung aus Prsenzttigkeit und Home-Office mglichspannende Projekte und abwechslungsreiche Aufgaben flache Hierarchien und teamorientiertes ArbeitsumfeldFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/passport-business-engineering-gmbh\/it-prozessmanager-standorte-hamburg-183319","tags":["Information Systems"],"job_types":["berufserfahren"],"location":"Hamburg","created_at":1702680542000},{"slug":"junior hr manager recruiting munich ","company_name":"MY Humancapital GmbH","title":"Junior HR Manager (m\/w\/d) - Recruiting","description":"Join our team: Candidate Consultant (m\/w\/d) im Recruiting gesucht! Du mchtest die Arbeitswelt von morgen aktiv mitgestalten und bringst einen unschlagbaren Mix aus Persnlichkeit und Motivation mit? Dann solltest du auf jeden Fall weiterlesen!Das Herzstck aller Unternehmen sind ihre Mitarbeiter*innen. Und genau hier kommen wir ins Spiel  wir supporten zahlreiche Unternehmen im Raum Mnchen entlang des gesamten Employee-Life-Cycle.Vom Focus Online wurden wir zum wachstumsstrksten Unternehmen im Sddeutschen Raum ausgezeichnet  und wir suchen Dich als neues Teammitglied, um gemeinsam diesen Aufschwung voranzutreiben. Dabei bist Du fester Bestandteil im Recruiting und wirst innerhalb krzester Zeit Deine eigenen Projekte betreuen. Bei uns steht Teamwork an erster Stelle und wir freuen uns darauf, gemeinsam mit Dir unsere Ziele zu erreichen  und dabei darf der Spa natrlich nicht zu kurz kommen!Also worauf wartest Du? Bewirb Dich jetzt und werde Teil der MHC-Crew! AufgabenCandidate Experience: Du wirkst aktiv beim Aufbau und der Umsetzung einer modernen Candidate Journey mit  vom ersten Kontakt bis zum Onboarding trgst du Deinen Stempel mit auf.  Recruiting 2.0: Du identifizierst neue Recruiting-Kanle und entwickelst im Team innovative Ideen fr die Talentsuche.  Career-Coaching: Du planst mit Bewerbern individuelle Karrieremglichkeiten, fhrst eigenstndig Interviews und bereitest sie gezielt auf Vorstellungsgesprche vor. Active Sourcing: Mittels Direct Search grbst Du wahre Goldstcke aus! Du sprichst gezielt und passgenau potentielle Bewerber an und gewinnst Sie fr neue, spannende Jobmglichkeiten.  Onboarding: Du begleitest die Bewerber*innen und neuen Mitarbeiter*innen entlang des kompletten Onboardingprozesses und bist erste Ansprechperson in Sachen Contract-Management.  Ideenmanagement: Deine Meinung ist gefragt! Denn die MHC entwickelt sich immer weiter  und zwar gemeinsam mit Dir! Bring Deine Ideen und Verbesserungsvorschlge ein und gestalte die Zukunft der MHC aktiv mit (bspw. Employer Branding, Prozessgestaltung, ). QualifikationNeben einem erfolgreichen Studium oder einer Ausbildung bringst Du idealerweise bereits Berufserfahrung im Recruiting mit. Zudem berzeugst Du noch mit einigen weiteren Charaktereigenschaften: Positives Mindset: Du liebst es Neues zu lernen und Verantwortung zu bernehmen. Dabei gehst Du auch gerne mal aus Deiner Komfortzone und wchst ber Dich hinaus. Fokus: Du weit, was Du mchtest, und bringst auch das ntige Durchsetzungsvermgen sowie ein hohes Ma an Eigeninitiative mit.  Lernbereitschaft: Fehler sind Teil des Lernens. Du bist mutig, probierst gerne Neues aus und denkst stets lsungsorientiert. Mit Spa bei der Sache: Auch die positive Vibes drfen bei Dir zu keinem Zeitpunkt zu kurz kommen. Du reit andere mit Deiner Energie mit und bist immer fr einen Lacher zu haben. BenefitsMonday is Funday Kultur: Gestalte auch Du ein Arbeitsumfeld, in dem Du Dich sonntags bereits auf Montag freust. Dabei warten sympathische Teamkollegen auf Dich, die Dich mit offenen Armen empfangen und mit Dir gemeinsam Erfolge feiern.  MHC-Workation: Einmal im Jahr geht es gemeinsam zu einer einzigartigen Destination, denn Erfolge mssen gemeinsam gefeiert werden.  Monday-Meal: Lets start the week right! Freue Dich jeden Montag auf ein kostenloses, gesundes Mittagessen gemeinsam mit dem ganzen Team.  Birthday-Vacation: An Deinem wichtigsten Tag im Jahr stehst du im Mittelpunkt und bekommst von uns zu Deinen 30 Tagen Urlaub sogar noch einen zustzlichen Urlaubstag geschenkt.  Jhrliche Gehaltserhhung: Dir machen Gehaltsverhandlungen wenig Spa? Uns auch nicht. Daher steigt Dein Gehalt automatisch  und das gleich zweimal im Jahr.  Purpose: Wir stellen bei einer Vielzahl von mittelstndischen und Grounternehmen im Raum Mnchen die wichtigste Ressource sicher  die Menschen, Kollegen und Mitarbeitenden.  Onboarding & Feedback: Der erste Eindruck zhlt! Deshalb erfolgt Dein Onboarding durch eine professionelle und strukturierte Einarbeitung mit regelmigen Feedback-Gesprchen. Dabei steht Dir Dein Mentor zur Seite und sorgt dafr, dass Du Dich innerhalb krzester Zeit zum Recruiting-Experten entwickelst. Karriere-Booster: Dich erwarten flache Hierarchien, abwechslungsreiche Aufgaben und die Mglichkeit in kurzer Zeit Verantwortung zu bernehmen.  Knowledge is Key: Getreu nach diesem Motto wirst Du regelmig an Seminaren und Coachings teilnehmen, um Deine persnliche und fachliche Weiterentwicklung stetig voranzutreiben. Zustzlich hast Du Zugriff auf exklusive Online-Akademien.Du mchtest Teil der Erfolgsgeschichte werden? Dann freuen wir uns auf Deine Bewerbung. Sende uns einfach Deinen Lebenslauf zu. Auf ein Anschreiben kannst Du gerne verzichten. Fr Rckfragen steht Dir Franzi Wild gerne unter 089 954 287  104 zur Verfgung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/junior-hr-manager-recruiting-munich-354981","tags":["Recruitment and Selection"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"kfz mechatroniker erding ","company_name":"MY Humancapital GmbH","title":"KFZ-Mechatroniker (m\/w\/d)","description":"Suchen Sie einen zuverlssigen Partner, der Ihnen bei der Stellensuche hilft? Dann sind Sie bei der MHC goldrichtig! Profitieren Sie von der langjhrigen Erfahrung unserer Experten. Dank der vertrauensvollen Zusammenarbeit mit zahlreichen Unternehmen knnen wir Ihnen jederzeit mageschneiderte Jobmglichkeiten anbieten. Verzichten Sie auf das Schreiben zahlreicher Bewerbungen. Gemeinsam finden wir Ihren Traumjob  und das vllig kostenfrei!Im Auftrag unseres Kunden in Erding suchen wir Sie zum nchstmglichen Zeitpunkt als Kfz-Mechatroniker (m\/w\/d).AufgabenAls Kfz-Mechatroniker (m\/w\/d) identifizieren und beheben Sie mechanische, elektronische und technische Fehler an FahrzeugenSie fhren regelmig Wartungsarbeiten und Inspektionen an Fahrzeugen durchHierbei reparieren Sie beschdigte oder defekte Fahrzeugkomponenten wie Motor, Getriebe und BremsenSie installieren neue Fahrzeugteile und tauschen beschdigte ausSchlielich beraten Sie Kunden in Bezug auf Reparaturen, Wartung und Serviceleistungen fr ihre FahrzeugeQualifikationSie haben eine erfolgreich abgeschlossene Ausbildung zum Kfz-Mechatroniker (m\/w\/d) oder eine vergleichbare Ausbildung Idealerweise bringen Sie erste Berufserfahrung als Kfz-Mechatroniker (m\/w\/d) mitHandwerkliches Geschick sowie przises Arbeiten zhlen zu Ihren StrkenAuerdem zeichnen Sie sich durch Ihre Verantwortungsbereitschaft und Zuverlssigkeit aus Schlielich arbeiten Sie sehr gerne im TeamBenefitsFlexibilitt: Durch flexible Arbeitszeiten von Montag bis Freitag ist die Vereinbarung von Beruf und Privatleben gewhrleistetModerne Gerte: Sie arbeiten mit den neusten ArbeitsgertenSicherheit: Arbeiten Sie in einer krisensicheren und zukunftsorienterten BrancheTeamspirit: Sie erwarten flache Hierarchien, kurze Entscheidungswege sowie eine wertschtzende ZusammenarbeitVielseitigkeit: Freuen Sie sich auf spannende und abwechslungsreiche Ttigkeiten in einem kollegialen ArbeitsumfeldSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Simon Schneider gerne unter 089 954 287 111 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/kfz-mechatroniker-erding-327456","tags":["Automotive Engineering"],"job_types":[],"location":"Erding","created_at":1702680542000},{"slug":"programmierer automatisierungstechnik leipzig ","company_name":"univativ GmbH","title":"Programmierer (m\/w\/d) Automatisierungstechnik","description":"Ab sofort, Langfristig, mit Option auf Verlngerung, mit Option auf bernahme | 40 Stunden pro Woche | Leipzig | Elektrotechnik | Berufserfahrener | 48000 bis 54000  im Jahr | Projekt-ID A202344252_4Sunivativ ist ein Projekt- und Personaldienstleister, der Studenten und Absolventen spannende Jobs bei renommierten Unternehmen bietet. Deine Karriere ist unsere Mission, denn Deine Entwicklung liegt uns am Herzen.Wir suchen einen Programmierer (m\/w\/d) fr Automatisierungstechnik, der zielstrebig und eigenverantwortlich das Projekt voranbringt. Du besitzt fundiertes Fachwissen und kennst Dich mit Automatisierungsapplikation aus? Dann suchen wir Dich!Unser Kunde ist ein weltweit ttiges Unternehmen mit dem Fokus auf Elektrifizierung, Automatisierung und Digitalisierung. Als einer der grten Anbieter energieeffizienter, ressourcenschonender Technologien ist unser Partner fhrend bei Systemen fr die Energieerzeugung und -bertragung sowie die medizinische Diagnose. Wenn wir Deine Neugier wecken konnten, dann warte nicht lange und bewirb Dich noch heute!AufgabenElektroniker\/Programmierer (m\/w\/d) fr Anlagenkommunikation und Automatisierungstechnik:Entwicklung von Applikationen und Methoden zur Anlagenberwachung und Zustandsbewertung von Energieverteilungsanlagen (elektrischen, elektronischen und mechanischen Komponenten)Entwicklung und Anpassungen Methoden\/Lsungen einer Engineeringplattform fr ein Anlagen-Monitoringsystem \"SIMARIScontrol\" fr Nieder-, Mittelspannungsschaltanlagen und deren PeripheriekomponentenErfassung und Speicherung von Messwerten\/Informationen in lokalen System und Cloud-SpeichernMglichkeit zur Erfassung von Referenzdaten als Datenbasis zur Bewertung der KomponentenEntwicklung von geeigneten Auswerte- und Analyseverfahren fr ProduktdatenEntwicklung und Implementierung von Lsungen zur Diagnose- und ServiceuntersttzungDefinition von Nutzerinterfaces und deren FunktionenQualifikationStaatl. gepr. Techniker oder Studium (Bachelor, Master, Diplom) im Bereich Elektrotechnik,Programmierung\/Softwarenetwicklung oder vergleichbarKenntnisse industrieller Automatisierungs-, Steuerungs- und Kommunikationstechnik und allgemeiner ElektrotechnikWnschenswerte Erfahrung mit SCADA-Systemen und deren Kommunikationsanbindung, vorteilhaft WinCCOAErfahrungen in Cloud-TechnologienProgrammierkenntnisse in C\/C++, Datenstrukturen und AlgorithmenErfahrungen im Frontend-Entwicklungsbereich UI\/UXSicher Deutsch in Wort und Schrift sowie gute Englischkenntnisse in Wort und SchriftBenefitsEin Jahreslohn zwischen 48000  und 54000 Eine persnliche ProjektbetreuungVielfltige Weiterbildungsmglichkeiten in unserer e-AcademyIndividuelles Coaching als Vorbereitung fr die Vorstellung beim KundenBis zu 2.000  Prmie fr Deine Weiterempfehlung an FreundeExklusive JobangeboteNetworking in verschiedenen BranchenWir konnten Dein Interesse wecken? Klasse!Wir freuen uns auf Deine BewerbungFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/programmierer-automatisierungstechnik-leipzig-413711","tags":["Engineering"],"job_types":[],"location":"Leipzig","created_at":1702680542000},{"slug":"mitarbeiter anlagenbuchhaltung leipzig ","company_name":"univativ GmbH","title":"Mitarbeiter Anlagenbuchhaltung (m\/w\/d)","description":"Ab sofort, Langfristig, mit Option auf Verlngerung, mit Option auf bernahme | 40 Stunden pro Woche | Leipzig | Energiewirtschaft | Berufserfahrener, Berufseinsteiger | 42000 bis 48000  im Jahr | Projekt-ID A202342070_6Sunivativ ist ein Projekt- und Personaldienstleister, der Studenten und Absolventen spannende Jobs bei renommierten Unternehmen bietet. Deine Karriere ist unsere Mission, denn Deine Entwicklung liegt uns am Herzen.Du hast Erfahrung in der Anlagenbuchhaltung und hast besitzt eine abgeschlossene Kaufmnnische Ausbildung? Mit der Rechnungslegung nach HGB bist Du vertraut und auch den Umgang mit SAP FI CO kennst Du? Dann ist das Deine Chance: Bewirb Dich jetzt als Anlagenbuchhalter (m\/w\/d).Wir geben Deiner Karriere den Kick! Starte erfolgreich bei unserem Kunden aus der Energiewirtschaft durch! In einem innovativen Team hast du die Mglichkeit, an spannenden Projekten mitzuarbeiten und Dein Wissen stetig zu erweitern! Das klingt nach einer faszinierenden Berufsperspektive? Wir freuen uns Dich kennenzulernen!AufgabenKaufmnnische Abrechnung von Investitionsmanahmen inkl. berleitung in die AnlagenbuchhaltungSelbststndige Bearbeitung der Anlagenbuchhaltung verschiedener Gesellschaften, Verbnde und EigenbetriebeErstellung der Monats-, Quartals- und Jahresabschlsse in der Anlagenbuchhaltung inkl. Abstimmung HauptbuchZusammenarbeit und Absprache mit der Bilanzbuchhaltung und bei Jahresabschlussprfungen mit WirtschaftsprfernZuarbeit von Daten der Anlagenbuchhaltung fr die Erstellung von Wirtschaftsplnen, Gebhrenkalkulationen und StatistikenQualifikationKaufmnnische Ausbildung oder vergleichbarMehrjhrige Berufserfahrung im Rechnungswesen von VorteilSehr gute Kenntnisse und sicherer Umgang mit SAP und MS-OfficeIdealerweise Erfahrung in der Anlagenbuchhaltung und ProjektmanagementTechnisches Verstndnis von VorteilDurchsetzungsvermgen, Eigeninitiative und SelbstndigkeitKontakt- und TeamfhigkeitSicheres Deutsch in Wort und SchriftBenefitsEin Jahreslohn zwischen 42000  und 48000 Eine persnliche ProjektbetreuungVielfltige Weiterbildungsmglichkeiten in unserer e-AcademyIndividuelles Coaching als Vorbereitung fr die Vorstellung beim KundenBis zu 2.000  Prmie fr Deine Weiterempfehlung an FreundeExklusive JobangeboteNetworking in verschiedenen BranchenWir konnten Dein Interesse wecken? Klasse!Wir freuen uns auf Deine BewerbungFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/mitarbeiter-anlagenbuchhaltung-leipzig-79563","tags":["Finance"],"job_types":[],"location":"Leipzig","created_at":1702680542000},{"slug":"mitarbeiter lohnbuchhaltung leuna ","company_name":"univativ GmbH","title":"Mitarbeiter Lohnbuchhaltung (m\/w\/d)","description":"Ab sofort, Langfristig, mit Option auf Verlngerung, mit Option auf bernahme | 40 Stunden pro Woche | Leuna | ffentlicher Dienst | Berufseinsteiger, Berufserfahrener | 30000 bis 32400  im Jahr | Projekt-ID A202344298_4Sunivativ ist ein Projekt- und Personaldienstleister, der Studenten und Absolventen spannende Jobs bei renommierten Unternehmen bietet. Deine Karriere ist unsere Mission, denn Deine Entwicklung liegt uns am Herzen.Du suchst den perfekten Einstieg in die Lohnbuchhaltung? Du hast eine abgeschlossene kaufmnnische Ausbildung, hast eine hohe Zahlenaffinitt und analytische Denkweise? Dann haben wir genau die richtige Stelle fr Dich als Mitarbeiter Lohnbuchhaltung (m\/w\/d).Unser Kunde ist im ffentlichen Dienst ttig und sucht aktuell Verstrkung im Projekt. Du suchst einen Einstieg in den ffentlichen Dienst? Dann bist Du bei uns richtig. Bewirb dich jetzt und profitiere von unseren umfassenden Entwicklungsmglichkeiten.AufgabenBearbeitung und Erstellung der Lohn- und Gehaltsabrechnung unter Einhaltung der aktuellen steuer- und sozialversicherungsrechtlichen BestimmungenAnsprechpartner in allen abrechnungsrelevanten, und lohnsteuerrechtlichen sowie sozialversicherungsrechtlichen FragenKontenabstimmung und Erstellung von Rckstellungen fr den MonatsabschlussAllgemeine Mitarbeit im Tagesgeschft der PersonalabteilungTermingerechte monatliche Erstellung von Meldungen der Abrechnungsdaten an externe StellenMelde- und BescheinigungswesenFhrung und Pflege der PersonalstammdatenQualifikationErfolgreich abgeschlossene kaufmnnische Ausbildung wnschenswert \/ Quereinstieg mglichErste Berufserfahrung in der Lohn- und Gehaltsabrechnung von VorteilKenntnisse im Bereich Lohnsteuer-, Sozialversicherungs- und Arbeitsrecht wnschenswertAnwenderkenntnisse im Umgang mit dem MS OfficeERP Kenntnisse z. B. in SAP oder DATEV sind von VorteilHohe Zahlenaffinitt und analytische FhigkeitenEinsatzbereitschaft und FlexibilittSelbstndige, strukturierte und zuverlssige ArbeitsweiseFhrerschein zwingend notwendig, da mit PNV schlecht zu erreichenBenefitsEin Jahreslohn zwischen 30000  und 32400 Eine persnliche ProjektbetreuungVielfltige Weiterbildungsmglichkeiten in unserer e-AcademyIndividuelles Coaching als Vorbereitung fr die Vorstellung beim KundenBis zu 2.000  Prmie fr Deine Weiterempfehlung an FreundeExklusive JobangeboteNetworking in verschiedenen BranchenWir konnten Dein Interesse wecken? Klasse!Wir freuen uns auf Deine BewerbungFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/mitarbeiter-lohnbuchhaltung-leuna-3033","tags":["Finance"],"job_types":[],"location":"Leuna","created_at":1702680542000},{"slug":"telefonischer kundenbetreuer 2pro woche home office schichtzulagen ab  uhr munster ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Telefonischer Kundenbetreuer m\/w\/d 2*pro Woche Home Office Schichtzulagen ab 18 Uhr","description":"Wollen Sie als Kundenbetreuer m\/w\/d fr ein Hotelvergleichsportal arbeiten?Als Kundenberater m\/w\/d erwartet Sie:AufgabenSie betreuen die Kunden bei Fragen und Problemen am Telefon oder per Mail und kmmern sich dabei professionell und freundlich um eine schnelle und zufriedenstellende LsungSie sind verantwortlich fr die fachliche Prfung und Bewertung von KundenanliegenSie stellen die zgige Abwicklung und den Abschluss der Kundenanfragen in enger Zusammenarbeit mit den nationalen und internationalen Partnern sicherSie haben stets ein offenes Ohr fr die Kunden und schaffen es, bei Rckfragen zu Buchungen  per Telefon und E-Mail  kulante Lsungen zur Zufriedenheit der Kunden zu findenGemeinsam mit dem Team wirken Sie an der internen Qualittssicherung mit, um eine fehlerfreie Bearbeitung sicherzustellenZur Weiterentwicklung der internen Prozesse, arbeiten Sie eng mit den Experten zusammenQualifikationBerufserfahrung im Dialogmarketing, in der Touristik \/ Hotelbranche (z.B. Reservierungsabteilung) oder im telefonischen KundenkontaktIdealerweise bringen Sie eine abgeschlossene Ausbildung im kaufmnnischen oder touristischen Bereich mitIn Beratungsgesprchen mit den Kunden zeichnen Sie sich durch ein freundliches, serises und lsungsorientiertes Auftreten aus  Sie bringt so schnell nichts aus der RuheSie sind ein echter Teamplayer (m\/w\/d), haben Spa am gemeinsamen Erfolg und bringen eigene Ideen einSchriftlich und mndlich berzeugen Sie mit verhandlungssicheren Deutschkenntnissen sowie mit sicheren EnglischkenntnissenVersierter Umgang mit den gngigen PC- und InternetanwendungenZeitliche Flexibilitt Randarbeitszeiten zwischen 8 und 22 Uhr abzudecken (Frh-\/Mittel-\/Sptschicht) sowie Bereitschaft zur Arbeit an Wochenenden und Feiertagen (5-Tage-Woche)Benefitsunbefristeter Arbeitsvertrag, eine attraktive Vergtung fr Wochenend-, Feiertags- und Sptschichten sowie jhrliche Prmien fr besondere Erfolge. Die bernahme von Verantwortung wird zustzlich honoriert (z.B. Wochenend-Schichtleitung). Eine bezuschusste betriebliche Altersvorsorge und viele weitere Vergnstigungen gibt es obendrauf.Der Schichtplan wird, unter der Bercksichtigung von Wnschen, mind. vier Wochen im Voraus erstellt. Gerarbeitet wird 3 Tage die Woche gemeinsam im Office  an den brigen 2 Tagen ist mobiles Arbeiten mglich (Home Office).Einen Laptop fr mobiles Arbeiten, zwei Bildschirme oder individuelles Equipment wie eine ergonomische Maus oder Noise-Cancelling-Kopfhrer? Kein Problem!Individuelle Frderung durch Fortbildungen sowie regelmige Feedbackgesprche. Durch ein starkes und nachhaltiges Wachstum werden langfristige Perspektiven in der Fach- und Fhrungslaufbahn geboten.Zentraler Standort direkt am Stadthafen. Dank Zuschuss zum Job-\/Deutschlandticket und Fahrrad-\/ eBike-Leasing kommen Sie klimaneutral und gnstig ins Bro.Kostenlose Getrnke, Msli und frisches Obst sorgen fr Energie. Mehrmals wchentlich gibt es ein kostenloses, abwechslungsreiches Mittagessen.Attraktives Sportprogramm durch einen Personaltrainer: Halten Sie sich fit durch Yoga, Rckenfit, Bootcamp-Training oder auch zwischendurch in der Bewegten Pause.Es herrscht ein kollegiales und freundschaftliches Umfeld. Bei regelmigen Office Partys, Teamevents und Sommer- und Weihnachtsfeier feiern wir zusammen.Haben wir ihr Interesse geweckt? Dann freuen wir uns auf ihre Bewerbung. Gerne auch per Whats App 015233605774Ivonne Wresch steht Ihnen gerne bei Fragen zur Verfgung. 01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-762","tags":["Customer Service"],"job_types":[],"location":"Münster","created_at":1702680542000},{"slug":"sachbearbeiter versicherung vz und tz moglich mo fr hamburg ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Sachbearbeiter m\/w\/d Versicherung VZ und TZ möglich. Mo-Fr","description":"Wollen Sie fr ein fhrendes Online-Vergleichsportal arbeiten? Wir suchen zur Untersttzung des Backoffice-Teams im Bereich Versicherungen Mitarbeiter\/Sachbearbeiter m\/w\/d.Wir freuen uns auf Ihre Bewerbung als Quereinsteiger m\/w\/d Sachbearbeitung Versicherungen in Voll- oder Teilzeit ab 16 Std.\/Woche.Aufgabeneigenstndige Prfung von VersicherungsantrgenUntersttzung bei telefonischen Anfragen der Bestandskunden (m\/w\/d)Kommunikation mit Versicherungsgesellschaften liegt in Schnittstelle zwischen Kundenberatern (m\/w\/d) und externen VersicherungsgesellschaftenQualifikationEine eigenstndige, zuverlssige und detailorientierte Arbeitsweise zeichnet Dich ausIdealerweise - erste Erfahrungen in der Sachbearbeitung o.. (ggf. durch Praktika oder Werkstudierendenttigkeiten) hohe Kundenorientierung sowie ein sicheres und freundliches Auftreten im telefonischen und schriftlichen KontaktBenefitsZentraler Arbeitsplatz - Home Office Tage mglichBroarbeitszeiten zwischen 9 und 17 Uhr 30000  p.a.mehr als 30 Tage Urlaub mglichqualifizierte EinarbeitungHaben wir Ihr Interesse geweckt? Dann freuen wir uns auf Ihre Bewerbung.Gerne per Mail oder per Whats App unter 0152\/33605774 Bei Fragen steht Ihnen Ivonne Wresch gerne zur Verfgung.Telefon 0152\/33605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/sachbearbeiter-versicherung-vz-und-tz-moglich-mo-fr-hamburg-307167","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702680542000},{"slug":"2500eur telefonischer kundenberater zahnzusatzversicherung hamburg ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Telefonischer Kundenberater m\/w\/d  Zahnzusatzversicherung","description":"Zur Untersttzung des Kundenmangement-Teams im Bereich Zahnzusatzversicherung werden Call Center Agent, Telefonische Kundenbetreuer m\/w\/d im Kundenservice in Hamburg gesucht.Als Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d erwartet Sie:AufgabenBeratung von Bestands- und Neukunden zum Thema Zahnzusatzversicherungen per Telefon und E-Mail (keine Kaltakquise)Erstellung von individuellen Angeboten fr den Zahnzusatz-BereichErfassung und Pflege von Kundendaten sowie Verantwortung von AntrgenSchnittstellenfunktion zwischen Kunden und VersicherungsgesellschaftenUntersttzung bei der permanenten Weiterentwicklung des VergleichsangebotsQualifikationKaufmnnische Ausbildung (z.B. Brokaufmann\/-kauffrau oder Versicherungsfachmann-\/frau) oder auch gerne VersicherungsquereinsteigerErsteErfahrung in der KundenberatungHohe Kundenorientierung sowie sicheres und freundliches Auftreten am TelefonEigenverantwortliche, gewissenhafte und strukturierte ArbeitsweiseHands-on-Mentalitt und Umsetzungsstrke mit DetailorientierungBegeisterung fr digitale GeschftsmodelleBenefitsunbefristeter ArbeitsvertragArbeitszeiten von Montag bis Freitag zwischen 8-20 UhrGehalt 30-32 kIntensive und individuelle EinarbeitungFachgerechte Qualifikation im KrankenversicherungsbereichEigenverantwortliches Arbeiten in einem dynamischen ArbeitsumfeldZentraler Standort mit ausgezeichneter Verkehrsanbindung und Blick auf die AlsterZuschuss zur HVV ProfiCardIndividuelle Entwicklungs- und WeiterbildungsmglichkeitenFreundschaftliches Arbeitsumfeld mit Duz-Kultur,gemeinsamen Mittagspausen und vielen TeameventsHaben wir Ihr Interesse geweckt? Dann freuen wir uns auf Ihre Bewerbung. Gerne knnen sie sich per Mail oder WhatsApp bewerben.Bei Fragen steht Ihnen Ivonne Wresch gerne zur Verfgung.0152\/33605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-217908","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702680542000},{"slug":"it first level support vogt ","company_name":"Ingenieurbüro Sulzer GmbH & Co. KG","title":"IT First Level Support","description":"Wir sind ein dynamisches Ingenieurbro fr Gebudetechnik mit 80 Mitarbeitern. Wir werden von einer externen IT-Firma betreut welche fr uns Hardware beschafft und unsere komplette Server betreut. Um die Schnittstelle zwischen unseren Mitarbeitern und dem externen IT-Dienstleister zu verbessern, suchen wir einen engagierten IT-Supportmitarbeiter als Halbtagskraft. Gehaltsangaben beziehen sich auf eine 40h Woche.AufgabenEntgegennahme und Bearbeitung von IT-Anliegen unserer Mitarbeiter.Erste Problemanalyse und -behebung im IT-Bereich.Koordination und Kommunikation mit unserem externen IT-Dienstleister.berwachung und Reporting des Status von IT-Problemen.Untersttzung und interne Koordination bei der Implementierung neuer IT-Systeme und -Prozesse.Fachkundiger Umgang und Support im Bereich Office 365.Untersttzung beim Aufbau und Umzug von Mitarbeiterarbeitspltzen, einschlielich der IT-InfrastrukturDokumentation des IT SystemsQualifikationAbgeschlossene Ausbildung im IT-Bereich oder vergleichbare Qualifikationen.Erfahrung im IT-Support und im Umgang mit IT-Infrastrukturen.Ausgeprgte Kenntnisse und Erfahrungen mit Office 365.Erfahrung im Aufbau und Umzug von Arbeitspltzen.Ausgeprgte Kommunikationsfhigkeit und Serviceorientierung.Fhigkeit, sowohl selbststndig als auch im Team zu arbeiten.Gute Deutsch- und Englischkenntnisse in Wort und Schrift.BenefitsDu wirst gut eingearbeitet durch eine hilfsbereite Kollegschaft.Du arbeitest an modernen Arbeitspltzen.Du hast die Mglichkeit, im Homeoffice zu arbeiten.Du profitierst von flexiblen Arbeitszeiten.Du erhltst kontinuierliche Weiterbildungsmglichkeiten.Du profitierst von einem attraktiven Vergtungssystem.Du bekommst viele zustzliche Sozialleistungen.Du wirst Teil eines dynamischen und heterogenen Teams in einer kollegialen Arbeitsatmosphre mit kurzen Entscheidungswegen.Du hast Zugang zur firmeneigenen Kantine.Du kannst direkt an der Firma ausreichend Parkpltze nutzen.Du geniet eine sehr gute Work-Life-Balance.Du profitierst von einer Unternehmenskultur, die dir alle Mglichkeiten bietet, deine persnlichen Strken zu entfalten.Werden Sie Teil unseres Teams und untersttzen Sie uns als IT Support Mitarbeiter. Wir bieten ein modernes Arbeitsumfeld, gute Weiterbildungsmglichkeiten und ein familires Betriebsklima.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ingenieurburo-sulzer-gmbh-co-kg\/it-first-level-support-vogt-414367","tags":["IT"],"job_types":[],"location":"Vogt","created_at":1702680542000},{"slug":"senior backend engineer munich ","company_name":"Temedica","title":"Senior Backend Engineer (f\/d\/m)","description":"Let's win togetherAs a Backend Engineer for our Mobile team at Temedica, you take charge of developing our new patient companion apps and contribute to the creation of a scalable app platform. You work towards the goal of improving patient outcomes by delivering tailored support to them. By leveraging the power of artificial intelligence, you actively influence patient behavior and shape their experiences into meaningful interventions. If you are passionate about using technology to make a real difference in patients' lives and want to be a key player in a dynamic and agile environment, this is the right opportunity for you!Your Role with usYou drive good, clean code practices while sharing your knowledge with the team, contributing to the success of your peers along the way.You shape the development of the overall apps by sharing proactive feedback and improving decision making.You search for and actionably deliver value for our users through building and influencing features.You think about PII data and how to protect our users.What you bring to the tableYou have 5+ years of experience working as a backend engineer, preferably in NodeJS, or in a similar role with a strong track record of developing, deploying, and maintaining the full lifecycle of, ideally, mobile applications.You have the ability to understand and discuss (but not necessarily know how to implement) infrastructure topics - big plus for cloud architecture knowledge (GCP, AWS, etc) and frontend topics, preferably in react\/react native.You have previous experience with platform or similar shared usage projects.You speak English fluently. German is a plus.What we bring to the tableWe use data for the better. We create technology that really helps. At Temedica, we break new ground in digital health and challenge the traditional healthcare model. We believe that individualized treatment is a fundamental right of every patient - so we make it happen! We build medical applications and use artificial intelligence to translate patient behavior into sensible interventions. We also combine our applications data with data sources from research, social listening and key market providers. Based on a B2B SaaS business model, we so offer novel data monitors that secure previously unknown insights for Pharma and Life-sciences to make personalized medicine reality. Finally!You want more? There are a bunch of things that Temedica offers its employees - and were talking real benefits, not equipment, fruits and drinks. Of course we take care of your daily caffeine and vitamin supply while you perform your work on state-of-the-art devices, but theres much more that we do to support our Temedicans, for example: 150 monthly subsidiary: For whatever makes most sense for you. Starting after the probationary period, you have the freedom to select where to direct your subsidiary from a wide range of options. Whether it's internet at home, a BahnCard or public transport, Kindergarden subsidy, paid time-off, or even your dream workation, the choice is yours to make. And yes, we've also got your back for the long run. Our company pension scheme offers a 50% subsidy, capped at a maximum of 90 per month, to proactively support your future financial security and help you save for retirement while maximizing your benefits. Mix and match these benefits to create a personalized package that suits your preferences and enhances your work-life balance!Hybrid-work policy: Our hybrid-work policy allows you to work from anywhere within Germany. In your team, you are free to decide when to come to the office and enjoy working and celebrating your wins together. Were talking 4 days per month here - cool?Company off-sites and kick-offs: These events allow you to knowledge-share and gather a better understanding of how to successfully reach our goals. Let us tell you, the food during these events is also worth a shot!We are happy to tell you more about our benefits and way of working at Temedica in a first call!Join us!You are looking for an exciting challenge within digital health? We are looking forward to your application!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/temedica\/senior-backend-engineer-munich-10848","tags":["Software Development"],"job_types":["professional \/ experienced"],"location":"Munich","created_at":1702680542000},{"slug":"junior controller neunkirchen ","company_name":"Amapharm GmbH","title":"Junior Controller (m\/w\/d)","description":"Gelangweilt von deinem aktuellen Job?!Bei uns gibt es nicht nur Obstkrbe, sondern auch einen lebenslangen Gummibrchenvorrat fr den langersehnten Energy-Kick.Wir suchen eine engagierte und qualifizierte Fachkraft im Controlling, um unser Team bei Amapharm zu verstrken. Unser Unternehmen ist bekannt fr seine vielfltigen, gesundheitsbewussten Produkte, die eine gesunde Vitaminzufuhr fr Kinder und Erwachsene gewhrleisten.AufgabenJetzt knntest du unsere neue Fachkraft werden.Folgende To-Dos werden dich erwarten:Erstellen von Reports und Analysen in ExcelAufbereitung von betriebswirtschaftlichen ReportsErstellung von Abweichungsanalysen und Ad-Hoc-Auswertungenberwachung und Auswertung von KennzahlenMitwirken in ProjektenEigenverantwortliche Sicherstellung der DatenqualittErstellen von Kalkulationen und AngebotenKalkulationen, AngebotserstellungDatenanalyse und Power BI AuswertungenLogistik ControllingBerechnung von MitarbeiterprmienRechnungsprfungQualifikationDas erwarten wir von dir:Abgeschlossenes Studium der Betriebswirtschaftslehre oder vergleichbare QualifikationErfahrungen im Controlling BereichGute Kenntnisse in MS Excel und idealerweise Erfahrungen mit Microsoft NavisionSelbststndige Arbeitsweise, analytisches Denkvermgen und hohes EngagementStrukturiertes Arbeiten  insbesondere in StresssituationenSehr gute Kenntnisse in englischer Sprache in Wort und SchriftBenefitsEin junges motiviertes Team in einer lockeren Arbeitsatmosphre wartet auf Dich.Sei gespannt auf spaige Teamevents, coole Sportprogramme, Charity-Veranstaltungen und tolle Weihnachtstraditionen.Ein frischer Obstkorb sowie jede Menge Vitamin Fruchtgummis stehen dir tglich zur Verfgung!Bewirb dich noch heute und sichere dir deinen Platz im #TeamAmapharm.Wir freuen uns auf dich!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/amapharm-gmbh\/junior-controller-neunkirchen-330991","tags":["Controlling"],"job_types":[],"location":"Neunkirchen","created_at":1702680542000},{"slug":"referent international projektfinanzen munich ","company_name":"MY Humancapital GmbH","title":"Referent international Projektfinanzen (m\/w\/d)","description":"Unser Kooperationspartner hat sich zum Ziel gesetzt, Mnchen so zu gestalten, dass es als zukunftsorientierte und nachhaltig agierende Metropole die Digitalisierung zum Wohl der Stadtgesellschaft einsetzt. Wenn Sie Mnchen gerne digital erleben mchten und Teil des Teams sein mchten, das sich hierfr engagiert, dann sind Sie bei uns genau richtig.Im Auftrag unseres Partnerunternehmens suchen wir Sie zum nchstmglichen Zeitpunkt als Referent international Projektfinanzen (m\/w\/d)\".AufgabenAls Referent (m\/w\/d) fr Projektfinanzen untersttzen Sie Entwicklung von Finanzierungskonzepten fr internationale ProjekteDabei identifizieren und evaluieren Sie potenzielle FinanzierungspartnerSie erstellen Budgetplne fr internationale ProjekteDarber hinaus berwachen und kontrollieren Sie die Budgetausgaben whrend des ProjektverlaufsAuerdem fhren Sie Finanzanalysen fr Projekte, einschlielich Kosten-Nutzen-Analysen durchQualifikationSie besitzen ein abgeschlossenes Studium in Betriebswirtschaftslehre, Finanzen, Wirtschaftswissenschaften oder einem verwandten Bereich.Zudem weise Sie erste Berufserfahrung als Projektcontroller (m\/w\/d), Finanzberater (m\/w\/d) fr internationale Projekte, Internationaler Finanzmanager (m\/w\/d) oder einem hnlichen BereichAuerdem besitzen Sie ein tiefgehendes Verstndnis fr die Prinzipien der Projektfinanzierung und deren BewertungSie konnten bereits Erfahrung im Umgang mit Finanzsoftware, insbesondere SAP oder anderen relevanten Systemen sammelnZudem sind Sie mit den internationalen Finanzmrkten und deren Einfluss auf Projektfinanzierungen vertrautBenefitsEin professionelles Onboarding um Sie vom ersten Tag an abzuholen und individuell zu frdernEin hybrides Arbeitsmodell, da Sie am besten wissen wo und wie Sie effektiv ArbeitenEin ausgezeichneter Arbeitgeber und eine wertschtzende Firmenkultur, weil Sie gerne in einem freundlichen und kooperativen Umfeld arbeitenEine reichhaltige Auswahl an kulinarischen Gerichten, wie Frchten, Snacks sowie Getrnken, weil Ihr ganzheitliches Wohlergehen zhltEin abwechslungsreiches Aufgabenfeld in einem flexiblen Arbeitsumfeld, damit Sie mit Ihrer Position langfristig zufrieden sindEin agiles Unternehmen in einer zukunftssicheren Branche, weil Sie fr die Zukunft abgesichert sein sollen Exzellente Weiterbildungsmanahmen, damit sie persnlich wie auch fachlich wachsen knnenSie finden das Stellenprofil interessant? Dann freuen wir uns auf Ihre Bewerbung. Senden Sie uns Ihre Unterlagen. Fr Rckfragen steht Ihnen Johanna Artmann gerne unter 089 954 287 106 zur Verfgung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/my-humancapital-gmbh\/referent-international-projektfinanzen-munich-374782","tags":["Controlling"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"projektleiter elektrik kolbermoor ","company_name":"unternehmensberatung monika gräter","title":"Projektleiter m\/w\/d Elektrik","description":"Schlsselfertige Produktionsanlagen in den Bereichen Frder- und Automatisierungs-technik sind die Profession unseres Auftraggebers. Im Laufe der Jahrzehnte hat sich das mittelstndische Unternehmen zu einer global agierenden Unternehmensgruppe gewandelt. Als wesentlicher Player in der schnellen und dynamischen Branche realisiert er kundenspezifische Anlagen, v.a. fur Grokunden der Automobilindustrie und Logistik, mit hoher Qualitt und Zuverlssigkeit. Fr das Stammhaus mit Sitz im Raum Rosenheim suchen wir Sie alsAufgabenSie leiten Kundenprojekte fr frdertechnische Anlagen technisch und konstruktiv, projektieren die elektrotechnischen Umfnge und begleiten das Projekt von derEntwicklung bis zur Abnahme beim Kunden.Mit direktem Kundenkontakt agieren Sie als Schnittstelle zu Gesamtprojektleitung, Konstruktion, Einkauf und Fertigung und untersttzen in fachlichen Themen auchVertrieb und Lieferanten. Sie bewerten unterschiedliche technische Konzepte, nehmen Kostenbewertungen vor, erstellen FMEA und Risikoanalysen, wgen Vor- und Nachteile ab und behalten dabei das Markt- und Wettbewerbsgeschehen im BlickIm Rahmen Ihres Projektes koordinieren Sie Mechanik-Elektrik-Schnittstellen, legen Kabelfhrungen fest und bernehmen die Auswahl und Auslegung von Sensorik,Antriebs- und SteuerungstechnikSie organisieren Meetings zur Abstimmung und wirken daran mit (z.B. Design Review, Kick-off etc.)Mithilfe des PDM-Systems erstellen Sie elektrische Zusammenbau-Zeichnungen,erfassen die As-Built-Stnde vor Ort und stoen die ntigen Prozesse in Einkauf,Arbeitsvorbereitung und Fertigungskontrolle an.QualifikationFundierter technischer Ausbildungshintergrund (z.B. Studium Elektrotechnik oderMechatronik, Technikerabschluss oder vergleichbare Fhigkeiten und Kenntnisse)Berufspraxis in vergleichbarem UmfeldBereitschaft zu gelegentlichen Dienstreisen im In- und AuslandGutes Deutsch und EnglischBenefitsunbefristete Festanstellung* mit attraktiver Vergtung, Prmienzahlungen undUrlaubsgeld Betriebliche Altersvorsorge und Unfallversicherunghome-office mglich Jobrad-Leasing und Zuzahlung zu Fitnessstudio kleine und groe Firmenevents und -ausflgeSie suchen den Einstieg in die Projektleitung oder wollen Ihre Kompetenz erweitern? Dann schicken Sie uns Ihre Bewerbung oder rufen Sie einfach an. Frau Grter freut sich auf Ihren Anruf und Ihre Fragen.*Ein Arbeitsvertrag kommt immer direkt mit unserem Auftraggeber zustande, wir stehen aber nicht nur unseren Kunden, sondern auch Ihnen gerne als neutraler Mittler zur Verfgung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/unternehmensberatung-monika-grater\/projektleiter-elektrik-kolbermoor-240937","tags":["Engineering"],"job_types":["teamleitung"],"location":"Kolbermoor","created_at":1702680542000},{"slug":"us gaap accounting expert cologne ","company_name":"MVE - Most Valuable Employee","title":"US GAAP Accounting Expert","description":"MVE - Most Valuable Employee ist eine Personalberatung, die ausschlielich mitarbeiterfreundliche und attraktive Arbeitgeber mit motivierten Kandidaten verbindet.Fr einen globalen Player im Rheinland suchen wir einen erfahrenen US GAAP Accounting Expert (*gn ). Wenn Sie daran interessiert sind, Ihre Big 4 Erfahrungen auf Unternehmensseite einzubringen und sich in den Bereichen US GAAP und SOX Compliance zuhause fhlen, dann sind Sie hier genau richtig.AufgabenUntersttzung in der Erstellung von Finanzaufstellungsangaben fr vierteljhrliche und jhrliche Berichterstattungen nach US GAAP und IFRS StandardSicherstellung der Compliance mit den relevanten RechnungslegungsstandardsDurchfhrung von Finanzanalysen und -bewertungen zur Untersttzung strategischer EntscheidungsprozesseEffiziente Vermittlung von technischen Buchhaltungskonzepten an Buchhalter und andere StakeholderQualifikationAbgeschlossenes Studium in Finanzen, Buchhaltung oder eine hnliche QualifikationMehr als 3 Jahre Berufserfahrung, vorzugsweise in einem brsennotierten Unternehmen und\/oder einer groen WirtschaftsprfungsgesellschaftNachgewiesene Fhigkeit, komplexe Buchhaltungsthemen sowohl fr technische als auch nicht-technische Stakeholder zu interpretieren und zu kommunizierenHervorragende Kommunikations- und VerhandlungsfhigkeitAnalytische Denkweise und die Fhigkeit, komplexe Finanzdaten zu interpretierenFlieende Englisch und Deutschkenntnisse in Wort und SchriftBenefitsModerne RumlichkeitenInklusive Unternehmenskultur, die Vielfalt frdertmehr als 30 Tage Urlaub und ein hybrides ArbeitsmodellWeiterbildungsmglichkeitenAttraktive Benefits, wie Mitarbeitervorteile und -rabatte*geschlechtsneutral. Allein aus Grnden der besseren Lesbarkeit wird im weiteren Textverlauf auf die gleichzeitige Verwendung mnnlicher, weiblicher und diverser Sprachformen verzichtet. Smtliche Personenbezeichnungen gelten geschlechtsneutral.Fr Fragen und Rckmeldungen melden Sie sich gerne bei unserer Ansprechpartnerin Frau Kwofie, unter 017655851530.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/mve-most-valuable-employee\/us-gaap-accounting-expert-cologne-354075","tags":["Finance"],"job_types":["berufserfahren"],"location":"Cologne","created_at":1702680542000},{"slug":"qualitatsingenieur lieferantenmanagement raum aachen ","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Qualitätsingenieur\/ Lieferantenmanagement (w\/m\/d)- Raum Aachen","description":"Talentscouts ist eine junge, dynamische Personalvermittlung. Unser Motto: IDEAL MATCH - Begeisterung fr Unternehmen und Kandidaten.Seit 2017 ist es unsere Mission Ingenieure sowie technische Experten mit den passenden Unternehmen zusammenzubringen. Als Personaldienstleister im Bereich Ingenieurwesen sind wir sowohl fr Unternehmen als auch fr Kandidaten ein starker Partner. Zu unseren Kunden zhlen namhafte mittelstndische Unternehmen und internationale Grokonzerne aus den Bereichen Anlagenbau, Maschinenbau und Automotive.Fr einen unserer Kunden aus dem Bereich Sondermaschinenbau suchen wir einen Qualittsingenieur (m\/w\/d) im Groraum Aachen.AufgabenIn deiner neuen Position liegt dein Schwerpunkt in Sachen Lieferanten-Entwicklungsprogramm. Gem unseren Richtlinien pflegst du dein globales Lieferantenetzwerk, prfst Prozessvorgaben inklusive deren Einhaltung sowie Lieferfhigkeiten und fhrst Audits durch.Du identifizierst frhzeitig prozessbedingte Fehlerquellen, analysierst diese und stimmst dich mit den jeweiligen Lieferanten ab, um die Lieferketten kontinuierlich zu verbessern.Du untersttzt auerdem bei Anlauf- und Verlagerungsprojekten und wirkst bei Erstbemusterungen und Produktvalidierungen mit.Du dokumentierst deine Projektfortschritte und die Lieferantenperformance przise, sorgst damit fr eine bersichtliche Struktur und entwickelst Entscheidungsgrundlagen fr die Lieferanten- und Komponentenfreigabe.QualifikationAbgeschlossenes ingenieurwissenschaftliches Studium oder ein vergleichbare AusbildungMehrjhrige Berufserfahrung im Qualittswesen mit Fokus auf LieferantenQualifikation zum\/zur Qualittsauditor\/-in, Erfahrung im Bereich Lieferantenauditierung wnschenswertPraxisbewhrte Kenntnisse in Qualittsmethoden wie FMEA, APQP, 8D, SPC usw.Routine mit SAP und MS Office sowie verhandlungssicheres Deutsch und EnglischAusgeprgte analytisch-strukturierte sowie sorgfltige und selbstndige Arbeitsweise gepaart mit einer signifikanten ProblemlsefhigkeitHohes Ma an Eigeninitiative, Kommunikationsstrke sowie DurchsetzungsvermgenEine pragmatische, unternehmerisch denkende Persnlichkeit, die Projekte gerne strategisch angeht, eine hohe Reisebereitschaft mitbringt und mit ihrer kommunikativen, aufgeschlossenen Art begeistert.BenefitsEinstieg bei einem einem innovativen, internationalen und expandierenden TechnologiefhrerAttraktive Vergtung und SozialleistungenFlache Hierarchien und direkte interdisziplinre ZusammenarbeitKontinuierliche fachliche WeiterbildungFlexible Arbeitszeiten und mobiles ArbeitenVermgenswirksame LeistungenBetriebliches Gesundheitsmanagement30 Tage UrlaubDu erfllst nicht jede Anforderung? Kein Problem, bewirb dich gerne trotzdem.Wir freuen uns ber deine Bewerbung!Dilara YabanciRecruiting ConsultantTALENTSCOUTS Recruiting GmbHT: +49 221 8888 7897M +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/qualitatsingenieur-lieferantenmanagement-raum-aachen-15214","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000},{"slug":"qualitatsprufer raum aachen ","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Qualitätsprüfer (m\/w\/d) - Raum Aachen","description":"Talentscouts ist eine junge, dynamische Personalvermittlung. Unser Motto: IDEAL MATCH - Begeisterung fr Unternehmen und Kandidaten.Seit 2017 ist es unsere Mission Ingenieure sowie technische Experten mit den passenden Unternehmen zusammenzubringen. Als Personaldienstleister im Bereich Ingenieurwesen sind wir sowohl fr Unternehmen als auch fr Kandidaten ein starker Partner. Zu unseren Kunden zhlen namhafte mittelstndische Unternehmen und internationale Grokonzerne aus den Bereichen Anlagenbau, Maschinenbau und Automotive.Fr einen unserer Kunden aus dem Bereich Sondermaschinenbau suchen wir einen Qualittsprfer (m\/w\/d) im Groraum Aachen.AufgabenPrfung von Produkten und Komplettgewerken anhand von Fertigungsunterlagen und PrfplnenDokumentation der Prfergebnisse sowie Freigabe oder Sperrung der geprften ArtikelUntersttzung bei der Umsetzung von Lieferantenqualifizierungs- und EntwicklungsmanahmenOptimierung von Fertigungszeichnungen hinsichtlich der Festlegung von Qualittsforderungen, insbesondere unter Bercksichtigung der technischen Machbarkeit und sinnvoller ToleranzenErkennung und Darstellung von Abweichungen in der TeilebeschaffungDurchfhrung von Produktabnahmen bei Lieferanten und DienstleisternSystematische Anwendung von statistischen MethodenAnalyse und Verbesserung bestehender UnternehmensprozesseAnsprechpartner fr die Produktion bei Abweichungen der Produktqualitt eines ZulieferersQualifikationAbgeschlossene, technische Ausbildung im Maschinenbau oder der ElektrotechnikMehrjhrige, praktische Berufserfahrung im Bereich der QualittssicherungGute Kenntnisse der Methoden im QualittsmanagementFundierte SAP-Kenntnisse im Umgang mit den Logistik- und QM-ModulenKenntnisse auf dem Gebiet der Vakuumtechnik sowie im Umgang und der Bearbeitung der Werkstoffe Quarz und Graphit sind erwnscht.Organisationstalent, Freundlichkeit im Umgang mit Kunden, Mitarbeitern und LieferantenGute Englischkenntnisse in Wort und SchriftBenefitsEinstieg bei einem einem innovativen, internationalen und expandierenden TechnologiefhrerAttraktive Vergtung und SozialleistungenFlache Hierarchien und direkte interdisziplinre ZusammenarbeitKontinuierliche fachliche WeiterbildungFlexible Arbeitszeiten und mobiles ArbeitenVermgenswirksame LeistungenBetriebliches Gesundheitsmanagement30 Tage UrlaubDu erfllst nicht jede Anforderung? Kein Problem, bewirb dich gerne trotzdem.Wir freuen uns ber deine Bewerbung!  Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHT: +49 221 8888 7897M +49 176 45263917Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/qualitatsprufer-raum-aachen-465716","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000},{"slug":"werkstudentin content managerin berlin ","company_name":"emjul","title":"Werkstudent*in Content Manager*in","description":"Wir suchen eine*n engagierte*n Werkstudent*in Content Manager*in, der unser Team bei der Entwicklung und Umsetzung von hochwertigem Content untersttzt. Als aufstrebende digitale Agentur mit Schwerpunkt auf Fintech, Real Estate und Blockchain bieten wir Dir die Mglichkeit, in einem spannenden und zukunftsorientierten Umfeld ttig zu sein.AufgabenErstellung und Bearbeitung von Inhalten fr die Website und soziale MedienVerfassen von ansprechenden Texten und Artikeln ber das Unternehmen und seine ProdukteBilder und Videos auswhlen und hochladen, um die visuelle Darstellung der Marke zu verbessernKommunikation mit dem Marketingteam, um die Inhaltsstrategie abzustimmenAnalyse von Daten und Erfolgsmessung der verffentlichten InhalteQualifikationDu solltest flieend Deutsch und Englisch sprechen und schreiben knnen.Erfahrung im Bereich Content Management oder Social Media ist wnschenswert.Gute Kenntnisse in der Erstellung von ansprechenden und kreativen Inhalten sind erforderlich.Grundlegende Kenntnisse in der Bildbearbeitung wren von Vorteil.Du solltest ein gutes Gespr fr aktuelle Trends und Themen haben.Wir bieten Ihnen eine herausfordernde und abwechslungsreiche Ttigkeit in einem motivierten Team. Du hast die Mglichkeit, deine Fhigkeiten weiterzuentwickeln und einen mageblichen Beitrag zum Erfolg unseres Unternehmens zu leisten.  Wiir uns auf deine Bewerbung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/emjul\/werkstudentin-content-managerin-berlin-47728","tags":["Marketing and Communication"],"job_types":["Working student"],"location":"Berlin","created_at":1702680542000},{"slug":"elektrokonstrukteur eplan raum aachen ","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Elektrokonstrukteur EPLAN (m\/w\/d) - Raum Aachen","description":"Talentscouts ist eine junge, dynamische Personalvermittlung. Unser Motto: IDEAL MATCH - Begeisterung fr Unternehmen und Kandidaten.Seit 2017 ist es unsere Mission Ingenieure sowie technische Experten mit den passenden Unternehmen zusammenzubringen. Als Personaldienstleister im Bereich Ingenieurwesen sind wir sowohl fr Unternehmen als auch fr Kandidaten ein starker Partner. Zu unseren Kunden zhlen namhafte mittelstndische Unternehmen und internationale Grokonzerne aus den Bereichen Anlagenbau, Maschinenbau und Automotive.Fr einen unserer Kunden aus dem Bereich Sondermaschinenbau suchen wir einen Elektrokonstrukteur (m\/w\/d) im Groraum Aachen.AufgabenErstellung aller elektrotechnischen Dokumente: E- Planung, Materialstcklisten, Pneumatik Plne, Ausfhrungsrichtlinien Erstellung der Blaupause aller Standardsysteme Ansprechpartner der Fertigung bei Bau und Test von neuen Specials in Kundenupgrades oder in Standardsystemen Untersttzung von System Definition in technischen SachfragenUntersttzung anderer Abteilungen bei Fragen und ProblemenSicherstellung der vollstndigen, termingerechten und fehlerfreien Bereitstellung der Dokumente an im Prozessablauf nachfolgende AbteilungenQualifikationErfolgreich abgeschlossene Ausbildung Techniker Elektrotechnik Sehr gute Kenntnisse in EPlan 8Kenntnisse in SAP\/R3 Gutes rumliches Vorstellungsvermgen und Interesse an technischen ZusammenhngenGute MS-Office-Kenntnisse (Excel)Gute Kommunikations- und OrganisationsfhigkeitenSehr gutes Englisch in Wort und SchriftBenefitsEinstieg bei einem einem innovativen, internationalen und expandierenden TechnologiefhrerAttraktive Vergtung und SozialleistungenFlache Hierarchien und direkte interdisziplinre ZusammenarbeitKontinuierliche fachliche WeiterbildungFlexible Arbeitszeiten und mobiles ArbeitenVermgenswirksame LeistungenBetriebliches Gesundheitsmanagement30 Tage UrlaubDu erfllst nicht jede Anforderung? Kein Problem, bewirb dich gerne trotzdem.Wir freuen uns ber deine Bewerbung!  Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHT: +49 221 8888 7897M +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/elektrokonstrukteur-eplan-raum-aachen-196768","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000},{"slug":"industriemechaniker mechatroniker montage raum aachen cologne ","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Industriemechaniker \/ Mechatroniker Montage (m\/w\/d) - Raum Aachen","description":"Talentscouts ist eine junge, dynamische Personalvermittlung. Unser Motto: IDEAL MATCH - Begeisterung fr Unternehmen und Kandidaten. Seit 2017 ist es unsereMission Ingenieure sowie technische Experten mit den passenden Unternehmen zusammenzubringen. Als Personaldienstleister im Bereich Ingenieurwesen sind wir sowohl fr Unternehmen als auch fr Kandidaten ein starker Partner. Zu unseren Kunden zhlen namhafte mittelstndische Unternehmen und internationale Grokonzerne aus den Bereichen Anlagenbau, Maschinenbau und Automotive.Fr einen unserer Kunden aus dem Bereich Sondermaschinenbau suchen wir einenIndustriemechaniker \/ Mechatroniker Montage (m\/w\/d) im Groraum Aachen.AufgabenMontage\/Verschlauchung von mechanischen\/elektromechanischer Baugruppen und Komponenten nach PlanAufbau von mechanischen Baugruppen nach ZeichnungPneumatikkenntnisseDurchfhrung von Funktions- und Hardwareprfungen der AnlagenQualifikationErfolgreich abgeschlossene technische Ausbildung als Industriemechaniker, Mechatroniker oder eine vergleichbare AusbildungErste Berufserfahrung, idealerweise im SondermaschinenbauSehr gute Deutschkenntnisse und EnglischgrundkenntnissePrzise und zuverlssige ArbeitsweiseTeamfhigkeitHoher QualittsanspruchBenefitsEinstieg bei einem einem innovativen, internationalen und expandierenden TechnologiefhrerAttraktive Vergtung und SozialleistungenFlache Hierarchien und direkte interdisziplinre ZusammenarbeitKontinuierliche fachliche WeiterbildungVermgenswirksame LeistungenBetriebliches Gesundheitsmanagement30 Tage UrlaubDu erfllst nicht jede Anforderung? Kein Problem, bewirb dich gerne trotzdem.Wir freuen uns ber deine Bewerbung!  Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobil: +49 176 45263917Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/industriemechaniker-mechatroniker-montage-raum-aachen-cologne-67267","tags":["Engineering"],"job_types":[],"location":"Cologne","created_at":1702680542000},{"slug":"konstruktionsingenieur sondermaschinenbau creo aachen ","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Konstruktionsingenieur Sondermaschinenbau - CREO (w\/m\/d) - Aachen","description":"Talentscouts ist eine junge, dynamische Personalvermittlung. Unser Motto: IDEAL MATCH - Begeisterung fr Unternehmen und Kandidaten.Seit 2017 ist es unsere Mission Ingenieure sowie technische Experten mit den passenden Unternehmen zusammenzubringen. Als Personaldienstleister im Bereich Ingenieurwesen sind wir sowohl fr Unternehmen als auch fr Kandidaten ein starker Partner. Zu unseren Kunden zhlen namhafte mittelstndische Unternehmen und internationale Grokonzerne aus den Bereichen Anlagenbau, Maschinenbau und Automotive.Fr einen unserer Kunden aus dem Bereich Anlagenbau suchen wir einen Konstruktionsingenieur Sondermaschinenbau - CREO (w\/m\/d) im Groraum Aachen.AufgabenErstellung und nderung von Einzelteil- und Baugruppenzeichnungen in Creo 8\/WindchillErstellung der Blaupause fr Standardsysteme, ggf. Integration von KundenspecialsErstellung von mechanischen Dokumenten (CREO-Planung, SAP-Materialstcklisten, Arbeitsanweisungen)Ansprechpartner fr Fertigung bei Bau und Test neuer Specials in Kundenaufwertungen oder StandardsystemenUntersttzung des Bereichs System Definition in technischen FragenSicherstellung termingerechter Bereitstellung der Dokumente fr nachfolgende AbteilungenQualifikationAbgeschlossenes Maschinenbaustudium (Bachelor\/Ingenieur)Gutes rumliches Vorstellungsvermgen und Interesse an technischen ZusammenhngenSehr gute Kenntnisse in CAD-Systemen (Creo 8)Gute Kenntnisse in SAP\/R3 und MS OfficeFhigkeit zur selbstndigen und teamorientierten ArbeitSehr gutes Englisch in Wort und SchriftBenefitsFlexible Arbeitszeiten, Mobile OfficeMitarbeiter-GewinnbeteiligungGesundheitswochen zur Untersttzung von physischer und mentaler GesundheitFort- und WeiterbildungsmglichkeitenBetriebliche Altersvorsorge, vermgenswirksame Leistungen und individuelle ZusatzversicherungenFirmeneigene Kantine mit subventionierten Mens und saisonalen ObstkrbenE-Ladestationen fr PKW und Fahrrder, gute Verkehrsanbindung mit kostenfreien ParkpltzenMitarbeitende-initiierte FreizeitaktivittenGrozgiges \"Mitarbeiter werben Mitarbeiter Programm\"Wenn diese Stelle zu Ihnen passt und fr Sie interessant klingt, freuen wir uns auf Ihre Bewerbung an:Dimitrios NoulisRecruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobil: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/konstruktionsingenieur-sondermaschinenbau-creo-aachen-18410","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000},{"slug":"technischer redakteur raum aachen cologne ","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Technischer Redakteur (w\/m\/d) - Raum Aachen","description":"Talentscouts ist eine junge, dynamische Personalvermittlung. Unser Motto: IDEAL MATCH - Begeisterung fr Unternehmen und Kandidaten. Seit 2017 ist es unsereMission Ingenieure sowie technische Experten mit den passenden Unternehmen zusammenzubringen. Als Personaldienstleister im Bereich Ingenieurwesen sind wir sowohl fr Unternehmen als auch fr Kandidaten ein starker Partner. Zu unseren Kunden zhlen namhafte mittelstndische Unternehmen und internationale Grokonzerne aus den Bereichen Anlagenbau, Maschinenbau und Automotive.Fr einen unserer Kunden aus dem Bereich Sondermaschinenbau suchen wir einenTechnischen Redakteur (w\/m\/d) im Groraum Aachen.AufgabenAktive Mitarbeit in den Entwicklungs- und CIP  Projekten mit Fokus der Produkt DokumentationUntersttzung bei der Erstellung, Verwaltung und Pflege aller produktbezogenen technischen DokumenteErstellung von redaktionellen Ausarbeitungen zu Themen der ProdukthandbcherPflege der Unternehmens-Terminologie als Grundlage zu allen technischen DokumentationenQualifikationTechnischer Redakteur mit Erfahrung in der Terminologie ArbeitGrundlegende Kenntnisse in der Maschinenrichtlinie und ISO\/IEC 82079-1:2012 NormKenntnisse\/Wissen in der Erstellung und Redaktion von technischen ProduktdokumentationenDeutsch Muttersprachler\/in mit guten Englisch Kenntnissen in Wort und SchriftTeamfhigkeit, Kommunikationsfhigkeit und Durchsetzungsfhigkeitbergreifendes theoretisches und praktisches Verstndnis fr Fachbereiche Software, Mechanik und Elektronik im AnlagenbauBenefitsEinstieg bei einem einem innovativen, internationalen und expandierenden Technologiefhrer Attraktive Vergtung und Sozialleistungen Flache Hierarchien und direkte interdisziplinre Zusammenarbeit Kontinuierliche fachliche Weiterbildung Flexible Arbeitszeiten und mobiles Arbeiten Vermgenswirksame Leistungen Betriebliches Gesundheitsmanagement 30 Tage UrlaubDu erfllst nicht jede Anforderung? Kein Problem, bewirb dich gerne trotzdem. Wir freuen uns ber deine Bewerbung!  Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobil: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/technischer-redakteur-raum-aachen-cologne-224845","tags":["Engineering"],"job_types":[],"location":"Cologne","created_at":1702680542000},{"slug":"qualitatsplaner aachen ","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Qualitätsplaner (w\/m\/d) - Aachen","description":"Talentscouts ist eine junge, dynamische Personalvermittlung. Unser Motto: IDEAL MATCH - Begeisterung fr Unternehmen und Kandidaten.Seit 2017 ist es unsere Mission Ingenieure sowie technische Experten mit den passenden Unternehmen zusammenzubringen. Als Personaldienstleister im Bereich Ingenieurwesen sind wir sowohl fr Unternehmen als auch fr Kandidaten ein starker Partner. Zu unseren Kunden zhlen namhafte mittelstndische Unternehmen und internationale Grokonzerne aus den Bereichen Anlagenbau, Maschinenbau und Automotive.Fr einen unserer Kunden aus dem Bereich Anlagenbau suchen wir einen Qualittsplaner (m\/w\/d) im Groraum Aachen.AufgabenErstellung von QM-Prfplnen, -anweisungen und -ablaufplnenFestlegung von Qualittsanforderungen fr Zulieferteile und ggf. PrfeinrichtungenErstellung des EMBP und Festlegung von Prf- und AbnahmekriterienUntersttzung bei Prozessabnahmen und -audits bei Lieferanten und DienstleisternDurchfhrung von Produktabnahmen und Bemusterungen bei Lieferanten und DienstleisternIdentifizierung und Dokumentation von Abweichungen in der TeilebeschaffungInhaltliche und terminliche Planung der Erstbemusterung von ZulieferteilenUntersttzung bei Lieferantenentwicklungsprogrammen und prventiven ManahmenMitarbeit bei Verbesserungsmanahmen, Projekten und FMEAsUntersttzung bei Definition und Erstellung von Standards mit der EntwicklungsabteilungQualifikationAusbildung zum Ingenieur der Elektrotechnik oder zum Staatlich geprften Elektrotechniker\/MaschinenbautechnikerAus- oder Weiterbildung im Bereich QM\/QS von Vorteil (z.B. QB\/QM, SixSigma-Green Belt\/Black Belt)Gute Kenntnisse in Qualittsmanagement-Methoden (FMEA, SPC, QFD, Ishikawa, Pareto)Mehrjhrige Berufserfahrung im Qualittswesen im Anlagenbau und -inbetriebnahme, bevorzugt in der HalbleiterindustrieFundierte Kenntnisse in Microsoft Office und SAP (Logistik und QM-Module)Teamorientiert, verantwortungsbewusst, gute EnglischkenntnisseAnalytisches Denken, didaktische Fhigkeiten, DurchsetzungsvermgenOrganisationsgeschick, Freundlichkeit im Umgang mit Kunden, Mitarbeitern und LieferantenBenefitsFlexible Arbeitszeiten, Mobile OfficeMitarbeiter-GewinnbeteiligungGesundheitswochen zur Untersttzung von physischer und mentaler GesundheitFort- und WeiterbildungsmglichkeitenBetriebliche Altersvorsorge, vermgenswirksame Leistungen und individuelle ZusatzversicherungenFirmeneigene Kantine mit subventionierten Mens und saisonalen ObstkrbenE-Ladestationen fr PKW und Fahrrder, gute Verkehrsanbindung mit kostenfreien ParkpltzenMitarbeitende-initiierte FreizeitaktivittenGrozgiges \"Mitarbeiter werben Mitarbeiter Programm\"Du erfllst nicht jede Anforderung? Kein Problem, bewirb dich gerne trotzdem. Wir freuen uns ber deine Bewerbung!Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobil: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/qualitatsplaner-aachen-261354","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000},{"slug":"sachbearbeiter technischer innendienst raum aachen ","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Sachbearbeiter Technischer Innendienst (m\/w\/d) - Raum Aachen","description":"Talentscouts ist eine junge, dynamische Personalvermittlung. Unser Motto: IDEAL MATCH - Begeisterung fr Unternehmen und Kandidaten. Seit 2017 ist es unsereMission Ingenieure sowie technische Experten mit den passenden Unternehmen zusammenzubringen. Als Personaldienstleister im Bereich Ingenieurwesen sind wir sowohl fr Unternehmen als auch fr Kandidaten ein starker Partner. Zu unseren Kunden zhlen namhafte mittelstndische Unternehmen und internationale Grokonzerne aus den Bereichen Anlagenbau, Maschinenbau und Automotive.Fr einen unserer Kunden aus dem Bereich Schttguttechnik und Industrieservice suchen wir einen Sachbearbeiter Technischer Innendienst (m\/w\/d) in Aachen.AufgabenDu bist der operative Ansprechpartner im Innendienst und kmmerst dich um die Anfragen- und Auftragsabwicklung.Du berprfst Kundenbestellungen, pflegst und verwaltest diese im ERP-System und erstellst Auftragsbesttigungen.Du koordinierst den Informationsfluss in Kundenprojekten.Du holst Angebote bei Lieferanten ein und beschaffst Norm- und Zeichnungsteile sowie Halbzeuge.Du erstellst Statistiken und Auswertungen und kmmerst dich um Monatsabschlussarbeiten.QualifikationAbgeschlossene kaufmnnische Ausbildung oder technische Ausbildung mit kaufmnnischem HintergrundBevorzugt Erfahrung in produzierenden UnternehmenKompetenz im Umgang mit technischen Zeichnungen und StcklistenVersierte MS-Office KenntnisseGute Deutsch- und EnglischkenntnisseBenefitsEine umfassende und strukturierte EinarbeitungEine interessante und abwechslungsreiche Ttigkeit sowie ein dynamisches und offenes Arbeitsklimaberstundenausgleich und Home-Office-MglichkeitenEinen unbefristeten Arbeitsvertrag und ein attraktives Vergtungspaket sowie eine moderne IT-AusstattungDu erfllst nicht jede Anforderung? Kein Problem, bewirb dich gerne trotzdem. Wir freuen uns ber deine Bewerbung!  Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobil: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/sachbearbeiter-technischer-innendienst-raum-aachen-82279","tags":["Engineering"],"job_types":[],"location":"Aachen","created_at":1702680542000},{"slug":"senior project manager wurzburg ","company_name":"PlanerAI GmbH","title":"Senior Project Manager (m\/f\/d)","description":"PlanerAI, wanneer softwareoplossing en duurzaamheid samenkomen - we willen voedselverspilling in de retailsector binnen de komende vijf jaar halveren met behulp van kunstmatige intelligentie.Hoe doen we dat? Onze kracht is ons unieke team. We zijn AI-experts, espressoliefhebbers en teamspelers! Onze teamspirit zorgt niet alleen voor de beste oplossing voor de eindklant, maar ook voor duurzame samenwerking, wat PlanerAI tot een prettige werkgever maakt.Word onderdeel van ons team en ondersteun ons als Senior projectmanager (m\/v\/d).Wij zijn een dynamische, snelgroeiende startup. Bij ons heb je de mogelijkheid om je taken vorm te geven op basis van je vaardigheden.Daarom moedigen we je aan om te solliciteren, zelfs als je niet helemaal voldoet aan sommige van de gewenste kwalificaties.TasksWe boren een nieuw marktsegment aan. Daarom zijn we op zoek naar iemand die ons kan ondersteunen bij deze uitbreiding.Externe aspecten van deze functie:Succesvol beheren van testprojecten met grote retailleveranciers.Beheren van grootschalige uitrol van onze planningsoplossing.Continue ondersteuning bieden en cordineren.Zakelijke relaties opbouwen en onderhouden met aanvullende lokale partners, distributeurs, retailers en andere relevante spelers.Interne aspecten van de functie:Verzamelen, structureren en cordineren van productvereisten met het productteam in lijn met de doelstellingen van het bedrijfNauwe uitwisseling met het management om het project te integreren in de organisatieOptioneel\/middellange termijn: Opbouwen van customer success team voor de nieuwe vertical.RequirementsBachelor- of masterdiploma in een bedrijfskundige richting of gelijkwaardig+3 jaar ervaring in projectmanagement, bij voorkeur in de introductie van producten of in een vergelijkbare omgeving.Aantoonbare ervaring in het opbouwen en onderhouden van klantrelaties.Startup ervaring in een agile en snel veranderende omgeving.Analytisch en technisch inzichtZeer goede communicatieve vaardigheden in geschreven en gesproken Nederlands en Engels.Duitse communicatieve vaardigheden zijn een pluspuntBenefits25 vakantiedagen en 5 dagen educatief verlof per jaar, die tot je vrije beschikking staan, omdat we je de kans willen geven voor persoonlijke ontwikkeling!We houden rekening met je individuele levensplanning: Je hebt de mogelijkheid om elke dag naar kantoor te komen of hybride te werken en je werktijden vrij in te delen - we kijken ernaar uit om je op je eerste werkdag op kantoor te ontmoeten en op ons maandelijkse teamevenementWe werken met op vertrouwen gebaseerde werktijden en een vrije organisatie van de werktijd, binnen de mogelijkheden van je functie.We voorzien je van moderne apparatuur (ook voor je kantoor aan huis) - jij beslist of je liever met Mac of Lenovo werktGestructureerde onboarding op maat van je behoeften - je buddy kijkt ernaar uit om je te ondersteunen en je start bij ons aangenaam te makenWe willen je ondersteunen om voor jezelf te zorgen volgens jouw wensen en ideen en bieden je daarom de mogelijkheid van een bedrijfspensioenregelingJouw geestelijke gezondheid is belangrijk voor ons. Met onze partner likeminded heb je toegang tot een platform waar je op elk moment toegang hebt tot verschillende psychologische aanbiedingen.Regelmatige teamevenementen en teambuilding - escape room, 3D minigolf, biertuinvergaderingen, BBQ's en nog veel meer...Samen met u willen we de toonaangevende planningsoplossing voor vers voedsel in Europa worden.Waar wacht je nog op? Solliciteer nu! - We kijken uit naar je sollicitatieFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/planerai-gmbh\/senior-project-manager-wurzburg-356411","tags":["Remote","Project Management"],"job_types":["manager"],"location":"Würzburg","created_at":1702680542000},{"slug":"konstrukteur creo koln cologne ","company_name":"TALENTSCOUTS Recruiting GmbH","title":"Konstrukteur Creo (m\/w\/d) - Köln","description":"Talentscouts ist eine junge, dynamische Personalvermittlung. Unser Motto: IDEAL MATCH - Begeisterung fr Unternehmen und Kandidaten.Seit 2017 ist es unsere Mission Ingenieure sowie technische Experten mit den passenden Unternehmen zusammenzubringen. Als Personaldienstleister im Bereich Ingenieurwesen sind wir sowohl fr Unternehmen als auch fr Kandidaten ein starker Partner. Zu unseren Kunden zhlen namhafte mittelstndische Unternehmen und internationale Grokonzerne aus den Bereichen Anlagenbau, Maschinenbau und Automotive.Fr einen unserer Kunden aus dem Bereich Anlagenbau suchen wir einen Konstrukteur (m\/w\/d) am Standort Kln.AufgabenDu erstellst Konzepte fr die Ausfhrung von Core Units und kostengnstigen Designs von Baugruppen und Komponenten, wobei du die gegebenen Spezifikationen bercksichtigst.Du erstellst Konstruktionsentwrfe von Maschinen, Baugruppen und Komponenten mithilfe von 3D CAD (CREO).Du fhrst detaillierte technische Berechnungen und Analysen von Baugruppen und Komponenten durch.Du entwickelst innovative Ideen fr neue Produkte innerhalb der Gas and Process Division.Du arbeitest an den Prozessen zur Umsetzung in allen AbteilungenDu hast kein Problem mit gelegentlichen DienstreisenQualifikationDu hast einen Bachelor- oder Masterabschluss im Bereich Maschinenbau oder eine hnliche Qualifikation.Du hast Erfahrung in eigenverantwortlicher Konstruktions- oder Entwicklungsarbeit unter Verwendung von 3D-CAD-Software, idealerweise in CREO.Kenntnisse in SAP und PLM sind wnschenswert.Du bist fhig zu kreativem und unkonventionellem Denken und bereit, neue Ideen zu verfolgen.Du bist ein Teamplayer und bereit, mit anderen Abteilungen zusammenzuarbeiten.Du bist bereit, dich in die Umsetzung internationaler Normen fr Turbomaschinen einzuarbeiten.Du verfgst ber gute Englischkenntnisse.BenefitsEigenverantwortliche und abwechslungsreiche Aufgaben bei einem stetig wachsenden und innovativen WeltmarktfhrerFundierte intensive Einarbeitung in das Aufgabenfeld durch kompetentes und motiviertes TeamFachliche und persnliche Weiterbildungsmglichkeiten durch unternehmenseigene AkademieAnsprechende Kantine mit vielseitigen SpeisenVielseitige MitarbeitervorteileAttraktive Vergtung und SozialleistungenVermgenswirksame Leistungen30 Tage UrlaubWenn diese Stelle zu Ihnen passt und fr Sie interessant klingt, freuen wir uns auf Ihre Bewerbung an:Dimitrios NoulisSales & Recruiting ConsultantTALENTSCOUTS Recruiting GmbHTel: +49221\/ 88887897Mobil: +49 176 45263917Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/talentscouts-recruiting-gmbh\/konstrukteur-creo-koln-cologne-376703","tags":["Engineering"],"job_types":[],"location":"Cologne","created_at":1702680542000},{"slug":"project manager wurzburg ","company_name":"PlanerAI GmbH","title":"Project Manager (m\/f\/d)","description":"PlanerAI, when software solution and sustainability come together - we want to halve food waste in the retail sector within the next five years with the help of artificial intelligence.How do we do that? Our strength is our unique team. We are AI experts, espresso lovers and team players! Our team spirit not only creates the best solution for the end customer, but also sustainable cooperation, which makes PlanerAI a pleasant employer.Become part of our team and support us as a Project Manager (m\/f\/d).We are a dynamic, fast-growing startup. With us, you have the opportunity to shape your tasks according to your skills.Therefore, we encourage you to apply, even if you do not quite meet some of the preferred qualifications.TasksWe are tapping into a new market segment. We are therefore looking for someone who can support us in this expansion.External aspects of this role:Successfully manage test projects with large retail suppliers.Manage large-scale roll-out of our planning solution.Provide and coordinate ongoing support.Establish and maintain business relationships with additional local partners, distributors, retailers and other relevant players.Internal aspects of the role:Collecting, structuring and coordinating product requirements with the product team in line with the company's objectivesClose exchange with the management to integrate the project into the organizationOptional\/medium-term: Build up customer success team for the new vertical.RequirementsBachelor's or Master's degree in a business degree program or equivalent+3 years of experience in project management, preferably in the introduction of products or in a similar environment.Proven experience in building and maintaining customer relationships.Startup experience or ability to work in an agile and rapidly changing environment.Analytical and technical understandingVery good communication skills in written and spoken Dutch and English.German communication skills are a plusBenefits25 vacation days and 5 days of educational leave per year, which are at your free disposal, because we want to give you the opportunity for personal development!We accommodate your individual life planning: You have the opportunity to come into the office every day or work hybrid and organize your working hours freely - we look forward to meeting you in our office on your first working day and at our monthly team eventWe work with trust-based working hours and free working time organization, within the possibilities of your roleWe provide you with modern equipment (also for your home office) - you decide whether you prefer to work with Mac or LenovoStructured onboarding tailored to your needs - your buddy is looking forward to supporting you and making your start with us a pleasant oneWe want to support you in providing for yourself according to your wishes and ideas and therefore offer you the option of a company pension schemeYour mental health is important to us. With our partner likeminded, you have access to a platform where you can access various psychological offers at any timeRegular team events and team building - escape room, 3D mini golf, beer garden meetings, BBQs and much more...A team that also likes to meet up after work for bouldering, CrossFit and pizza :)And of course perhaps the best espresso north of the AlpsTogether with you, we want to become the leading planning solution for fresh food in Europe.What are you waiting for? Apply now! - We look forward to receiving your applicationFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/planerai-gmbh\/project-manager-wurzburg-198","tags":["Remote","Project Management"],"job_types":["manager"],"location":"Würzburg","created_at":1702680542000},{"slug":"senior project manager wurzburg ","company_name":"PlanerAI GmbH","title":"Senior Project Manager (m\/f\/d)","description":"PlanerAI, when software solution and sustainability come together - we want to halve food waste in the retail sector within the next five years with the help of artificial intelligence.How do we do that? Our strength is our unique team. We are AI experts, espresso lovers and team players! Our team spirit not only creates the best solution for the end customer, but also sustainable cooperation, which makes PlanerAI a pleasant employer.Become part of our team and support us as a Senior project manager (m\/f\/d).We are a dynamic, fast-growing startup. With us, you have the opportunity to shape your tasks according to your skills.Therefore, we encourage you to apply, even if you do not quite meet some of the preferred qualifications.TasksWe are tapping into a new market segment. We are therefore looking for someone who can support us in this expansion.External aspects of this role:Successfully manage test projects with large retail suppliers.Manage large-scale roll-out of our planning solution.Provide and coordinate ongoing support.Establish and maintain business relationships with additional local partners, distributors, retailers and other relevant players.Internal aspects of the role:Collecting, structuring and coordinating product requirements with the product team in line with the company's objectivesClose exchange with the management to integrate the project into the organizationOptional\/medium-term: Build up customer success team for the new vertical.RequirementsBachelor's or Master's degree in a business degree program or equivalent+3 years of experience in project management, preferably in the introduction of products or in a similar environment.Proven experience in building and maintaining customer relationships.Startup experience or ability to work in an agile and rapidly changing environment.Analytical and technical understandingVery good communication skills in written and spoken Dutch and English.German communication skills are a plusBenefits25 vacation days and 5 days of educational leave per year, which are at your free disposal, because we want to give you the opportunity for personal development!We accommodate your individual life planning: You have the opportunity to come into the office every day or work hybrid and organize your working hours freely - we look forward to meeting you in our office on your first working day and at our monthly team eventWe work with trust-based working hours and free working time organization, within the possibilities of your roleWe provide you with modern equipment (also for your home office) - you decide whether you prefer to work with Mac or LenovoStructured onboarding tailored to your needs - your buddy is looking forward to supporting you and making your start with us a pleasant oneWe want to support you in providing for yourself according to your wishes and ideas and therefore offer you the option of a company pension schemeYour mental health is important to us. With our partner likeminded, you have access to a platform where you can access various psychological offers at any timeRegular team events and team building - escape room, 3D mini golf, beer garden meetings, BBQs and much more...A team that also likes to meet up after work for bouldering, CrossFit and pizza :)And of course perhaps the best espresso north of the AlpsTogether with you, we want to become the leading planning solution for fresh food in Europe.What are you waiting for? Apply now! - We look forward to receiving your applicationFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/planerai-gmbh\/senior-project-manager-wurzburg-75786","tags":["Remote","Project Management"],"job_types":["manager"],"location":"Würzburg","created_at":1702680542000},{"slug":"die prophezeiung sagt mach lieber datenbankadministration mit positivem impact werde oracle crack bleib mensch lich frankfurt ","company_name":"myTalentscout GmbH","title":"Die Prophezeiung sagt: Mach lieber Datenbankadministration mit positivem Impact - Werde Oracle Crack & bleib (M|E|N|S|C|H) -lich","description":"Weil ORACLE eben nicht nur ein Tempel in Griechenland, sondern hier im Norden von Frankfurt ein wichtiger Teil von erstklassigen, branchenfhrenden IT-Produkten ist.  ORACLE weckt auch bei dir Begeisterung und Lust auf die Administration von Datenbanken? Dann knnte diese Position der nchste Schritt auf dem Weg zum\/zur absoluten Oracle-Spezialisten\/-Spezialistin sein.  Die Vision: eine sicherere Welt. Von der Forschung ber die Software bis hin zu Netzwerken und Serversystemen erschaffen die Menschen in diesem Unternehmen Sicherheits-Komplettlsungen fr ihre Kund:innen.Aufgaben Stell dir vor, dein neuer Job ist ein wahrer Datenbanken Deepdive in einem Hochverfgbarkeitsumfeld. Deine Mission ist die Betreuung von Oracle 11g und 19c Datenbanken.  Bei der Planung von Datenbank-Neuinstallationen legst du mit deinem Knnen und deiner Kreativitt die Grundlagen.  Deine weitere Mission in der Datenwelt: Patches, Upgrades, Backup und Recovery, Monitoring, Reorganisation, Migration, Performance Tuning und Troubleshooting.QualifikationDamit deine Mission nicht impossible, sondern eine langfristige berufliche Erfllung ist, suchen wir Denker:innen mit folgenden Fhigkeiten:  ca. 3 Jahre Berufserfahrung in der Administration von Oracle Datenbanken Kenntnisse in Linux und AIX Administration Gute Deutsch- und Englischkenntnisse fr eine harmonische Teamkommunikation Wir suchen einen leidenschaftlichen Techmenschen mit einem offenen, kreativen Mindset, der gerne an Problemen tftelt und Interesse an der Erkundung neuer Technologien hat.BenefitsDas schlgt sich in den Rahmenbedingungen nieder. Schau doch mal, ob sie deinen Vorstellungen entsprechen:  Flexibilitt fr deinen Arbeitsalltag mit einer Hybriden Home-Office Lsung (ca. 50% Office + 50% HO) & Vertrauensarbeitszeit  Ein Einstiegsgehalt je nach deiner Erfahrung bis zu ca. 80.000  p.a.  Regelmige und\/oder individuelle Fortbildungen  wchentlicher Englischkurs und Tech-Talk  Arbeitgeberfinanzierte, betriebliche Krankenzusatzversicherung sowie Zuschuss zu VWL oder DV  Viele Teamevents und gemeinsame Sportveranstaltungen  Kinderbetreuungszuschuss von bis zu  200,- monatlich pro KindWas sagst du? Wollen wir gemeinsam Plne fr deine berufliche Zukunft schmieden? Einfach bewerben! Wir freuen uns dich kennenzulernen. Damit meine ich, wirklich kennenlernen!  Wir sind myTalentscout! Fr uns ist ein Lebenslauf mehr als nur ein Stck Papier!  Happy to connect!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/mytalentscout-gmbh\/die-prophezeiung-sagt-mach-lieber-datenbankadministration-mit-positivem-impact-werde-oracle-crack-bleib-mensch-lich-frankfurt-114265","tags":["Database Administration"],"job_types":["berufserfahren"],"location":"Frankfurt","created_at":1702680542000},{"slug":"controller kaufmannische angestellte markdorf ","company_name":"WEBER FIBERTECH GMBH","title":"Controller\/ Kaufmännische Angestellte (m\/w\/d)","description":"Sie sind bereit fr eine neue Herausforderung? Sie mchten Ihr Talent in einem innovativen und dynamischen Unternehmen unter Beweis stellen? Als Team arbeiten wir jeden Tag mit Herz und Leidenschaft fr unsere innovative Technologie. Denn gemeinsam schaffen wir etwas Sinnvolles  fr uns und Ihre Karriere. Was will man mehr.Die WEBER FIBERTECH GmbH ist ein stetig expandierendes Unternehmen mit Sitz in Markdorf am Bodensee. Wir entwickeln und produzieren basierend auf unserem patentrechtlich geschtzten E-LFT-Verfahren lang- und endlosfaserverstrkte thermoplastische Leichtbauteile. Tag fr Tag arbeiten unsere Mitarbeiter an der Weiterentwicklung unserer Technologie. Wir gehen neue Wege, setzen neue Standards im Markt und begeistern unsere Kunden aus unterschiedlichen Branchen.AufgabenWeiterentwicklung des Controllings des gesamten UnternehmensEigenverantwortliche und proaktive Untersttzung der Geschftsleitung im BerichtswesenProjektcontrolling, kaufmnnische Begleitung der Konstruktions- und EntwicklungsprojekteProjektergebnisrechnung, Abweichungsanalysen, Projekt-Forecast sowie Erstellung von NachkalkulationenErstellung und Auswertung von Kennzahlen fr das MonatsreportingsMitwirkung bei der Erstellung des JahresberichtesUntersttzung der laufenden BuchhaltungQualifikationAbgeschlossenes Bachelor-\/Masterstudium mit dem Schwerpunkt Controlling und Finanzen.Du verfgst ber mindestens 2 Jahre Berufserfahrung im ControllingGute SAP KenntnissePrziser selbststndiger Arbeitsstil verbunden mit hchster GenauigkeitAnalytisches Denken und strukturierte ArbeitsweiseTeamgeist, hohes Engagement und FlexibilittGute EnglischkenntnisseBenefitsFestes Anstellungsverhltnis in einem stark wachsenden und familienfreundlichen UnternehmenFamilienfreundliche Arbeitszeiten und 30 Tage UrlaubGezielte Frderung und Weiterentwicklung Ihrer FhigkeitenFlexible ArbeitszeitenLeistungsgerechte Vergtung Herausfordernde AufgabenFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/weber-fibertech-gmbh\/controller-kaufmannische-angestellte-markdorf-487643","tags":["Controlling"],"job_types":[],"location":"Markdorf","created_at":1702680542000},{"slug":"customer success account managerin berlin ","company_name":"Matera GmbH","title":"Customer Success - Account Manager*in","description":"In a nutshell:Als Account Manager*in bist du bei uns genau richtig, wenn du Lust hast den Aufbau des Customer Success Departments mitzugestalten. Arbeite mit uns in Berlin im Office oder flexibel hybrid, Vollzeit. Starte ab sofort oder in den nchsten 4 Monaten.AufgabenDeine Rolle bei Matera:Beratung und Untersttzung deiner Kund*innenAufbau der Strukturen und Prozesse gemeinsam mit dem Team und unserem Country Managersmarte Automatisierung der bestehenden AblufeAufbau einer Wissensbasis fr wiederkehrende FragenQualifikationDas bringst du mit:Du gehst Probleme kreativ an und bleibst dran, bis du die perfekte Lsung gefunden hastDu hast Spa am Kontakt mit MenschenErste Erfahrungen mit Immobilien, Recht oder in der Buchhaltung sind von Vorteil, aber nicht notwendigDu sprichst Deutsch auf sehr gutem Niveau und kannst sicher auf Englisch kommunizierenBei Matera garantieren wir Chancengleichheit und Vielfalt. Hier bist du so willkommen, wie du bist!BenefitsDeine Aussichten:Vergtung von 37.500-45.000 plus attraktive Anteilsoptionen am UnternehmenMatera Benefits: vergnstigte Mitgliedschaft fr den Urban Sports Club, Lunch-Gutscheine und ein monatlicher PNV-ZuschussEigenverantwortliches Arbeiten mit Gestaltungsfreiraumsteile Lernkurve in einem aufstrebenden SaaS Start-upambitioniertes Team, bei dem der Spa auch nicht zu kurz kommt:)Unsere Mission:Unsere Mission bei Matera ist es, Wohnungseigentmer*innen glcklich zu machen! Durch uns knnen sie ihre Immobilie transparent und einfach selbst verwalten und dadurch eine Menge Zeit und Geld sparen. Seit 2017 sind wir auf dem franzsischen Markt aktiv und machen bereits jeden Tag das Leben von mehr als 100.000 Wohnungseigentmer*innen besser. In Deutschland haben wir im letzten Jahr ebenfalls einen groartigen Start mit einem ambitionierten Team hingelegt.Hast du Lust die Skalierung des deutschen Marktes mit uns gemeinsam anzugehen? Dann bewirb dich jetzt!:)Um unser Team kennenzulernen und Eindrcke von unserer Kultur zu bekommen, schaue gerne bei uns auf LinkedIn oder auf Instagram vorbei!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/matera-gmbh\/customer-success-account-managerin-berlin-73242","tags":["Customer Service"],"job_types":["berufseinstieg"],"location":"Berlin","created_at":1702680542000},{"slug":"kopie von example it systemadministrator berlin ","company_name":"jemix GmbH","title":"Kopie von example: IT-Systemadministrator (m\/w\/d)","description":"Ihre AufgabenDAS IST DER JOB:Als Teil von #teamjemix versorgst du unsere Kunden im Tagesgeschft mit professionellen IT-Lsungen und bist die direkte Anlaufstelle unserer Kunden  Bearbeitung von Tickets des TagesgeschftesSpannende IT-Projekte machen deinen Arbeitstag abwechslungsreichErfassung, Pflege und Dokumentation der WissensdatenbankSicherstellung des Betriebs komplexer Systemumgebungen unserer KundenIm Bewerbungs- und Kennlernprozess mchten wir gerne zusammen mit dir herausfinden, welches unserer Teams dein potenzielles Zuhause werden knnte. Die Teams finden sich in den Bereichen Helpdesk & Fieldservice, Network & Datacenter, Device Management und Cloudmanagement wieder.Ihr ProfilDAS BRINGST DU MIT:Abgeschlossene Ausbildung im IT-Bereich oder entsprechende praktische BerufserfahrungIT-Innovationen begeistern DichmacOS und iOS sind deine LeidenschaftSelbststndige ArbeitsweiseKommunikations- und TeamfhigkeitWarum wir?Das sind deine Vorteile:Aktuelles Apple EquipmentJhrliche Teamreise nach MallorcaArbeitgeberzuschuss zur betrieblichen AltersvorsorgeUnbegrenzte Erfrischungsgetrnke, sowie Kaffee und ObstMobiles ArbeitenArbeitsstandort auf MallorcaQualitrain: Zugriff auf ber 5.000 Fitness & Spa AngeboteKitazuschussPVN FirmenticketWir freuen uns von dir zu hren!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jemix-gmbh\/kopie-von-example-it-systemadministrator-berlin-126487","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702680542000},{"slug":"kopie von kopie von example it systemadministrator berlin ","company_name":"jemix GmbH","title":"Kopie von Kopie von example: IT-Systemadministrator (m\/w\/d)","description":"Ihre AufgabenDAS IST DER JOB:Als Teil von #teamjemix versorgst du unsere Kunden im Tagesgeschft mit professionellen IT-Lsungen und bist die direkte Anlaufstelle unserer Kunden  Bearbeitung von Tickets des TagesgeschftesSpannende IT-Projekte machen deinen Arbeitstag abwechslungsreichErfassung, Pflege und Dokumentation der WissensdatenbankSicherstellung des Betriebs komplexer Systemumgebungen unserer KundenIm Bewerbungs- und Kennlernprozess mchten wir gerne zusammen mit dir herausfinden, welches unserer Teams dein potenzielles Zuhause werden knnte. Die Teams finden sich in den Bereichen Helpdesk & Fieldservice, Network & Datacenter, Device Management und Cloudmanagement wieder.Ihr ProfilDAS BRINGST DU MIT:Abgeschlossene Ausbildung im IT-Bereich oder entsprechende praktische BerufserfahrungIT-Innovationen begeistern DichmacOS und iOS sind deine LeidenschaftSelbststndige ArbeitsweiseKommunikations- und TeamfhigkeitWarum wir?Das sind deine Vorteile:Aktuelles Apple EquipmentJhrliche Teamreise nach MallorcaArbeitgeberzuschuss zur betrieblichen AltersvorsorgeUnbegrenzte Erfrischungsgetrnke, sowie Kaffee und ObstMobiles ArbeitenArbeitsstandort auf MallorcaQualitrain: Zugriff auf ber 5.000 Fitness & Spa AngeboteKitazuschussPVN FirmenticketWir freuen uns von dir zu hren!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jemix-gmbh\/kopie-von-kopie-von-example-it-systemadministrator-berlin-154309","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Berlin","created_at":1702680542000},{"slug":"example it systemadministrator hamburg ","company_name":"jemix GmbH","title":"Example: IT-Systemadministrator (m\/w\/d)","description":"Ihre AufgabenDAS IST DER JOB:Als Teil von #teamjemix versorgst du unsere Kunden im Tagesgeschft mit professionellen IT-Lsungen und bist die direkte Anlaufstelle unserer Kunden  Bearbeitung von Tickets des TagesgeschftesSpannende IT-Projekte machen deinen Arbeitstag abwechslungsreichErfassung, Pflege und Dokumentation der WissensdatenbankSicherstellung des Betriebs komplexer Systemumgebungen unserer KundenIm Bewerbungs- und Kennlernprozess mchten wir gerne zusammen mit dir herausfinden, welches unserer Teams dein potenzielles Zuhause werden knnte. Die Teams finden sich in den Bereichen Helpdesk & Fieldservice, Network & Datacenter, Device Management und Cloudmanagement wieder.Ihr ProfilDAS BRINGST DU MIT:Abgeschlossene Ausbildung im IT-Bereich oder entsprechende praktische BerufserfahrungIT-Innovationen begeistern DichmacOS und iOS sind deine LeidenschaftSelbststndige ArbeitsweiseKommunikations- und TeamfhigkeitWarum wir?Das sind deine Vorteile:Aktuelles Apple EquipmentJhrliche Teamreise nach MallorcaArbeitgeberzuschuss zur betrieblichen AltersvorsorgeUnbegrenzte Erfrischungsgetrnke, sowie Kaffee und ObstMobiles ArbeitenArbeitsstandort auf MallorcaQualitrain: Zugriff auf ber 5.000 Fitness & Spa AngeboteKitazuschussPVN FirmenticketWir freuen uns von dir zu hren!Wir freuen uns ber deine Bewerbung!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jemix-gmbh\/example-it-systemadministrator-hamburg-242646","tags":["Software Development"],"job_types":["berufserfahren"],"location":"Hamburg","created_at":1702680542000},{"slug":"spezialist fur technische softwaretests nuremberg ","company_name":"isento GmbH","title":"Spezialist (m\/w\/d) für technische Softwaretests","description":"Software-Tester zerstren keinen Code  sie zerstren Illusionen ber den Code! (nach James Bach)Das siehst Du genauso? Dann suchen wir Dich als Spezialist (m\/w\/d) fr technische SoftwaretestsWir Tester:innen bei isento sindRealisten; Analysten; Anarchisten; kreativ; systematisch; intuitiv; neugierig; skeptisch; methodisch; kommunikativ; immer fr ein Pairing zu haben; berzeugungs- und Qualitter; lebenslange Lerner; technisch fasziniert; fachlich interessiert; professionell und vor allem: gut drauf, weil wir lieben, was wir tun!Wir sind isento (portugiesisch: frei) und realisieren Softwareprojekte von der Konzeption bis zum Rollout. Als Spezialist (m\/w\/d) fr technische Softwaretests untersttzt Du unsere Projekte durch werthaltiges und frhes Feedback, nachhaltige Test-Lsungen und methodische Exzellenz.Du weit, dass Testcode kein zweitklassiger Code ist, und kannst wie ein:e Entwickler:in denken? Wenn Du auerdem Kenntnisse zu Lasttests, Security-Tests oder Barrierefreiheits-Tests mitbringst und Lust hast, Dich in all diesen Aufgaben weiterzuentwickeln, dann sollten wir uns kennenlernen!AufgabenDein Job bei isentoTestautomatisierung: Strategie, Architektur, Realisierung, Einfhrung und Wartung von Automatisierungs-LsungenErstellung und QS von UnittestsUntersttzung bei statischen Code-AnalysenKonzeption und Durchfhrung von Last- und Performancetests, Security-Tests oder Tests auf BarrierefreiheitQualifikationDas bringst Du mitVertiefte Programmier- und Netzwerk-KenntnisseProjekterfahrung in TestautomatisierungVertiefte Kenntnisse in Last- und Performancetests oder Security-Tests oder Barrierefreiheits-TestsKenntnisse einschlgiger Werkzeuge und Frameworks zu den o.g. TestartenISTQB: mindestens Foundation Level, Advanced Level Technical Tester wre idealBenefitsDas ist isentoFlache Hierarchen, flexible Arbeitszeiten und Home Office sind schon lange kein Alleinstellungsmerkmal mehr, sondern gehren fr uns zu einer modernen Arbeitskultur. Auf was Du Dich bei uns also sonst noch freuen kannst:Wir arbeiten als Team auf Augenhhe. Wir leben den offenen Austausch, bringen Eigeninitiative, neue Ideen, aber auch konstruktive Kritik ein. Wir lernen von- und miteinander, entwickeln uns zusammen weiter und feiern gemeinsam auf unserer Dachterrasse. Egal ob Rinder- oder Seitansteak, Couchpotato oder Adrenalinjunkie, mit Familie, Katze oder Kakadu  wir sind ein buntgemischtes Team, wir sind isento!Komm in unser Team und bringe Deine Individualitt ein. Wir freuen uns auf Dich!Was wir sonst noch bieten? Besuche unsere Website oder schicke uns Deine Bewerbungsunterlagen und wir lernen uns kennen!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/spezialist-fur-technische-softwaretests-nuremberg-409759","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000},{"slug":"dein neuer traumjob steuerfachwirt in hohr grenzhausen ","company_name":"Tina Lehr Steuerberaterin","title":"Dein neuer Traumjob - Steuerfachwirt (m\/w\/d) in Höhr-Grenzhausen!","description":"Du hast Lust auf ein wertschtzendes & familires Arbeitsumfeld, spannende & berregionale Mandate und darauf, Dich beruflich und persnlich weiterzuentwickeln?Dann knnte dir unsere kleine Kanzlei genau das bieten, was Du suchst. Wir, das bin ich Tina, Sabrina, Heike, Anita, Elke, Johanna und unsere Brohndin Josie und wir freuen uns auf Dich als neues Teammitglied.AufgabenUnser Angebot fr Dich: Erhole dich voll und ganz mit 29 Urlaubstagen. Nicht genug? Erweitere deine Urlaubstage unbegrenzt mit angesparten berstunden Bilde dich weiter und profitiere von Freistellung und Kostenbernahme, auch bei Weiterbildung zum Bilanzbuchhalter oder Steuerberater Team-Spirit: Jeden Freitag gemeinsames Frhstck, durchatmen bei Kaffeepausen im Garten und regelmige Team-Events Du hast die freie Wahl: Sachbezugskarte, Tankgutschein, Zuschsse zum Fitnessstudio oder Kindergarten sowie Arbeitgeberzuschuss zur AltersvorsorgeQualifikationDas bringst Du mit: Du hast Deine Ausbildung zur Steuerfachangestellten (m\/w\/d) erfolgreich absolviert Du hast gerne eine Weiterbildung zur Steuerfachwirtin gemacht (m\/w\/d) oder kannst Dir vorstellen, Dich weiterzubilden Du bist grundstzlich in der Steuerberatung zu Hause und konntest bereits Erfahrungen in einer Kanzlei sammelnBenefits Sommer = Mehr Freizeit. Arbeite im Winter etwas mehr, um im Sommer mehr Zeit im Freibad, Park oder Deinem Garten zu verbringen Perfekte Bedingungen: Ansprechende Brorume, viel Fokus in 2er-Bros und inkl. zwei Monitore Tierliebhaber aufgepasst: Unser Kanzleihund Josie freut sich darauf, mit Dir in unserem Garten zu spielen und ist immer bereit fr ausgiebige Gassirunden!Bist Du bereit, Teil unserer kleinen Kanzlei-Familie zu werden? Dann schicke uns Deine Bewerbung an bewerbung (at) steuer-lehr. de  Anschreiben war gestern, schicke uns nur Deinen Lebenslauf oder einen Link zu deinem Xing- oder LinkedIn-Profil.Wenn Du vorher schon fragen hast, erreichst Du mich unter: 02624 \/ 9000 690Bonus fr Zu-Ende-Leser: Solltest Du Dein Steuerberaterexamen ablegen wollen, so ist eine Partnerschaft mittelfristig gerne mglich Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/tina-lehr-steuerberaterin\/dein-neuer-traumjob-steuerfachwirt-in-hohr-grenzhausen-201724","tags":["Finance"],"job_types":[],"location":"Höhr-Grenzhausen","created_at":1702680542000},{"slug":"dein neuer traumjob steuerberater in hohr grenzhausen ","company_name":"Tina Lehr Steuerberaterin","title":"Dein neuer Traumjob - Steuerberater (m\/w\/d) in Höhr-Grenzhausen!","description":"Du hast Lust auf ein wertschtzendes & familires Arbeitsumfeld, spannende & berregionale Mandate und darauf, Dich beruflich und persnlich weiterzuentwickeln? Dann knnte dir unsere kleine Kanzlei genau das bieten, was du suchst. Wir, das bin ich Tina, Sabrina, Heike, Anita, Elke, Johanna und unsere Brohndin Josie und wir freuen uns auf Dich als neues Teammitglied.AufgabenUnser Angebot fr Dich: Erhole dich voll und ganz mit 29 Urlaubstagen. Nicht genug? Erweitere deine Urlaubstage unbegrenzt mit angesparten berstunden Bilde dich weiter und profitiere von Freistellung und Kostenbernahme, auch bei Weiterbildung zum Bilanzbuchhalter oder Steuerberater Team-Spirit: Jeden Freitag gemeinsames Frhstck, durchatmen bei Kaffeepausen im Garten und regelmige Team-Events Du hast die freie Wahl: Sachbezugskarte, Tankgutschein, Zuschsse zum Fitnessstudio oder Kindergarten sowie Arbeitgeberzuschuss zur AltersvorsorgeQualifikationDas bringst Du mit: Du hast Dein Steuerberaterexamen bestanden oder befindest Dich gerade mitten in der Vorbereitung Du bist in der Steuerberatung zu Hause und konntest bereits Erfahrungen in einer Kanzlei sammelnBenefits Sommer = Mehr Freizeit. Arbeite im Winter etwas mehr, um im Sommer mehr Zeit im Freibad, Park oder Deinem Garten zu verbringen Perfekte Bedingungen: Ansprechende Brorume, viel Fokus in 2er-Bros und inkl. zwei Monitore Tierliebhaber aufgepasst: Unser Kanzleihund Josie freut sich darauf, mit Dir in unserem Garten zu spielen und ist immer bereit fr ausgiebige Gassirunden!Bist du bereit, Teil unserer kleinen Kanzlei-Familie zu werden? Dann schicke uns Deine Bewerbung an bewerbung (at) steuer-lehr. de  Anschreiben war gestern, schicke uns nur Deinen Lebenslauf oder einen Link zu deinem Xing- oder LinkedIn-Profil.Wenn du vorher schon fragen hast, erreichst du mich unter: 02624 \/ 9000 690Bonus fr Zu-Ende-Leser: Solltest Du Dein Steuerberaterexamen ablegen wollen, so ist eine Partnerschaft mittelfristig gerne mglich Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/tina-lehr-steuerberaterin\/dein-neuer-traumjob-steuerberater-in-hohr-grenzhausen-239653","tags":["Finance"],"job_types":[],"location":"Höhr-Grenzhausen","created_at":1702680542000},{"slug":"working student marketing munich ","company_name":"Magazino GmbH","title":"Working Student (f\/m\/x) Marketing","description":"Your tasksYou will help plan, conceptualize and execute all digital marketing activities, e.g. paid advertising (LinkedIn, Google) and organic postingsYou will work closely with our Sales & Marketing team to find the best approach to reach potential customersHelping to create content and graphics for our website and social mediaYou keep our Customer Relations Management (CRM) system up to dateYou support and actively participate in the organization of customer events and trade fairsRequirementsYou are currently studying and are interested in marketing, communication or something similarYou like social media and marketing and, of course, for robotsYou are fluent in German and have a good command of English to communicate successfully with internal and external stakeholdersYou get an extra smile from us if ...o ... you understand the principles of digital advertising and have experience with cost-per-click (CPC) campaignso ... you are familiar with some CRM, photo and video editing programs (e.g. Wordpress, Canva, HubSpot)  Important: As a working student (f\/m\/x) you have at least 15 hours per week or 6 months as an intern (f\/m\/x)!What we have to offerCutting-edge technology: As pioneers in robotics we are able to navigate and manipulate without rails and guides and offer solutions to processes that no one could automate ever before!Team: We are an international team with more than 25 nationalities. Youll work in a team with exceptionally smart, humble, collaborative and hardworking individuals.Culture: Come as you are! Join a vibrant, inventive, and diverse team that values collaboration over hierarchy. To innovate you need to fail from time to time  we always learn and improve.Workplace: Our office is located near the SBahn station Hirschgarten. We work in a loft-style office with great equipment, our own workshop and testing area.Full Board: You dont feel like thinking about what you want to have for lunch tomorrow, not to mention preparing it? Luckily, our french cook treats us with a freshly cooked free lunch everyday! And as the cherry on top, there is a packed fridge with drinks, fresh fruits and of course coffee!Flexibility: Flexibility is a top priority for us. Our hybrid working model for positions where presence is dispensable helps to achieve a healthy work-life balance.Benefits: We offer attractive holiday, health care, and compensation packages. Learn more about our current benefits here.At Magazino fostering inclusivity is our top priority. We are dedicated to create an inclusive environment for all candidates and provide equal opportunities to all qualified applicants regardless of gender, ethnicity, age, national origin, sexual orientation, culture, or education. If you need any reasonable adjustments to make the application process accessible for you, well do our best to accommodate you. Feel free to approach us for that!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/magazino-gmbh\/working-student-marketing-munich-410018","tags":["Marketing and Communication"],"job_types":["Internship","no experience required \/ student"],"location":"Munich","created_at":1702680542000},{"slug":"werkstudent praktikant marketing munich ","company_name":"Magazino GmbH","title":"Werkstudent\/Praktikant (w\/m\/x) Marketing","description":"Deine AufgabenDu hilfst bei der Planung, Konzeption und Durchfhrung aller digitalen Marketingaktivitten, z. B. bezahlte Werbung (LinkedIn, Google) und organische PostingsDu arbeitest eng mit unserem Sales- & Marketingteam zusammen, um den besten Ansatz zur Ansprache potenzieller Kunden zu findenDu hilfst bei der Erstellung von Inhalten und Grafiken fr unsere Website und Social MediaDu hltst unser Customer Relations Management (CRM)-System auf dem neuesten StandDu untersttzt in der Organisation von Kundenevents und Messen und nimmst aktiv daran teilDein ProfilDu studierst derzeit und interessierst dich fr Marketing, Kommunikation oder vergleichbaresDu hast Spa und Leidenschaft fr Social Media und Marketing und natrlich auch fr RoboterDu sprichst flieend Deutsch und hast gute Englischkenntnisse, um mit internen sowie externen Stakeholdern erfolgreich zu kommunizierenDu bekommst ein extra Lcheln von uns, wenn    Du die Prinzipien der digitalen Werbung verstehst und Erfahrung mit Cost-per-Click (CPC) Kampagnen hast   Du Dich mit einigen CRM, Foto- und Videobearbeitungsprogrammen (z.B. Wordpress, Canva, HubSpot) auskennstWichtig: Als Werkstudent (w\/m\/x) hast Du mindestens 15 Stunden pro Woche Zeit bzw. 6 Monate als Praktikant (w\/m\/x)!Was wir bietenSpitzentechnologie : Als Pioniere der Robotik sind wir in der Lage, ohne Schienen und Leitlinien zu navigieren und zu manipulieren, und bieten Lsungen fr Prozesse, die noch nie jemand zuvor automatisieren konnte!Team: Wir sind ein internationales Team mit mehr als 25 Nationalitten. Du wirst in einem Team mit sehr smarten, bescheidenen, kooperativen und fleiigen Menschen arbeiten.Kultur: Sei einfach Du selbst! Werde Teil eines dynamischen, innovativen und vielfltigen Teams, das Zusammenarbeit ber Hierarchie stellt. Um innovativ zu sein, muss man ab und zu scheitern - wir lernen und verbessern uns stndig.Arbeitsplatz: Unser Bro befindet sich in der Nhe der S-Bahn-Station \"Hirschgarten\". Wir arbeiten in einem Bro im Loft-Stil mit toller Ausstattung, eigener Werkstatt und Testbereich.Vollverpflegung: Du hast keine Lust, darber nachzudenken, was du morgen zu Mittag essen willst, geschweige denn, es vorzubereiten? Zum Glck verwhnt uns unser franzsischer Koch jeden Tag mit einem frisch gekochten kostenlosen Mittagessen! Und als Sahnehubchen gibt es einen gefllten Khlschrank mit Getrnken, frischem Obst und natrlich Kaffee!Flexibilitt: Flexibilitt wird bei uns grogeschrieben. Unser hybrides Arbeitsmodell fr Positionen, bei denen Anwesenheit verzichtbar ist, trgt zu einer gesunden Work-Life-Balance bei.Benefits: Wir bieten attraktive Urlaubs-, Gesundheits- und Vergtungsleistungen. Erfahre hier mehr ber unsere aktuellen Benefits.Bei Magazino ist uns die Frderung der Inklusivitt sehr wichtig. Wir sind daher bestrebt, ein inklusives Umfeld fr alle Kandidaten (w\/m\/x) zu schaffen und bieten allen qualifizierten Bewerbenden unabhngig von Geschlecht, ethnischer Zugehrigkeit, Alter, nationaler Herkunft, sexueller Orientierung, Kultur oder Bildung gleiche Chancen. Wenn Du gewisse Anpassungen bentigst, um den Bewerbungsprozess fr Dich zugnglich zu machen, werden wir unser Bestes tun, um Dir entgegenzukommen. Sprich uns gerne darauf an!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/magazino-gmbh\/werkstudent-praktikant-marketing-munich-324964","tags":["Marketing and Communication"],"job_types":["Internship","hilfstätigkeit \/ student"],"location":"Munich","created_at":1702680542000},{"slug":"systemadministrator nuremberg ","company_name":"isento GmbH","title":"Systemadministrator (m\/w\/d)","description":"Du suchsteine Stelle, bei der du Verantwortung bernimmst und die Mglichkeit hast, Neues zu lernen und Dich weiterzuentwickeln.ein Unternehmen, das auf Langfristigkeit ausgerichtet ist, Kommunikation auf Augenhhe frdert, und wo Wertschtzung und offener Austausch einen hohen Stellenwert habenein Umfeld, in dem Du aktiv mitgestalten kannst, um positive Vernderungen voranzutreibenber isento: YES zu Kompetenz und Leidenschaft!Wir sind isento (portugiesisch: frei) und realisieren IT-Projekte in Nrnberg von der Konzeption bis zum Rollout. Als Systemadministrator (m\/w\/d) bist Du ein wertvolles Mitglied unseres Teams und untersttzt uns bei der Verwaltung und Wartung von Linux- und Windows-Systemen. Auerdem bernimmst du die Verantwortung fr die Sicherstellung der reibungslosen Funktion unserer IT-Systeme und -Netzwerke.AufgabenDas erwartet dich bei isentoInstallation, Administration und Wartung von Linux- und Windows-Servern und -ClientsKonfiguration und Betrieb von Applikationen fr Softwareentwicklung, wie Jenkins, GitLab, SonarQube etc., sowie Integration mit anderen ApplikationenVerwaltung von Active Directory (AD) und LDAP zur Authentifizierung und Autorisierung von BenutzernKontinuierliche Optimierung und Weiterentwicklung der IT-Infrastruktur sowie der IT-SicherheitIdentifizierung und Lsung technischer Probleme sowie die Untersttzung von internen Fachabteilungen und Mitwirkung an IT-ProjektenQualifikationDas bringst Du mitAbgeschlossenes Studium im Bereich Informatik \/ Berufsausbildung zum Fachinformatiker (m\/w\/d) Systemintegration oder eine vergleichbare QualifikationMehrjhrige Erfahrung in der Administration von Linux- und Windows-SystemenFundierte Kenntnisse in Active Directory, LDAP und Identity ManagementGute Kenntnisse in der Netzwerktechnologie (TCP\/IP, DNS, DHCP)Idealerweise Erfahrung in den Bereichen Cloud-Services, Datenbankanwendungen und Netzwerktechnik, sowie Applikationen zur Untersttzung der SoftwareentwicklungsprozesseFhigkeit, Probleme selbststndig zu lsen und effektiv in einem Team zu arbeitenAusgezeichnete Kommunikationsfhigkeiten in Deutsch sowie gutes EnglischBenefitsWas wir bieten?Obstkorb und Getrnkeflat  klar. Auf was du dich bei isento aber wirklich freuen kannst:Wir arbeiten als Team auf Augenhhe. Wir leben den offenen Austausch, bringen Eigeninitiative, neue Ideen, aber auch konstruktive Kritik ein. Wir lernen von- und miteinander, entwickeln uns zusammen weiter und feiern gemeinsam auf unserer Dachterrasse. Egal ob Rinder- oder Seitansteak, Couchpotato oder Adrenalinjunkie, mit Familie, Katze oder Kakadu  wir sind ein buntgemischtes Team, wir sind isento!Komm in unser Team und bringe Deine Individualitt ein. Wir freuen uns auf Dich!Was wir sonst noch bieten? Besuche unsere Website oder schicke uns Deine Bewerbungsunterlagen und wir lernen uns kennen!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/systemadministrator-nuremberg-334685","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000},{"slug":"cobol entwickler refnr  munich ","company_name":"Q-Perior","title":"Cobol Entwickler (m\/w\/d) (Ref.Nr.: 41185)","description":"Fr unseren Kunden in Dsseldorf suchen wir einen Cobol Entwickler (m\/w\/d).  Key FactsStart: 01.04.2024Dauer: 12 Monate \/ + VerlngerungsoptionAuslastung: 100 %Einsatzart: ArbeitnehmerberlassungEinsatzort: RemoteEinsatzland: DeutschlandIhre Aufgaben Zur Aufrechterhaltung des Betriebs einer abzulsenden Anwendung wird Untersttzung in der COBOL Anwendungsentwicklung gesucht.  Muss-Anforderungen Mehrjhrige Berufserfahrung in der Anwendungsentwicklung im IBM Grorechnerumfeld (z\/OS) Sehr gute Kenntnisse in COBOL, JCL und IMS DC Tiefgehende Kenntnisse im Umgang mit relationalen Datenbanken, insbesondere DB2 Verbindliches Auftreten und Verhandlungsgeschick sowie eine schnelle Auffassungsgabe Flexibilitt und Offenheit bei sich verndernden Rahmenparametern grundstzlich gutes technisches\/architekturelles Verstndnis inkl. Testprozesse\/-vorgehen Erfahrungen im Versicherungsumfeld wren vorteilhaft  Weitere InformationenCOBOL, IBM, DB2  ber unsEs ist unser Anspruch als Business- und IT-Beratung, erstklassige Leistung und hchste Qualitt fr unsere Kunden zu erbringen. Daher steht Q fr Qualitt und _PERIOR, abgeleitet aus superior, unterstreicht, dass wir alles dafr tun, erstklassige Ergebnisse fr unsere Kunden zu liefern. Wir bieten Partnerunternehmen und Freelancern (m\/w\/d) umfassende Perspektiven innerhalb unserer eigenen Projekte und untersttzen unsere Kunden als langjhriger Rahmenvertragspartner bei der Besetzung von Projektvakanzen  zeitnah und direkt.  Wir freuen uns auf Ihre Kontaktaufnahme!  Ihr direkter Ansprechpartner bei Q_PERIORElma AbdagicTelefon: +49 89 455 99 282E-Mail: Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/q-perior\/cobol-entwickler-refnr-41185-munich-409983","tags":["Remote","Software Development"],"job_types":["Interim","berufserfahren"],"location":"Munich","created_at":1702680542000},{"slug":"vp of sales berlin ","company_name":"Lumiform","title":"VP of Sales","description":"Lumiform, founded in 2019, is one of the fastest-growing software startups based in Berlin. We operate globally, and over 50,000 organizations across 201 countries use our innovative Lumiform platform - and this is just the beginning .We have already secured 8 million in investment, are currently in the Series-A stage, and are backed by Germany's Tier 1 SaaS investors Capnamic and 42CAP. Our mission is to unleash the full potential of frontline teams, eliminate operational inefficiencies, reduce costs, and drive a new era of collaboration and automation in frontline teams.We seek a dynamic VP Sales to optimize our successful inbound funnel of 4,000 monthly signups by refining our pipeline structure and segmentation. Your role includes rapidly introducing new sales channels, such as outbound and channel sales, and spearheading our transition from towards increasing ACVs.Your approach should be hands-on, directly engaging in sales activities while also applying a strategic mindset to swiftly establish clear, efficient structures. You will play a key role in coaching our sales team, leveraging your extensive experience in SaaS and hands-on team leadership.Reporting directly to the CEO, you will be instrumental in aligning our sales strategies with overall company goals. Your expertise will drive sales performance and shape our sales teams development and success.TasksSales Leadership & Team Management:Direct a team of 3 SDRs and 3 Account ExecutivesDevelop and execute a sales strategy targeting key regions: DACH, Western Europe, Latin America, and the US.Monitor team and individual performance against quotas.Provide regular feedback and coaching sessions to enhance team output.Lead recruitment of new sales talent.Hands-On Sales Activities:Close high-value accounts and oversee negotiations.Deliver tailored product demos to potential clients.Lead in RFP submissions.Sales Strategic Development:Refine the inbound sales process to make it scalable and repeatable.Collaborate with marketing, customer success, and product for aligned strategies.Design and launch new channels like an outbound motion or partnerships.Offer precise monthly and quarterly sales forecasts.Sales Team Building, Training & Development:Recruit, hire, and onboard new salespeople as needed.Equip the team with comprehensive product knowledge.Coach the team on Lumiform's USPs for a compelling sales pitch.Arrange training to enhance sales and product expertise.Performance Metrics and Analysis:Define key sales KPIs and regularly review them.Use data to analyze sales performance and make adjustments as necessary.Stakeholder Communication & Management:Regularly update the CEO, board, and other stakeholders on sales progress, challenges, and strategies.Participate in board meetings or investor relations as the face of sales.Requirements8+ years experience in sales, preferably in a B2B SaaS environment.Proven experience in managing a sales team of at least five people.You work together with your team members in our office in Berlin.Perfect English and German skills (native speaker level).Demonstrated ability to meet or exceed sales quotas.Proficient in CRM software, preferably Hubspot and Salesforce.Exceptional negotiation and closing skills.Strong analytical and team management skills.Excellent verbal and written communication abilities.BenefitsCompetitive salary with team-performance-based bonuses.Opportunity to be a key player in a rapidly growing SaaS company.Option to get an attractive virtual share package.We care about your personal & professional development. You will receive an annual learning budget for books, courses, conferences, etc.; some hours per week are reserved for learning new skills.You are also welcome to work from our beautiful and bright pet-friendly office in the heart of Berlin where we have fresh fruits, free drinks, good coffee and several cafs and restaurants of almost every origin close by.Annual meet-up in Berlin for a week (The Lumi-Week) with all employees where we have workshops, team events, drinks, delicious food, and good talks.Urban Sports Club or Benefitsy membership.Join a team of 15 nationalities (>35 employees) and various backgrounds. We ensure you have regular contact with everybody and are updated on the company's progress.Join us at our rapidly growing startup, where we take pride in achieving double-digit growth month after month.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/lumiform\/vp-of-sales-berlin-55303","tags":["Management","Team Leader"],"job_types":["manager"],"location":"Berlin","created_at":1702680542000},{"slug":"key account manager hamburg ","company_name":"Pulse Advertising GmbH","title":"(Key) Account Manager (m\/w\/d)","description":"Du bist ein Profi, wenn es um den Ausbau von Kundenbeziehungen geht und liebst kreativen Content? Sales-Pitches, Projektmanagement und Reportings lassen dein Herz hher schlagen?Du hast Spa daran, deine Kunden bestmglich auf dem digitalen Markt zu positionieren und du weit, welche Kennzahlen es braucht, um den Erfolg einer Social-Media Kampagne auszuwerten? Dann bist du das perfekte Match fr unser ambitioniertes Accounts-Team!AufgabenDu bist verantwortlich fr die Betreuung, Beratung und den strategischen Ausbau unserer KundenDu bereitest eigenstndig Sales-Pitches vor und fhrst diese vor unseren Kunden durchDu erstellst Reportings und Projektauswertungen und analysierst diese auf PotentialeDu identifizierst sowie entwickelst neue Vertriebsstrategien und optimierst ProjektablufeQualifikationDriven. Passionate. Diverse. Equal. Das sind Eigenschaften, die Du schtztDu konntest bereits ber 4 Jahre Berufserfahrung im Sales oder in der Kundenbetreuung und -beratung sammelnDu erstellst gern Kalkulationen und Reportings, um auf deren Basis Prozesse zu optimieren und aktiv voranzutreibenDu bist ein absoluter Teamplayer, kommunikationsstark und verhandlungssicher in Deutsch und EnglischBenefitsArbeite aus jedem unserer Bros weltweit: Du wolltest schon immer mal nach Paris, London, Mailand, Hamburg oder Berlin? Dann pack Deine Koffer und arbeite von einem unserer internationalen Standorte aus!Business & Fhrungskrfte Coaching: Wir freuen uns, wenn Du dich weiterentwickelst und bieten Dir dafr individuelle Einzel- oder Teamworkshops anWeltweite Treffen: Lets connect! Bei unseren globalen Teamevents kommen wir zusammen, um voneinander zu lernen und unsere Erfolge zu feiernHybride & flexible Arbeitsmglichkeiten: Lust auf Abwechslung? Kein Problem! Bei uns hast du die Mglichkeit, zwei Tage pro Woche flexibel aus der Ferne zu arbeitenZentrale Brostandorte: Kurze Arbeitswege garantiert! Unsere Bros liegen alle inmitten urbaner HotspotsHunde sind bei uns willkommen: Tierische Motivation und Kuschelfaktor inklusive! Dein vierbeiniger Freund ist in unseren Bros herzlich willkommenFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/pulse-advertising-gmbh\/key-account-manager-hamburg-119849","tags":["Marketing and Communication"],"job_types":[],"location":"Hamburg","created_at":1702680542000},{"slug":"it anwendungsspezialist offenbach ","company_name":"univativ GmbH","title":"IT-Anwendungsspezialist (m\/w\/d)","description":"Baldmglichst, Langfristig, In Festanstellung | 40 Stunden pro Woche | Offenbach am Main | Finanzwesen | Berufserfahrener | 80000 bis 100000  im Jahr | Projekt-ID P202344873_2Sunivativ ist ein Projekt- und Personaldienstleister, der Studenten und Absolventen spannende Jobs bei renommierten Unternehmen bietet. Deine Karriere ist unsere Mission, denn Deine Entwicklung liegt uns am Herzen.Als Informatiker (m\/w\/d) berzeugst Du mit Kreativitt und Fachwissen? Individuelle Softwarelsungen zu programmieren findest Du so spannend, wie Testumgebungen zu erstellen? Wenn Du Dich mit C# und Java auskennst, ist die Ttigkeit bei unserem Kunden genau das Richtige fr Dich!AufgabenDesign, Anpassung und Entwicklung von Erweiterungen fr ein bestehendes System, auf Basis einer Standardsoftware zur Steuerung und Verwaltung der Deckungsmassen eines Kreditinstitutes (TXS)Sicherstellung der Einhaltung interner Regularien in Bezug auf IT-Sicherheit und Compliance3rd-Level-SupportSteuerung externer DienstleisterBeratung von Fachbereichen bei der Konzeption und Weiterentwicklung von SystemenQualifikationHochschulabschluss (Informatik oder naturwissenschaftlich-technischer Studiengang)Erfahrung in einem hnlichen AufgabengebietGute Kenntnisse in der Softwareentwicklung (z.B. C# oder JAVA)Idealerweise auch Kenntnisse mit der Arbeit unter z\/OSEin gutes technisches VerstndnisStrukturierte ArbeitsweiseAnalytisches und konzeptionelles DenkenHohe EinsatzbereitschaftSehr gute Deutsch- und Englischkenntnisse (in Wort und Schrift)BenefitsEin Jahreslohn zwischen 80000  und 100000 Eine Festanstellung direkt bei unserem KundenUnser Kunde bietet: Die Mglichkeit 50% von zu Hause zu arbeiten,Gesundheits- und und Fitnesskurse,betriebliche Altersvorsorge,individuelle Entwicklungsmglichkeiten,flexible ArbeitszeitenWir konnten Dein Interesse wecken? Klasse!Wir freuen uns auf Deine BewerbungFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/it-anwendungsspezialist-offenbach-6205","tags":["IT"],"job_types":[],"location":"Offenbach","created_at":1702680542000},{"slug":"junior consultant requirements engineering nuremberg ","company_name":"isento GmbH","title":"Junior Consultant (m\/w\/d) Requirements Engineering","description":"Du suchst ein Unternehmen, das Innovation leidenschaftlich vorantreibt und dir die Chance bietet, aktiv dazu beizutragen. ein Team von Gleichgesinnten, die nicht nur Kollegen sind, sondern auch Quellen der Inspiration, die dich tglich herausfordern und frdern. ein Arbeitsumfeld, das die Balance zwischen Arbeit und Privatleben respektiert, flexible Arbeitszeiten ermglicht und dir Raum fr deine persnliche Entfaltung bietet.ber isento: YES zu Kompetenz und Leidenschaft!Wir sind isento (portugiesisch: frei) und realisieren IT-Projekte in Nrnberg von der Konzeption bis zum Rollout. Uns Analytiker:innen eint eine Leidenschaft: Verstehen, was Menschen wirklich brauchen. Unser Motto: Produkte entwickeln, die begeistern! Und das wollen wir gemeinsam tun. Als Junior Requirements Engineer (m\/w\/d) wirst du an der Gestaltung und Entwicklung von Softwaresystemen teilhaben, die unsere Kunden berzeugen.AufgabenDein Job bei isentoDu eignest dir Wissen und Knnen in der Anforderungsermittlung und Systemanalyse an, begleitet von einem engagierten Team.Du bernimmstdeine ersten eigenverantwortlichen Aufgabenund wirkst aktiv an realen Projekten mit, stets mit einem erfahrenen Mentor an deiner Seite.Du gehst strukturiert und systematisch vor, um Anforderungen przise zu erfassen und Kundenbedrfnisse zu verstehen.Du untersttzt agile Entwicklungsteams und erwirbst praxisnahe Kenntnisse in agilen Frameworks.In deinem Team spielst du eine Schlsselrolle bei der Identifizierung vielfltiger Kundenwnsche und Anwenderbedrfnisse.QualifikationDas bringst Du mitDu hast eine Ausbildung oder ein Studium abgeschlossen. Falls nicht, berzeuge uns einfach mit deiner Empathie, deinem analytischen Denken und deinem Engagement  bei uns zhlen nicht nur klassische Wege.Obwohl Kenntnisse in Informatik von Vorteil sind, sind wir auch offen fr diejenigen, die bereit sind, sich in technische Zusammenhnge einzuarbeiten.IREB-Zertifikat: Wenn du es bereits besitzt, groartig! Wenn nicht, untersttzen wir dich bei deinem Einstieg und begleiten dich auf dem Weg zum Experten.Erfahrung im Requirements Engineering wre schn, ist aber keine zwingende Voraussetzung.Die deutsche Sprache beherrschst du sehr gut, Englisch ist aber auch kein Problem fr dich.BenefitsDas ist isentoFlache Hierarchen, flexible Arbeitszeiten und Homeoffice sind schon lange kein Alleinstellungsmerkmal mehr, sondern gehren fr uns zu einer modernen Arbeitskultur. Auf was Du Dich bei uns also sonst noch freuen kannst:Wir arbeiten als Team auf Augenhhe. Wir leben den offenen Austausch, bringen Eigeninitiative, neue Ideen, aber auch konstruktive Kritik ein. Wir lernen von- und miteinander, entwickeln uns zusammen weiter und feiern gemeinsam auf unserer Dachterrasse. Egal ob Rinder- oder Seitansteak, Couchpotato oder Adrenalinjunkie, mit Familie, Katze oder Kakadu  wir sind ein buntgemischtes Team, wir sind isento!Komm in unser Team und bringe Deine Individualitt ein. Wir freuen uns auf Dich!Was wir sonst noch bieten? Besuche unsere Website oder schicke uns Deine Bewerbungsunterlagen und wir lernen uns kennen!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/junior-consultant-requirements-engineering-nuremberg-471255","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000},{"slug":"teamleiter umwelt genehmigung und managementsysteme berlin ","company_name":"Personalas GmbH","title":"Teamleiter (m\/w\/d) Umwelt, Genehmigung und Managementsysteme","description":"Wir suchen fr ein fhrendes Beratungs- und Ingenieurbro in Berlin einen Teamleiter (m\/w\/d) fr den Bereich Umwelt, Genehmigung und Managementsysteme. (Alternativ auch fr den Bereich Arbeitsschutz und Anlagensicherheit.)Das bekommen Sie geboten:+ Unbefristetes Arbeitsverhltnis, in Festanstellung+ 75k bis 120k Jahresbrutto, je nach Expertise+ Sonderzahlungen \/ Prmien+ 30 Urlaubstage+ Ausgewogene Work-Life-Balance, durch flexible Vertrauensarbeitszeit+ Home-Office-Mglichkeiten (2 Tage \/ Woche)+ gefrderte Fort- und Weiterbildungsmglichkeiten + Firmenwagen (AUDI A4), auch privat nutzbar+ Bahncard 25 (1. Klasse), auch privat nutzbar+ Jobrad, Betriebliche Altersvorsorge, betriebliches Gesundheitsmanagement (Massagen, Fitnessprogramm), regelmige Teamevents uvm...AufgabenWas tun Sie dafr:+ operative Fhrung und Entwicklung der Teammitglieder+ Bearbeiten und Fhren von Projekten im Bereich Umwelt, Genehmigung, sowie Managementsysteme+ interne Prozessoptimierungen, sowie externe Prsentation des UnternehmensQualifikationWas bringen Sie mit:+ ein abgeschlossenes (naturwissenschaftliches) Studium oder vergleichbare Berufserfahrung+ mehrjhrige Projekterfahrung im Bereich immissionsschutzrechtliche Genehmigungsverfahren und\/oder Managementsysteme+ sicherer Umgang mit komplexen und multiplen Projekten+ idealerweise erste FhrungserfahrungKlingt das interessant fr Sie? Dann kontaktieren Sie uns Montag  Freitag von 08:00  20:00 Uhr: 030 12 37 36 21PS : Die Vermittlung ist fr Sie als Bewerber immer kostenfrei. Sie bentigen keinen Vermittlungsgutschein. Es handelt sich hierbei um ein Direktvermittlungsangebot. Das Arbeitsverhltnis schlieen Sie mit dem Auftraggeber.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/personalas-gmbh\/teamleiter-umwelt-genehmigung-und-managementsysteme-berlin-86771","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Berlin","created_at":1702680542000},{"slug":"kaufmannischer mitarbeiter in teilzeit nuremberg ","company_name":"isento GmbH","title":"Kaufmännischer Mitarbeiter (m\/w\/d) in Teilzeit","description":"Du suchst eine Position, in der du deine Fhigkeiten in unterschiedlichen Aufgaben voll entfalten kannst. ein Umfeld, wo du nicht nur ein Rdchen im Getriebe bist, sondern aktiv Themen voranbringen kannst ein Arbeitgeber, der dir die Mglichkeit anbietet, deine Zeit individuell zu planen und die Flexibilitt einer Teilzeitstelle zu nutzenber uns:Wir sind isento (portugiesisch: frei) und realisieren IT-Projekte in Nrnberg von der Konzeption bis zum Rollout. Als kaufmnnischer Mitarbeiter (m\/w\/d) bist du der Schlssel zu unseren reibungslosen Ablufen und kannst in verschiedenen Bereichen wie HR, Controlling, Vertrieb und mehr mitwirken. Dadurch bieten wir dir die Mglichkeit, sowohl persnlich als auch beruflich zu wachsen und dich kontinuierlich weiterzuentwickeln.AufgabenDein Job bei isento:Aktualisierung und Pflege der ProjektportaleImplementierung und regelmige Pflege von ForecastsAuswertung von Resturlaub, Krankheitstagen, Zeitkonten und berstunden zur effizienten RessourcenplanungUntersttzung bei der Pflege im WissensmanagementMglichkeit zur Mitarbeit in den Bereichen Marketing und RecruitingAnalyse von Vertriebsdaten und Mitwirkung an Vertriebsaktionen und KampagnenEvaluierung von Kooperationsmglichkeiten mit neuen Partnern und KundenQualifikationDas bringst Du mit:Bereits gesammelte Berufserfahrung, unabhngig von deinem Fachbereich, ist bei uns von Wert  hier zhlen deine Fhigkeiten und dein Einsatz!Gute Excel-Kenntnisse und die Fhigkeit, Dinge effizient zu erledigen (Getting Things Done-Mentalitt)Proaktive und aufmerksame Arbeitsweise, kombiniert mit einer schnellen AuffassungsgabeFreude am Brohund: Ein zustzliches Plus, wenn du eine tierfreundliche Arbeitsumgebung schtztGute Deutsch- und EnglischkenntnisseBenefitsWas wir bieten?Flache Hierarchien, flexible Arbeitszeiten und Homeoffice sind schon lange kein Alleinstellungsmerkmal mehr, sondern gehren fr uns zu einer modernen Arbeitskultur. Auf was Du Dich bei uns also sonst noch freuen kannst:Wir arbeiten als Team auf Augenhhe. Wir leben den offenen Austausch, bringen Eigeninitiative, neue Ideen, aber auch konstruktive Kritik ein. Wir lernen von- und miteinander, entwickeln uns zusammen weiter und feiern gemeinsam auf unserer Dachterrasse. Egal ob Rinder- oder Seitansteak, Couchpotato oder Adrenalinjunkie, mit Familie, Katze oder Kakadu  wir sind ein buntgemischtes Team, wir sind isento!Komm in unser Team und bringe Deine Individualitt ein. Wir freuen uns auf Dich!Was wir sonst noch bieten? Besuche unsere Website oder schicke uns Deine Bewerbungsunterlagen und wir lernen uns kennen!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isento-gmbh\/kaufmannischer-mitarbeiter-in-teilzeit-nuremberg-125236","tags":["IT"],"job_types":[],"location":"Nuremberg","created_at":1702680542000},{"slug":"physiotherapeut als fuhrungskraft zielgehalt  eur dortmund ","company_name":"Jarl Skand Personalberatung GmbH","title":"Physiotherapeut als Führungskraft (m\/w\/d): Zielgehalt 50.400 €","description":"Welches Feuer hat dich einst zur Physiotherapie gefhrt?Bei uns steht die individuelle Betreuung unserer Patienten im Zentrum und wir suchen eine inspirierende Persnlichkeit, die mit Herzblut und fachlicher Expertise unsere Praxis in Dortmund bereichert  und als Fhrungskraft vorangeht.AufgabenDeine Verantwortung:Du fhrst und gestaltest das Team, um die hchste Qualitt der Patientenversorgung sicherzustellen.Analysiere sorgfltig Dysbalancen und Schmerzen, um mageschneiderte Therapieplne zu entwickeln und die Behandlungsergebnisse zu maximieren.Leite aktiv die Reise zur Genesung, optimiere die Plne kontinuierlich und feiere Erfolge mit Patienten und Team.Dokumentiere przise Behandlungsverlufe, Fortschritte und Heilungsprozesse, um eine umfassende Nachverfolgung zu gewhrleisten.QualifikationDeine DNA als Fhrungskraft:Deine Passion fr die Physiotherapie ist ansteckend und inspirierend.Sowohl Patienten als auch Kollegen schtzen deine Empathie und dein einfhlsames Auftreten.Du bist eine treibende Kraft in der Teamarbeit und frderst kreative Ideen.BenefitsUnsere Angebote an dich als Fhrungskraft:Attraktives Zielgehalt: 50.400 Euro Gestaltung deiner Arbeitszeit: Wir bieten flexible Optionen und die Mglichkeit einer 4-Tage-Woche.Karriereperspektiven: Leite als Fhrungskraft oder nutze als Freelancer die Unternehmensvorteile in vollem Umfang.Untersttzendes Team: Unsere Rezeption bietet professionelle Untersttzung, um die Patientenerfahrung zu optimieren.Individuelle Zeiteinteilung: Planung deiner Arbeitszeiten und Urlaubstage ber unsere interne App.Effizientes Arbeiten: Lngere Behandlungszeiten fr maximale Ergebnisse.Deine Weiterentwicklung: Wir investieren in deine Weiterbildung und frdern deine berufliche Entwicklung.Komfort und Moderne: Nutze modernste Praxisrume, gerumige Trainingsbereiche und innovative Ausstattung.Ausgewogene Balance: Grozgige Umziehzeiten und Raum fr spontane Pausen frdern deine Work-Life-Balance.Bereit, deine Leidenschaft fr die Physiotherapie als inspirierende Fhrungskraft zu leben?Ich freue mich schon auf deine Bewerbung!Du erreichst mich so:per E-Mail: karriere (at) physioforlife . netper Telefon: 0231 58 06 75 83per WhatsApp: 0175 20 52 182Gerne nehme ich mir ausreichende Zeit, um deine Fragen zu beantworten und dich bei einer frischgebrhten Tasse Kaffee kennenzulernen. Viele GreDein SamiFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jarl-skand-personalberatung-gmbh\/physiotherapeut-als-fuhrungskraft-zielgehalt-50400-eur-dortmund-5347","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Dortmund","created_at":1702680542000},{"slug":"physiotherapeut als fuhrungskraft in dortmund leite mit leidenschaft ","company_name":"Jarl Skand Personalberatung GmbH","title":"Physiotherapeut als Führungskraft (m\/w\/d) in Dortmund: Leite mit Leidenschaft","description":"Welches Feuer hat dich einst zur Physiotherapie gefhrt?Bei uns steht die individuelle Betreuung unserer Patienten im Zentrum und wir suchen eine inspirierende Persnlichkeit, die mit Herzblut und fachlicher Expertise unsere Praxis in Dortmund bereichert  und als Fhrungskraft vorangeht.AufgabenDeine Verantwortung:Du fhrst und gestaltest das Team, um die hchste Qualitt der Patientenversorgung sicherzustellen.Analysiere sorgfltig Dysbalancen und Schmerzen, um mageschneiderte Therapieplne zu entwickeln und die Behandlungsergebnisse zu maximieren.Leite aktiv die Reise zur Genesung, optimiere die Plne kontinuierlich und feiere Erfolge mit Patienten und Team.Dokumentiere przise Behandlungsverlufe, Fortschritte und Heilungsprozesse, um eine umfassende Nachverfolgung zu gewhrleisten.QualifikationDeine DNA als Fhrungskraft:Deine Passion fr die Physiotherapie ist ansteckend und inspirierend.Sowohl Patienten als auch Kollegen schtzen deine Empathie und dein einfhlsames Auftreten.Du bist eine treibende Kraft in der Teamarbeit und frderst kreative Ideen.BenefitsUnsere Angebote an dich als Fhrungskraft:Attraktives Zielgehalt: 50.400 Euro Gestaltung deiner Arbeitszeit: Wir bieten flexible Optionen und die Mglichkeit einer 4-Tage-Woche.Karriereperspektiven: Leite als Fhrungskraft oder nutze als Freelancer die Unternehmensvorteile in vollem Umfang.Untersttzendes Team: Unsere Rezeption bietet professionelle Untersttzung, um die Patientenerfahrung zu optimieren.Individuelle Zeiteinteilung: Planung deiner Arbeitszeiten und Urlaubstage ber unsere interne App.Effizientes Arbeiten: Lngere Behandlungszeiten fr maximale Ergebnisse.Deine Weiterentwicklung: Wir investieren in deine Weiterbildung und frdern deine berufliche Entwicklung.Komfort und Moderne: Nutze modernste Praxisrume, gerumige Trainingsbereiche und innovative Ausstattung.Ausgewogene Balance: Grozgige Umziehzeiten und Raum fr spontane Pausen frdern deine Work-Life-Balance.Bereit, deine Leidenschaft fr die Physiotherapie als inspirierende Fhrungskraft zu leben?Ich freue mich schon auf deine Bewerbung!Du erreichst mich so:per E-Mail: karriere (at) physioforlife . netper Telefon: 0231 58 06 75 83per WhatsApp: 0175 20 52 182Gerne nehme ich mir ausreichende Zeit, um deine Fragen zu beantworten und dich bei einer frischgebrhten Tasse Kaffee kennenzulernen. Viele GreDein SamiFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jarl-skand-personalberatung-gmbh\/physiotherapeut-als-fuhrungskraft-in-dortmund-leite-mit-leidenschaft-199764","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Dortmund","created_at":1702680542000},{"slug":"sap mm experte fur unternehmensweite s 4hana neueinfuhrung hamburg ","company_name":"Connecting Dots GmbH & Co. KG","title":"SAP MM - Experte (m\/w\/d) für unternehmensweite S\/4Hana Neueinführung","description":"Fr unseren Kunden in Hamburg suchen wir einen SAP MM Inhouse Consultant S\/4HANA (m\/w\/d) zur Festanstellung. Das Unternehmen beschftigt rund 1.000 Mitarbeiter und ist in der Logistikbranche ttig. Da die IT-Landschaft neu aufgebaut und modernisiert werden soll, wird also eine Position erffnet, welche unter anderem die Greenfield SAP Einfhrung und den Neuaufbau von SAP beinhaltet. Fr die Position sollten mindestens sehr gute Deutsch und Englischkenntnisse, sowohl in Wort als auch in Schrift, vorhanden sein. Der grte Teil der Arbeit kann im Homeoffice verrichtet werden, jedoch sollte der Lebensmittelpunkt in oder um Hamburg liegen oder dorthin verlagert werden, da mindestens 7 Tage im Monat vor Ort gearbeitet werden soll.AufgabenDu bist fr die Umstellung der Warenwirtschaft (MM) auf SAP S\/4HANA hauptverantwortlich und bernimmst gleichzeitig die Betreuung der Vorarbeiten zur Gestaltung des Systems. Der Aufbau der SAP-Landschaft (klassisch Greenfield) und die Einfhrung von SAP MM spielen dabei die zentrale Rolle. Das wird ein Projekt fr die nchsten zehn Jahre werden.  Die Zusammenarbeit mit anderen Fachbereichen, um beispielsweise State-of-the-Art Lsungen zu finden, fllt ebenfalls in deinen Aufgabenbereich.  Das Dokumentieren und Bereitstellen deines Wissens gehren ebenso zu deinen Aufgaben, wie auch die Untersttzung deiner Kollegen, zum Beispiel bei Trainings oder Workshops. Bei allen technischen Fragestellungen rund um SAP MM bist du erster technischer Ansprechpartner.QualifikationDu hast ein abgeschlossenes Studium im Bereich der Informatik und bringst mehrjhrige Berufserfahrung in dieser oder einer vergleichbaren Position mit. Auch solltest Du dich bestens mit SAP S\/4HANA auskennen sowie sehr gute kommunikative Fhigkeiten besitzen.  Der Aufbau von SAP-Landschaften sollte fr dich kein Problem darstellen, da dies den grten Teil deiner Arbeit ausmacht. Da Du Teil eines neuen Teams bist, solltest du ebenfalls Spa an der Arbeit mit und innerhalb eines Teams haben. Erfahrung in Modellierung und der Prsentation von komplexeren Sachverhalten hast du im besten Fall auch, da auch dies Themen in deinem Aufgabenbereich sind. Durch den Freiraum in der Mitgestaltung der Umstellung, ist ein kreatives und tiefes Prozessverstndnis gerne gesehen.BenefitsUnser Kunde bietet seinen Mitarbeitern eine groe Menge an verschiedenen Benefits. Neben einer 38,5 Stunden Woche als Vollzeitarbeitsplatz, bietet das Unternehmen die Mglichkeit ungefhr 75% der Arbeit im Homeoffice zu erledigen. Es wird ein attraktives Gehaltspaket geboten, welches mit tariflichen und weiteren Zusatzleistungen, wie beispielsweise 30 Tage Urlaub, Urlaubs- und Weihnachtsgeld und 29 Deutschlandticket, unterstrichen wird. Sowohl die PNV als auch die Anbindung mit dem Auto ist sehr gut und du hast viel Spielraum in der eigenen Gestaltung deines Arbeitsplatzes. Das sind natrlich noch nicht alle Punkte, allerdings lassen sich die genannten Benefits schon sehen.Solltest Du also Lust haben ein neues Team aufzubauen und ein positives Arbeitsklima mitzugestalten, freue ich mich auf deine Unterlagen.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/connecting-dots-gmbh-co-kg\/sap-mm-experte-fur-unternehmensweite-s-4hana-neueinfuhrung-hamburg-84668","tags":["SAP\/ERP Consulting","Development"],"job_types":["berufserfahren"],"location":"Hamburg","created_at":1702680542000},{"slug":"auftragssachbearbeiter in im e commerce coldcenter bochum wattenscheid ","company_name":"Seco Kältetechnik GmbH","title":"Auftragssachbearbeiter\/-in im  E-COMMERCE Coldcenter (Bochum \/ Wattenscheid)","description":"Die Seco Kltetechnik GmbH wurde 1993 durch unseren Inhaber in Bochum gegrndet. Was als Planungsbro fr Groklteanlagen begann, entwickelte sich innerhalb kurzer Zeit zu einem Vollservice in allen Bereichen der Klte- und Klimatechnik. Unsere Kunden aus dem Lebensmitteleinzelhandel, dem Discount, der Industrie, der Khlmbelhersteller sowie der Gastronomie und dessen Handel wenden sich vertrauensvoll an uns.Kein Wunder! Durch unsere Geschftsbereiche im regionalen Anlagenbau sowie dem Coldcenter (bundesweiter Service fr steckerfertige Khl- und Tiefkhlmbel) und der Seco Manufaktur GmbH (kundenspezifische Sonderlsungen) sind wir der Ansprechpartner Nummer 1 fr Klte-, Klima- und Wrmetechnik sowie der dazugehrigen Mess-, Steuer- und Regeltechnik.Als erfolgreiches, innovatives und stetig wachsendes mittelstndisches Unternehmen zeichnen wir uns durch flache Hierarchien, schnelle Entscheidungswege und effiziente sowie technologisch moderne Arbeitsprozesse und Arbeitspltze aus. Insbesondere die sowohl professionelle als auch persnliche Frderung unserer beinahe 500 Colleginnen und Collegen in Deutschland und sterreich liegt uns sehr am Herzen.AufgabenWofr Du brennen kannst:fachkundige Bearbeitung aller telefonisch oder schriftlich eingehender Kundenanfragen, sowie fallabschlieende Bearbeitung von KundenanliegenBearbeitung von Anfragen unserer Kunden per Telefon & E-MailErstellung und Verwaltung der Auftragsdokumentationen mit modernen IT-Systemeneigenstndige Reklamations- und Problembearbeitungallgemeine Aufgaben in der Projektadministration und -koordination, sowie bei der Umsetzung von Manahmen zur QualittssicherungQualifikationDein Werkzeugkoffer beinhaltet: eine abgeschlossene kaufmnnische Ausbildung, idealerweise im Bromanagementumfassende Berufserfahrungen in dem o. g. TtigkeitsbereichKommunikationsstrke fr die telefonische Betreuung von Endkundensehr gute PC- \/ Internet- und MS-Office-Kenntnisse (Word, Excel, Outlook)gute Deutschkenntnisse in Wort und SchriftServiceorientierung und Gewandtheit im Umgang mit KundenBenefitsWas Dich nicht kalt lassen sollte: ein familires und faires Betriebs- und Arbeitsklima mit Charme des Ruhrgebietsein sicherer Arbeitsplatz in einem systemrelevanten und stndig wachsenden Unternehmenein spannendes und inhaltlich herausforderndes Aufgabenfeldein collegiales Miteinander in einem dynamischen Team mit flacher Hierarchieein unbefristeter Arbeitsvertrag mit leistungsorientierter Vergtungeine attraktive betriebliche Altersvorsorge sowie Urlaubs- und Weihnachtsgeld nach der Probezeiteine intensive und praxisnahe Einarbeitung und Begleitung im ArbeitsalltagWir freuen uns ber Deine aussagefhigen Bewerbungsunterlagen und ein baldiges Kennenlernen.Bis kaltFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/seco-kaltetechnik-gmbh\/auftragssachbearbeiter-in-im-e-commerce-coldcenter-bochum-wattenscheid-401411","tags":["HR"],"job_types":[],"location":"Bochum","created_at":1702680542000},{"slug":"projektmanager tech munich ","company_name":"MegaDev GmbH","title":"Projektmanager - Tech (m\/w\/d)","description":"english version belowDu liebst das Zocken, bist kreativ und auf der Suche nach einer neuen Herausforderung? Perfekt!Die MegaDev GmbH wurde 2015 in Mnchen gegrndet und ist mit ihrer Software PLITCH europischer Marktfhrer fr legale Cheats und Trainingcodes fr Einzelspieler PC-Spiele. PLITCH hilft Spielern, das Spielerlebnis ihrem Geschmack und Vorlieben anzupassen, um die Zeit beim PC-Spielen optimal zu nutzen. Die All-in-One Software kann tausende von Fhigkeiten, Gegenstnden und Ressourcen freischalten und repetitives Spielen damit minimieren; andererseits bietet sie aber auch einen Training-Modus, mit dem gezielt Spielsituationen herausfordernder gestaltet werden knnen.Unser Team besteht aus erfahrenen Unternehmern, Entwicklern und Enthusiasten aus der Gaming Branche. Dabei fehlst noch Du:zur Verstrkung suchen wir Dich als einen PROJEKTMANAGER - TECH (m\/w\/d) in Vollzeit.________________________________________________________________________Do you love gaming, are you creative and looking for a new challenge? Perfect!The MegaDev GmbH was founded in Munich, Germany, in 2015 and is the European market leader for legal cheats and training codes for single-player PC games with its software PLITCH. PLITCH gives gamers the freedom to customize their gaming experience according to their wishes. This enables users to get the most out of their play time as our software provides the power to tailor single-player PC games to the players exact needs and preferences. On the one hand, the all-in-one product makes it possible to effortlessly increase skills, multiply items, and add resources  thereby minimizing repetitive gameplay. On the other hand, our software offers hardcore cheats which can be utilized for the creation of a training environment in-game. In this way, players can practice and improve their personal gaming skills.The MegaDev team consists of experienced entrepreneurs, developers and enthusiasts from the gaming industry. But you are still missing:We are looking for you to support us as a full-time PROJECT MANAGER - TECH (m\/f\/d).AufgabenTYPISCHE HERAUSFORDERUNGEN DEINER STELLE:Du bist fr die Planung, Koordination und berwachung von Projekten im Development im Hinblick auf Umfang, Ressourcen und Qualitt zustndigDu bist in Deiner Schnittstellenfunktion im stndigen Austausch mit den relevanten Fachabteilungen innerhalb der MegaDev GmbH und untersttzt bei der Identifizierung neuer Features sowie Entwicklungs- und Verbesserungspotentiale unserer ProdukteIn Zusammenarbeit mit den jeweiligen Fachabteilungen erarbeitest Du im Team relevante Anforderungen, definierst Project Scopes sowie Roadmaps und verteilst die daraus resultierenden Anforderungen und Aufgaben an das Tech Team oder ggf. an externe Dienstleister\/AgenturenDu arbeitest im engen Austausch mit dem Tech Team sowie externen Dienstleistern und berichtest proaktiv ber Projektfortschritte Du betreust das agil arbeitende Tech Team im TagesgeschftDu bist verantwortlich fr die Befhigung, Betreuung und Untersttzung aller Teammitglieder, um sicherzustellen, dass sie ber die richtigen Werkzeuge und das erforderliche Wissen fr die zugewiesenen Aufgaben verfgenDu teilst frhzeitig weiteren Handlungsbedarf mit, um eine dauerhafte Transparenz der Projektzeitplne und eine teambergreifende Synchronisierung zu gewhrleistenDu frderst eine Kultur der kontinuierlichen Verbesserung durch Hinterfragen bestehender Methoden und Vorschlagen innovativer Lsungen zur Optimierung der Projektfristen und -leistung, um jederzeit das bestmgliche Ergebnis erreichen zu knnen   ________________________________________________________________________TYPICAL CHALLENGE OF YOUR POSITION:You are responsible for the planning, coordination and monitoring of development projects in terms of scope, resources and qualityAs a liaison, you are in constant communication with the relevant specialist departments within the MegaDev GmbH and support the identification of new features as well as development and improvement potential for our productsIn collaboration with the respective specialist departments, you will work in a team to develop relevant requirements, define project scopes and roadmaps and distribute the resulting requirements and tasks to the tech team or, if necessary, to external service providers\/agenciesYou work closely with the tech team and external service providers and proactively report on project progressYou support the agile tech team in its day-to-day businessYou are responsible for empowering, mentoring and supporting all team members to ensure they have the right tools and knowledge for the assigned tasksYou communicate further action needs early to ensure ongoing transparency of project timelines and cross-team synchronizationYou foster a culture of continuous improvement by challenging existing methods and proposing innovative solutions to optimize project timelines and performance to always achieve the best possible outcomeQualifikationDEIN PROFIL:Du hast eine lsungsorientierte, proaktive Hands-on-Mentalitt und suchst stetig nach Potenzialen und Optimierungsmglichkeiten, die du effektiv mit den verschiedenen Stakeholdern besprechen kannstDu liebst und lebst agile Projektarbeit und Managementtechniken und kannst Deine Ideen verstndlich formulieren, darstellen und prsentierenDu bist und bleibst immer auf dem Laufenden ber technologische Trends und EntwicklungenDu bist offen fr die groen und kleinen Herausforderungen, die bei der Entwicklung und Verbesserung unserer Produkte im Weg stehen knnten und findest kreative und praktikable LsungenDu kannst Erfahrung in der erfolgreichen Leitung? unterschiedlicher Teams und Interessengruppen, Gewhrleistung einer effektiven Zusammenarbeit und Kommunikation whrend des gesamten Projektlebenszyklus nachweisenDu bist immer auf den neuesten Stand ber neue Trends im Bereich IT und DevelopmentOb Servus oder Hello - Du sprichst Deutsch und Englisch flieendHIT THE HIGHSCORE:Du bist vertraut mit unserem Produkt PLITCHDu hast bereits Erfahrung in .NET Maui und Blazor Hybrid FrontendDu handelst und arbeitest gerne eigenverantwortlich________________________________________________________________________YOUR PROFILEYou have a solution-oriented, proactive hands-on mentality and are constantly looking for potential and optimization opportunities, which you effectively discuss with the various stakeholdersYou love and live agile project work and management techniques and can formulate, present and explain your ideas clearlyYou are and always stay up to date with technological trends and developmentsYou are open to the big and small challenges that could get in the way of the development and improvement of our products and find creative and practicable solutionsYou can demonstrate experience in successfully managing diverse teams and stakeholders, ensuring effective collaboration and communication throughout the project lifecycleYou are always up to date with new trends in IT and developmentWhether Servus or Hello - you speak German and English fluentlyHIT THE HIGHSCORE:You are familiar with our product PLITCHYou already have experience in .NET Maui and Blazor Hybrid FrontendYou like to act and work independently________________________________________________________________________WARUM WIR?Unser Arbeitsumfeld zeichnet sich durch flache Hierarchiestrukturen aus, die Dir viel Freiheit in Deinen Arbeitsbereichen geben und die Mglichkeit schnell Verantwortung zu bernehmen. Wir sind immer auf der Suche nach der genialsten Lsung und ermuntern jeden unserer Mitarbeiter, tglich neue Wege fr Problemlsungen zu finden. Wir sind ein diverses, flexibles und hochmotiviertes Team, schtzen Ehrlichkeit, Transparenz und den respektvollen Umgang miteinander  und sind allesamt Gamer und lieben und leben diese Leidenschaft auch in unserem Alltag!Um dir etwas zurckzugeben, bieten wir Dir nicht nur ein wettbewerbsfhiges Gehalt, sondern kmmern uns auch sonst um Dich:Zustzlich zu einem gensslichen Latte Macchiato, gibts auch kalte Softdrinks und Bier bei uns in der Kche  natrlich aufs HausDamit Du immer mitreden kannst, bieten wir Dir den Raum und die Untersttzung fr Weiterbildungen auf persnlicher und beruflicher EbeneDank unserer hhenverstellbaren Tische und ergonomischen Sthle gehren Rckenprobleme der Vergangenheit anFr Deine Work-Life-Balance: Zeiterfassung, Gleitzeit, die Mglichkeit zur mobilen Arbeit und 28 bezahlte UrlaubstageWeil wir alle nicht jnger werden, kmmern wir uns um Deine Zukunft und bezuschussen Deine Beitrge zur betrieblichen AltersvorsorgeLast but not least: Erholung und gemeinsames Barbecue auf unserer DachterrasseAlso, worauf wartest Du noch?Wir knnen es kaum erwarten, Dich kennenzulernen!________________________________________________________________________WHY US?Our work environment is characterized by flat hierarchy structures, which give you a lot of freedom in your work areas and the opportunity to quickly take on responsibility. We are always looking for the most brilliant solution and encourage each of our employees to find new ways to solve problems every single day.We are a diverse, flexible, and highly motivated team, we value honesty, transparency, and respectful interaction with each other - and we are all gamers and love and live this passion in our everyday lives!To give you something back, we don't only offer you a competitive salary but also take care of you in any other way:A creamy Latte Macchiato, some cold soft drinks or a nice, cool beer? Whatever your heart desires, we've got it stocked in our kitchen. On the house, of courseMake sure you're always part of the conversation: We offer the opportunities and support for further education on both a professional and a personal levelBack problems are a thing of the past with our height-adjustable desks and ergonomic chairsKeep your work and your life in balance with fair time-tracking, flexible working hours, the possibility of mobile work and 28 days of paid vacationWe know we're all not getting any younger - that's why we subsidize your contributions to the company pension schemeLast but not least: Our roof terrace is THE spot for some relaxation or a spontaneous barbecue!So, what are you waiting for?We can't wait to get in touch with you!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/megadev-gmbh\/projektmanager-tech-munich-98170","tags":["Project Management"],"job_types":["berufserfahren"],"location":"Munich","created_at":1702680542000},{"slug":"versuchsingenieur bergbau recycling  70k cologne ","company_name":"Riverstate Premium Recruiting","title":"Versuchsingenieur Bergbau\/Recycling 50-70k (m\/w\/d)","description":"Sie wollten schon immer mal Superheld sein und Ihr Herz schlgt fr Nachhaltigkeit und High-Tech? In dieser Position finden Sie alles vereint! Als Versuchsingenieur fr ein international renommiertes Unternehmen, kmmern Sie sich darum, Rohstoffe dem Kreislauf zurckzufhren. So tragen Sie mageblich zur Nachhaltigkeit in Bereichen bei, in denen Wertstoffe, Metalle und Stoffe aus dem Bergbau wiederverwendet werden.Auf Sie warten auergewhnliche Projekte fr Kunden rund um den Globus, ein herzliches Team, ein Einstiegsgehalt von bis zu 70.000 Euro, je nach Erfahrung, monatliche Bonuszahlungen und grozgige Gleitzeitmodelle. Die firmeneigene Entwicklungsabteilung arbeitet eng mit Universitten und Forschungseinrichtungen zusammen und sichert so die fhrende Innovationsstrke, um Wertstoffe weltweit in reinster Form aufbereiten zu knnen. Kommen Sie ins Team und bewerben Sie sich jetzt alsVersuchsingenieur Bergbau\/Recycling 50-70k (m\/w\/d)AufgabenSie fhren selbststndig Versuche durch und fhren den Kunden durch die einzelnen ArbeitsprozesseSie bernehmen die technische Beratung von Kunden fr Prozesse und Maschineneinstze bis hin zur Erstellung von kompletten Arbeitsprogrammen Sie leisten technische Untersttzung fr den VertriebSie untersttzen die technischen Kollegen bei Bedarf vor Ort oder remoteQualifikationSie sind Techniker oder Ingenieur in den Fachrichtungen Aufbereitungstechnik, Rohstoffingenieurwesen oder Umweltingenieurwissenschaften, Elektro- oder Verfahrenstechnik o..Sie haben sehr gute Kenntnisse in Deutsch und Englisch in Wort + SchriftSie haben einen Fhrerschein der Klasse BBenefitsSpannendes Arbeitsfeld: Ihre Ttigkeit ist uerst vielseitig und Sie genieen ein Hchstma an Eigenverantwortung. Hier haben Sie mit interessanten Menschen ebenso zu tun wie mit spannenden Maschinen aus den unterschiedlichsten Branchen. Wirkungsfeld: Um Ihre Expertise bestmglich einsetzen zu knnen, begleiten Sie Kollegen rund um den Globus und untersttzen den technischen Arbeitsablauf. Der Reiseanteil betrgt dabei 20%.Entwicklungspotential: Das Unternehmen ist in den vergangenen Jahren stark gewachsen und es haben sich durch die allgemeine globale Entwicklung neue Arbeitsfelder ergeben. In den nchsten Jahren wird es weiterhin neue Anforderungen an die Technik geben, die Sie mageblich mitgestalten knnen.Weitere Benefits: Neben 30 Urlaubstagen jhrlich erhalten Sie eine betriebliche Altersvorsorge, Mglichkeiten zum Fahrradleasing und ein zukunftsorientiertes Arbeitsumfeld auf dem neuesten Stand der Technik. Genieen Sie die Vorzge grozgiger Gleitzeitmodelle und die Mglichkeit, Ihre Berichte im Homeoffice zu verfassen.Bewerben Sie sich am besten jetzt gleich. Wir melden uns anschlieend telefonisch bei Ihnen und begleiten Sie kompetent und zuverlssig durch den gesamten Bewerbungsprozess. Unsere Beratung ist fr Sie vllig kostenlos. Falls Sie Fragen haben, erreichen Sie Ihre persnliche Ansprechpartnerin Marion Hofmann unter +49 30 549 059 738.# recycling # kreislaufwirtschaft # verfahrenstechnik # versuchswesen # verfahrensingenieur # versuchsingenieur # versuche # versuchstechniker # rohstoffe # abfallverwertung # wertstoffaufbereitung # sortiermaschinen # sortieranlagen # sondermaschinenbau # inbetriebnehmer # bergbau # metallurgie # prozessingenieur # abfallbehandlungFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riverstate-premium-recruiting\/versuchsingenieur-bergbau-recycling-50-70k-cologne-154089","tags":["Process Engineering"],"job_types":["berufserfahren"],"location":"Cologne","created_at":1702680542000},{"slug":"werkstudentin praktikantin venture capital in koln cologne ","company_name":"Realyze Ventures Management GmbH","title":"Werkstudent:In \/ Praktikant:In (m\/w\/d) Venture Capital in KÖLN","description":"Wir suchen hier in KLN nach engagierten Werkstudenten und Praktikanten, die unser Team im Bereich Venture Capital und Start-up-Management untersttzen. In dieser aufregenden Rolle wirst du die Gelegenheit haben, an verschiedenen Aspekten des Venture Capital-Geschfts teilzunehmen und wertvolle Erfahrungen in der Start-up-Branche zu sammeln.AufgabenAkquise und Auswahl neuer Start-ups: Du hilfst bei der Identifizierung und Akquise vielversprechender Start-ups, die in unser Portfolio passen und untersttzt bei der Vorqualifizierung von unserem Deal Flow anhand von uns definierten AnforderungenStartup und Deal Administration: Du bernimmst die Verantwortung fr den administrativen Investmentprozess, trgst fr uns relevante Startups in unsere Datenbank ein, stellst die kontinuierliche Dokumentation sicher, hltst die einzelnen Prozessschritte nach und arbeitest eng mit unseren Investment Managern zusammenDeal Due Diligence: Du bernimmst Teilaufgaben im Due Diligence Prozess und arbeitest hierbei eng mit den zustndigen Investment Managern zusammen Dokumenten Management: Du wirkst bei der Erstellung von Investment Vorlagen und anderen relevanten Dokumenten im Entscheidungsprozess mit und untersttzt unsere das Team hierbei enorm Portfoliomanagement und Monitoring\/Reporting: Du hilfst bei der berwachung und dem Reporting unserer Portfolio-Unternehmen und erhltst Einblicke in die Zusammenarbeit mit den Startups  Growth & More: Du hast die Mglichkeit erste Erfahrung bei der Erstellung von Financial Modeling Reviews und der Erstellung von Business Cases sowie diversen Themen im Bereich Fondsmanagement & Investor Relations zu sammeln und entwickelst dich in verschiedenen Bereichen weiterQualifikationLeidenschaft fr Start-ups: Du solltest ein starkes Interesse an der Start-up-Szene und dem Unternehmertum mitbringen und bereits erste Erfahrungen in Form eines Praktikums oder eines Werkstudentenjobs in einem Startup gesammelt haben. Dein Ziel sollte es sein, nach deinem Studium Fu in der VC Branche fassen zu wollenAnalytische Fhigkeiten & Finance: Die Fhigkeit, Informationen zu analysieren und Schlsse zu ziehen, ist entscheidend. Zudem ist ein grundlegendes Verstndnis von Finanzen und Geschftsmodellen von VorteilSelbststndigkeit: Du arbeitest eigenverantwortlich und zeigst Initiative, auerdem ist es fr dich selbstverstndlich, die Extra Meile zu gehen und bist bereit, kontinuierlich zu lernen und dich in verschiedene Aufgabenbereiche des Venture Capital-Geschfts einzuarbeitenTeamfhigkeit: Du arbeitest gerne im Team, kommunizierst offen und transparent, hast kein Problem damit, fr deine Arbeitsergebnisse einzustehen und hast deine Interaktionsfhigkeit im Team in der Praxis bereits erfolgreich unter Beweis stellen knnen und erste Erfahrung gesammeltKommunikationsfhigkeiten\/Bilingualitt: Gute schriftliche und mndliche Kommunikationsfhigkeit auf Englisch UND Deutsch sind wichtig, um deine tglichen Aufgaben bei uns zu bewltigenVerfgbarkeit\/Arbeitszeit Werstudenten: Du hast Zeit und Lust, uns fr mindestens die nchsten 12 Monate als Werkstudent:In fr 16-20 Stunden\/Woche an 2-3 Tagen\/Woche zu untersttzen und mit uns gemeinsam zu wachsenVerfgbarkeit\/Arbeitszeit Praktikanten: Du hast Zeit und Lust, uns fr mindestens 3 bis 6 Monate als Praktikant:In im besten Fall Vollzeit zu untersttzen und mit uns gemeinsam zu wachsenLocation Kln: Du hast die Mglichkeit 1-2 mal pro Woche bei uns im Office in Kln\/Mhlheim vor Ort zu sein und mit uns On-Site zusammen zu arbeiten. Falls fr dich ein Umzug nach Kln und Umgebung in Frage kommt ist das natrlich auch eine Option.BenefitsWas dich erwartet?Eine angenehme Arbeitsatmosphre in einem kleinen, agilen Team mit sehr groen Entfaltungs- und Mitgestaltungsmglichkeiten Abwechslungsreiche und innovative Themenfelder und eine enorme Lernkurve Die Chance persnlich und fachlich in einem konstruktiven und dynamischen Arbeitsumfeld zu wachsen Entwicklungsmglichkeiten und die Chance, deinen Berufseinstieg bei einem jungen aufstrebenden Venture Capital Unternehmen zu schaffenWir freuen uns auf Deine Bewerbungen!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/realyze-ventures-management-gmbh\/werkstudentin-praktikantin-venture-capital-in-koln-cologne-8048","tags":["Business Analyst"],"job_types":["Working student"],"location":"Cologne","created_at":1702680542000},{"slug":"quereinstieg als netzwerk service techniker aalen ","company_name":"Software Engineering GmbH","title":"Quereinstieg als Netzwerk Service-Techniker (w\/m\/d)","description":"Du bist auf der Suche nach neuen Herausforderungen?WIR auf der Suche nach Verstrkung unseres Teams!Fr Service Team in Aalen sind wir auf der Suche nach engagierter Untersttzung als:IT Netzwerk Service-Techniker (w\/m\/d) - gerne (Quer)EinsteigerHilf uns dabei, externe und interne Kunden zu betreuen, indem du unterschiedliche technische Ttigkeiten im Bereich von Installation, Reparatur und Abschaltung von Netzelementen bernimmst und \/ oder die Ttigkeiten und Aufgaben lernst!AufgabenWartung und Installation von LAN- und WAN-UmgebungenEnd-to-End-Fehlerbestimmung, Fehlersuche und -behebungVerwaltung von Ticket Management SystemenExterne technische Prfung von GertenVerwaltung der Logistik von Ersatzteilen und ReparaturenEinrichtung von Hardware und Herunterladen von Gertekonfigurationen beim KundenAktivitten im Zusammenhang mit Netzwerk- und Kundenwartung und -installation. (Service Desks, Telco, etc.)berwachung administrativer Aufgaben wie Gerterckgabe, Aktualisierung der Service-Koordination, Abschluss von FllenKoordinierung und Verwaltung von NetzwerkinfrastrukturnderungenQualifikationErste Praxiserfahrung im Bereich Netzwerktechnik Interesse an von LAN- & WAN-Technologien, Telekommunikationstechnologien und -protokollenPC-Kenntnisse im Bereich MS Outlook, MS Excel, MS Word, MS Explorer, Visio, etc.Sprachkenntnisse: flieend Deutsch und EnglischBenefitsDienstwagen (auch zur privaten Nutzung mglich)Arbeiten in einem innovativen UnternehmenErfahrungsaustausch mit anderen FachkrftenGute Mglichkeit zur WeiterbildungHerausragende Arbeitsbedingungen und faire BezahlungArt: FestanstellungOrt: AalenBeginn: 02.01.2024 oder nach VereinbarungFalls wir Dein Interesse geweckt haben bewirb Dich jetzt, wir freuen uns auf Dein Feedback!Kontakt:SOFTWARE ENGINEERING GMBHAnsprechpartner: Hr. LdemannTel.: 089 1787677-55Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/software-engineering-gmbh\/quereinstieg-als-netzwerk-service-techniker-aalen-241908","tags":["System and Network Administration"],"job_types":[],"location":"Aalen","created_at":1702680542000},{"slug":"lohn und gehaltsbuchhalter munich ","company_name":"RiJu Connecting GmbH","title":"Lohn- und Gehaltsbuchhalter (m\/w\/d)","description":"Die RiJu Connecting GmbH steht fr Professionalitt und Loyalitt. Wir sind ein junges Unternehmen mit sehr viel Erfahrung in der Personaldienstleistung. Unser Name RiJu Connecting setzt sich aus den Anfangsbuchstaben unserer Vornamen Riccardo und Julia zusammen  als Ausdruck unseres intensiven, persnlichen Engagements. Und durch den Zusatz Connecting (=verbindend) przisieren wir, was wir tun, die richtigen Menschen und Positionen miteinander zu verbinden.Fr ein Unternehmen im Bereich der Gastronomie im Raum Mnchen suchen wir zum nchstmglichen Zeitpunkt einen Lohn- und Gehaltsbuchhalter (m\/w\/d).Es handelt sich um eine Direktvermittlung.AufgabenDurchfhrung der Lohn- und GehaltsabrechnungenPflege und Betreuung der elektronischen ZeiterfassungErstellung von Statistiken und AuswertungenQualifikationEine abgeschlossene kaufmnnische BerufsausbildungMehrjhrige Berufserfahrung in der EntgeltabrechnungGute Kenntnisse in den gngigen MS-Office AnwendungenSehr gute Deutschkenntnisse in Wort und SchriftBenefitsKostenfreie VerpflegungVolle soziale AbsicherungMglichkeit zur mobilen ArbeitVergnstigte Mobilittsangebote (z.B. PNV)Sollten wir Ihr Interesse erweckt haben, lassen Sie uns gerne IhreBewerbungsunterlagen zukommen.Sollten Sie Fragen haben, stehen wir Ihnen gerne unter069-850966011 zur Verfgung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riju-connecting-gmbh\/lohn-und-gehaltsbuchhalter-munich-18844","tags":["HR"],"job_types":[],"location":"Munich","created_at":1702680542000},{"slug":"microsoft dynamics  ce entwickler mainz ","company_name":"RiJu Connecting GmbH","title":"Microsoft Dynamics 365 CE Entwickler (m\/w\/d)","description":"Die RiJu Connecting GmbH steht fr Professionalitt und Loyalitt. Wir sind ein junges Unternehmen mit sehr viel Erfahrung in der Personaldienstleistung. Unser Name RiJu Connecting setzt sich aus den Anfangsbuchstaben unserer Vornamen Riccardo und Julia zusammen  als Ausdruck unseres intensiven, persnlichen Engagements. Und durch den Zusatz Connecting (=verbindend) przisieren wir, was wir tun, die richtigen Menschen und Positionen miteinander zu verbinden.Fr ein erfolgreiches, mittelstndisches Full Service IT-Unternehmen im Groraum Mainz suchen wir zum nchstmglichen Zeitpunkt einen Microsoft Dynamics 365 CE Entwickler (m\/w\/d).Es handelt sich um eine Direktvermittlung.AufgabenEntwicklung von BackendprozesseErstellung von Model-driven AppsErstellung technischer DatenQualifikationErfahrung mit der Anpassung und Integration von Microsoft Dynamics 365Sehr gute Kenntnisse in der Entwicklung mit C# und Type ScriptGute SQL Datenbank KenntnisseSehr gute Deutsch- und EnglischkenntnisseBenefitsBetriebliche AltersvorsorgeFlexible ArbeitszeitenMobiles Arbeiten Firmenwagen auch zur privaten NutzungSollten wir Ihr Interesse erweckt haben, lassen Sie uns gerne IhreBewerbungsunterlagen zukommen.  Sollten Sie Fragen haben, stehen wir Ihnen gerne unter069-850966010 zur Verfgung.  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riju-connecting-gmbh\/microsoft-dynamics-365-ce-entwickler-mainz-490149","tags":["System and Network Administration"],"job_types":[],"location":"Mainz","created_at":1702680542000},{"slug":"veranstaltungstechniker edingen neckarhausen ","company_name":"RiJu Connecting GmbH","title":"Veranstaltungstechniker (m\/w\/d)","description":"Die RiJu Connecting GmbH steht fr Professionalitt und Loyalitt. Wir sind ein jungesUnternehmen mit sehr viel Erfahrung in der Personaldienstleistung. Unser NameRiJu Connecting setzt sich aus den Anfangsbuchstaben unserer Vornamen Riccardound Julia zusammen  als Ausdruck unseres intensiven, persnlichen Engagements.Und durch den Zusatz Connecting (=verbindend) przisieren wir, was wir tun, dierichtigen Menschen und Positionen miteinander zu verbinden.Fr einen Kunden in der Eventbranche im Rhein-Neckar-Kreis suchen wir zum nchstmglichen Zeitpunkt einen Veranstaltungstechniker (m\/w\/d) in Vollzeit.Es handelt sich um eine Direktvermittlung.AufgabenPlanung sowie Auf- und Abbau der Veranstaltunstechnik und VideoinstallationenMedien- und Broadcast-Technik bei Projekten und StudioproduktionenBetreuung der Veranstaltungen vor OrtBearbeitung von Kunden- und Projektanfragen sowie AusschreibungenQualifikationAbgeschlossene technische Ausbildung\/Studium oder vergleichbare Qualifikation im Bereich Video- oder VeranstaltungstechnikMehrjhrige Berufserfahrung in der VeranstaltungstechnikSehr gute Deutschkenntnisse in Wort und SchriftReisebereitschaft \/ Fhrerschein Klasse BBenefitsGehalt und Benefits werden mit dem Kunden individuell vereinbart.Sollten wir Ihr Interesse geweckt haben, lassen Sie uns gerne Ihre Bewerbungsunterlagen zukommen.Bei Fragen stehen wir Ihnen gerne unter 069-850966011 oder 0160-99806415 zur Verfgung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/riju-connecting-gmbh\/veranstaltungstechniker-edingen-neckarhausen-145728","tags":["Engineering"],"job_types":[],"location":"Edingen-Neckarhausen","created_at":1702680542000},{"slug":"kaufmannischen mitarbeiter buchhaltung rechnungswesen straubing ","company_name":"ODAV AG","title":"Kaufmännischen Mitarbeiter Buchhaltung \/ Rechnungswesen (m\/w\/d)","description":"Zum nchstmglichen Zeitpunkt suchen wir einen Kaufmnnischen Mitarbeiter Buchhaltung \/ Rechnungswesen (m\/w\/d)Als innovativer Technologiepartner des Handwerks untersttzt die ODAV AG seit 50 Jahren Handwerksbetriebe und deren Organisationen mit hochwertigen Software-Lsungen und IT-Dienstleistungen.AufgabenBeratung bei der Einfhrung & dem Betrieb von Softwareprodukten aus dem Bereich Finanz- & RechnungswesenBestandskundenbetreuung und ProduktvermarktungProjektmanagementDurchfhrung von KundenschulungenKontinuierliche ProduktfortentwicklungQualifikationSie verfgen ber eine kaufmnnische bzw. steuerfachliche Ausbildung oder ein abgeschlossenes Hochschulstudium bevorzugt aus den Studienrichtungen BWL oder VWLIdealerweise bringen Sie bereits erste Berufserfahrung im Finanz- und Rechnungswesen mitSie begeistert sowohl der Umgang mit Kunden als auch IT-Systeme und SoftwareprodukteTeamfhigkeit ist fr Sie eine Selbstverstndlichkeit, denn Erfolge feiert man gemeinsamGute analytische Fhigkeiten und eine strukturierte Arbeitsweise runden Ihr Profil abBenefitsWir bieten einen zukunftsorientierten Arbeitsplatz mit einem hohen Ma an Selbststndigkeit und der Mglichkeit im Mobile Office zu arbeiten. Profitieren Sie von einer gelebten Work-Life-Balance und engagierten Kollegen. In spannenden Projekten knnen Sie Ihre Fhigkeiten und Ideen einbringen. Unser umfangreiches Schulungsangebot sorgt dafr, dass Ihre Entwicklung nicht stillsteht. Ein flexibles Arbeitszeitmodell, betriebliche Altersvorsorge und eine leistungsgerechte Bezahlung runden unser Angebot ab.Interessiert? Dann sollten wir uns kennenlernen!Bewerben Sie sich direkt ber unser Onlineportal.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/odav-ag\/kaufmannischen-mitarbeiter-buchhaltung-rechnungswesen-straubing-475809","tags":["IT"],"job_types":[],"location":"Straubing","created_at":1702680542000},{"slug":"controller hr bereich stuttgart ","company_name":"univativ GmbH","title":"Controller (m\/w\/d) HR-Bereich","description":"Baldmglichst, bis zum 01.05.2025 | 40 Stunden pro Woche | Stuttgart | Energiewirtschaft | Berufseinsteiger, Berufserfahrener | 62000 bis 65000  im Jahr | Projekt-ID A202344895_2Sunivativ ist ein Projekt- und Personaldienstleister, der Studenten und Absolventen spannende Jobs bei renommierten Unternehmen bietet. Deine Karriere ist unsere Mission, denn Deine Entwicklung liegt uns am Herzen.Du sucht eine Position, bei der Du Deine Kenntnisse voll einbringen und weiterentwickeln kannst? Dann suchen wir Dich als Controller (m\/w\/d) fr den HR-Bereich!Bei unserem Kunden handelt es sich um ein erfolgreiches Unternehmen aus der Energiebranche. Dich erwarten vielfltige Aufgaben und eine freundliche Arbeitsatmosphre. Wir konnten Dein Interesse wecken? Dann freuen wir uns auf Deine Bewerbung!AufgabenDu erstellst und prsentierst HR-Reports mit aussagekrftigen KennzahlenZudem wirkst Du bei Quartals- und Jahresabschlssen mitDie Erstellung von ad-hoc-Auswertungen sowie die Analyse und Interpretation strategischer HR-KPIs gehren zu Deinen AufgabenDu begleitest eine Schnittstellenfunktion zur ITDie bernahme operativer Controlling-Themen sowie deren Koordination ist ebenso in Deinem ZustndigkeitsbereichQualifikationDu bringst ein abgeschlossenes Studium im Bereich Wirtschaftswissenschaften, Wirtschaftsinformatik oder vergleichbar mitDu hast Erfahrung im HR-ControllingAuerdem bist Du IT-affin, hast eine analytische Denkweise und ein gutes ZahlenverstndnisIdealerweise hast Du Kenntnisse in SAP BW, SAP HCM und MS Power BIDu sprichst verhandlungssicher Deutsch und EnglischBenefitsEin Jahreslohn zwischen 62000  und 65000 Die Mglichkeit auch Remote von zu Hause zu arbeitenDu erhltst von uns Rckmeldung innerhalb von 48 StundenWhrend Deines Einsatzes wirst Du durch einen persnlichen Talent Coach begleitetWir bieten Dir vielfltige Weiterbildungsmglichkeiten in unserer e-academyWir konnten Dein Interesse wecken? Klasse!Wir freuen uns auf Deine BewerbungFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/controller-hr-bereich-stuttgart-175804","tags":["Finance"],"job_types":[],"location":"Stuttgart","created_at":1702680542000},{"slug":" 2600eur 500eur bonus telefonische kundenbetreuer berlin ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2600€ + 500€ Bonus Telefonische Kundenbetreuer m\/w\/d","description":"Mchte Sie fr ein internationales Unternehmen arbeiten, das zu den marktfhrenden unabhngigen Dienstleistern im Bereich von Tankkartenlsungen in Deutschland gehrt?Das Team in Berlin wird erweitert und gesucht werden Kundenbetreuer\/Sachbearbeiter m\/w\/d im Inbound.AufgabenKundenbetreuungAngebotserstellung und BearbeitungFallabschlieende Bearbeitung aller KundenanfragenE-Mail- und FaxbearbeitungSchnittstelle zu anderen AbteilungenQualifikationFhigkeit im Team zu arbeitenFreundliches AuftretenAngenehme StimmeDeutschkenntnisse in Wort und Schrift auf muttersprachlichem NiveauEffiziente, schnelle ArbeitsweiseSpa am TelefonierenMS-Office Kenntnisse insbesondere Exvelgute Englischkenntnisse fr die interne KommunikationBenefits2300  2600  brutto (verhandelbar  Berufserfahrung) zzgl. 500 BonusAngenehmes BroNhe FriedrichstraeArbeitszeiten von Mo-Do 08:30  17 Uhr, Freitag bis 15 Uhr  Vollzeit 37,5 StundenEntwicklungsmglichkeiten in einem internationalen KonzernBewerbung:Wir freuen uns auf Ihre Bewerbung per Mail oder WhatsAppIvonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-393791","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"hr generalist berlin ","company_name":"Workstation Customer Care","title":"HR Generalist (m\/f\/d)","description":"Our customer is one of the most important call centers on the market. As a result of its expansion their HR department is looking into having new members join the team.The HR Generalist (m\/f\/d) will advise, guide and coach corporate people managers on employment matters including policy interpretation, HR procedures, employee conflicts, engaging employees, performance management and employee transitions within and\/or out of the company.The HR Generalist will also conduct investigations into Employee Relations matters with a focus on customer or competitor behavior complaints, employer complaints and applicant\/employee complaints. The HR Generalist will partner with the Law department to ensure a fair and consistent approach to policies and procedures, thus promoting a positive culture within the business. Responsibilities:Coach and advise managers to provide resources and guidance when complex workplace issues arise among employees or between employees and managers, especially at key points of the employee life cycle such as performance management, leaves or absence, internal job changes or end of employment.Supports the corporate Mission, Vision, and Values in their work and communications.Acts as a Company advocate, advancing corporate culture, while ensuring that employees are being supported and represented in a fair and consistent manner.Maintains the highest standards of integrity and business ethics.Proactively connects with new employees in the business unit to discuss their onboarding experience, reinforce culture and values, and assist them in networking within their new organization.Works closely with leaders and employees to improve work relationships, build morale, increase productivity and engagement.Your qualifications:Ability to listen well, understand root causes of a situation, then provide exceptional guidance and coaching to leaders on how to proceed.Knowledgeable of employment law; must be up-to-date with current Employee Relations legislation.Strong negotiation and influencing skills with proven track record in influencing employees at all levels of the organization in a consultative manner.Excellent verbal and written communication skills in German and English.Excellent analytical ability.Well-organized and able to successfully handle several priorities simultaneously.Independent judgment and decision-making skills.Ability to use modern workplace technology (e.g. IP phones, video conferencing, etc.) and software, including Microsoft Word, Excel and PowerPoint, etc.At least 3 years progressive HR experience requiredWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/hr-generalist-berlin-178697","tags":["HR"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"kundenservice vertragsverlangerung turkisch berlin ","company_name":"Workstation Customer Care","title":"Kundenservice Vertragsverlängerung TÜRKISCH - m\/w\/d","description":"Unser Kunde ist einer der groen Mobilfunkbetreiber. Im Gegensatz zum Wettbewerb spricht er seine Kunden gezielt vor Ende der Vertragslaufzeit an und bietet aktuelle Tarife und neue Handys an. Der Kunde profitiert durch gnstigere Tarife und die Mglichkeit ein neues Smartphone zu besten Konditionen zu erhalten - unser Auftraggeber profitiert durch Kundentreue und eine steigende Zahl an Nutzern. Wenn Sie (m\/w\/d) Teil dieses erfolgreichen Teams werden wollen, sollten Sie sich bewerben. Das Unternehmen legt Wert darauf, dass jedes Angebot einen wirklichen Vorteil fr den Kunden bietet. Hierzu analysiert das Computersystem im Vorfeld der Gesprche die aktuellen Eckdaten. Das System zeigt Ihnen am Bildschirm mgliche Alternativprodukte und die centgenaue Sparmglichkeit fr den Kunden. Wir suchen talentierte Persnlichkeiten, die sowohl deutsch als auch trkisch sprechen.Das bietet Ihnen unser Auftraggeber:Fixgehalt zuzglich einer Erfolgsprmie moderne Brorume mit freien Getrnkenverbilligtes NVP Ticketkeine Zeitvorgaben fr die GesprcheDiese Aufgaben erwarten Sie:Direktansprache der bestehenden Kunden per Telefon oder MailZusammenfassung der bestehenden Vertragskonditionen fr den Kunden (z.B. Laufzeitende, bertragungsgeschwindigkeit)Vorstellung der verfgbaren Telefone mit ihren Unterscheidungskriterien (z.B. Betriebssystem, Gre, Kameraauflsung)Hinweis auf besonders gnstige AktionsangebotePrsentation der dazu passenden Vertragsoptionen (Bercksichtigung des aktuellen Nutzungsprofils - z.B. viele Auslandsaufenthalte, hohes Datenbertragungsvolumen)Pflege der Datenbank und der VertragsunterlagenWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kundenservice-vertragsverlangerung-turkisch-berlin-187105","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"einstieg in die buchhaltung magdeburg ","company_name":"Workstation Customer Care","title":"Einstieg in die Buchhaltung - Magdeburg m\/w\/d","description":"Sie haben erfolgreich eine Ausbildung oder Umschulung im Bereich Buchhaltung abgeschlossen und mchten jetzt erste Berufserfahrung in diesem Bereich sammeln? Sie rgern sich darber, dass viele Unternehmen mehrjhrige Berufserfahrung erwarten, damit Sie ohne groe Einarbeitung sofort eingesetzt werden knnen. Anders luft es bei unserem Auftraggeber!Bevor Sie starten, wird in einer sechswchigen Schulung Ihr Wissen aufgefrischt und an der ein oder anderen Stelle sicher auch ergnzt:Sie lernen, wie man Rechnungspositionen in den Anzeigemasken findetSie sammeln Erfahrung in der Erstellung von Rechnungskorrekturen und GutschriftenSie drfen auch Angebote schreiben und Vertragskonditionen ndernSie erfahren, wie Sie Einblick in Zahlungsbelege und Kontostnde nehmen knnenSie erstellen Abbuchungsauftrge und lsen Zahlungslufe ausSie erhalten eine Einarbeitung in SAP (wenn Sie damit schon gearbeitet haben, um so besser)Bei dieser Stelle arbeiten Sie (m\/w\/d) in der Sachbearbeitung fr einen groen Energieanbieter. Sie betreuen die Kunden in allen kaufmnnischen Fragestellungen und Erfassen die relevanten Daten im System. Alles was Sie gelernt haben, knnen Sie jetzt nutzen: Sie geben Auskunft zu geleisteten Vorauszahlungen, erlutern die Rechnungsdetails oder ndern den Energiemix, wenn der Kunde z.B. keinen Atomstrom mehr mchte.Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/einstieg-in-die-buchhaltung-magdeburg-317379","tags":["Finance"],"job_types":[],"location":"Magdeburg","created_at":1702680542000},{"slug":"burokaufmann schwerpunkt personal berlin ","company_name":"Workstation Customer Care","title":"Bürokaufmann Schwerpunkt Personal  (m\/w\/d)","description":"Unser Auftraggeber ist ein bekannter Name aus dem Einzelhandel mit mehreren hundert Filialen. Durch berzeugenden und zukunftsweisenden Service und hochwertige Produkte hat sich das Unternehmen am Markt hervorragend positioniert und sich bei seinen Kunden einen Namen gemacht. Fr die Personalsachbearbeitung suchen wir einen Brokaufmann (m\/w\/d) Schwerpunkt Personal.Ihre Aufgaben:Betreuung und Beratung von Mitarbeitern in allen Fragen des PersonalwesensRekrutierungAnlage und Pflege der PersonalaktenErfassung von Abwesenheiten wie z.B. Urlaub und KrankheitVorbereitende LohnbuchhaltungPflege der ZeiterfassungPersonaleinfhrungAllgemeine administrative AufgabenIhr Profil:Berufserfahrung in der PersonalsachbearbeitungAbgeschlossene kaufmnnische Ausbildung mit dem Interessenschwerpunkt PersonalGute Kenntnisse im ArbeitsrechtSicheren Umgang mit MS OfficeSelbststndiges ArbeitenHohe ZuverlssigkeitFlexibilitt und EngagementWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-schwerpunkt-personal-berlin-468590","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"mitarbeiter kassenabrechnung und tagesabschluss berlin ","company_name":"Workstation Customer Care","title":"Mitarbeiter Kassenabrechnung und Tagesabschluss (m\/w\/d)","description":"Im Auftrags unseren Mandanten, ein erfolgreich gefhrtes Einzelhandelsunternehmen im Non-Food Bereich, suchen wir einen kaufm. Mitarbeiter (m\/w\/d) fr die Vorbereitung und Durchfhrung von Kassenabrechnungen und Tagesabschlssen.Ihre Aufgaben:Kassenabrechnung und KassenbuchfhrungVerbuchung von Ein- und Auszahlungenberprfung von EinzahlungenTelefonische Kommunikation mit den FilialenKlrung von KassendifferenzenGutscheinverwaltung und Kreditkartenabrechnungberwachung und Durchfhrung des ZahlungsverkehrsKontenbereinigungUnsere Anforderungen:erfolgreich abgeschlossene Ausbildung im Kaufmnnischen Bereichsehr gutes Zahlenverstndniserste Erfahrungen in einer vergleichbaren Funktion (z.B. vorbereitende Buchfhrung)gute Kenntnisse der MS-Office-Anwendungenein hohes Ma an Selbststndigkeit, Flexibilitt und analytischem DenkvermgenWas Sie erwarten knnen:eine anspruchsvolle Ttigkeit mit hoher Verantwortunggute Entwicklungsmglichkeitenkompetente Einarbeitung durch ein freundliches Teamein modernes Bro und ein angenehmes BetriebsklimaWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-kassenabrechnung-und-tagesabschluss-berlin-494629","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"user helpdesk spezialist konigs wusterhausen ","company_name":"Workstation Customer Care","title":"User Helpdesk Spezialist (m\/w\/d)","description":"Unser Kunde ist ein weltweit fhrendes Unternehmen in der Finanzbranche und sucht mehrere motivierte und technisch versierte Mitarbeiter (m\/w\/d) fr den Technischer Support im Helpdesk fr die Inhouse-MitarbeiterInnen mit flieenden deutschen Sprachkenntnissen, herausragender Arbeitseinstellung und groem Interesse an der IT. Geeignete Bewerber stehen vor einer schnellen, spannenden Karriere in einer globalen Unternehmensumgebung, bei der der Schwerpunkt auf der Bereitstellung von hervorragendem Kundenservice liegt. Bestimmte Qualifikationen sind keine Voraussetzung, aber ein Interesse fr IT Systeme und nachweisbares Interesse an der technischen Entwicklung von Hard- und Software wnscht sich unser Auftraggeber. Aufgrund des starken Wachstums bestehen sehr gute Entwicklungsmglichkeiten, z.B. in Richtung Teamleiter, Trainer (m\/w\/d) oder auch in ganz anderen Bereichen des Konzerns. Dies ist eine ausgezeichnete Gelegenheit, in eine globale Organisation einzutreten und in einer zukunftsorientierten Umgebung die Mglichkeiten wahrzunehmen, selbst an seinen Aufgaben zu wachsen und einen konsequenten nchsten Schritt im Lebenslauf zu ttigen. Wir suchen talentierte Persnlichkeiten mit den folgenden Eigenschaften:sehr gute deutsche Sprachkenntnisse, in Wort und SchriftErste Erfahrung im IT Bereich; Helpdesk wre ideal, aber auergewhnliche Kandidaten ohne Erfahrung werden ebenfalls bercksichtigttechnische Begabung mit einer offensichtlichen Begeisterung fr Technikmotivierte und begeisterte Persnlichkeit mit dem Wunsch, sich weiter zu entwickelnpositive Einstellung zur Arbeit, zeitlich flexibel und zhin der Lage mit mehreren Problemen parallel zu arbeitenoptimistisch in die Zukunft blickend und ein guter TeamplayerDiese Ttigkeit kann alternativ in den Brorumen unseres Auftraggebers oder bei Ihnen zu Hause im Homeoffice ausgefhrt werden.Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/user-helpdesk-spezialist-konigs-wusterhausen-48557","tags":["Customer Service"],"job_types":[],"location":"Königs Wusterhausen","created_at":1702680542000},{"slug":"kundenberater tarifauskunft arabisch berlin ","company_name":"Workstation Customer Care","title":"Kundenberater Tarifauskunft Arabisch - m\/w\/d","description":"Fr die nachfolgende Stelle suchen wir Mitarbeiter (m\/w\/d) zur Festanstellung bei unserem Kunden. Als fhrender Anbieter von Kundenkontaktlsungen mit insgesamt 6.000 Mitarbeitern prsentiert sich unser Unternehmen auch in Deutschland als einer der Marktfhrer. Im Produktportfolio ist die gesamte Leistungspalette der Kundenbetreuung vereint und wird durch ein umfassendes IT- und Serviceangebot ergnzt. Mit ca. 1.000 Mitarbeitern in Berlin\/ Brandenburg ist es ber viele Jahre gelungen, durch Innovation, Kompetenz und Kundenorientierung die Stellung am Markt zu etablieren und auszubauen. Die Mitarbeiter sichern dabei durch eine hohe Serviceorientierung das Wachstum des Unternehmens. Wir suchen eine motivierte Persnlichkeit als Kundenbetreuer (m\/w\/d) eines internationalen MobilfunkunternehmensAufgaben:Tarifberatung fr Neu- und BestandskundenDurchfhrung von Rufnummer- bzw. KartentauschPrfung des Auftragsstatus bei Endgert und Ersatzkarte, zzgl. SendeverfolgungVersand von ErsatzkartenSperrung und Einrichtung von DienstenBeantwortung von RechnungsnachfragenAllgemeine Beratung zu Sonderdiensten (WAP, GPRS, UMTS)Allgemeine Beratung zu Endgerten und ZubehrAnschlieende Sach- und Nachbearbeitung der TelefonateAnforderungen:Berufserfahrung in kaufmnnischen Bereichengutes sprachliches Ausdrucksvermgen auf Deutsch UND Arabischgute PC-Kenntnisseserviceorientiertes AuftretenVerantwortungsbewusstsein und Engagementstrukturierte und zielorientierte Arbeitsweisezeitliche FlexibilittWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kundenberater-tarifauskunft-arabisch-berlin-378487","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"french customer service english language materials berlin ","company_name":"Workstation Customer Care","title":"French Customer Service English Language Materials m\/f\/d","description":"Our client provides world class content in the most relevant, engaging and flexible formats to support students, teachers and institutions through a lifetime of learning. Our client develops and distributes textbooks, e-books and interactive e-learning resources. Our client, a leading publisher in English language materials and digital solutions, is seeking a Customer Service Assistant (m\/f\/d) to join its team, supporting its French customer base.Reporting to the Customer Service Manager, you will be handling French customers queries as well as assisting the team with internal reporting and editing of support materials.Key areas of support include:Digital customer supportOnline end-user support (teachers, students)The ideal applicant will:be a team playerbe a problem solver who takes ownership of all tasksbe keen on learning and developing a career in the field of Customer Servicebe a fluent French speakerWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/french-customer-service-english-language-materials-berlin-19433","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"email abrechnungsservice energieversorger homeoffice potsdam ","company_name":"Workstation Customer Care","title":"Email Abrechnungsservice Energieversorger Homeoffice M\/W\/D","description":"Diese Stelle knnen Sie von zu Hause ausfhren. Sie sollten nicht weiter als 100 km entfernt von Potsdam wohnen. Unser Auftraggeber ist der Vertragspartner eines renommierten Energieversorgers. Wir suchen talentierte Persnlichkeiten (m\/w\/d) zum Aufbau eines neuen Teams.Ihre Aufgaben:Aufnahme von Kundenanliegen und Dokumentation aller Anfragen im SystemSchriftliche Erklrungen zu Jahresendrechnungen, Abschlagszahlungen und StundungsantrgenUmzugsservice fr Neu- und BestandskundenAuskunftserteilung zu Konditionen, Bereitstellungszeitpunkt und VertragsmodalittenErfassen und Pflegen von Kunden-, Stamm- und BewegungsdatenSicherstellung der KundenzufriedenheitWas Sie mitbringen sollten:Kaufmnnisches Wissen und Knnen, Quereinsteiger sind herzlich willkommenKenntnisse der gngigen MS-Office-ProgrammeAffinitt zur und Freude an der Arbeit am PCAusgeprgte KommunikationsfhigkeitSelbstndige Arbeitsweise und GenauigkeitErste Erfahrung im Kundenservice von Vorteil, aber nicht BedingungWas Sie erwartet:ausfhrliche, bezahlte SchulungInteressante und verantwortungsvolle Ttigkeit in einem freundlichen TeamFlexible ArbeitszeitmodelleGute EntwicklungsmglichkeitenMglichkeit der beruflichen Neuorientierung fr QuereinsteigerModerne Arbeitspltze und nette Teams, die sich auf Sie freuen!Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/email-abrechnungsservice-energieversorger-homeoffice-potsdam-58185","tags":["Finance"],"job_types":[],"location":"Potsdam","created_at":1702680542000},{"slug":"neukundenbetreuung technik homeoffice potsdam ","company_name":"Workstation Customer Care","title":"Neukundenbetreuung Technik Homeoffice Potsdam m\/w\/d","description":"Unser Auftraggeber ist ein groer Internetanbieter, der sicher stellen mchte, dass seine Neukunden den bestmglichen Start mit dem neuen Vetrag haben. Hierzu gehrt, dass es keine technischen Hindernisse gibt und der Kunde (m\/w\/d) von der ersten Minute an alle Funktionen und Gerte nutzen kann. Allerdings hat nicht jeder Kunde das notwendige Verstndnis, z.B. einen Router zu installieren oder Applikationen aus dem Netz herunter zu laden. Hier kommen Sie (m\/w\/d) ins Spiel.Was werden Sie in dieser Position tun?Sie helfen Kunden, Endgerte in Betrieb zu nehmenSie untersttzen beim Download von SoftwareSie schalten Anwendungen zur Nutzung freiSie beauftragen den Versand von AustauschgertenSie fhren Leitungstests durchber Sie:Sie verstehen die Funktionsweise moderner technischer GerteSie knnen gut zuhren und sich in Probleme hineinversetzenSie sind hilfsbereit und geduldigSie knnen in Schichten arbeitenSie bleiben stets auf dem Laufenden, was technische Entwicklungen betrifftAlternativ kann die Ausbung der Stelle in den Bros unseres Auftraggebers stattfinden oder bei Ihnen zu Hause im Homeoffice. Die Einarbeitung erfolgt im Unternehmen am Standort. Damit Sie den Kontakt zum Unternehmen nicht verlieren, sollten Sie ca. einmal pro Woche im Unternehmen arbeiten.Wir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/neukundenbetreuung-technik-homeoffice-potsdam-349832","tags":["Customer Service"],"job_types":[],"location":"Potsdam","created_at":1702680542000},{"slug":"junior bankkaufmann im homeoffice berlin ","company_name":"Workstation Customer Care","title":"Junior Bankkaufmann im Homeoffice (m\/w\/d)","description":"Sie haben einen kaufmnnisch geprgten Werdegang oder verfgen ber kaufmnnische Grundlagen und sind interessiert im Segment der Bankdienstleistungen einzusteigen? Dann ist die Position des Servicemitarbeiters (m\/w\/d) im Dienstleistungscenter (Inbound) genau das Richtige fr Sie und der perfekte erste Schritt in die Finanzwelt! Diese Einstiegsposition (Junior) im Bankbereich kann bundesweit aus dem Homeoffice ausgebt werden.Es kommen folgende Aufgaben auf Sie zu:telefonische Kundenberatung im Inbound im Zusammenhang mit allen Produkten und Services der Kreditinstitute, z.B. Telefonbanking (Zahlungsverkehr), Bausparen, Anfragen zu GirokontenStammdatenkontrolle \/ Pflege der DokumentendetailsEigenstndiges Durchfhren der Folgearbeiten, wie z.B. das Reporting und Fhren der StatistikDas bringen Sie mit:kaufmnnische Ausbildung (m\/w\/d) oder Berufserfahrung in einem kaufmnnischen Beruf (m\/w\/d)erste Berufserfahrung bei einem Finanzdienstleister sind vorteilhaft, aber nicht zwingendhohe Kommunikationsfhigkeithohes Ma an Kunden- und Serviceorientierungsehr gute DeutschkenntnisseEDV-AffinittWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/junior-bankkaufmann-im-homeoffice-berlin-299567","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"kundenservice mit arabischen sprachkenntnissen berlin ","company_name":"Workstation Customer Care","title":"Kundenservice mit Arabischen Sprachkenntnissen m\/w\/d","description":"Fr unseren Kunden, ein etabliertes Servicecenter mit zahlreichen Auszeichnungen, suchen wir mehrere Kundenbetreuer (m\/w\/d) fr den Bereich Mobilfunk - Inbound, Vollzeit & Teilzeit mglich.Ihre Aufgaben:  Telefonische und schriftliche Bearbeitung von Kundenanfragen Freundliche und zielorientierte Kommunikation mit den Kunden Eigenstndige Problemanalyse und Fehlerbeseitigung Hilfestellung bei Vertragsnderungen Reklamationsbearbeitung und Beschwerdemanagement Betreuung von Privat- und GeschftskundenIhr Profil:  Dienstleistungsorientierte und kommunikationsfreudige Persnlichkeit Versierter Umgang mit den blichen PC-Anwendungen Sehr gute Kenntnisse in Deutsch UND Arabisch Leistungs- und zielorientierte Arbeitsweise Quereinsteiger (m\/w\/d) und Berufsstarter (m\/w\/d) sind herzlich willkommen!Was Sie erwartet:  Bezahlte Schulung, kompetente Einarbeitung und regelmiges Coaching Angenehmes Betriebsklima in einem dynamischen Team Weiterbildung mit Entwicklungsmglichkeiten Bei Fragen stehen wir Ihnen selbstverstndlich sehr gerne zur Verfgung!Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kundenservice-mit-arabischen-sprachkenntnissen-berlin-120666","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"mitarbeiter rechnungswesen magdeburg ","company_name":"Workstation Customer Care","title":"Mitarbeiter Rechnungswesen (m\/w\/d)","description":"Fr unseren Kunden suchen wir einen Mitarbeiter (m\/w\/d) im Bereich Rechnungswesen.Sie bernehmen bei unserem Kunden die Sachbearbeitung mit folgenden Aufgaben:Vorbereitende Buchhaltung, insbesondere Bearbeitung von EingangsrechnungenErstellung von Ausgangsrechnungen (z. B. Monatsrechnungen, Sammelrechnungen)Gutschriftenerstellung und RechnungskorrekturenErstellung von Jahresrckvergtungen und UmsatzauswertungenPflege diverser kundenspezifischer Preislisten\/StammdatenpflegeProzessoptimierung im Bereich Rechnungslegung und Weiterentwicklung der ArbeitsprozesseWas Sie fr diese Position neben der Leidenschaft fr Zahlen mitbringen sollten:Abgeschlossene kaufmnnische Ausbildung oder vergleichbare BerufserfahrungIT Kenntnisse, MS OfficeStrukturierte Arbeitsweise, Zuverlssigkeit, SelbstndigkeitGute Englischkenntnisse sind von Vorteil, aber kein Muss!Unser Kunde bietet Ihnen:Ein motiviertes Team und langfristige Perspektiven bei anspruchsvollen AufgabenWeiterbildungen und EntwicklungsmglichkeitenFlache Hierarchien, gemeinsame Teamevents und FreizeitmglichkeitenWir freuen uns auf Ihre Bewerbungsunterlagen und auf ein erstes Kennenlernen!Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-rechnungswesen-magdeburg-140011","tags":["Finance"],"job_types":[],"location":"Magdeburg","created_at":1702680542000},{"slug":"mitarbeiter lohnabrechnung fur industrieunternehmen berlin ","company_name":"Workstation Customer Care","title":"Mitarbeiter Lohnabrechnung für Industrieunternehmen (m\/w\/d)","description":"Unser Auftraggeber sucht einen versierten Mitarbeiter (m\/w\/d) in der Lohnabrechnung.Bringen Sie mit, was es braucht:Erfahrung in der Durchfhrung der LohnabrechnungenErfahrung in der Abrechnung von gewerblichen Mitarbeiter notwendigSelbstndige und strukturierte Arbeitsweise sowie TeamplayerGute Anwenderkenntnisse im Umgang mit SAPFundierte Kenntnisse im Arbeits-, Lohnsteuer- und SozialversicherungsrechtWas werden Sie tun:Lohnabrechnung fr einen definierten MitarbeiterkreisAbrechnung von Zeitlohn sowie Akkord- und GruppenlohnMitarbeiterberatung zu Abrechnungsfragenberwachung der Zeitwirtschaftberprfung der Entgeltfortzahlung im KrankheitsfallBeratung von Mitarbeitern in lohnrelevanten FragestellungenAdministrative und organisatorische Ttigkeiten im TagesgeschftErstellung von Beitragsnachweisen, Lohnsteueranmeldungen und BescheinigungenWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-lohnabrechnung-fur-industrieunternehmen-berlin-149306","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"burokaufmann sekretariatsservice magdeburg ","company_name":"Workstation Customer Care","title":"Bürokaufmann (m\/w\/d) Sekretariatsservice","description":"Brokaufmann (m\/w\/d) Sekretariatsservice gesucht (Homeoffice nach Einarbeitung mglich).Ihre Aufgaben:Organisation von WeiterbildungenTerminkoordinationVor- und Nachbearbeitung von Seminarenallgemeine SekretariatsaufgabenIhr Profil:Abgeschlossene kaufmnnische AusbildungErste Berufserfahrung wnschenswertSehr gute PC-KenntnisseSehr gute DeutschkenntnisseGute EnglischkenntnisseEin freundliches Team & eine intensive Einarbeitung warten auf Sie.Wir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-sekretariatsservice-magdeburg-423289","tags":["Business Operations"],"job_types":[],"location":"Magdeburg","created_at":1702680542000},{"slug":"burokaufmann okologischer tourismus homeoffice berlin ","company_name":"Workstation Customer Care","title":"Bürokaufmann Ökologischer Tourismus - Homeoffice (M\/W\/D)","description":"Diese Stelle kann zu 80% von zu Hause ausgefhrt werden - einmal die Woche mchte Sie das Unternehmen in den Brorumen begren, damit der Kontakt nicht verloren geht. Insofern sollten Sie nicht allzu weit vom Berliner Bezirk Spandau entfernt wohnen.Unser Auftraggeber ist ein Reiseveranstalter und hat sich auf nachhaltigen, kologisch wertvollen Tourismus spezialisiert. Hierzu betreibt unser Kunde ein Reiseportal, auf dem Urlauber sich interaktiv und schnell ber Reisegebiete, Anreisemodalitten und Preise informieren knnen. Nicht immer wird der potenzielle Kunde fndig und ruft die angegebene Hotline an - und erreicht dann Sie (m\/w\/d). Unser Kunde legt sehr viel Wert auf Qualitt der Beratung - insofern gibt es keine Zeitbegrenzungen fr Gesprche. Ziel Ihres Kontakts mit dem Kunden ist, dem Kunden genau das Urlaubserlebnis zu vermitteln, das er sucht.Ihre Aufgaben als Reiseberater (m\/w\/d):Sie sind erster Ansprechpartner fr Kunden, die eine Reise buchen mchtenSie gehen individuell auf jeden einzelnen Kunden ein und erfragen seine genauen VorstellungenSie beschreiben das Zielgebiet, selektieren nach Speisenangebot und Sternezahl, beraten zu kinderfreundlichen oder auch kinderfreien Hotels und bercksichtigen die Flugzeitenwnsche des KundenSie beraten den Kunden ausfhrlich und bieten Alternativangebote anUnsere Anforderungen:gutes sprachliches Ausdrucksvermgengute PC-Kenntnisseserviceorientiertes AuftretenVerantwortungsbewusstsein und Engagementstrukturierte und zielorientierte Arbeitsweisezeitliche FlexibilittberzeugungsfhigkeitWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-okologischer-tourismus-homeoffice-berlin-167640","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"mitarbeiter rechnungserfassung berlin ","company_name":"Workstation Customer Care","title":"Mitarbeiter Rechnungserfassung (m\/w\/d)","description":"Wir suchen einen kaufmnnischen Mitarbeiter (m\/w\/d) fr die Verwaltung, Teilzeit 20 Stunden \/ Woche.Ihr Aufgabengebiet:Bearbeitung und Versand von VertragsunterlagenRechnungserfassungProjektaufgabenIhr Profil:Kaufmnnische AusbildungErste BerufserfahrungSichere MS-Office KenntnisseZuverlssigkeitSelbststndige ArbeitsweiseZeitliche Flexibilitt (8-17 Uhr, in 2 Schichten)Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-rechnungserfassung-berlin-347511","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"burokaufmann rechnungsprufung magdeburg ","company_name":"Workstation Customer Care","title":"Bürokaufmann (m\/w\/d) Rechnungsprüfung","description":"Fr unseren Auftraggeber suchen wir einen Brokaufmann (m\/w\/d) fr die Rechnungsprfung, u.a. fr folgende Aufgaben:Prfung der Eingangsrechnungen und Gutschriften auf sachliche und rechnerische RichtigkeitKlrung von Differenzen und Unklarheiten mit den entsprechenden internen Ansprechpartnernberwachung der ZahlungseingngeKlrung von Unstimmigkeiten und AbweichungenUntersttzung des administrativen TagesgeschftsFr diese Stelle als Brokauffrau (m\/w\/d) Rechnungsprfung wnschen wir uns von Ihnen:Abgeschlossene kaufmnnische Berufsausbildung oder vergleichbare Berufserfahrung, z.B. als Brokauffrau-\/mann (m\/w\/d) oder Buchhaltungsfachkraft (m\/w\/d).Gute PC KenntnisseStrukturierte und korrekte ArbeitsweiseTermintreue und VerlsslichkeitGute Kenntnisse der MS-Office-AnwendungenZahlenverstndnisErste Berufserfahrung in der Rechnungsprfung ist von Vorteil aber nicht BedingungWir bieten:Eine umfangreiche und vergtete EinarbeitungFestgehalt ohne variable AnteileEine abwechslungsreiche Ttigkeit in einem internationalen UnternehmenProfessionelle Strukturen inkl. BetriebsratInterne Weiterbildung und EntwicklungschancenGuter Zusammenhalt im Team und Spa bei der ArbeitWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-rechnungsprufung-magdeburg-262880","tags":["Business Operations"],"job_types":[],"location":"Magdeburg","created_at":1702680542000},{"slug":"abrechnungsservice abo zahlungen tlw homeoffice berlin ","company_name":"Workstation Customer Care","title":"Abrechnungsservice Abo-Zahlungen tlw homeoffice m\/w\/d","description":"Ob Musik, Autos, Kleidung oder sogar Rasierer - die Abowirtschaft boomt - denn, sie gibt den Nutzern die Flexibilitt, die sie sich wnschen. Eine einfache Registrierung, das perfekte Produkt und eine flexible Bezahlung runden die Angebote ab, die wir heute in vielfltiger Weise nutzen. Damit das auch alles reibungslos funktioniert, gibt es unseren Kunden - und Sie in Ihrer neuen Rolle als Mitarbeiter (m\/w\/d) im Abrechnungsservice.Ihr Arbeitstag wird sich um folgende Fragestellungen bzw. Themengebiete drehen:Verlngerung \/ Kndigung \/ Pausierung von AbosAuswahl von Zahlungsmethoden und RechnungsstellungZahlungszuordnung und Vereinbarung von RatenzahlungenBeschwerdemanagementDazu bringen Sie am besten viel Verstndnis mit:fr die individuellen Bedrfnisse der Kundenfr Zahlen, Daten, Faktenfr den Entscheidungsspielraum, den Ihnen das Unternehmen einrumtfr die Notwendigkeit von professionellem Verhaltenfr Regeln und Gesetze fr Herausforderungen und positive Lsungsanstze - unser Auftraggeber lsst niemanden im Regen stehenWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/abrechnungsservice-abo-zahlungen-tlw-homeoffice-berlin-252549","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"burokauffrau entgeltabrechnung berlin ","company_name":"Workstation Customer Care","title":"Bürokauffrau (m\/w\/d) Entgeltabrechnung","description":"Fr unseren Kunden in Berlin suchen wir einen Mitarbeiter (m\/w\/d) fr das Team Entgeltabrechnung.Aufgaben: Untersttzung bei der Erstellung der Lohn- und Gehaltsabrechnung sowie bei den vorbereitenden TtigkeitenSupport bei Kundenanfragen zur Funktionalitt des Lohnprogramms, eigentstndige MandatsbearbeitungErstellen monatlicher Auswertungen und Informationen fr die Entwicklungsabteilung SoftwareKorrespondenz mit Krankenkassen und BehrdenAnforderungen:Fr diese Ttigkeit wnschen wir uns einen Kandidaten (m\/w\/d) mit kaufmnnischem Hintergrund und technischer Affinitt.Darber hinaus sollte der ideale Kandidat (m\/w\/d) eine gute Kommunikation mitbringen und sich gern mit Kunden, anderen Abteilungen sowie auch der Entwicklungsabteilung Software abstimmen.Wenn Sie eine Weiterbildung im Bereich Lohn- und Gehalt erfolgreich absolviert haben wre dies von Vorteil, ist aber keine Bedingung. Bei groer technischer Affinitt schult unser Kunde auch gern die fachlichen Komponenten der Lohnabrechnung. Wir freuen uns auf Ihre Bewerbung und auf ein erstes Kennenlerngesprch!Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokauffrau-entgeltabrechnung-berlin-13244","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"operations advisor berlin ","company_name":"Worldia GmbH","title":"Operations Advisor M\/W\/D","description":"Wer wir sind Worldia ist eine B2B2C-Reiseplattform fr mageschneiderte Reisen. Wir ermglichen allen unseren Partnern, das immense Potenzial fr  la carte Reisen zu nutzen, indem wir leistungsstarke Technologie, sorgfltig ausgewhlte Qualittsprodukte und Premium-Kundenservice kombinieren.Nachdem wir im Jahr 2023 eine Investition von 25 Millionen Euro erhalten haben, expandiert Worldia mit vielen spannenden Projekten: Einfhrung der neuen Plattformversion, neue Geschftspartnerschaften und internationale Expansion.Wir sind stolz darauf, das HAPPY INDEX AT WORK-Zertifikat von CHOOSE MY COMPANY zu tragen!Hast du Lust, dich unserem Abenteuer anzuschlieen? Herzlich willkommen an Bord!Unsere WerteAMBITION \/\/ Nach den Sternen greifen.VERGNGEN \/\/ Gemeinsam eine gute Zeit verbringenINTEGRITT \/\/ Immer ehrlich und transparent sein.Das machst du bei uns:Du lsst Reisetrume wahr werden und fhrst interne und externe Buchungsprozesse durch, um den Kunden ihre gebuchte Reise zu ermglichen.Qualitt steht an erster Stelle - durch die Erstellung und berarbeitung von individuellen Reiseunterlagen bleiben am Ende keine Fragen mehr bei unseren Kunden offenRegelmiger Kontakt mit unseren Produktanbietern steht an deiner TagesordnungDas bringst du mit: Du wohnst in Berlin oder bist bereit nach Berlin zu ziehen um bei uns im Bro zu arbeitenDu sprichst Deutsch auf einem B2 Niveau und sehr gutes Englisch in Wort und Schrift Du bringst idealerweise erste Erfahrungen in der Reiseindustrie mit. Aber auch Quereinsteiger sind herzlich willkommen bei unsDu bist ordentlich, grndlich und hast ein gutes Auge frs DetailDu ergreifst gerne die Initiative und bist lsungsorientiertDu bist enthusiastisch und berzeugendDu scheust dich nicht, den Hrer in die Hand zu nehmen und hast Spa am Gesprch mit Kunden und PartnernNeue Herausforderungen sind fr dich kein Problem.Das Reisen liegt bei dir in der DNA! Deine Vorteile bei uns:Alles, was Du fr Deine Position kennen und wissen musst, bringen wir Dir vor Ort im Zuge einer individuellen Einarbeitung bei Unsere internationale Basis ist in Berlin zwischen Bernauer Strae und Rosenthaler Platz - ein fantastischer Standort mitten in der HauptstadtRabatte fr die eigenen Reisen Vergnstigtes BVG Ticket Steuerfreie Sachgutscheine als monatliches Gehaltsextra Vergnstigte Urban Sports Club Mitgliedschaft Wchentliches Team-Lunch und Essensgutscheine fr deine Verpflegung am Arbeitsplatz Mglichkeit auf FAM-tripsEin junges Arbeitsumfeld in der Touristik mit viel Entwicklungspotenzial Faire Arbeitskonditionen (es muss fr dich und fr uns gut passen) Hundefreundliches Bro (aktuell zhlen auch unsere vier vierbeinigen Freunde Pepe, Pamuk, Schneemann and Ceberus zu unserem Team)Worldia hat den IDEA-Pakt (Inklusion - Vielfalt - Gerechtigkeit - Barrierefreiheit) unterzeichnet und befolgt einen fairen und nichtdiskriminierenden Einstellungsprozess.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/worldia-gmbh\/operations-advisor-berlin-19229","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702680542000},{"slug":"supervisorin infrastrukturelles facility management vollzeit berlin ","company_name":"GONDER Group","title":"Supervisor:in infrastrukturelles Facility Management (m\/w\/d) - Vollzeit","description":"Kurz & knapp: Wir suchen ab dem 01.02.2023 einen Objektleiter:in\/ Supervisor (m\/w\/d) in Vollzeit (Arbeitszeit Mo.-Fr. von 07:00 bis 15:00 Uhr) in Berlin (Hauptbahnhof) mit bertariflicher Bezahlung und attraktiven Benefits.Willkommen bei der GONDER Group  Ihr Partner fr exzellente Karrierechancen in der GebudedienstleistungDie GONDER Group ist ein fhrendes Familienunternehmen mit Sitz in Frankfurt am Main, das seit fast 100 Jahren im Bereich des infrastrukturellem Gebudemanagement ttig ist. Mit unseren fast 4.000 engagierten Mitarbeitern sind wir deutschlandweit ein verlsslicher Partner fr Facility Management, Inhouse-Logistik und Personaldienstleistungen.Warum die GONDER Group?Tradition trifft Innovation: Wir setzen auf bewhrte Methoden und modernste Technologien (z.B. Digitalisierung & Robotik)Karriereentwicklung: Wir bieten vielfltige Aufstiegsmglichkeiten und frdern kontinuierliche Weiterbildung.Nachhaltigkeit: Gemeinsam mit unseren Kunden setzen wir auf nachhaltige Dienstleistungen und sind stolz auf unser EcoVadis Gold Rating.Teamkultur: Bei uns steht der Mensch im Mittelpunkt. Wir legen groen Wert auf ein positives Arbeitsklima und Teamarbeit.AufgabenIhre Aufgaben umfassen unter anderem:Ansprechpartner:in des Kunden fr alle infrastrukturellen DienstleistungenBetreuung, Koordination und Abstimmung aller Mitarbeiter im ObjektVerantwortlich fr die Gebudereinigung, Servicepersonal, Empfangskrfte und SicherheitskrfteDurchfhrung von Qualittskontrollen und Einleitung erforderlicher Manahmen bei auftretenden Mngeln sowie abschlieende Prfung (allgemeine Objektbetreuung)Zustzliche Betreuung von Grund- und Unterhaltsreinigungen und Abnahme der Leistungen durch den Kunden Bei der Ausbung der Ttigkeit immer auf arbeitsrechtliche, sicherheitstechnische Vorgaben achten und den Datenschutz gewhrleistenQualifikationMehrjhrige Berufserfahrung in der Gebudereinigung, Qualittssicherung oder Facility-Management Bereich (wnschenswert) ODER Mehrjhrige Berufserfahrung im Hotelgewerbe, der Gastronomie, Systemgastronomie, im Restaurantfach o. . als Teamleitung oder Manager:in - Quereinsteiger willkommen Sehr gute Deutschkenntnisse in Wort & Schrift, Engischkenntnisse von VorteilFreundliches Erscheinungsbild, Durchsetzungsvermgen, Zuverlssigkeit und EinsatzbereitschaftEin Fhrungszeugnis ohne EintragungenEine ausgeprgte ServiceorientierungBenefitsGute Bezahlung - fair und immer pnktlich30 Tage UrlaubFlexible ArbeitszeitenModerne Arbeitsausstattung inkl. Firmenhandy, Laptop oder TabletKostenlose ArbeitskleidungBikeleasingGONDER eHealth - Dein Angebot fr Gesundheit und WellbeingWeiterbildungsbildungsmglichkeiten in der hausinternen SchulungsakademieMitarbeiter-Rabatte bei vielen namhaften Herstellern & MarkenBitte senden Sie uns Ihre aussagekrftigen Bewerbungsunterlagen online an:Herr DrnerWir freuen uns auf Ihre Bewerbung!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/gonder-group\/supervisorin-infrastrukturelles-facility-management-vollzeit-berlin-400741","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Berlin","created_at":1702680542000},{"slug":"expansion manager startup stuttgart ","company_name":"ooblee Europe GmbH","title":"Expansion Manager (m\/w\/d) - Startup","description":"Werde Expansion Manager bei ooblee und stehe an der Spitze der Digitalisierung des Einzelhandels mit unserer schnell wachsenden Social Commerce App.Du suchst nach einer Herausforderung im Startup Umfeld und hast die Untersttzung des lokalen Einzelhandels am Herzen? Du hast Interesse am Aufbau von Kundenbeziehungen und Kontakt mit Bestandskunden? Wir freuen uns auf deine Bewerbung als Expansion Manager (m\/w\/d) in unserem Team bei ooblee.ooblee betreibt eine Social Commerce App, die lokale Geschfte und mit lokalen Konsumenten verbindet. Unsere Social-Shopping-Community untersttzt somit Einzelhndler und ermglicht es Usern das Shopping Angebot Ihrer Stadt zu erkunden und lokal einzukaufen.Als ooblee-Expansion Manager bist du die erste Kontaktstelle zu lokalen Ladengeschften und reprsentierst unsere Shopping Community. Indem du die besten Produkte fr das Produktsortiment unserer Plattform aussuchst, langfristige Beziehungen zu einzelnen Geschften aufzubaust und diesen einen ersten Vorgeschmack bietest, hilfst du dabei unsere Shopping Community zu expandieren und einen attraktiven Marktplatz aufzubauen.AufgabenSelektion der mglichen Partnershops fr die ooblee App Selektion der Produkte fr das Produktsortiment unserer Plattform Besuche lokale Geschfte, um ihnen ooblee vorzustellen Knpfe Kontakte zu lokalen Einzelhndlern und gib ihnen einen Vorgeschmack auf die Nutzung der ooblee App Arbeite mit unseren Marketing- und Produktteams zusammen, um Kundenfeedback zu sammeln und uns bei der kontinuierlichen Verbesserung der App zu helfen Aktualisierung und Erweiterung der Kundendaten in unserem CRM Reisettigkeit 80% innerhalb DeutschlandsQualifikationDu reist gerne und hast Interesse deine Sales Skills aufzubauen? Dann bist Du bei uns richtig! Du bist verantwortlich fr die Expansion unserer Verkaufsaktivitten in deinem Bundesland und darber hinausAusgeprgte Kommunikationsfhigkeiten und ein freundliches Auftreten, vorzugsweise mit Erfahrung in einer Rolle mit KundenkontaktAusgezeichneter Teamplayer mit hoher Arbeitsmoral, sozialer Kompetenz und KommunikationsfhigkeitDu bringst ein hohes Ma an Eigeninitiative, Motivation und Teamfhigkeit mit  und berzeugst durch eine freundliche Hartnckigkeit mit ausgeprgter ZielorientierungSelbststndige und strukturierte ArbeitsweiseFlieend in DeutschFhrerscheinklasse B wird erwartetBenefitsWerde Teil eines innovativen, schnell wachsenden, gut finanzierten und ffentlich untersttzten E-Commerce Startups Ausgezeichnete Entwicklungs- und Aufstiegsmglichkeiten und gute Work-Life-Balance Flache Hierarchien und Teamgeist Erhalte Discounts und kostenlose Produkte von unseren Partnershops Erstattung von ReisekostenUntersttze uns bei der Mission mit ooblee den lokalen Handel zu strken und die lokale Shopping Community aufzubauen. Bewirb dich jetzt! #JobOpening #ExpansionManager #StartUp #Expansion #SupportLocal #oobleeFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ooblee-europe-gmbh\/expansion-manager-startup-stuttgart-297592","tags":["Management","Team Leader"],"job_types":["teamleitung"],"location":"Stuttgart","created_at":1702680542000}]