[{"slug":"customer success account managerin berlin ","company_name":"Matera GmbH","title":"Customer Success - Account Manager*in","description":"In a nutshell:Als Account Manager*in bist du bei uns genau richtig, wenn du Lust hast den Aufbau des Customer Success Departments mitzugestalten. Arbeite mit uns in Berlin im Office oder flexibel hybrid, Vollzeit. Starte ab sofort oder in den nchsten 4 Monaten.AufgabenDeine Rolle bei Matera:Beratung und Untersttzung deiner Kund*innenAufbau der Strukturen und Prozesse gemeinsam mit dem Team und unserem Country Managersmarte Automatisierung der bestehenden AblufeAufbau einer Wissensbasis fr wiederkehrende FragenQualifikationDas bringst du mit:Du gehst Probleme kreativ an und bleibst dran, bis du die perfekte Lsung gefunden hastDu hast Spa am Kontakt mit MenschenErste Erfahrungen mit Immobilien, Recht oder in der Buchhaltung sind von Vorteil, aber nicht notwendigDu sprichst Deutsch auf sehr gutem Niveau und kannst sicher auf Englisch kommunizierenBei Matera garantieren wir Chancengleichheit und Vielfalt. Hier bist du so willkommen, wie du bist!BenefitsDeine Aussichten:Vergtung von 37.500-45.000 plus attraktive Anteilsoptionen am UnternehmenMatera Benefits: vergnstigte Mitgliedschaft fr den Urban Sports Club, Lunch-Gutscheine und ein monatlicher PNV-ZuschussEigenverantwortliches Arbeiten mit Gestaltungsfreiraumsteile Lernkurve in einem aufstrebenden SaaS Start-upambitioniertes Team, bei dem der Spa auch nicht zu kurz kommt:)Unsere Mission:Unsere Mission bei Matera ist es, Wohnungseigentmer*innen glcklich zu machen! Durch uns knnen sie ihre Immobilie transparent und einfach selbst verwalten und dadurch eine Menge Zeit und Geld sparen. Seit 2017 sind wir auf dem franzsischen Markt aktiv und machen bereits jeden Tag das Leben von mehr als 100.000 Wohnungseigentmer*innen besser. In Deutschland haben wir im letzten Jahr ebenfalls einen groartigen Start mit einem ambitionierten Team hingelegt.Hast du Lust die Skalierung des deutschen Marktes mit uns gemeinsam anzugehen? Dann bewirb dich jetzt!:)Um unser Team kennenzulernen und Eindrcke von unserer Kultur zu bekommen, schaue gerne bei uns auf LinkedIn oder auf Instagram vorbei!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/matera-gmbh\/customer-success-account-managerin-berlin-330825","tags":["Customer Service"],"job_types":["berufseinstieg"],"location":"Berlin","created_at":1702896543000},{"slug":"senior 3d artist munich ","company_name":"New Flag GmbH","title":"(Senior) 3D Artist (m\/w\/d)","description":"Das erwartet Dich bei unsDu erschaffst gerne visuelle Erlebnisse und bist ein kreativer Kopf? Du hast darber hinaus einen ausgeprgten Sinn fr Gestaltung und anspruchsvolle 3D-Visualisierung? Als Teil unseres Creative Teams hast Du die Mglichkeit, durch innovative CGI-Elemente und Designideen unsere Projekte auf ein neues sthetisches Niveau zu heben und damit direkt am Erfolg unserer einzigartigen Marken beteiligt zu sein.   Du bist Experte oder Expertin fr CGIDu koordinierst unsere CGI Projekte in Zusammenarbeit mit externen PartnernDu erstellst hochwertgie 3D Assets unserer ProdukteDu konzipierst und gestaltest Renderings unserer Produkte (Stills und Animationen)Du gestaltest 3D Szenerien und Moodbilder, die unsere Produkte atmosphrisch in Szene setzenDu untersttzt den Designprozess neuer Produktideen durch hochwertige Renderings verschiedener Designanstze und erweckset sie damit zum LebenDu untersttzt das Marketing von fertig entwickelten Produkten durch fotorealistische Renderings, die in digitaler und gedruckter Form breite Verwendung findenDu begleitest als Designer oder Designerin die Form- und Farbgestaltung neuer ProdukteDas bringst Du mitAbgeschlossenes Bachelor- \/Masterstudium im Bereich Design\/Gestaltung oder eine vergleichbare Ausbildung sowie mindestens 2-3 Jahre Berufserfahrung als 3D ArtistDu verfgst ber Erfahrung als Produktdesigner sowie im ProjektmanagementAusgezeichnete Kenntnisse mit Maxon Cinema 4D, OTOY Octane Render und der Adobe Creative Cloud (insbesondere Photoshop, Illustrator, After Effects und Premiere Pro)3D-Modeling: Schnelles und detailgetreues Polygon-Subdivision-Modeling (sowohl Hard-Surface als auch Textilien und Flssigkeiten) sowie die effiziente Verarbeitung von Produktionsdaten (z.B. STEP)Shading und Lighting: Erstellung komplexer Shader sowie die realistische Ausleuchtung von Produkten und deren StagingRendering und Post-Production: Du renderst hoch aufgelste Bilder und verleihst ihnen den letzten Feinschliff durch Color Grading und RetuscheDu verfgst ber Erfahrung mit digitaler Fotografie, Bildbearbeitung, Videoschnitt, Vertonung und TypografieDu bringst Liebe zum Detail, ein gutes Gespr fr Bildkomposition, Form und Farbe sowie knstlerische Kreativitt mitStrukturierte und ordentliche Arbeitsweise (Ordnerstrukturen, Filenaming, Workflows)Ein hohes Qualittsbewusstsein und die Fhigkeit, Designs objektiv zu bewertenHohes Ma an Zuverlssigkeit sowie eine selbststndige, zielgerichtete und strukturierte ArbeitsweiseDu bist in der Lage vorausschauend, lsungsorientiert und effizient bei engen zeitlichen Vorgaben zu ArbeitenSehr gute Deutsch- und Englischkenntnisse in Wort und SchriftDas bieten wir DirViel Verantwortung am Puls der Zeit in einem kreativen und hoch motivierten TeamEin internationales Arbeitsumfeld mit Start-up Atmosphre und Du KulturSpannende, abwechslungsreiche Aufgabengebiete in einem schnelllebigen, florierenden UnternehmenAttraktive Fitnesskooperationen, Fahrradleasing, Corporate Benefits und gratis Obst & GetrnkeAuergewhnliche Trendprodukte zu vergnstigten Preisen und viele GratisprodukteEin moderner Arbeitsplatz im Herzen von Mnchen und Home Office (2 Tage\/Woche)Dein Weg zu unsDer Upload Deiner Bewerbungsunterlagen mit Angabe Deines Eintrittstermins und Deiner Gehaltsvorstellungen dauert nur 2 Minuten.   Wir wertschtzen Vielfalt und begren daher alle Bewerbungen  unabhngig von Geschlecht, Nationalitt, Religion und Weltanschauung, ethnischer und sozialer Herkunft, Behinderung, Alter sowie sexueller Orientierung und Identitt. Join us! Wir freuen uns auf Dich!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/new-flag-gmbh\/senior-3d-artist-munich-457393","tags":["Graphic Arts and Communication Design"],"job_types":["berufserfahren"],"location":"Munich","created_at":1702896543000},{"slug":"junior softwareentwickler java hanover ","company_name":"univativ GmbH","title":"(Junior) Softwareentwickler (m\/w\/d) Java","description":"Baldmglichst, Unbefristet, In Festanstellung | 40 Stunden pro Woche | Hannover | Personaldienstleistung | Berufseinsteiger, Berufserfahrener | 42000 bis 50000  im Jahr | Projekt-ID P202238667_13Sunivativ ist ein Projekt- und Personaldienstleister, der Studenten und Absolventen spannende Jobs bei renommierten Unternehmen bietet. Deine Karriere ist unsere Mission, denn Deine Entwicklung liegt uns am Herzen.Objektorientiere Programmierung, agile Entwicklung und ein modernes Arbeitsumfeld sind alles Schlagworte, die Dein Traumberuf mitbringen sollte? Du hast Dein Studium oder Deine Ausbildung im IT-Bereich abgeschlossen, Dich auf die Java-Programmierung spezialisiert und bist auf der Suche nach Deinem Berufseinstieg? Zudem liebst Du Vielfalt und Abwechslung im Job, mchtest Dich stetig weiterentwickeln und suchst nach jemanden, der Dich bei Deinem Karriereweg untersttzt und begleitet? Dann bist Du bei uns genau richtig!Wir bieten Dir eine unbefristete Anstellung bei univativ und die Mglichkeit, Erfahrung in unterschiedlichen Branchen, Unternehmen und Projekten zu sammeln. Du bist von Tag eins an Teil unseres Teams in Hannover und arbeitest im Laufe Deiner Anstellung bei verschiedenen Kundenprojekten in der Metropolregion Hannover, Braunschweig, Gttingen und Wolfsburg mit. Egal ob Aufnahme von Anforderungen, Entwicklung von Java-Anwendungen oder die Beratung von Kunden  es erwarten Dich vielfltige Aufgaben eines Softwareentwicklers. Das klingt spannend? Dann schick uns noch heute Deine Bewerbung!AufgabenEntwicklung, Testing, Implementierung und Wartung von Java-AnwendungenDurchfhrung von Qualittssicherungsmanahmen im EntwicklungsprozessOptimierung der Softwareanwendungen und Behebung von defectsAufnahme von Anforderungen durch regelmige Absprachen mit den Fachabteilungen und Kunden3rd Level-Support fr die entwickelten Programme und ProzesseQualifikationEin abgeschlossenes Studium der Informatik, der Wirtschaftsinformatik und \/ oder eine abgeschlossene Ausbildung zum Fachinformatiker fr AnwendungsentwicklungErste praktische Erfahrungen in der Entwicklung mit Java oder einer objektorientierte ProgrammierspracheErfahrung in der Anbindung von Datenbanken wnschenswertEin sicherer Umgang in der Arbeit mit Entwicklungsumgebungen wie Eclipse oder NetBeans und mit Frameworks wie Spring oder JSFVerhandlungssichere Deutschkenntnisse und flieende Englischkenntnisse in Wort und SchriftStrukturiertes und eigenverantwortliches Arbeiten sowie eine ausgeprgte LsungsorientierungBenefitsEin Jahreslohn zwischen 42000  und 50000 Eine Festanstellung direkt bei unserem KundenDie Mglichkeit auch Remote von zu Hause zu arbeiten.Wir bieten Dir eine unbefristete Festanstellung bei univativ sowie die Mglichkeit Erfahrung in unterschiedlichen Branchen, Unternehmen und Projekten zu sammeln.Mit uns kommst Du weiter! Zum einen baust Du echtes Experten-Wissen in der Softwareentwicklung auf. Zum anderen frdern wir Deine Entwicklung aktiv und bieten Dir spannende Karriereperspektiven.Dabei untersttzt Dich Dein persnlicher Talent Coach, der als Dein zentraler Ansprechpartner und Karrierebegleiter fr Dich da ist.Du bist Teil unseres univativ-Teams in Hannover und hast darber hinaus die Mglichkeit Dein berufliches Netzwerk bei verschiedenen Kunden auszubauen.Wir konnten Dein Interesse wecken? Klasse!Wir freuen uns auf Deine BewerbungFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-softwareentwickler-java-hanover-386752","tags":["IT"],"job_types":[],"location":"Hanover","created_at":1702892942000},{"slug":"brand manager biosimilar bad homburg ","company_name":"Biomatch GmbH","title":"Brand Manager Biosimilar (m\/w\/d)","description":"Fr ein fhrendes Unternehmen in der Branche Biosimilars suchen wir einen Brand Manager.Positionszusammenfassung:Die Position des Brand Manager Inflammation umfasst die aktive Verwaltung von Inflammation-Produkten. Der ideale Kandidat bringt umfangreiche Erfahrung im Brand Management mit und verfgt vorzugsweise ber Kenntnisse in den Therapiebereichen Gastroenterologie, Dermatologie oder Rheumatologie ODER im Bereich Biologika\/Biosimilars. In einem dynamischen Umfeld bieten sich Mglichkeiten zur Gestaltung und Ausweitung der Marken, whrend das Unternehmen ein agiles, wachstumsorientiertes Umfeld bietet. Standort: Bro in Bad-Homburg, Deutschland (Hybrid)Arbeitszeit: Vollzeit (40 Stunden\/Woche)AufgabenEntwicklung und Umsetzung lokaler Markenplne, abgestimmt auf die globale MarketingstrategiePlanung und Durchfhrung lokaler Marketingaktivitten in den Bereichen Gastroenterologie, Rheumatologie und DermatologieZusammenarbeit mit Kreativ- und Medienagenturen sowie externen DienstleisternEntwicklung und Implementierung innovativer MarketinganstzeOrganisation und Durchfhrung von Kongressen und VeranstaltungenZusammenarbeit mit dem Vertrieb und medizinischem FachpersonalKontinuierliche Schulung des AuendienstesBudgetkontrolle und regelmige Bewertung von MarketinginitiativenGenerierung von Marktinformationen zur Priorisierung von PromotionsaktivittenQualifikationAkademischer Abschluss in Naturwissenschaften, Medizin, Pharmazie oder WirtschaftMindestens 1-2 Jahre Erfahrung in der pharmazeutischen Industrie als Brand-\/ProduktmanagerVorzugsweise Erfahrung im Bereich Biologika\/BiosimilarsFachwissen in Gastroenterologie, Dermatologie oder RheumatologieSehr gute Englisch- und DeutschkenntnisseBenefitsWork-Life-Balance: Flexible Arbeitszeiten und Remote-OptionenKarriereentwicklung: FortbildungsmglichkeitenUnternehmenskultur: Kollaboratives, integratives Umfeld Attraktive VergtungJetzt mit dem Lebenslauf bewerben!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/biomatch-gmbh\/brand-manager-biosimilar-bad-homburg-436415","tags":["Product Management"],"job_types":["berufserfahren"],"location":"Bad Homburg","created_at":1702892942000},{"slug":"talent acquisition specialist calw ","company_name":"Börlind GmbH","title":"Talent Acquisition Specialist (m\/w\/d)","description":"Das erwartet Dich:Kreativer Kopf im Recruiting: Du entwickelst innovative Konzepte, setzt diese operativ um und optimierst kontinuierlich die Personalprozesse rund um Recruiting und OnboardingCandidate Experience Experte: Als Herzstck des Recruitings koordinierst, begleitest und fhrst du den gesamten Recruiting-Prozess, um unseren Bewerber:innen eine unvergessliche Erfahrung zu bietenMarkenbotschafter in sozialen Medien: Gemeinsam mit unserem Team baust du aktiv an einer starken Arbeitgebermarke auf Social Media. Dein Ziel: Brlind als attraktiven Arbeitgeber prsentieren und das Netzwerk erweiternActive Sourcing Virtuose: Du implementierst und steuerst Active Sourcing Manahmen, inklusive langfristigem Candidate Community Management, um die besten Talente fr Brlind zu gewinnenProjektmanagement-Profi: Du bearbeitest HR-Projekte mit Leidenschaft, um unsere Personalprozesse kontinuierlich zu verbessern und weiterzuentwickelnKPI-Messung und Reporting: Du behltst den berblick ber die verantworteten Prozesse, misst KPIs und berichtest im Shopfloor ber deine ErfolgeDas solltest Du mitbringen:Beauty und Brain: Du bringst ein erfolgreich abgeschlossenes Studium (BWL, Wirtschaftspsychologie, Sozialwissenschaften o..) mit Schwerpunkt Personal oder eine kaufmnnische Ausbildung mit personalwirtschaftlicher Zusatzqualifikation mitErfahrungspionier: Mit mindestens 3 Jahren Erfahrung im Active Sourcing, Personalrecruiting und -marketing kennst du die Trends und Technologien der HR-WeltTech-Enthusiast: Begeisterungsfhigkeit fr neue Technologien und HR-Trends zeichnen dich ausOrganisationstalent: Du behltst in einem vielseitigen Aufgabenspektrum den berblick und arbeitest konzeptionell sowie operativBetriebswirtschaftlicher Blick: Du verstehst die betriebswirtschaftlichen Zusammenhnge und agierst mit unternehmerischem DenkenSocial Media Guru: Du bist sicher im Umgang mit Social-Media-Plattformen, gestaltest Content und setzt Recruitingkanle der Zukunft erfolgreich einDas bieten wir Dir:NoneFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/borlind-gmbh\/talent-acquisition-specialist-calw-483688","tags":["HR"],"job_types":[],"location":"Calw","created_at":1702892942000},{"slug":"e commerce manager operations gesucht cologne ","company_name":"Atelier X GmbH","title":"E-Commerce Manager - Operations gesucht","description":"\"Das Atelier X ist ein Luxus- und High-Fashion-Einzelhandelsgeschft in der Klner Innenstadt. Wir sind innerhalb krzester Zeit zu einer Anlaufstelle fr kreative Menschen geworden, die den kosmopolitischen Lifestyle mit einer Mischung aus Fashion, Dften und Accessoires in ihren Alltag integrieren mchten. Wir setzen auf junge, unkonventionelle Brands und etablierte, traditionelle Marken mit klarer Identitt. Unser Markenportfolio beinhaltet eine ausgewhlte Produktpalette aus High Fashion Marken und exklusiven Nischenprodukten, wie Acne Studios, Autry, Craig Green, Fear Of God, Ami Paris, Kenzo, Maison Margiela, Marni, Raf Simons, Rick Owens, Jil Sander, Hed Mayner, Y-Project & mehr.\"Fr die Betreuung unseres Online-Shops suchen wir ab sofort einenE-Commerce Manager - Operations in TeilzeitAufgabenDeine Aufgaben:vollumfngliche Betreuung des Online ShopsProduktberprfung: direkte Korrektur\/Artikel-Anpassung bei Fehlern zw. Warenwirtschaftssystem und ShopifySaisonbedingte Produktpflege aller Artikel im Online Shop: Pflege von Images ber Farfetch\/Online Shop, Produktbeschreibung, Produktnamen, Kategorien, Farben etc.Bearbeitung von Tickets \/Kundenservice: Aufbau der Texte im CRM, sowie OptimierungMonitoren von Bestellungen und Retouren innerhalb Shopify fr besondere FlleProzessoptimierung E-CommerceMitarbeit bei der strategische-kaufmnnische Ausrichtung der Verkaufsplattform ShopifyAnalysen und AktionssteuerungQualifikationDas bringst du mit:sehr gute Kenntnisse in den Prozessen fr Omnichannel CommerceSystemkompetenz im Bereich Warenwirtschaft Praxis im PIMausgeprgtes Talent fr Organisation und Prozessmanagementgerne Kenntnisse im GrafikbereichBenefitsWir bieten dir:ein dynamisches und fachlich kompetentes Teamdie Mglichkeit auf flexibles Arbeiten in unseren Brorumen, Home Office oder Remoteeine ausfhrliche Einarbeitungsphasedirekte und unkomplizierte Kommunikationswegewachsendes und zielstrebiges digitales Unternehmenbesonderer Flair im Bereich der LuxusmodeWir freuen uns auf deine Bewerbung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/atelier-x-gmbh\/e-commerce-manager-operations-gesucht-cologne-342046","tags":["Marketing and Communication"],"job_types":["berufserfahren"],"location":"Cologne","created_at":1702892942000},{"slug":"team lead support berlin ","company_name":"mediaire GmbH","title":"Team Lead Support","description":"Wir sind ein Berliner MedTech-Startup, das sich der Entwicklung von KI-basierten Softwarelsungen verschrieben hat, die RadiologInnen bei ihrer tglichen Arbeit untersttzen: der Analyse von medizinischen Bildern. Mit unseren hoch innovativen Softwarelsungen zur Identifizierung von Demenz, Aneurysmen oder Multipler Sklerose (MS) aus MRT-Scans konnten wir bereits viele begeisterte Kunden gewinnen.AufgabenDu leitest unser Supportteam und gestaltest interne Prozesse federfhrend gemeinsam mit deinen Kolleg:innen.Du verantwortest Prozesse nicht nur - du lebst sie, indem du im operativen Tagesgeschft mitarbeitest und das Team bei der Lsung von Problemen und der Kommunikation untersttzt.Dir sind Menschen wichtiger als KPIs, du denkst gerne out-of-the-box und passt wenn ntig dein Vorgehen an, um uns noch schneller und effizienter dabei zu machen, unsere Kund:innen zu untersttzen.Du arbeitest mit unserem Entwicklungsteam und unseren Radiolog:innen zusammen, um unsere Produkte und Infrastruktur zu verbessern.Du untersttzt deine Kolleg:innen bei ihrer persnlichen und fachlichen Weiterentwicklung.QualifikationDu bist technisch versiert, kennst dich mit Linux und der Kommandozeile aus und Container und VMs sind dir nicht fremd.  Du bist empathisch, kommunizierst gerne und liebst es, Kund:innen und Kolleg:innen zu untersttzen.Du machst Dinge mglich und hast Spa daran, auch mal im Hintergrund zu arbeiten und deine Kolleg:innen durch die Gestaltung von optimalen Prozessen zu entlastenDu bist neugierig und findest gerne Lsungen fr knifflige Probleme.Du bringst flieende Deutsch- und Englischkenntnisse in Wort und Schrift mit.Du hast bereits mindestens 3 Jahre Erfahrung im technischen Support, idealerweise von SaaS-Anwendungen, und im Idealfall auch bereits erste Erfahrung als Teamlead gesammelt.Bonuspunkte gibt es fr:   Erfahrung mit radiologischen IT Systemen (PACS, RIS, DICOM) ist ein groes Plus.Erfahrung mit Auditverfahren und \/ oder im Bereich der MedizintechnikLinux Sysadmin Kenntnisse, besonders Networking und Scripting mit Bash oder PythonBenefitsBei uns zhlen Kompetenz, Persnlichkeit und Engagement mehr als Formalitten und Studiengang.Mit Deiner Arbeit trgst Du dazu bei, die Diagnose von Krankheiten schneller, genauer und beherrschbarer zu machen.Du wirst Teil eines interdisziplinren hochmotivierten Teams mit schnellen Entscheidungsprozessen.Flexibilitt: Du kannst von zu Hause oder in unserem Bro in Berlin-Kreuzberg arbeiten.Vergnstigungen: Mitgliedschaft im Urban Sports Club, Getrnke und Snacks im Bro.mediaire wurde 2018 von Dr. Andreas Lemke und Dr. Jrg Dpfert gegrndet - beide Physiker mit einem Hintergrund in der MRT-Physik.  Die eigentliche Grndungsgeschichte geht jedoch auf das Jahr 2009 zurck, als sich die wissenschaftlichen Wege von Andreas und Jrg mehrfach mit dem renommierten Radiologen Prof. Henrik Michaely kreuzten. Aus unterschiedlichen Hintergrnden kommend und mit der Erkenntnis, dass beide das gleiche Ziel verfolgten, nahm die Idee eines wissenschaftlich und wirtschaftlich erfolgreichen Hightech-Produkts Gestalt an - eine Software, die durch knstliche Intelligenz (KI) angetrieben wird und eine hocheffiziente Analyse medizinischer Bilddaten in der Radiologie ermglicht, um RadiologInnen in ihrer tglichen Routine zu untersttzen.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/mediaire-gmbh\/team-lead-support-berlin-309864","tags":["Remote","Helpdesk"],"job_types":["teamleitung"],"location":"Berlin","created_at":1702892942000},{"slug":"vertriebsinnendienst  remote hamburg ","company_name":"thejugglingswan GmbH","title":"Vertriebsinnendienst (m\/w\/d) 100% Remote","description":"Jeder Anruf, den du machst, bringt dich nher zu deinem eigenen Ziel, jedes Nein ist ein Ansporn, das nchste JA zu bekommen. Feierst du?Dann lies gerne weiter.Denn wenn du eine Person bist, diefr Vertrieb brennt, sich dort regelmig durch YouTube Videos und Co. weiterbildet +bestehende Prozesse und ein gutes Produkt nutzen mchte, um die eigenen vertrieblichen Ziele zu erreichen...dann bist du bei uns genau richtig.Wer wir sind?Wir sind ein Team von Social-Media-Experten aus Hamburg, die immer auf dem neuesten Stand bleiben. Unser Ziel ist es, unseren Kunden dabei zu helfen, sich von der Konkurrenz abzuheben. Wir wissen, dass Unternehmen heute traditionelle Werte und moderne Bedrfnisse vereinen mssen, und Social Media ist dafr perfekt geeignet. Wir bieten mageschneiderte Lsungen an, indem wir uns die Zeit nehmen, unsere Kunden und ihre Ziele zu verstehen.Wir machen den Mittelstand bekannt, ziehen die richtigen Mitarbeiter an und generieren neuen Umsatz fr unsere Kunden.AufgabenWas du tun wirst:Kundenanfragen bearbeiten per E-Mail & Telefon: Outbound Leads generieren durch Social Media & Kaltakquise.Leads anrufen und Verkaufsgesprche terminieren.Kaltakquise mit bereitgestellter Liste betreiben (mit dem Ziel eine Potenzialanalyse zu vereinbaren)Termine mit Interessenten vereinbaren per Telefon.Kundenbeziehungen auf- und ausbauen: Kunden beraten und Upsells vorbereiten.Gesprchstermine vorbereiten: CRM pflegen und Verkufern relevante Infos weiterleiten.Follow Up betreiben bei Kunden & InteressentenZuknftig Abschlussgesprche fhren & unsere Produkte verkaufenQualifikationExtrovertiert & an Menschen interessiert.Vorerfahrung im Vertrieb notwendig.Biss haben und Ziele erreichen wollen.Kunden- und serviceorientiert und freundliches und kommunikatives Auftreten.Engagiert und besitzt eine schnelle Auffassungsgabe, eine strukturierte Arbeitsweise und bringst eine hohe Lernbereitschaft mit.berzeugungsstark & redegewandt.Eine ruhige, angenehme und attraktive Stimme.Bestehenden Prozessen folgen knnen.Vorerfahrung im Bereich Online-Marketing und Coaching frderlich, aber nicht notwendig.Ausbildung\/Studium: ist nebenschlichBenefits Die Mglichkeit mit einem coolen Team zusammenzuarbeiten: Wir feiern das persnliche Wachstum und bringen uns gegenseitig weiter. Faires und sicheres Gehalt Mentoring: Was mchtest du beruflich und persnlich eigentlich erreichen? Gemeinsam entwerfen wir einen Plan, um deine Ziele umzusetzen. Regelmige Team-Events (Abendessen, Offsites) Kaffeemaschine mit leckerem Kaffee Wir stellen das ntige Equipment (Macbook und so weiter) Ein top modernes Office in Hamburg SternschanzeDu liebst den Vertrieb und mchtest von berall arbeiten? Bewirb dich jetzt als Vertriebsinnendienst (m\/w\/d) bei thejugglingswan GmbH und werde Teil unseres dynamischen Teams!Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/thejugglingswan-gmbh\/vertriebsinnendienst-100-remote-hamburg-186916","tags":["Remote","Distribution Marketing"],"job_types":["berufseinstieg"],"location":"Hamburg","created_at":1702892942000},{"slug":"applikationsingenieur in bereich vertriebsinnendienst saarbrucken ","company_name":"Fluid.iO Sensor + Control GmbH & Co. KG","title":"Applikationsingenieur\/in - Bereich: Vertriebsinnendienst (m\/w\/d)","description":"Wir sind ein schnell wachsendes Industrieunternehmen, das zuverlssige Sensortechnologie und Elektronik zum Messen, Prfen und Steuern von Gasen und Flssigkeiten entwickelt, produziert und verkauft.AufgabenIhre Aufgaben:Fr unsere Kunden sind Sie erster Ansprechpartner fr technische Produkte und Lsungen im B2B Bereich:berzeugende Vorstellungen unserer innovativen Produkte gegenber (potenziellen) KundenUntersttzung bei der Realisierung von Applikationen und Anforderungen unserer KundenVertriebsuntersttzende Ttigkeiten (Telefonische Kundenberatung, Technischer Support, Angebotserstellung) Zusammenarbeit mit R&D und Marketing (Produktdokumentationen, Durchfhrung von Produkt- und Systemtests, Messevorbereitung und -durchfhrung)QualifikationDas bringen Sie mit: abgeschlossenes Studium der Elektrotechnik, Verfahrenstechnik oder eines verwandten technischen Fachbereichs erste Berufserfahrung im Bereich der industriellen Mess-, Steuer-, Regelungstechnik und\/oder Verfahrenstechnik Produktivitt, Kundenorientierung, Kreativitt und Hilfsbereitschaft - sowohl eigenverantwortlich als auch im Team Begeisterung fr technisches HandwerkBenefitsWas wir bieten:Einarbeitung erfolgt \"on the job\" in einem engagierten, kompetenten Teamlangfristige Zusammenarbeitmoderne und familire Arbeitsumgebung mit kurzen Entscheidungswegeneigenstndiges Arbeiten in abwechslungsreichen und individuellen Projektenflexible Arbeitszeitenleistungsgerechte VergtungEntwicklungs- und Karrieremglichkeitenzustzliche optionale Sozialleistungen, z. B. betriebliche Altersvorsorge mit ber dem Gesetz liegenden ArbeitgeberzuschussWeitere Details zur Anstellung:Arbeitsort: Saarbrcken Einstiegslevel: Absolvent ggf. erste ErfahrungenAnstellungsart: VollzeitTtigkeitsbeginn: ab sofort Die Stellenanzeige gilt fr Personen jeden Geschlechts gleichermaen.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/fluidio-sensor-control-gmbh-co-kg\/applikationsingenieur-in-bereich-vertriebsinnendienst-saarbrucken-90095","tags":["Engineering"],"job_types":[],"location":"Saarbrücken","created_at":1702892942000},{"slug":"allrounder in buchhaltung rechnungswesen berlin ","company_name":"Adato AG","title":"Allrounder\/in Buchhaltung\/Rechnungswesen","description":"Pensum: 100%Stellenantritt: sofort\/nach VereinbarungArbeitsort: FlughafenregionAnstellungsart:  Festanstellung  Einleitung: Fr unsere Kundin, ein innovatives KMU im Dienstleistungsbereich, suchen wir per sofort oder nach Vereinbarung eine erfahrene Allrounder-Persnlichkeit, um das bestehende Buchhaltungs-Team zu untersttzen.Stellenbeschrieb:  Mehre Jahre relevante Berufserfahrung sowie eine abgeschlossene Ausbildung im Bereich Rechnungswesen sind Voraussetzung. Zudem kommunizierst Du stilsicher in Deutsch, weitere Sprachen wie FR\/EN sind von Vorteil. Eine gut gefllter Erfahrungsrucksack sowie Deine ?hands-on? Mentalitt runden Dein Profil ab.  Anforderungsprofil:  In dieser spannenden Position hast Du Berhrungspunkte mit folgenden Aufgaben: Kontierung und Erfassung von Eingangsrechnungen, berwachung des Kreditoren-Workflows, das Fhren der Kreditoren- und Anlagenbuchhaltung sowie die Mithilfe bei Monats-, Quartals- und Jahresabschlssen. Auch die Themen Lastschriftverfahren, Einlesen der tglichen Debitorenzahlungen, die Auszahlung von Kreditoren sowie allgemeinen Buchhaltungsaufgaben wie transitorische Buchungen und Auswertungen\/Analysen sind fr Dich kein Neuland. Vertiefte Kenntnisse im Zahlungsverkehr sind von grossem Vorteil.  Haben wir Dein Interesse geweckt? Dann bewirb Dich noch heute, wir freuen uns ber Deine Kontaktaufnahme.__Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/adato-ag\/allrounder-in-buchhaltung-rechnungswesen-berlin-1354","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702892942000},{"slug":"senior consultant sap mm mannheim ","company_name":"Avvale GmbH","title":"(Senior) Consultant SAP MM (m\/w\/d)","description":"Tauchen Sie ein in ein Universum grenzenloser Mglichkeiten und gestalten Sie aktiv unsere gemeinsame Zukunft mit  werden Sie Teil von Avvale in Deutschland!Um das Potenzial unserer Kunden optimal zu nutzen und unsere Beratungsfelder weiterzuentwickeln und zu vertiefen, suchen wir eine\/einen (Senior) Consultant SAP MM (m\/w\/d) mit hoher Eigenmotivation und dem Ziel, sich in unseren von Innovation und Wachstum geprgten Unternehmensalltag einzubringen.Als Teil von Avvale in Deutschland tragen Sie aktiv zur Gestaltung einer gemeinsamen und nachhaltigen Zukunft bei. Bei uns erwartet Sie von Anfang an die Mglichkeit, Verantwortung zu bernehmen und sich in einem professionellen Umfeld schnell weiterzuentwickeln. Ihre Ideen und Ihr Engagement sind bei uns gefragt, um innovative Lsungen fr unsere Kunden zu schaffen und neue Mastbe in der Branche zu setzen.AufgabenDurchfhrung von Digitalisierungs- und Implementierungsprojekten im SAP-Umfeld als Teilprojektleiter SAP MMMitgestaltung, Planung und Durchfhrung von BeratungsprojektenKonzepterstellung mit Vorschlgen zu Handlungsempfehlungen und Umsetzung in den Kunden-SystemenKonstruktive, lsungsorientierte und partnerschaftliche Zusammenarbeit mit dem Kunden und dem ProjektteamQualifikationMust-have:Mehrjhrige Berufserfahrung als SAP Consultant oder Key User im Bereich SAP MMSehr gute Kenntnisse im SAP-Modul MM (Prozesse, Customizing, Stammdaten)Sicheres und berzeugendes Auftreten, sowie eine ausgeprgte Kommunikationsfhigkeit und eine proaktive ArbeitsweiseFlexibilitt, Reisebereitschaft, Kundenorientierung und ausgeprgte Analysefhigkeiten runden Ihr Profil abFlieende Deutschkenntnisse und sehr gute Englischkenntnisse sind VoraussetzungWnschenswert:Erfahrungen in SAP Rollout Projekten (idealerweise S\/4HANA Rollouts)Strukturierte, zielorientierte Arbeitsweise und eine konzeptionelle DenkweiseKenntnisse in einem weiteren SAP-ModulBenefitsArbeitsmodell nach Ihren Bedrfnissen: Genieen Sie Flexibilitt durch flexible Arbeitszeiten und einen Mobile Office VertragAttraktives Vergtungspaket: Neben einem wettbewerbsfhigen Grundgehalt bieten wir Ihnen die Option auf einen Firmenwagen sowie grozgige Beitrge zur betrieblichen AltersvorsorgeNachhaltige Mobilittsoptionen: Erhalten Sie einen Zuschuss zum Leasing eines E-Bikes im Rahmen unseres Dienstrad-ProgrammsAgile Unternehmensstruktur: Bei uns genieen Sie die Freiheit, rasch in Verantwortungsfelder aufzusteigen und eigene Ideen einzubringen, dabei profitieren Sie von flachen Hierarchien und kurzen EntscheidungswegenIndividuelle Karrierebegleitung und fokussierte Entwicklung: Persnliches Mentoring und zielgerichtete Entwicklungsgesprche bilden die Grundlage fr kontinuierliche berufliche Aufstiegschancen und KompetenzsteigerungIndividuell gestaltbare Weiterbildung: Sie erhalten bei uns die Freiheit, aus einer Reihe von Weiterbildungsinitiativen diejenigen auszuwhlen, die Ihren beruflichen und persnlichen Entwicklungszielen entsprechenInternationales Netzwerk und Team-Events: Tauschen Sie sich innerhalb eines globalen Kollegen-Netzwerks aus und nehmen Sie an regelmigen Firmenevents teilWir freuen uns auf Sie!Starten Sie mit uns in eine aufregende neue Beratungszeit in der fnften industriellen Revolution! Leben Sie die Ihnen gebotenen Freirume aus und gestalten Sie aktiv unsere gemeinsame Zukunft mit.Senden Sie hierzu bitte Ihre aussagekrftigen Bewerbungsunterlagen (Anschreiben, Lebenslauf, Projektliste) hier ber Join zu.BER UNS:Avvale ist ein global agierendes Beratungsunternehmen fr digitale Unternehmenstransformation mit mehr als 3.000 Mitarbeitenden, die ber mehrere Kontinente hinweg Unternehmen auf ihrem Weg zur Industrie 5.0 begleiten. Nachhaltigkeit und Circular Economy nehmen dabei einen besonderen Platz ein. Wir untersttzen unsere Kunden dabei, die heutigen Herausforderungen erfolgreich zu meistern, sowohl nachhaltig als auch profitabel zu wirtschaften und ihre Geschftsprozesse mithilfe der neuesten Technologien zu optimieren und zu digitalisieren und die digitale Transformation erfolgreich zu gestalten.Unsere Dienst- und Beratungsleistungen erstrecken sich ber eine breite Palette von Branchen und Themen, dabei liegt unsere herausragende Kompetenz rund um SAP. In Deutschland konzentrieren wir uns auf die Hauptbereiche: SAP ERP Consulting & S\/4HANA Migration, Digital Experience & Cloud Innovations, System Integration sowie das Application Lifecycle Management. Unser Leistungsportfolio umfasst die Implementierung und Maintenance fhrender SAP Lsungen sowie die Planung und Entwicklung mageschneiderter digitaler Plattformen. Darber hinaus bieten wir umfassende Beratungsleistungen im Bereich Test- Incident & Change Management an.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/avvale-gmbh\/senior-consultant-sap-mm-mannheim-474553","tags":["Remote","SAP\/ERP Consulting","Development"],"job_types":[],"location":"Mannheim","created_at":1702892942000},{"slug":"senior consultant sap sd mannheim ","company_name":"Avvale GmbH","title":"(Senior) Consultant SAP SD (m\/w\/d)","description":"Tauchen Sie ein in ein Universum grenzenloser Mglichkeiten und gestalten Sie aktiv unsere gemeinsame Zukunft mit  werden Sie Teil von Avvale in Deutschland!Um das Potenzial unserer Kunden optimal zu nutzen und unsere Beratungsfelder weiterzuentwickeln und zu vertiefen, suchen wir eine\/einen (Senior) Consultant SAP SD (m\/w\/d) mit hoher Eigenmotivation und dem Ziel, sich in unseren von Innovation und Wachstum geprgten Unternehmensalltag einzubringen.Als Teil von Avvale in Deutschland tragen Sie aktiv zur Gestaltung einer gemeinsamen und nachhaltigen Zukunft bei. Bei uns erwartet Sie von Anfang an die Mglichkeit, Verantwortung zu bernehmen und sich in einem professionellen Umfeld schnell weiterzuentwickeln. Ihre Ideen und Ihr Engagement sind bei uns gefragt, um innovative Lsungen fr unsere Kunden zu schaffen und neue Mastbe in der Branche zu setzen.AufgabenDurchfhrung von Digitalisierungs- und Implementierungsprojekten im SAP-Umfeld als Teilprojektleiter SAP SDMitgestaltung, Planung und Durchfhrung von BeratungsprojektenKonzepterstellung mit Vorschlgen zu Handlungsempfehlungen und Umsetzung in den Kunden-SystemenKonstruktive, lsungsorientierte und partnerschaftliche Zusammenarbeit mit dem Kunden und dem ProjektteamQualifikationMust-have:Mehrjhrige Berufserfahrung als SAP Consultant oder Key User im Bereich SAP SDSehr gute Kenntnisse im SAP-Modul SD (Prozesse, Customizing, Stammdaten)Flexibilitt, Reisebereitschaft, Kundenorientierung und ausgeprgte Analysefhigkeiten Sicheres und berzeugendes Auftreten, sowie eine ausgeprgte Kommunikationsfhigkeit und eine proaktive ArbeitsweiseFlieende Deutschkenntnisse und sehr gute EnglischkenntnisseWnschenswert:Erfahrungen in SAP Rollout Projekten (idealerweise S\/4HANA Rollouts)Kenntnisse in angrenzenden SAP Modulen (z. B. VC, PP, MM, LE)Strukturierte, zielorientierte Arbeitsweise und eine konzeptionelle DenkweiseBenefitsArbeitsmodell nach Ihren Bedrfnissen: Genieen Sie Flexibilitt durch flexible Arbeitszeiten und einen Mobile Office VertragAttraktives Vergtungspaket: Neben einem wettbewerbsfhigen Grundgehalt bieten wir Ihnen die Option auf einen Firmenwagen sowie grozgige Beitrge zur betrieblichen AltersvorsorgeNachhaltige Mobilittsoptionen: Erhalten Sie einen Zuschuss zum Leasing eines E-Bikes im Rahmen unseres Dienstrad-ProgrammsAgile Unternehmensstruktur: Bei uns genieen Sie die Freiheit, rasch in Verantwortungsfelder aufzusteigen und eigene Ideen einzubringen, dabei profitieren Sie von flachen Hierarchien und kurzen EntscheidungswegenIndividuelle Karrierebegleitung und fokussierte Entwicklung: Persnliches Mentoring und zielgerichtete Entwicklungsgesprche bilden die Grundlage fr kontinuierliche berufliche Aufstiegschancen und KompetenzsteigerungIndividuell gestaltbare Weiterbildung: Sie erhalten bei uns die Freiheit, aus einer Reihe von Weiterbildungsinitiativen diejenigen auszuwhlen, die Ihren beruflichen und persnlichen Entwicklungszielen entsprechenInternationales Netzwerk und Team-Events: Tauschen Sie sich innerhalb eines globalen Kollegen-Netzwerks aus und nehmen Sie an regelmigen Firmenevents teilWir freuen uns auf Sie!Starten Sie mit uns in eine aufregende neue Beratungszeit in der fnften industriellen Revolution! Leben Sie die Ihnen gebotenen Freirume aus und gestalten Sie aktiv unsere gemeinsame Zukunft mit.Senden Sie hierzu bitte Ihre aussagekrftigen Bewerbungsunterlagen (Anschreiben, Lebenslauf, Projektliste) hier ber Join zu.BER UNS:Avvale ist ein global agierendes Beratungsunternehmen fr digitale Unternehmenstransformation mit mehr als 3.000 Mitarbeitenden, die ber mehrere Kontinente hinweg Unternehmen auf ihrem Weg zur Industrie 5.0 begleiten. Nachhaltigkeit und Circular Economy nehmen dabei einen besonderen Platz ein. Wir untersttzen unsere Kunden dabei, die heutigen Herausforderungen erfolgreich zu meistern, sowohl nachhaltig als auch profitabel zu wirtschaften und ihre Geschftsprozesse mithilfe der neuesten Technologien zu optimieren und zu digitalisieren und die digitale Transformation erfolgreich zu gestalten.Unsere Dienst- und Beratungsleistungen erstrecken sich ber eine breite Palette von Branchen und Themen, dabei liegt unsere herausragende Kompetenz rund um SAP. In Deutschland konzentrieren wir uns auf die Hauptbereiche: SAP ERP Consulting & S\/4HANA Migration, Digital Experience & Cloud Innovations, System Integration sowie das Application Lifecycle Management. Unser Leistungsportfolio umfasst die Implementierung und Maintenance fhrender SAP Lsungen sowie die Planung und Entwicklung mageschneiderter digitaler Plattformen. Darber hinaus bieten wir umfassende Beratungsleistungen im Bereich Test- Incident & Change Management an.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/avvale-gmbh\/senior-consultant-sap-sd-mannheim-191730","tags":["Remote","SAP\/ERP Consulting","Development"],"job_types":[],"location":"Mannheim","created_at":1702892942000},{"slug":"senior talent acquisition manager all genders munich ","company_name":"Parkdepot","title":"Senior Talent Acquisition Manager (all genders) Munich","description":"Your new roleAre you ready to join us on an exciting road trip? We are an emerging startup and aim to turn parking management on its head. You support your colleagues in building a product that revolutionizes the way parking is managed. With our innovative technology, we are ready to transform mobility and explore new ways of doing things.  Imagine yourself actively shaping the growth of our company and having a significant impact on the future of urban mobility. With your expertise in Talent Acquisition and the entire Candidate Journey you will strengthen our position as market leader, while as Talent Acquisition Manager (all genders) you will achieve new successes together with our excellent team.What to expectSparring partner: Forge strong partnerships with department heads, gaining insights into recruitment requirements, and offer adept coaching and support in market dynamics, interview techniques, and process best practicesHiring Strategies: You oversee hiring needs, comprehend priorities in the recruitment process, and develop suitable sourcing strategies based on that understanding to attract active and passive talentData: Shape business decisions and hiring strategies by utilizing your market expertise and harnessing the power of dataProcesses: Champion top-tier processes and systems, aiding in the preservation of data integrity and adherence to processes, all geared towards cultivating a positive hiring experience for both candidates and hiring teamsEmployer Branding: You serve as a brand ambassador, promoting our employer brand externallyInspire us byExperience: Proven track record in in-house recruiting, specializing in engineering \/ tech profiles and experience in sourcing, engaging, and activating passive candidatesCandidate Experience: Deep understanding of balancing candidate experience and impactful interview processesHands-on: You enjoy working independently in a dynamic environment and are characterized by your proactive approachData-driven: You take a data-driven approach and have the ability to work in a solution-oriented way to gather meaningful analytics for hiring through recruitment dataCommunication: Proficiency in both German and English languagesWhat we offer youFlexibility: Our model allows you to tailor your work schedule to your unique requirements, ensuring maximum flexibility.Equipment: Decide on your own equipment to work efficiently and comfortably.Workation: Work in inspiring locations during your Workation for fresh ideas.Measurable goals: Our OKRs allow you to directly measure your impact on our product and company success.Catering: Fresh coffee from our portafilter machine around the clock for your energy and productivity. Discover the variety of Bella&Bona, our online cafeteria, or help yourself to our fruit basket or enjoy breakfast at the cereal bar.Dress code: Dress in a way that makes you feel most comfortable.Events: Celebrate our successes at our legendary team events and OKR parties.Development: Take advantage of our language courses or in-house training programs to learn new skills.Health: We support your health and fitness with EGYM to keep you active.Security: Your workplace security is ensured by our profitable business model.Profit sharing: Benefit from our Virtual Stock Option Plan (VSOP) and participate in the success of Parkdepot.Innovation through diversityRegardless of your background, origin, gender identity, or individual circumstances, it's your personality that interests us. That's why we're committed to building a culture of collaboration and respect, where every team member has a voice, can grow, and feels valued with us.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parkdepot\/senior-talent-acquisition-manager-all-genders-munich-124318","tags":["HR"],"job_types":["professional \/ experienced"],"location":"Munich","created_at":1702892942000},{"slug":"maschineneinrichterin in  schicht kehl ","company_name":"CARECOS Kosmetik GmbH","title":"Maschineneinrichter:in (m\/w\/d) in 3-Schicht","description":"Die JDA cosmetic group ist ein international ttiger Hersteller von High End Wirkstoffkosmetik. Teil der Gruppe ist die Eigenmarke JEAN DARCEL Cosmtique GmbH & Co. KG und der erfahrene Lohnhersteller CARECOS Kosmetik GmbH. Die stark expandierende CARECOS Kosmetik GmbH ist seit mehr als 25 Jahren fr die Entwicklung und Herstellung von Hautpflegeprodukten der JDA-Produkte und fr viele namhafte hochwertige Kosmetikmarken in Deutschland sowie international ttig. Fr die CARECOS Kosmetik GmbH suchen wir zum nchstmglichen Zeitpunkt eine:n Mitarbeiter:in (m\/w\/d) in der Betriebstechnik.AufgabenRsten, Einstellen und Justieren von Abfll- & VerpackungsanlagenAnlagenbetreuung in der laufenden FertigungBehebung von technischen StrungenPlanung und Durchfhrung von Instandhaltungs- und WartungsarbeitenErprobung neuer und Optimierung bestehender AbfllvorgngeQualifikationAbgeschlossene Berufsausbildung (Mechanik, Elektrotechnik, Steuerungstechnik) oder Quereinsteiger mit entsprechender BerufserfahrungKenntnisse in der Produktions-\/ Abfll- und VerpackungstechnikIdealerweise aus der Kosmetik-\/ Lebensmittel- oder PharmaindustrieErfahrung in der Wartung von industriellen AnlagenGute Deutschkenntnisse in Wort und SchriftZuverlssigkeit und TeamfhigkeitVerantwortungs- und Qualittsbewusstsein, selbststndige ArbeitsweiseGute EDV-KenntnisseBereitschaft zur Schichtarbeit (3-Schichtbetrieb), Option Dauernachtschicht ist auf Wunsch mglichBenefitsEine 38,5 Stunden-Woche30 Tage Urlaub sowie ein 13. GehaltMitarbeiterrabatte und -benefits, wie z.B. unsere SpenditCardTtigkeitsbezogene WeiterbildungsangeboteVermgenswirksame Leistungen und Mglichkeit der Entgeltumwandlung zur betrieblichen AltersvorsorgeBetriebliches GesundheitsmanagementModerne Technik-AusstattungTeamevents wie Sommerfest, Weihnachtsfeier, TeambuildingUmfassende Einarbeitung und Kolleg:innen, die ihr Wissen gerne teilenEin familiengefhrtes Unternehmen mit Duz-KulturEin stark wachsendes Team mit flachen Hierarchien und einem kollegialen ArbeitsumfeldBitte senden Sie uns Ihre vollstndigen Bewerbungsunterlagen unter Angabe Ihrer Gehaltsvorstellungen und Ihrem frhestmglichen Eintrittsdatum zu. Wir freuen uns auf Ihre aussagekrftige Bewerbung!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/carecos-kosmetik-gmbh\/maschineneinrichterin-in-3-schicht-kehl-40002","tags":["Industrial Engineer"],"job_types":[],"location":"Kehl","created_at":1702892942000},{"slug":"leiter kundenservice callcenter rottenburg ","company_name":"Kopp Verlag e.K.","title":"Leiter Kundenservice \/ Callcenter (m\/w\/d)","description":"Wir suchen zum nchstmglichen Termin einen Leiter Kundenservice (m\/w\/d) fr unseren Unternehmenssitz in Rottenburg am Neckar. Sie leiten unseren Kundenservice und steuern unsere externen Callcenter.AufgabenFachliche und disziplinarische Fhrung sowie Weiterentwicklung der Mitarbeiter im eigenen Kundenservice-Team Entwicklung von Manahmen zur Motivation des eigenen Teams Fhren von Mitarbeitergesprchen sowie Mitarbeit bei Trainings- und CoachingmanahmenBearbeitung von Eskalationsfllen und KundenbeschwerdenErstellen von Forecasts Sicherstellung bzw. Weiterentwicklung unserer Servicequalitt sowie Gewhrleistung einer hervorragenden Kundenbetreuung und hohen KundenzufriedenheitBerichterstattung ber Leistungskennzahlen und -trendsMonitoring der Verkaufserfolge und kontinuierliche Weiterentwicklung der einzelnen TeammitgliederAbstimmung und Fhrung der externen CallcenterAktive Mitarbeit im Tagesgeschft in der HauptsaisonQualifikationAbgeschlossenes Studium der Betriebswirtschaft oder vergleichbare QualifikationMehrjhrige Berufserfahrung im (telefonischen) Kundenservice im B2C-UmfeldErfahrungen in der fachlichen und disziplinarischen FhrungVerhandlungssichere Deutschkenntnisse in Wort und SchriftAusgeprgte Kunden- und Serviceorientierung sowie hohe KommunikationsstrkeTeamorientierte Einstellung und die Fhigkeit, andere zu berzeugen und zu motivierenAusgeprgte VertriebsorientierungSelbstsicheres Auftreten als kooperative Fhrungspersnlichkeit mit Entscheidungs- und KonfliktlsungsstrkeServiceorientierte und empathische PersnlichkeitBereitschaft, im Team zu agieren und Entscheidungen gemeinsam zu tragenBenefitsWir bieten eine angenehme Arbeitsatmosphre und kurze Entscheidungswege. Auerdem erwartet Sie bei uns:Ein moderner, lichtdurchfluteter, klimatisierter Arbeitsplatz in unserem neugebauten, architektonisch interessanten Firmengebude direkt an der NaturEin eigenes Betriebsrestaurant mit reichhaltigem Angebot, gratis Tafelwasser, Kaffee sowie frisches ObstEine optimale Lage an der B28 mit Parkflchen direkt am GebudeRadabstellflchen, Umkleiderume und Duschen sowie eine gute Anbindung an den ffentlichen NahverkehrHohe Mitarbeiterrabatte auf das komplette Sortiment von ber 13 Millionen ArtikelnUntersttzung bei der Altersvorsorge durch vermgenswirksame Leistungen und eine Mglichkeit der betrieblichen AltersvorsorgeGemeinsame MitarbeitereventsEin attraktives Vergtungspaket30 Tage Urlaub und 24. wie 31.12. freiEine wertschtzende \"Du\"-KulturUnd natrlich eine sorgfltige EinarbeitungWir haben Ihr Interesse geweckt?Dann freuen wir uns auf Ihre aussagekrftige Bewerbung mit:AnschreibenLebenslaufArbeits- und AusbildungszeugnissenKndigungsfrist und EintrittsterminSowie Ihren GehaltsvorstellungenFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kopp-verlag-ek\/leiter-kundenservice-callcenter-rottenburg-53709","tags":["Customer Service"],"job_types":["teamleitung"],"location":"Rottenburg","created_at":1702889342000},{"slug":"full stack developer all genders krefeld ","company_name":"KOMMSOFT - R+R IT-Solutions GmbH","title":"Full Stack Developer (all genders)","description":"Wir sind KOMMSOFT - Experten fr Softwareentwicklung und suchen einen Full Stack Entwickler zur Untersttzung unseres jungen & dynamischen Teams.Bei uns dreht sich alles um Innovation, Technologie und die Bereitstellung hervorragender Produkte fr Verwaltungen.Wenn Du eine Leidenschaft fr Innovation hast und gerne in einem kreativen und untersttzenden Umfeld arbeiten mchtest passt du wie die Faust aufs Auge zu uns.Trau dich und spring ins warme Wasser und starte mit deiner Karriere endlich durch.AufgabenNeu und Weiterentwicklungen von Web ApplikationenFrontend Entwicklung mit HTML \/ CSS \/ JavaScript \/ Angular(JS)Backend Entwicklung mit PHPDatenbankentwicklung mit SQL (MSSQL)Quellcode auf Herz und Nieren testenSecond-Level-SupportSpa daran haben, eigene Ideen\/Erfahrungen & Verbesserungsmglichkeiten einzubringenKontinuierliche Weiterentwicklung der eigenen FachkenntnisseAber vor allem: Die Digitlisierung voranbringen!QualifikationDu hast gute Kommunikationsfhigkeiten und kannst technische Konzepte verstndlich erklrenDu bist kundenorientiert und hast Spa daran, individuelle Lsungen zu entwickelnDu bist geduldigDu arbeitest gerne im Team und bist flexibel, um auf wechselnde Anforderungen reagieren zu knnenSuper wre, wenn du dich in den o.g. Sprachen sowie mit Webservern (IIS), GIT & CI\/CD auskennstBenefitsGenau wie wir sind unsere Benefits dynamisch und kreativ, so wie viel knnen wir sagen: Mobiles & flexibles Arbeiten, regelmige Mitarbeiter Events und Feel Good im Arbeitsalltag sowie im Bro und Zuhause sind fr uns selbstverstndlich.Mchtest du in einem jungen dynamischen Unternehmen arbeiten, das sich auf die Digitalisierung unserer Verwaltungen also auch unser eigenes Leben spezialisiert hat? Bewirb dich jetzt als  bei KOMMSOFT!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kommsoft-rr-it-solutions-gmbh\/full-stack-developer-all-genders-krefeld-348796","tags":["Software Development"],"job_types":[],"location":"Krefeld","created_at":1702889342000},{"slug":"it consultant requirements engineer software kundenberater all genders krefeld ","company_name":"KOMMSOFT - R+R IT-Solutions GmbH","title":"IT-Consultant \/  Requirements Engineer \/ Software-\/Kundenberater (all genders)","description":"Wir sind KOMMSOFT - Experten fr Softwareentwicklung und suchen einen IT-Consultant \/ Requirements Engineer \/ Software-\/Kundenberater zur Untersttzung unseres jungen & dynamischen Teams.Bei uns dreht sich alles um Innovation, Technologie und die Bereitstellung hervorragender Produkte fr Verwaltungen.Wenn Du eine Leidenschaft fr Innovation hast und gerne in einem kreativen und untersttzenden Umfeld arbeiten mchtest passt du wie die Faust aufs Auge zu uns.Trau dich und spring ins warme Wasser und starte mit deiner Karriere endlich durch.AufgabenAnforderungsanalyse fr neue Softwareprojekte durchfhrenKunden bei der Definition und Spezifikation von Anforderungen untersttzen(Technische) Lsungen konzipieren und prsentieren, um die Kundenbedrfnisse zu erfllenEng mit dem Entwicklungsteam zusammenarbeiten, um die Umsetzung der Anforderungen sicherzustellenKundensupport bei technischen Fragen und ProblemenQualifikationDu besitzt Kenntnisse in der Softwareentwicklung und hast bereits Erfahrung als IT-Consultant, Requirements Engineer oder Software-\/Kundenberater gesammeltDu bist kommunikationsstark und kannst technische Sachverhalte verstndlich erklrenDu hast ein ausgeprgtes Verstndnis fr die Bedrfnisse und Anforderungen der Kunden und kannst diese in technische Lsungen bersetzenDu bringst eine hohe Kundenorientierung mit und arbeitest gerne im TeamBenefitsGenau wie wir sind unsere Benefits dynamisch und kreativ, so wie viel knnen wir sagen: Mobiles & flexibles Arbeiten, regelmige Mitarbeiter Events und Feel Good im Arbeitsalltag sowie im Bro und Zuhause sind fr uns selbstverstndlich.Mchtest du in einem jungen dynamischen Unternehmen arbeiten, das sich auf die Digitalisierung unserer Verwaltungen also auch unser eigenes Leben spezialisiert hat? Bewirb dich jetzt als bei KOMMSOFT!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kommsoft-rr-it-solutions-gmbh\/it-consultant-requirements-engineer-software-kundenberater-all-genders-krefeld-133380","tags":["Consulting","Engineering"],"job_types":[],"location":"Krefeld","created_at":1702889342000},{"slug":" 2800eur provision sales agent telefonischer kundenberater berlin ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2800€ + Provision Sales Agent\/Telefonischer Kundenberater m\/w\/d","description":"Mchten Sie fr ein internationales Unternehmen arbeiten, das einer der marktfhrenden unabhngigen Dienstleister im Bereich von Tankkartenlsungen in Deutschland ist?Gesucht werden Telefonische Kundenberater, Sales Agent, Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d im Outbound, Kundenservice.Das Team in Berlin wird erweitert und Sie knnen als Telefonischer Kundenberater (m\/w\/d) fr den Vertriebsinnendienst ttig sein.Als Telefonische Kundenberater, Sales Agent, Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d erwartet Sie:AufgabenKundenberatung  Inbound- und Outbound- Telefonie (B2B)Angebotserstellung und BearbeitungBestandskundenbetreuung (B2B)E-Mail- und Faxbearbeitung QualifikationFhigkeit im Team zu arbeitenFreundliches AuftretenErfahrung im Vertrieb  idealerweise im TelefonvertriebLoyalittEffiziente, schnelle ArbeitsweiseKenntnisse bei PC-Anwendungen und Office-Programmenverhandlungssichere DeutschkenntnisseBenefitsFixgehalt (verhandelbar, mind. 2300 - 2800 ) plus ungedeckelten Bonus (im Schnitt 300-500 im ersten Quartal), bei Erreichung von Quartalszielen steigt das Grundgehalt und die BonuszahlungenAngenehmes Bro in 10117 Berlin (Nhe S-Bahnhof Friedrichstrae)Arbeitszeiten von Montag bis Donnerstag 08:30  16:45 Uhr am Freitag bis 15 Uhr (37,5 Stunden)Entwicklungsmglichkeiten in einem internationalen KonzernBewerbungHaben wir Ihr Interesse geweckt? Wir freuen uns auf Ihre Bewerbungsunterlagen. Gerne per Mail oder per WhatsApp.Ivonne WreschW & W Human Resources01523\/3605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2800eur-provision-sales-agent-telefonischer-kundenberater-berlin-360093","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702889342000},{"slug":"2500eur mitarbeiter terminierung berlin ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Mitarbeiter m\/w\/d Terminierung","description":"Mchten Sie fr ein internationales Unternehmen arbeiten, das einer der marktfhrenden unabhngigen Dienstleister im Bereich von Tankkartenlsungen in Deutschland ist?Gesucht werden Telefonische Kundenberater, Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d im Bereich Bestandskunden.Als Telefonische Kundenbetreuer, Call Center Agent, Telefonischer Kundenberater m\/w\/d erwartet Sie:AufgabenKundenzufriedenheitsbefragungBedarfsermittlungTerminierung fr das Sales TeamQualittsmanagementErweiterung des eigenen Portfolios durch Kundenbindung und KundenempfehlungenQualifikationIdealerweise bereits erste oder mehrjhrige Erfahrung in der Bestandskundenbetreuung und in der TelefonieKommunikationsstrke, Begeisterungs- und Teamfhigkeitgute Selbstorganisationgute MS-Office-KenntnisseVerhandlungssichere DeutschkenntnisseBenefits2500 (verhandelbar)Angenehmes Bro in 10117 Berlin (Nhe S-Bahnhof Friedrichstrae)Arbeitszeiten von Montag bis Donnerstag 08:30  16:45 Uhr am Freitag bis 15 Uhr (37,5 Stunden)Entwicklungsmglichkeiten in einem internationalen KonzernBewerbungHaben wir Ihr Interesse geweckt? Wir freuen uns auf Ihre Bewerbungsunterlagen. Gerne per Mail oder per WhatsApp.Ivonne WreschW & W Human Resources01523\/3605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-mitarbeiter-terminierung-berlin-46842","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702889342000},{"slug":" 2600eur 500eur bonus telefonische kundenbetreuer berlin ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2600€ + 500€ Bonus Telefonische Kundenbetreuer m\/w\/d","description":"Mchte Sie fr ein internationales Unternehmen arbeiten, das zu den marktfhrenden unabhngigen Dienstleistern im Bereich von Tankkartenlsungen in Deutschland gehrt?Das Team in Berlin wird erweitert und gesucht werden Kundenbetreuer\/Sachbearbeiter m\/w\/d im Inbound.AufgabenKundenbetreuungAngebotserstellung und BearbeitungFallabschlieende Bearbeitung aller KundenanfragenE-Mail- und FaxbearbeitungSchnittstelle zu anderen AbteilungenQualifikationFhigkeit im Team zu arbeitenFreundliches AuftretenAngenehme StimmeDeutschkenntnisse in Wort und Schrift auf muttersprachlichem NiveauEffiziente, schnelle ArbeitsweiseSpa am TelefonierenMS-Office Kenntnisse insbesondere Exvelgute Englischkenntnisse fr die interne KommunikationBenefits2300  2600  brutto (verhandelbar  Berufserfahrung) zzgl. 500 BonusAngenehmes BroNhe FriedrichstraeArbeitszeiten von Mo-Do 08:30  17 Uhr, Freitag bis 15 Uhr  Vollzeit 37,5 StundenEntwicklungsmglichkeiten in einem internationalen KonzernBewerbung:Wir freuen uns auf Ihre Bewerbung per Mail oder WhatsAppIvonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-428738","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702889342000},{"slug":"2500eur telefonischer kundenberater zahnzusatzversicherung hamburg ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Telefonischer Kundenberater m\/w\/d  Zahnzusatzversicherung","description":"Zur Untersttzung des Kundenmangement-Teams im Bereich Zahnzusatzversicherung werden Call Center Agent, Telefonische Kundenbetreuer m\/w\/d im Kundenservice in Hamburg gesucht.Als Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d erwartet Sie:AufgabenBeratung von Bestands- und Neukunden zum Thema Zahnzusatzversicherungen per Telefon und E-Mail (keine Kaltakquise)Erstellung von individuellen Angeboten fr den Zahnzusatz-BereichErfassung und Pflege von Kundendaten sowie Verantwortung von AntrgenSchnittstellenfunktion zwischen Kunden und VersicherungsgesellschaftenUntersttzung bei der permanenten Weiterentwicklung des VergleichsangebotsQualifikationKaufmnnische Ausbildung (z.B. Brokaufmann\/-kauffrau oder Versicherungsfachmann-\/frau) oder auch gerne VersicherungsquereinsteigerErsteErfahrung in der KundenberatungHohe Kundenorientierung sowie sicheres und freundliches Auftreten am TelefonEigenverantwortliche, gewissenhafte und strukturierte ArbeitsweiseHands-on-Mentalitt und Umsetzungsstrke mit DetailorientierungBegeisterung fr digitale GeschftsmodelleBenefitsunbefristeter ArbeitsvertragArbeitszeiten von Montag bis Freitag zwischen 8-20 UhrGehalt 30-32 kIntensive und individuelle EinarbeitungFachgerechte Qualifikation im KrankenversicherungsbereichEigenverantwortliches Arbeiten in einem dynamischen ArbeitsumfeldZentraler Standort mit ausgezeichneter Verkehrsanbindung und Blick auf die AlsterZuschuss zur HVV ProfiCardIndividuelle Entwicklungs- und WeiterbildungsmglichkeitenFreundschaftliches Arbeitsumfeld mit Duz-Kultur,gemeinsamen Mittagspausen und vielen TeameventsHaben wir Ihr Interesse geweckt? Dann freuen wir uns auf Ihre Bewerbung. Gerne knnen sie sich per Mail oder WhatsApp bewerben.Bei Fragen steht Ihnen Ivonne Wresch gerne zur Verfgung.0152\/33605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-204237","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702889342000},{"slug":"sachbearbeiter versicherung vz und tz moglich mo fr hamburg ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Sachbearbeiter m\/w\/d Versicherung VZ und TZ möglich. Mo-Fr","description":"Wollen Sie fr ein fhrendes Online-Vergleichsportal arbeiten? Wir suchen zur Untersttzung des Backoffice-Teams im Bereich Versicherungen Mitarbeiter\/Sachbearbeiter m\/w\/d.Wir freuen uns auf Ihre Bewerbung als Quereinsteiger m\/w\/d Sachbearbeitung Versicherungen in Voll- oder Teilzeit ab 16 Std.\/Woche.Aufgabeneigenstndige Prfung von VersicherungsantrgenUntersttzung bei telefonischen Anfragen der Bestandskunden (m\/w\/d)Kommunikation mit Versicherungsgesellschaften liegt in Schnittstelle zwischen Kundenberatern (m\/w\/d) und externen VersicherungsgesellschaftenQualifikationEine eigenstndige, zuverlssige und detailorientierte Arbeitsweise zeichnet Dich ausIdealerweise - erste Erfahrungen in der Sachbearbeitung o.. (ggf. durch Praktika oder Werkstudierendenttigkeiten) hohe Kundenorientierung sowie ein sicheres und freundliches Auftreten im telefonischen und schriftlichen KontaktBenefitsZentraler Arbeitsplatz - Home Office Tage mglichBroarbeitszeiten zwischen 9 und 17 Uhr 30000  p.a.mehr als 30 Tage Urlaub mglichqualifizierte EinarbeitungHaben wir Ihr Interesse geweckt? Dann freuen wir uns auf Ihre Bewerbung.Gerne per Mail oder per Whats App unter 0152\/33605774 (Lebenslauf reicht aus) Bei Fragen steht Ihnen Ivonne Wresch gerne zur Verfgung.Telefon 0152\/33605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/sachbearbeiter-versicherung-vz-und-tz-moglich-mo-fr-hamburg-314574","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702889342000},{"slug":"telefonischer kundenbetreuer 2pro woche home office schichtzulagen ab  uhr munster ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Telefonischer Kundenbetreuer m\/w\/d 2*pro Woche Home Office Schichtzulagen ab 18 Uhr","description":"Wollen Sie als Kundenbetreuer m\/w\/d fr ein Hotelvergleichsportal arbeiten?Als Kundenberater m\/w\/d erwartet Sie:AufgabenSie betreuen die Kunden bei Fragen und Problemen am Telefon oder per Mail und kmmern sich dabei professionell und freundlich um eine schnelle und zufriedenstellende LsungSie sind verantwortlich fr die fachliche Prfung und Bewertung von KundenanliegenSie stellen die zgige Abwicklung und den Abschluss der Kundenanfragen in enger Zusammenarbeit mit den nationalen und internationalen Partnern sicherSie haben stets ein offenes Ohr fr die Kunden und schaffen es, bei Rckfragen zu Buchungen  per Telefon und E-Mail  kulante Lsungen zur Zufriedenheit der Kunden zu findenGemeinsam mit dem Team wirken Sie an der internen Qualittssicherung mit, um eine fehlerfreie Bearbeitung sicherzustellenZur Weiterentwicklung der internen Prozesse, arbeiten Sie eng mit den Experten zusammenQualifikationBerufserfahrung im Dialogmarketing, in der Touristik \/ Hotelbranche (z.B. Reservierungsabteilung) oder im telefonischen KundenkontaktIdealerweise bringen Sie eine abgeschlossene Ausbildung im kaufmnnischen oder touristischen Bereich mitIn Beratungsgesprchen mit den Kunden zeichnen Sie sich durch ein freundliches, serises und lsungsorientiertes Auftreten aus  Sie bringt so schnell nichts aus der RuheSie sind ein echter Teamplayer (m\/w\/d), haben Spa am gemeinsamen Erfolg und bringen eigene Ideen einSchriftlich und mndlich berzeugen Sie mit verhandlungssicheren Deutschkenntnissen sowie mit sicheren EnglischkenntnissenVersierter Umgang mit den gngigen PC- und InternetanwendungenZeitliche Flexibilitt Randarbeitszeiten zwischen 8 und 22 Uhr abzudecken (Frh-\/Mittel-\/Sptschicht) sowie Bereitschaft zur Arbeit an Wochenenden und Feiertagen (5-Tage-Woche)Benefitsunbefristeter Arbeitsvertrag, eine attraktive Vergtung fr Wochenend-, Feiertags- und Sptschichten sowie jhrliche Prmien fr besondere Erfolge. Die bernahme von Verantwortung wird zustzlich honoriert (z.B. Wochenend-Schichtleitung). Eine bezuschusste betriebliche Altersvorsorge und viele weitere Vergnstigungen gibt es obendrauf.Der Schichtplan wird, unter der Bercksichtigung von Wnschen, mind. vier Wochen im Voraus erstellt. Gerarbeitet wird 3 Tage die Woche gemeinsam im Office  an den brigen 2 Tagen ist mobiles Arbeiten mglich (Home Office).Einen Laptop fr mobiles Arbeiten, zwei Bildschirme oder individuelles Equipment wie eine ergonomische Maus oder Noise-Cancelling-Kopfhrer? Kein Problem!Individuelle Frderung durch Fortbildungen sowie regelmige Feedbackgesprche. Durch ein starkes und nachhaltiges Wachstum werden langfristige Perspektiven in der Fach- und Fhrungslaufbahn geboten.Zentraler Standort direkt am Stadthafen. Dank Zuschuss zum Job-\/Deutschlandticket und Fahrrad-\/ eBike-Leasing kommen Sie klimaneutral und gnstig ins Bro.Kostenlose Getrnke, Msli und frisches Obst sorgen fr Energie. Mehrmals wchentlich gibt es ein kostenloses, abwechslungsreiches Mittagessen.Attraktives Sportprogramm durch einen Personaltrainer: Halten Sie sich fit durch Yoga, Rckenfit, Bootcamp-Training oder auch zwischendurch in der Bewegten Pause.Es herrscht ein kollegiales und freundschaftliches Umfeld. Bei regelmigen Office Partys, Teamevents und Sommer- und Weihnachtsfeier feiern wir zusammen.Haben wir ihr Interesse geweckt? Dann freuen wir uns auf ihre Bewerbung. Gerne auch per Whats App 015233605774Ivonne Wresch steht Ihnen gerne bei Fragen zur Verfgung. 01523\/3605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-429263","tags":["Customer Service"],"job_types":[],"location":"Münster","created_at":1702889342000},{"slug":"junior referent finance berlin ","company_name":"univativ GmbH","title":"(Junior) Referent (m\/w\/d) Finance","description":"Baldmglichst, bis zum 01.07.2024, mit Option auf Verlngerung | 40 Stunden pro Woche | Berlin | Finanzwesen | Berufseinsteiger, Berufserfahrener | 42000 bis 55000  im Jahr | Projekt-ID A202344832_2Sunivativ ist ein Projekt- und Personaldienstleister, der Studenten und Absolventen spannende Jobs bei renommierten Unternehmen bietet. Deine Karriere ist unsere Mission, denn Deine Entwicklung liegt uns am Herzen.Du hast Dein Studium im Bereich Wirtschaftswissenschaften oder Deine kaufmnnische Ausbildung erfolgreich abgeschlossen, bist kommunikativ und begeisterst Dich fr die Finanzbranche? Darber hinaus bist Du fit im Umgang mit SAP und verfgst ber ein hohes Ma an Verantwortungsbewusstsein? Dann suchen wir genau Dich als (Junior) Referent (m\/w\/d) im Finanzbereich.Unser namhafter Kunde aus dem Finanzsektor sucht zum nchstmglichen Zeitpunkt Verstrkung. Im Rahmen Deiner Ttigkeit bertst Du die einzelnen Fachbereiche hinsichtlich der Budgetplanung, generierst Reports und wickelst Rckstellungen ab. Wenn Du auf der Suche nach einer verantwortungsvollen und analytischen Aufgabe bist, dann erwartet Dich in diesem Bereich eine spannende Zukunft.AufgabenBeratung der Fachbereiche hinsichtlich der BudgetplanungDurchfhrung von ReportsAbwicklung von RckstellungenKontierung und Anlage von Auftrgen mittels SAPBerechnung von AbschreibungenQualifikationEin abgeschlossenes Studium im Bereich Wirtschaftswissenschaften oder BWL, eine abgeschlossene kaufmnnische Ausbildung oder vergleichbarErste Erfahrungen im Finanzbereich wnschenswertFundierte Kenntnisse im Umgang mit SAP FI\/COVerhandlungssichere Deutschkenntnisse in Wort und SchriftEin hohes Ma an Kommunikationsstrke sowie eine analytische und strukturierte ArbeitsweiseBenefitsEin Jahreslohn zwischen 42000  und 55000 Die Mglichkeit 50% auch Remote von zu Hause zu arbeitenVielfltige Weiterbildungsmglichkeiten in unserer e-academyCorporate Shopping und Rabatte fr ausgewhlte FitnessstudiosBis zu 2.000  Prmie fr Deine Weiterempfehlung an FreundeWir konnten Dein Interesse wecken? Klasse!Wir freuen uns auf Deine BewerbungFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/univativ-gmbh\/junior-referent-finance-berlin-113584","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702885744000},{"slug":"hotel operations manager hamburg ","company_name":"numa","title":"Hotel Operations Manager - Hamburg (m\/f\/d)","description":"ABOUT NUMAHey! We're numa. We're a dynamic, diverse hospitality brand that's offering uniquely designed apartments for the modern traveler. We specialize in the beauty of convenience and the delight of a design, with a totally digital guest experience and properties designed with intention.Numa properties are located in the most exciting and vibrant neighbourhoods across Europe. We're not just disrupting the hospitality industry for our guestsbehind the curtain, we're shaking up the way hotels operate. We've built a proprietary technology and data platform that makes running a hospitality operation more efficient than ever. We offer consistent quality and an unmatched guest experience.ABOUT THE ROLE:In this mission critical role you and your team will be representing numa in the actual hospitality units, making sure every guest feels welcomed and taken care of, you will be in charge of ensuring the best service experience possible. You Will Focus On:Ensure numa guest experience standards are consistently executedEnsure the day to day operation of the allocated hospitality units within the numa standards and legal frameworkManage relationship with third-party service providers and vendors and ensure service level agreements are in place and regular quality control inspections are conductedEnsure a proactive maintenance and upkeeping program to protect and safeguard the physical conditions of the allocated unitsContribute actively to develop and deliver the numa brand and product on propertyBe responsible for managing conversion and cost levels though the implementation of PAR levels and proactive business planningEnsure that all local legal requirements, permits and operational backup systems are constantly maintainedABOUT YOUProven track record of hotel operations preferably from a housekeeping or front office backgroundFinancial understanding of cost control procedures and inventory managementFirst leadership experience in managing small teams and external partnersGood understanding of respective local market and business fluctuationsAbility to work under pressure, well organized and hard workingAbility to multitask and keep an overview in a fast paced work environmentVery good English and German language skills are requiredABOUT OUR OFFERJoin an agile work environment with flat hierarchies where your ideas make an impact from the very beginningBuild your own success story based on what you do well and how you want to growElevate your physical and mental wellness with our monthly benefit allowancesGet to know your internationally diverse team during our events and retreatsSpend a free night at your nearest numa stay upon starting and enjoy a 30% employee discount on personal stays in the coolest neighbourhoods in Europenuma values the diversity of the people it hires and serves. Diversity at our company means fostering a workplace in which individual differences are recognised, appreciated, respected and responded to in ways that fully develop and utilise each person's talents and strengths. We therefore welcome applications from people of all races, ethnicities, disability statuses, ages, religions, gender identities, and sexual orientations.For more information on the processing of your personal data, please see our Privacy Notice.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/numa\/hotel-operations-manager-hamburg-272515","tags":[],"job_types":[],"location":"Hamburg, Hamburg, Germany","created_at":1702885513000},{"slug":"produktionsplaner munich ","company_name":"Isar Aerospace Technologies GmbH","title":"Produktionsplaner (m\/w\/d)","description":"Deine MissionZu deinen Zustndigkeiten gehren unter anderem die folgenden Aufgaben:Planung und Priorisierung von Bauteilen \/ Baugruppenberwachung und Sicherstellung der termingerechten FertigungErstellen von Arbeitsplnen und ArbeitsablufenAufbereitung und Erstellung projektbezogener DokumenteKontinuierliche Verbesserung der ArbeitsablufeUntersttzung der Abteilungen, um die Einhaltung der Fristen zu gewhrleistenSchnittstellenarbeit zwischen Projektleitung, Konstruktion, Fertigung und MontageWas du mitbringstMaster oder Bachelor Abschluss in Maschinenbau, oder vergleichbareErfahrung in der Arbeitsvorbereitung\/ProduktionsplanungErfahrung im Umgang mit ERP und MES SystemenErfahrung mit Excel (VBA, Pivot)Technisches Verstndnis fr verschiedene Abteilungen wie CNC und Additive ManufacturingVerhandlungssichere Deutsch-, und EnglischkenntnisseWarum du bei uns durchstarten solltest30 Tage UrlaubBezuschusstes MittagessenIndividuelles WeiterbildungsbudgetVirtuelle UnternehmensanteileBezuschusstes Fitnessstudio-Mitgliedschaft (Qualitrain)Betriebliche AltersvorsorgeWir bieten auch:Mietkleidung mit WaschserviceFlexible ArbeitszeitenFreie Snacks und ObstFreie Getrnke und KaffeePausenbereich mit komplett ausgestatteter KcheParkpltze direkt vor dem HausRegelmige bezuschusste TeameventsPersnliches und Team-BonussystemFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isar-aerospace-technologies-gmbh\/produktionsplaner-munich-112443","tags":[],"job_types":[],"location":"Munich, Bavaria, Germany","created_at":1702885513000},{"slug":"quality inspector munich ","company_name":"Isar Aerospace Technologies GmbH","title":"Quality Inspector (m\/w\/d)","description":"Deine MissionDein Ttigkeitsfeld beinhaltet folgende Aufgaben:Prfung von internen Erzeugnissen und die unserer Zulieferer mittels Sicht und Maprfung gem Zeichnung oder SpezifikationBeurteilung von Bauteilen auf interne QualittsanforderungenDokumentieren und Abarbeiten von Auftrgen im SystemSelbststndiges Erstellen und Ausfhren von einfachen Messprogrammen an Messgerten (u.a. Faro-Arm, Keyence)Durchfhrung von Material- und MaterialzeugnisprfungMithilfe bei der kontinuierlichen Prozessoptimierung von ArbeitsablufenSicherstellen von Ordnung und Sauberkeit am ArbeitsplatzKommunikation der Prfergebnisse internAnlage und Ausgabe von neuen MessmittelnWas du mitbringstErfolgreich abgeschlossene technische Berufsausbildung in einem kunststoff- oder metallverarbeitendem Gebiet oder vergleichbarErste Berufserfahrung in der Qualittsprfung wnschenswertGute Kenntnisse im Lesen und Interpretieren von technischen Zeichnungen, sowie ein gutes generelles technisches VerstndnisGute Kenntnisse im Messen mit manuellen MessmittelnSehr hohes QualittsbewusstseinBelastbarkeit, Flexibilitt und TeamfhigkeitHohe Motivation komplexe Herausforderungen anzunehmenGute Deutschkenntnisse erforderlich, Englischkenntnisse von VorteilWarum du bei uns durchstarten solltest30 Tage UrlaubBezuschusstes MittagessenIndividuelles WeiterbildungsbudgetVirtuelle UnternehmensanteileBezuschusstes Fitnessstudio-Mitgliedschaft (Qualitrain)Betriebliche AltersvorsorgeWir bieten auch:Mietkleidung mit WaschserviceFlexible ArbeitszeitenFreie Snacks und ObstFreie Getrnke und KaffeePausenbereich mit komplett ausgestatteter KcheParkpltze direkt vor dem HausRegelmige bezuschusste TeameventsPersnliches und Team-BonussystemWer wir sindIsar Aerospace ist Vorreiter der New Space Industrie mit dem Ziel einen besseren, schnelleren und kostengnstigeren Zugang zum Weltraum zu ermglichen.Unsere Mission ist es, zur Demokratisierung des Weltraums beizutragen, um das Leben auf der Erde heute und fr zuknftige Generationen zu verbessern.Wir sind ein schnell wachsendes Unternehmen mit dem Ziel, nachhaltige und umweltfreundliche Startmglichkeiten fr kleine und mittlere Satelliten und Konstellationen in die niedrige Erdumlaufbahn zu liefern. Das Unternehmen wird von weltweit fhrenden Technologieinvestoren mit starkem Engagement und groer Untersttzung privat finanziert.Unser Team besteht aus engagierten und talentierten Mitarbeitern mit Leidenschaft fr Innovationen im Weltraum. Wir bauen revolutionre Raketen, die die Raumfahrtindustrie nachhaltig verndern werden.Mchten Du mehr ber uns erfahren?Dann besuchewww.isaraerospace.comNote: Due to high volume of applications, we cannot get back to all candidates. If you have not heard from us within 2-4 weeks, please consider that your application has been unsuccessful for the current openings. However, in line with our GDPR policy, we will keep your details and will let you know if\/when a suitable position comes up.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/isar-aerospace-technologies-gmbh\/quality-inspector-munich-407761","tags":[],"job_types":[],"location":"Munich, Bavaria, Germany","created_at":1702885513000},{"slug":"team lead workplace berlin ","company_name":"Parloa","title":"Team Lead Workplace (f\/m\/d)*","description":"YOUR MISSION:As the Team Lead Workplace (f\/m\/d*), your mission is to create a thriving work environment, ensuring the success of the organization and the satisfaction and growth of its employees. You will oversee and coordinate various aspects of the workplace, contributing to the smooth and effective operation of the Berlin office, with a global perspective in mind. Your ultimate goal is to shape a positive and engaging experience for everyone in the workplace.IN THIS ROLE YOU WILL:Guard Parloa's culture by maintaining a welcoming workplace, enhancing our operational plans and workflows, and creating a cohesive workplace experience across all our offices.Collaborate with various stakeholders at Parloa, both external and internal, to ensure an excellent employee experience.Plan and execute various team-building activities in collaboration with your team, to promote employee engagement and satisfaction.Keep Parloa compliant in all things workplace, to ensure a safe and healthy work environment for all of us.Lead our amazing workplace team and ensure they are growing with Parloa by providing coaching, guidance, and development opportunities.Align the team's day-to-day work with the overall company goals, through OKR initiatives, projects, and the overall team vision creation and communication.Own our Workplace reporting, analyzing relevant data to make informed decisions.WHAT YOU BRING TO THE TABLE:Fluent in both German and English, with a knack for effective communication.Proven expertise in time, project, and event management.Resourceful and adaptable, thriving in navigating workplace challenges.Tech-savvy, with proficiency in g-cloud software and collaboration tools.Dedicated to delivering outstanding service to internal teams and employees.Adept at stakeholder management, building and nurturing positive relationships.Regular office attendance in our vibrant Berlin office.NICE TO HAVE:Basic understanding of budgeting and expense management.Familiarity with relevant employment laws and regulations.WHAT'S IN IT FOR YOU?Be part of a dynamic, driven team of +20 nationalities with flat hierarchies and collaborative company cultureAttractive compensation package with equity.Training and development budget which can be used for conferences and attending development courses to ensure continuous professional growth.Flexible working hours, 28 vacation days and workation opportunitiesRegular team events, game nights, and other social activitiesAnd last but not least: a beautiful office with flair in the heart of Berlin with all the conveniences, such as adjustable desks, social area, fresh fruits, cereals and drinks.Is something missing here? Reach out and let's talk about what else you need for your ideal next growth opportunity.Your recruiting process at Parloa:Recruiter video call  Meet your manager  Challenge Task  Expert interview(s)  Meeting the team  Founder interviewWhy Parloa?Join Parloa in revolutionizing customer communication with Artificial Intelligence! We're a leading Conversational AI platform collaborating with industry giants, both as partners and clients. Our mission is to create a comprehensive customer solution for businesses worldwide, and we're committed to achieving this by having people and AI join forces.We were founded in 2017 in Berlin, and since then we've become one of the most innovative SaaS companies in the market. By leveraging our cutting-edge conversational AI platform, we are enabling businesses to have meaningful conversations with their customers. We're committed to achieving this by combining top-notch technical engineering with innovative leadership and the belief that every single team member can have a massive impact on our future.By joining Parloa, you'll have the opportunity to be part of a dynamic and innovative team that's revolutionizing an entire industry. We're passionate about growing together and creating opportunities for personal and professional development. With our recent 20 million Series A investment, we're expanding globally and looking for talented individuals to join us on this exciting journey.Do you have questions about Parloa, the role, or our team before you apply? Please feel free to get in touch with our .Parloa is committed to upholding the highest data protection standards for our clients' and employees' data. All our employees are instrumental in ensuring the utmost care, GDPR, and ISO compliance, including ISO 27001, in handling sensitive information.* We provide equal opportunities to all qualified applicants regardless race, gender, sexual orientation, age, religion, national origin, disability status, socioeconomic background and other characteristics.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parloa\/team-lead-workplace-berlin-313842","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702885513000},{"slug":"senior hr operations manager cologne ","company_name":"SoSafe GmbH","title":"Senior HR Operations Manager","description":"EinleitungDu brennst fr state-of-the-art HR Organisationen? Dich zeichnet ein serviceorientiertes Mindset aus? Du bist bist kontaktfreudig und hast Lust auf ein dynamisches Umfeld mit einem hochmotivierten Team?Bei SoSafe hast du die Chance, den aufregenden Weg vom Startup zur fhrenden Cyber-Security Software in Europa aktiv mitzugestalten und untersttzt dabei, das Internet etwas sicherer zu machen.Deine AufgabenGemeinsam mit Deinen Sparring Partner:innen im HR-Team bist du die erste Anlaufstelle bei allen Anliegen im Personalmanagement (u.a. Contract, Compliance, Guidelines, Reports, Benefits) - sowohl fr die Mitarbeiter in Deutschland als auch in unseren internationalen Gesellschaften oder die, die ber Employer of Record eingestellt sind. Du entwickelst und setzt reibungslose und skalierbare Prozesse um - vom Onboarding bis hin zum Offboarding unserer Mitarbeitenden.Du bist fr die Entwicklung und Kommunikation von neuen Guidelines, Policies und Prozessen verantwortlich.Du bernimmst Ownership fr eigene Projekte in Deinem Bereich und navigierst diese selbststndig bis zum Ziel (z.B. Einfhrung vom neuen Employer of Record, Auswahl und Einfhrung vom neuen HRIS)Du stellest einen reibungslosen Wissenstransfer & die Dokumentation im HR-Team sicherDu bist Ansprechpartner:in fr arbeitsrechtliche ThemenDu arbeitest eng mit internen (Payroll, HRBP, Talent Acquision Teams etc.) und externen Partnern (Anwlte, Employers of Record, Relocation Agency etc.)Dein ProfilDu verfgst bermindestens 5 Jahre Arbeitserfahrung im Deutschen als auch internationalem Personalmanagement Du hast ein abgeschlossenes Studium in Wirtschafts-\/Sozialwissenschaften, Rechtswissenschaften, Psychologie oder eine vergleichbare Qualifikation mit HR-BezugDu weit wie man skalierbare und effiziente Prozesse in einem schnell wachsenden und internationalen Unternehmen einfhrt. Deine positive Can do\"- & Service-Mentalitt kombiniert mit einer gewissenhaften, strukturierten Arbeitsweise lassen Dich im agilen Arbeitsumfeld so richtig aufblhenDir bereitet es Freude, eigenstndig zu arbeiten, Du hast aber genauso groen Spa daran, dich im Team auszutauschen.Du beherrschst Deutsch und Englisch flieend in Wort und SchriftWarum wir?Eigenverantwortliches Arbeiten im Team und steile Entwicklungsmglichkeiten in einem stark wachsenden Unternehmen im Bereich Cyber-Security \/ IT-Sicherheit 33 Tage Urlaub Maximale Flexibilitt: Arbeite von deinem Home-Office ausMobility Package (subventioniertes Fahrrad oder PNV-Zuschuss)Betriebliche AltersvorsorgeOption auf einen KiGa Platz durch unsere Kooperation SoSafe x FRBEL\"Jede Menge wchentliche (virtuelle und physische) Networking-Formate wie \"Team Bootcamp\", Coffee Chat Roulette und Tech Talksber 20 Communitys, die unsere Safeys zusammenbringen und fr vertrauensvolle Beziehungen sorgen. Wir lernen voneinander und haben einen echten Einfluss darauf, wie wir unseren Arbeitsplatz gestalten wollen ber unsMach mit uns gemeinsam die digitale Welt ein Stckchen sicherer! Als eines der am schnellsten wachsenden Security Awareness Scale-Ups weltweit, stellen den Menschen in den Mittelpunkt  und definieren mit unserem lernpsychologischen Ansatz den Status quo im Bereich digitale Sicherheit komplett neu.Mit starkem VC-Funding im Rcken sind wir auf der Suche nach weiteren motivierten Teamplayern, die uns bei unserer ambitionierten Mission und internationalen Expansion untersttzen. Bei SoSafe bernimmst du Verantwortung fr deine Arbeit und dein Wachstum und boostest deine Karriere in das nchste Level!Wenn du etwas bewegen mchtest, dir ein aufgeschlossenes Umfeld, das Wert auf Vielfalt und Gemeinschaft legt, wichtig ist und du mit deinem Tun eine Sinnhaftigkeit verknpfen mchtest, dann knnte SoSafe genau der richtige Arbeitsplatz fr dich sein!Bist du unser*e nchste*r Cyber Security Held*in?Werde Teil unserer Erfolgsgeschichte und bewirb dich jetzt!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sosafe-gmbh\/senior-hr-operations-manager-cologne-386645","tags":[],"job_types":[],"location":"Cologne, North Rhine-Westphalia, Germany","created_at":1702885513000},{"slug":"senior hr operations manager berlin ","company_name":"SoSafe GmbH","title":"Senior HR Operations Manager","description":"EinleitungDu brennst fr state-of-the-art HR Organisationen? Dich zeichnet ein serviceorientiertes Mindset aus? Du bist bist kontaktfreudig und hast Lust auf ein dynamisches Umfeld mit einem hochmotivierten Team?Bei SoSafe hast du die Chance, den aufregenden Weg vom Startup zur fhrenden Cyber-Security Software in Europa aktiv mitzugestalten und untersttzt dabei, das Internet etwas sicherer zu machen.Deine AufgabenGemeinsam mit Deinen Sparring Partner:innen im HR-Team bist du die erste Anlaufstelle bei allen Anliegen im Personalmanagement (u.a. Contract, Compliance, Guidelines, Reports, Benefits) - sowohl fr die Mitarbeiter in Deutschland als auch in unseren internationalen Gesellschaften oder die, die ber Employer of Record eingestellt sind. Du entwickelst und setzt reibungslose und skalierbare Prozesse um - vom Onboarding bis hin zum Offboarding unserer Mitarbeitenden.Du bist fr die Entwicklung und Kommunikation von neuen Guidelines, Policies und Prozessen verantwortlich.Du bernimmst Ownership fr eigene Projekte in Deinem Bereich und navigierst diese selbststndig bis zum Ziel (z.B. Einfhrung vom neuen Employer of Record, Auswahl und Einfhrung vom neuen HRIS)Du stellest einen reibungslosen Wissenstransfer & die Dokumentation im HR-Team sicherDu bist Ansprechpartner:in fr arbeitsrechtliche ThemenDu arbeitest eng mit internen (Payroll, HRBP, Talent Acquision Teams etc.) und externen Partnern (Anwlte, Employers of Record, Relocation Agency etc.)Dein ProfilDu verfgst bermindestens 5 Jahre Arbeitserfahrung im Deutschen als auch internationalem Personalmanagement Du hast ein abgeschlossenes Studium in Wirtschafts-\/Sozialwissenschaften, Rechtswissenschaften, Psychologie oder eine vergleichbare Qualifikation mit HR-BezugDu weit wie man skalierbare und effiziente Prozesse in einem schnell wachsenden und internationalen Unternehmen einfhrt. Deine positive Can do\"- & Service-Mentalitt kombiniert mit einer gewissenhaften, strukturierten Arbeitsweise lassen Dich im agilen Arbeitsumfeld so richtig aufblhenDir bereitet es Freude, eigenstndig zu arbeiten, Du hast aber genauso groen Spa daran, dich im Team auszutauschen.Du beherrschst Deutsch und Englisch flieend in Wort und SchriftWarum wir?Eigenverantwortliches Arbeiten im Team und steile Entwicklungsmglichkeiten in einem stark wachsenden Unternehmen im Bereich Cyber-Security \/ IT-Sicherheit 33 Tage Urlaub Maximale Flexibilitt: Arbeite von deinem Home-Office ausMobility Package (subventioniertes Fahrrad oder PNV-Zuschuss)Betriebliche AltersvorsorgeOption auf einen KiGa Platz durch unsere Kooperation SoSafe x FRBEL\"Jede Menge wchentliche (virtuelle und physische) Networking-Formate wie \"Team Bootcamp\", Coffee Chat Roulette und Tech Talksber 20 Communitys, die unsere Safeys zusammenbringen und fr vertrauensvolle Beziehungen sorgen. Wir lernen voneinander und haben einen echten Einfluss darauf, wie wir unseren Arbeitsplatz gestalten wollen ber unsMach mit uns gemeinsam die digitale Welt ein Stckchen sicherer! Als eines der am schnellsten wachsenden Security Awareness Scale-Ups weltweit, stellen den Menschen in den Mittelpunkt  und definieren mit unserem lernpsychologischen Ansatz den Status quo im Bereich digitale Sicherheit komplett neu.Mit starkem VC-Funding im Rcken sind wir auf der Suche nach weiteren motivierten Teamplayern, die uns bei unserer ambitionierten Mission und internationalen Expansion untersttzen. Bei SoSafe bernimmst du Verantwortung fr deine Arbeit und dein Wachstum und boostest deine Karriere in das nchste Level!Wenn du etwas bewegen mchtest, dir ein aufgeschlossenes Umfeld, das Wert auf Vielfalt und Gemeinschaft legt, wichtig ist und du mit deinem Tun eine Sinnhaftigkeit verknpfen mchtest, dann knnte SoSafe genau der richtige Arbeitsplatz fr dich sein!Bist du unser*e nchste*r Cyber Security Held*in?Werde Teil unserer Erfolgsgeschichte und bewirb dich jetzt!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sosafe-gmbh\/senior-hr-operations-manager-berlin-292908","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702885513000},{"slug":"streaming backend engineer berlin ","company_name":"Zattoo ","title":"Streaming Backend Engineer","description":"YOUR FUTURE, ON DEMANDThe ideal blend of stability and flexibility. A genuinely human employer that cares for people and the planet. True autonomy to shape what comes next, for us and you. This is the perfect platform to take your career where you want.Back in 2005, we pioneered Europe's first TV streaming service. Today, we're the world's first certified climate neutral TV streaming provider. 3 million users across three countries. Over 230 colleagues of 47 nationalities. We're the grown-up start-up, helping to shape a better future since day one. That hasn't changed, even if the world has. We're friendly, international, inclusive  and our people say we're reliable and transparent, too. It's why they trust us and believe in what we do.THE ROLEBecome a part of the core team that maintains, extends and improves our streaming backend based on state of the art technology. Collaborate with a highly skilled and passionate team of multi-national engineers to build and operate our CDN services.THE STREAMING BACKEND TEAMOur team develops the software which drives our carrier-grade Content Delivery Network, covering the full processing chain for stream packaging, caching, encryption and delivery. We work closely with the Playback team - our counterpart to bring streaming features into applications, with the Ads Backend team - whose engineers focus on our solutions for server-side dynamic ad insertion, and the Video Backend team - which takes care of content ingest, transcoding and storage.WHAT YOU'LL DOImprove our HTTP streaming stack (DASH, HLS) and experiment with new technologiesSecure sensible content with fine-grained access control and DRM technologiesSolve the scalability challenges of a global Content Delivery NetworkImprove fault tolerance of our platformDevelop high-quality, clean and maintainable codeCollaborate with stakeholders and engineers across the companyWHAT YOU'LL BRINGExpert knowledge in C\/C++ and\/or Golang programmingExcellent understanding of operating system \/ Linux fundamentalsExpertise and ideas to build highly concurrent and distributed systemsExperience diagnosing and troubleshooting complex systems using test tools, network management systems and error reporting systemsDesire and abilities to learn new technologies and programming languagesComfortable working with remote colleagues and multidisciplinary teamsExperience in development and support of production systems with 24x7 operationsBonus:Experience with video streaming (HLS, MPEG-DASH...) technologiesExperience with distributed data stores such as Scylla or ClickHouseExperience with container management such as Kubernetes, Docker or LXCWHY JOIN US?At Zattoo, you're always on firm ground with real freedom to explore. You'll have the support and opportunity you need to go far, while you're helping us create a sustainable and entertainment-filled future for all.WHAT WE OFFER YOUReward: strong market competitive salaryRecharge: 30 days vacation plus public holidaysRegulate:trust based flexible working hours and the option for remote work worldwide for up to 8 weeks per year Plus:We'resharing:Free access to the best streaming experience on the marketWe're developing: Your own development budget, German classes and Zattoo all-companyhack daysWe're inclusive: 'Zattooies' are a fun, engaged, and diverse team made up of 47 nationalitiesWe're healthy: Health checks, team sports, organic fruit, vegan optionsand more!We're responsible: We are carbon neutral, an active employee Green team, discounted BVG tickets and free bike rentalsWe're sociable: Acalendar of events with fireside chats, lunches, in-house bar, BBQ's, monthly socials, summer party and an annual off-site eventZattoo enables our users to view indiscriminately and we reflect that in our team too. Regardless of race, gender, sexual orientation, religion, national origin, age, disability or any other characteristic protected by law we encourage everyone to apply and will give everyone equal consideration. We are an equal opportunities employer, join us and help build a diverse team dedicated to the future of TV.You can learn more about us at:https:\/\/zattoo.comFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/zattoo\/streaming-backend-engineer-berlin-407444","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702885513000},{"slug":"senior sales manager advertising berlin remote germany ","company_name":"Zattoo ","title":"Senior Sales Manager Advertising - Berlin \/ Remote (Germany)","description":"YOUR FUTURE, ON DEMANDThe ideal blend of stability and flexibility. A genuinely human employer that cares for people and the planet. True autonomy to shape what comes next, for us and you. This is the perfect platform to take your career where you want.Back in 2005, we pioneered Europe's first TV streaming service. Today, we're the world's first certified climate neutral TV streaming provider. 3 million users across three countries. Over 230 colleagues of 47 nationalities. We're the grown-up start-up, helping to shape a better future since day one. That hasn't changed, even if the world has. We're friendly, international, inclusive  and our people say we're reliable and transparent, too. It's why they trust us and believe in what we do.THE ROLEZattoo is creating the future of television, live and on demand. We build Apps for mobile, web and big screen on systems like Apple, Android, Samsung, Amazon Fire TV, Xbox One and many more.TV streaming is growing fast and the Zattoo platform is becoming increasingly popular for consumers but also for advertisers. With Zattoo's Connected TV and Dynamic Ad Substitution offerings advertisers discover real TV advertising alternatives. Due to the ever increasing demand we want to grow our Advertising Team in Germany.As a member of the Advertising Team you'll manage Zattoo's premium video and display inventory using direct and programmatic sales channels. In close cooperation with the Head of Sales Germany you'll work with media agencies and direct clients to actively develop Germany's advertising landscape. Besides the daily business you'll be involved in projects around pricing, process optimization, product development and Dynamic Ad Substitution.You will find Zattoo to be a comfortable place to work at with our flat hierarchies, pragmatic decision making, fast approval paths and willingness to take risks. As a member of a small advertising team, you will benefit from a high degree of independence, allowing you to bring and directly implement your own ideas. This position is especially interesting for candidates who enjoy directly seeing the impact of their work on a daily basis.WHAT YOU'LL DOEffectively present Zattoo as a highly relevant premium publisher and technological leader towards certain media agencies and direct clients in GermanyDevelop sustainable agency and advertiser relationships and provide regular updates of Zattoo's advertising portfolio, especially in terms of Connected TV and Dynamic Ad Substitution.Create convincing presentation decks and use them as one of your most important tools to pitch for new businessCreate meaningful reports and analysesContribute to the revenue goal Germany by being the first contact person for certain media agencies and direct clients and consulting them towards productive collaborationsTake responsibility for the complete sales cycle from acquisition through price negotiations to providing the complete campaign order package to the ad operations team to be able to set up the campaign in the ad serverRepresent Zattoo at business events and trade fairsCollaborate closely with the ad operations and product teamWHAT YOU'LL BRINGExperience in digital and\/or TV ad sales or digital mediaExperience in the programmatic advertising ecosystemPassionate about becoming the trusted advisor of media agencies and clients, listening to clients needs and creating and selling tailored offers aligned with internal prioritiesExisting network of digital media agencies and clientsStrong organizational and interpersonal written and verbal communication skillsKeen perception and analytical thinkingYou're always up-to-date with new trends in the digital video advertising landscape and in programmatic advertisingFluent in written and spoken German and EnglishBonus:Experience with CRM Tools like Salesforce andExperience with Google Ad ManagerWHY JOIN US?At Zattoo, you're always on firm ground with real freedom to explore. You'll have the support and opportunity you need to go far, while you're helping us create a sustainable and entertainment-filled future for all.WHAT WE OFFER YOUReward: strong market competitive salaryRecharge: 30 days vacation plus public holidaysRegulate: trust based flexible working hours and the option for remote work worldwide for up to 8 weeks per year Plus:We'resharing:Free access to the best streaming experience on the marketWe're developing: Your own development budget, German classes and Zattoo all-companyhack daysWe're inclusive: 'Zattooies' are a fun, engaged, and diverse team made up of 47 nationalitiesWe're healthy: Health checks, team sports, organic fruit, vegan optionsand more!We're responsible: We are carbon neutral, an active employee Green team, discounted BVG tickets and free bike rentalsWe're sociable: Acalendar of events with fireside chats, lunches, in-house bar, BBQ's, monthly socials, summer party and an annual off-site eventZattoo enables our users to view indiscriminately and we reflect that in our team too. Regardless of race, gender, sexual orientation, religion, national origin, age, disability or any other characteristic protected by law we encourage everyone to apply and will give everyone equal consideration. We are an equal opportunities employer, join us and help build a diverse team dedicated to the future of TV.You can learn more about us at:https:\/\/zattoo.comFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/zattoo\/senior-sales-manager-advertising-berlin-remote-germany-202579","tags":[],"job_types":[],"location":"Berlin, Berlin, Germany","created_at":1702885513000},{"slug":"senior customer success manager latam hamburg ","company_name":"Appinio ","title":"(Senior) Customer Success Manager - LatAm (m\/f\/d)","description":"Allow us to introduce ourselvesHello there! We're Appinio, the fastest (and coolest) market research platform. On a mission to make the world a little more fact-based, we help companies understand how consumers think and make better data-driven decisions.We started out in Hamburg back in 2014 but we're now humbled to call the world our playground, with over 200 employees spread across 25 cities (we're remote-first), 2000+ international clients and a panel reach of 7 million, globally.Want to be a part of the Appinio movement? Your mission as a (Senior) Customer Success ManagerAs Appinio continues to revolutionize and conquer the market research industry, we are dedicated to continuously delivering exceptional experiences to our clients. Our Customer Success Team plays a fundamental role in this mission and supports clients to fully leverage the power of our platform. As we continue to grow, we are seeking a talented (Senior) Customer Success Manager (m\/f\/d) based in LatAm to join our team.As a (Senior) Customer Success Manager, your role will be pivotal in establishing and nurturing robust client relationships, encouraging Appinio's platform utilization, and maximizing customer value. You'll have the unique opportunity to take charge of a major customer in the FMCG industry, while also working with additional clients to contribute to our Latam region's success. Collaboration is key, and you'll closely work with our Sales, Product, and Operations teams in Latin America, as well as our Global Customer Success team, to harmonize strategies and ensure a seamless customer journey. This position offers an exciting opportunity to be part of a dynamic and innovative team in a growing market.What you'll be doingServe as the primary point of contact for our key account in the FMCG industry in LatAmBuild and maintain strong relationships with key stakeholders within the client's organizationUnderstand the client's business goals and objectives and work to align our services with themProactively identify opportunities for account expansion and value-add servicesMonitor customer health, usage patterns, and satisfaction levelsCollaborate with the Product team to provide customer feedback and help shape product enhancementsYou will thrive in this role ifYou have a proven track record in managing large accounts, especially in the LatAm region, with a preference for experience within the FMCG industryYou have extensive experience in customer success, coupled with strong consultancy and technical savvyYou have demonstrated success in driving customer satisfaction and retentionYou have a background in the market research industryYou have commercial capabilities and a deep understanding of financial account managementYou have product knowledge and proficiency in using customer success toolsYou have data analysis and reporting skillsYou have excellent communication and interpersonal skillsYou have problem-solving and conflict resolution skillsYou have strategic thinking and account planning abilitiesYou are based in LatAmWhat's in it for you?Flexibility Policy- meaning there is no hard cap on the number of vacation daysUdemy L&D Platform-full access to 22,000+ courses and certifications to deepen your knowledge as your career progressesAll the hardware you need andyour own MacBookThis post not only outlines our ideal candidate but also serves as an inspiration for what this role can evolve into. Even if you consider yourself an 80% fit but have a genuine passion for this position, we encourage you to apply. We're eager to hear from individuals who share our enthusiasm.Appinio is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.Learn more about us:appinio.com LinkedIn Xing Kununu InstagramFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/appinio\/senior-customer-success-manager-latam-hamburg-402974","tags":[],"job_types":[],"location":"Hamburg, Hamburg, Germany","created_at":1702885512000},{"slug":"kaufmannischer mitarbeiter lohnabrechnung berlin ","company_name":"Workstation Customer Care","title":"Kaufmännischer Mitarbeiter (m\/w\/d) Lohnabrechnung","description":"Fr unseren Kunden in Berlin-Mitte suchen wir Mitarbeiter (m\/w\/d) mit Erfahrung in der Lohnabrechnung.Ihr Aufgabengebiet: Untersttzung der Kollegen bei der Anwendung des Lohnabrechnungsprogramms Telefonische und schriftliche Auskunft zur Anwendung einzelner Programmmodule berwachung und Einpflegen von Gesetzesnderungen Allgemeiner Schriftverkehr und Versenden von InformationsmaterialSie berzeugen uns mit: Einer fundierten kaufmnnischen Ausbildung oder entsprechender Berufserfahrung Erfahrung im Bereich Lohnabrechnung, vorbereitende Lohnbuchhaltung Idealerweise Erfahrung mit Lohnabrechnungsprogramm Fortgeschrittene PC-Anwenderkenntnisse in MS-Office Einfache Englischkenntnisse Ausgeprgte Kommunikations- und Teamfhigkeit Strukturierte, selbststndige und gewissenhafte ArbeitsweiseWir bieten: Einen zukunftssicheren, attraktiven Arbeitsplatz berschaubare Teamgre mit kurzen Entscheidungswegen Intensive Einarbeitung zur idealen Vorbereitung auf Ihre Ttigkeiten Umfangreiche SozialleistungenWir freuen uns auf Ihre Bewerbung und auf ein erstes gemeinsames Gesprch.Wir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kaufmannischer-mitarbeiter-lohnabrechnung-berlin-194042","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702882142000},{"slug":"mitarbeiter rechnungserfassung berlin ","company_name":"Workstation Customer Care","title":"Mitarbeiter Rechnungserfassung (m\/w\/d)","description":"Wir suchen einen kaufmnnischen Mitarbeiter (m\/w\/d) fr die Verwaltung, Teilzeit 20 Stunden \/ Woche.Ihr Aufgabengebiet:Bearbeitung und Versand von VertragsunterlagenRechnungserfassungProjektaufgabenIhr Profil:Kaufmnnische AusbildungErste BerufserfahrungSichere MS-Office KenntnisseZuverlssigkeitSelbststndige ArbeitsweiseZeitliche Flexibilitt (8-17 Uhr, in 2 Schichten)Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-rechnungserfassung-berlin-20772","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702882142000},{"slug":"kundenberater tarifauskunft arabisch berlin ","company_name":"Workstation Customer Care","title":"Kundenberater Tarifauskunft Arabisch - m\/w\/d","description":"Fr die nachfolgende Stelle suchen wir Mitarbeiter (m\/w\/d) zur Festanstellung bei unserem Kunden. Als fhrender Anbieter von Kundenkontaktlsungen mit insgesamt 6.000 Mitarbeitern prsentiert sich unser Unternehmen auch in Deutschland als einer der Marktfhrer. Im Produktportfolio ist die gesamte Leistungspalette der Kundenbetreuung vereint und wird durch ein umfassendes IT- und Serviceangebot ergnzt. Mit ca. 1.000 Mitarbeitern in Berlin\/ Brandenburg ist es ber viele Jahre gelungen, durch Innovation, Kompetenz und Kundenorientierung die Stellung am Markt zu etablieren und auszubauen. Die Mitarbeiter sichern dabei durch eine hohe Serviceorientierung das Wachstum des Unternehmens. Wir suchen eine motivierte Persnlichkeit als Kundenbetreuer (m\/w\/d) eines internationalen MobilfunkunternehmensAufgaben:Tarifberatung fr Neu- und BestandskundenDurchfhrung von Rufnummer- bzw. KartentauschPrfung des Auftragsstatus bei Endgert und Ersatzkarte, zzgl. SendeverfolgungVersand von ErsatzkartenSperrung und Einrichtung von DienstenBeantwortung von RechnungsnachfragenAllgemeine Beratung zu Sonderdiensten (WAP, GPRS, UMTS)Allgemeine Beratung zu Endgerten und ZubehrAnschlieende Sach- und Nachbearbeitung der TelefonateAnforderungen:Berufserfahrung in kaufmnnischen Bereichengutes sprachliches Ausdrucksvermgen auf Deutsch UND Arabischgute PC-Kenntnisseserviceorientiertes AuftretenVerantwortungsbewusstsein und Engagementstrukturierte und zielorientierte Arbeitsweisezeitliche FlexibilittWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/kundenberater-tarifauskunft-arabisch-berlin-194337","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702882142000},{"slug":"mitarbeiter lohnabrechnung fur industrieunternehmen berlin ","company_name":"Workstation Customer Care","title":"Mitarbeiter Lohnabrechnung für Industrieunternehmen (m\/w\/d)","description":"Unser Auftraggeber sucht einen versierten Mitarbeiter (m\/w\/d) in der Lohnabrechnung.Bringen Sie mit, was es braucht:Erfahrung in der Durchfhrung der LohnabrechnungenErfahrung in der Abrechnung von gewerblichen Mitarbeiter notwendigSelbstndige und strukturierte Arbeitsweise sowie TeamplayerGute Anwenderkenntnisse im Umgang mit SAPFundierte Kenntnisse im Arbeits-, Lohnsteuer- und SozialversicherungsrechtWas werden Sie tun:Lohnabrechnung fr einen definierten MitarbeiterkreisAbrechnung von Zeitlohn sowie Akkord- und GruppenlohnMitarbeiterberatung zu Abrechnungsfragenberwachung der Zeitwirtschaftberprfung der Entgeltfortzahlung im KrankheitsfallBeratung von Mitarbeitern in lohnrelevanten FragestellungenAdministrative und organisatorische Ttigkeiten im TagesgeschftErstellung von Beitragsnachweisen, Lohnsteueranmeldungen und BescheinigungenWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/mitarbeiter-lohnabrechnung-fur-industrieunternehmen-berlin-50103","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702882142000},{"slug":"burokaufmann rechnungsprufung magdeburg ","company_name":"Workstation Customer Care","title":"Bürokaufmann (m\/w\/d) Rechnungsprüfung","description":"Fr unseren Auftraggeber suchen wir einen Brokaufmann (m\/w\/d) fr die Rechnungsprfung, u.a. fr folgende Aufgaben:Prfung der Eingangsrechnungen und Gutschriften auf sachliche und rechnerische RichtigkeitKlrung von Differenzen und Unklarheiten mit den entsprechenden internen Ansprechpartnernberwachung der ZahlungseingngeKlrung von Unstimmigkeiten und AbweichungenUntersttzung des administrativen TagesgeschftsFr diese Stelle als Brokauffrau (m\/w\/d) Rechnungsprfung wnschen wir uns von Ihnen:Abgeschlossene kaufmnnische Berufsausbildung oder vergleichbare Berufserfahrung, z.B. als Brokauffrau-\/mann (m\/w\/d) oder Buchhaltungsfachkraft (m\/w\/d).Gute PC KenntnisseStrukturierte und korrekte ArbeitsweiseTermintreue und VerlsslichkeitGute Kenntnisse der MS-Office-AnwendungenZahlenverstndnisErste Berufserfahrung in der Rechnungsprfung ist von Vorteil aber nicht BedingungWir bieten:Eine umfangreiche und vergtete EinarbeitungFestgehalt ohne variable AnteileEine abwechslungsreiche Ttigkeit in einem internationalen UnternehmenProfessionelle Strukturen inkl. BetriebsratInterne Weiterbildung und EntwicklungschancenGuter Zusammenhalt im Team und Spa bei der ArbeitWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-rechnungsprufung-magdeburg-324464","tags":["Business Operations"],"job_types":[],"location":"Magdeburg","created_at":1702882142000},{"slug":"burokaufmann okologischer tourismus homeoffice berlin ","company_name":"Workstation Customer Care","title":"Bürokaufmann Ökologischer Tourismus - Homeoffice (M\/W\/D)","description":"Diese Stelle kann zu 80% von zu Hause ausgefhrt werden - einmal die Woche mchte Sie das Unternehmen in den Brorumen begren, damit der Kontakt nicht verloren geht. Insofern sollten Sie nicht allzu weit vom Berliner Bezirk Spandau entfernt wohnen.Unser Auftraggeber ist ein Reiseveranstalter und hat sich auf nachhaltigen, kologisch wertvollen Tourismus spezialisiert. Hierzu betreibt unser Kunde ein Reiseportal, auf dem Urlauber sich interaktiv und schnell ber Reisegebiete, Anreisemodalitten und Preise informieren knnen. Nicht immer wird der potenzielle Kunde fndig und ruft die angegebene Hotline an - und erreicht dann Sie (m\/w\/d). Unser Kunde legt sehr viel Wert auf Qualitt der Beratung - insofern gibt es keine Zeitbegrenzungen fr Gesprche. Ziel Ihres Kontakts mit dem Kunden ist, dem Kunden genau das Urlaubserlebnis zu vermitteln, das er sucht.Ihre Aufgaben als Reiseberater (m\/w\/d):Sie sind erster Ansprechpartner fr Kunden, die eine Reise buchen mchtenSie gehen individuell auf jeden einzelnen Kunden ein und erfragen seine genauen VorstellungenSie beschreiben das Zielgebiet, selektieren nach Speisenangebot und Sternezahl, beraten zu kinderfreundlichen oder auch kinderfreien Hotels und bercksichtigen die Flugzeitenwnsche des KundenSie beraten den Kunden ausfhrlich und bieten Alternativangebote anUnsere Anforderungen:gutes sprachliches Ausdrucksvermgengute PC-Kenntnisseserviceorientiertes AuftretenVerantwortungsbewusstsein und Engagementstrukturierte und zielorientierte Arbeitsweisezeitliche FlexibilittberzeugungsfhigkeitWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-okologischer-tourismus-homeoffice-berlin-235952","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702882142000},{"slug":"neukundenbetreuung technik homeoffice potsdam ","company_name":"Workstation Customer Care","title":"Neukundenbetreuung Technik Homeoffice Potsdam m\/w\/d","description":"Unser Auftraggeber ist ein groer Internetanbieter, der sicher stellen mchte, dass seine Neukunden den bestmglichen Start mit dem neuen Vetrag haben. Hierzu gehrt, dass es keine technischen Hindernisse gibt und der Kunde (m\/w\/d) von der ersten Minute an alle Funktionen und Gerte nutzen kann. Allerdings hat nicht jeder Kunde das notwendige Verstndnis, z.B. einen Router zu installieren oder Applikationen aus dem Netz herunter zu laden. Hier kommen Sie (m\/w\/d) ins Spiel.Was werden Sie in dieser Position tun?Sie helfen Kunden, Endgerte in Betrieb zu nehmenSie untersttzen beim Download von SoftwareSie schalten Anwendungen zur Nutzung freiSie beauftragen den Versand von AustauschgertenSie fhren Leitungstests durchber Sie:Sie verstehen die Funktionsweise moderner technischer GerteSie knnen gut zuhren und sich in Probleme hineinversetzenSie sind hilfsbereit und geduldigSie knnen in Schichten arbeitenSie bleiben stets auf dem Laufenden, was technische Entwicklungen betrifftAlternativ kann die Ausbung der Stelle in den Bros unseres Auftraggebers stattfinden oder bei Ihnen zu Hause im Homeoffice. Die Einarbeitung erfolgt im Unternehmen am Standort. Damit Sie den Kontakt zum Unternehmen nicht verlieren, sollten Sie ca. einmal pro Woche im Unternehmen arbeiten.Wir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/neukundenbetreuung-technik-homeoffice-potsdam-397565","tags":["Customer Service"],"job_types":[],"location":"Potsdam","created_at":1702882142000},{"slug":"burokaufmann reklamationsbearbeitung berlin ","company_name":"Workstation Customer Care","title":"Bürokaufmann Reklamationsbearbeitung (m\/w\/d)","description":"Wir bieten Ihnen (m\/w\/d) bei der Arbeitsplatzsuche spannende Kunden, interessante und vielfltige Entwicklungsmglichkeiten sowie ein sehr gutes Netzwerk aufgrund unsere langjhrigen Erfahrung.Fr verschiedene Kunden suchen wir langfristige Mitarbeiter (m\/w\/d) in Teilzeit.Unsere Kunden arbeiten im Bereich Onlinehandel, Tourismus, Onlinevideothek und verschiedenen anderen Branchen.Es erwartet Sie eine intensive und bezahlte Einarbeitungs- \/ Schulungszeit, fachliches Coaching sowie gute und spannende Entwicklungsmglichkeiten.Ihre Aufgaben:Bestandskundenbetreuung: Aufnahme des Kundenanliegens und fallabschlieende SachbearbeitungBestellannahme und Produktberatung zu den entsprechenden KundenwnschenIdentifizierung und Analyse des KundenwunschesBearbeitung der AuftragsabwicklungAnlage und Bearbeitung von KundenstammdatenWas Sie mitbringen:Berufserfahrung in aus einem serviceorientierten ArbeitsumfeldSehr gute Kommunikationsfhigkeiten und Spa am Umgang mit Kunden per Mail und TelefonWir bieten Ihnen:Arbeitnehmerberlassung als Alternative zum Kennenlernen des Kundenunternehmens fr 3 Monate mit bernahmeIntensive Einarbeitung \/ bezahlte SchulungGute EntwicklungsmglichkeitenHervorragende MitarbeiterbetreuungWir freuen uns auf Ihre Bewerbung und darauf, Sie bei der Suche nach dem passenden Job untersttzen zu knnen!Wir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-reklamationsbearbeitung-berlin-101272","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702882142000},{"slug":"junior bankkaufmann im homeoffice berlin ","company_name":"Workstation Customer Care","title":"Junior Bankkaufmann im Homeoffice (m\/w\/d)","description":"Sie haben einen kaufmnnisch geprgten Werdegang oder verfgen ber kaufmnnische Grundlagen und sind interessiert im Segment der Bankdienstleistungen einzusteigen? Dann ist die Position des Servicemitarbeiters (m\/w\/d) im Dienstleistungscenter (Inbound) genau das Richtige fr Sie und der perfekte erste Schritt in die Finanzwelt! Diese Einstiegsposition (Junior) im Bankbereich kann bundesweit aus dem Homeoffice ausgebt werden.Es kommen folgende Aufgaben auf Sie zu:telefonische Kundenberatung im Inbound im Zusammenhang mit allen Produkten und Services der Kreditinstitute, z.B. Telefonbanking (Zahlungsverkehr), Bausparen, Anfragen zu GirokontenStammdatenkontrolle \/ Pflege der DokumentendetailsEigenstndiges Durchfhren der Folgearbeiten, wie z.B. das Reporting und Fhren der StatistikDas bringen Sie mit:kaufmnnische Ausbildung (m\/w\/d) oder Berufserfahrung in einem kaufmnnischen Beruf (m\/w\/d)erste Berufserfahrung bei einem Finanzdienstleister sind vorteilhaft, aber nicht zwingendhohe Kommunikationsfhigkeithohes Ma an Kunden- und Serviceorientierungsehr gute DeutschkenntnisseEDV-AffinittWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/junior-bankkaufmann-im-homeoffice-berlin-258659","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702882142000},{"slug":"burokaufmann sekretariatsservice magdeburg ","company_name":"Workstation Customer Care","title":"Bürokaufmann (m\/w\/d) Sekretariatsservice","description":"Brokaufmann (m\/w\/d) Sekretariatsservice gesucht (Homeoffice nach Einarbeitung mglich).Ihre Aufgaben:Organisation von WeiterbildungenTerminkoordinationVor- und Nachbearbeitung von Seminarenallgemeine SekretariatsaufgabenIhr Profil:Abgeschlossene kaufmnnische AusbildungErste Berufserfahrung wnschenswertSehr gute PC-KenntnisseSehr gute DeutschkenntnisseGute EnglischkenntnisseEin freundliches Team & eine intensive Einarbeitung warten auf Sie.Wir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/burokaufmann-sekretariatsservice-magdeburg-144567","tags":["Business Operations"],"job_types":[],"location":"Magdeburg","created_at":1702882142000},{"slug":"internship automation software tester quality assurance at iot startup dusseldorf ","company_name":"Livello GmbH","title":"Internship Automation Software Tester \/ Quality Assurance at IoT Startup (m\/f\/d)","description":"We are looking for a new team member for our software testing and quality assurance of our Smart Kiosks.Must-have requirement: Mandatory internship for universityLocation: Dsseldorf-BilkStart: by arrangement \/ immediatelyTasksDesigning and executing test plans, test cases, and test scripts for various software applicationsCollaborate with the development team to understand software requirements and identify potential areas for automation testingConducting review meetings, preparing summary reports and communicating with the software teamError tracking and bug reporting to developers and other team membersPerform manual and automated tests to ensure software functionality, usability, and performance meet quality standardsDocument and report software defects, track their status, and work closely with developers to resolve issuesContribute to the continuous improvement of the software testing process by suggesting innovative ideas and best practicesRequirements6 months mandatory internship required by the universityGood knowledge of QA processes, methodologies, standards and strategiesKnowledge of any automated testing framework (Cypress, TestNG, Robot Framework, Selenium etc.)Basic knowledge of any programming language (preferable JavaScript, also accepted Java, Python etc)Basic handling of Jira for ticket management and Confluence for documentationIdeally: Docker, Git, CI\/CD, API Testing (Postman), Agile ScrumBenefitsA responsible position in a fast-growing and highly innovative start-upAn agile and diverse team with colleagues from all over the worldEnglish speaking open work environment, with flat hierarchies and short decision-making pathsDog-friendly office in a prime location with lots of shopping\/restaurant options nearbyAdvanced technology stack leveraging cutting-edge IoT hardware and softwareCreative freedom for own ideas, projects and personal developmentTeam building, learning and start-up eventsLivello is building the future of autonomous retail and smart inventory management. We are developing a revolutionary IoT Platform and telemetric Smart Kiosks with state-of-the-art smart shelving and monitoring technology, leveraging the newest technologies and engineering principles, relying on concepts like automation, autoscaling, resilience, real-time monitoring, sensor fusion, computer vision, machine learning and deep analytics. Our stack consists of modern Javascript, Typescript, Node.Js, React & Redux, Docker, containers, client libraries, and GraphQL, all built on a microservice-based Kubernetes architecture, all supported by the strengths of the Google Cloud Platform. We strongly believe in the power of CICD and integrate and deploy our applications with modern CICD tools from Gitlab.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/livello-gmbh\/internship-automation-software-tester-quality-assurance-at-iot-startup-dusseldorf-139884","tags":["Quality Assurance","Inspection"],"job_types":["Internship","entry"],"location":"Düsseldorf","created_at":1702864195000},{"slug":"net entwickler mit leib und seele bremen ","company_name":"Intercon Solutions GmbH IT & Engineering Experts","title":".Net Entwickler mit Leib und Seele! (m\/w\/d)","description":"Ich suche eine\/n qualifizierte\/n .Net Entwickler\/in mit Leidenschaft und Engagement, denn es wartet eines unserer modernsten und zukunftsorientiertesten Kunden im Bremer Herzen auf dich. Flexiblitt steht unter anderem weit oben und dadurch kannst du eine angenehme und entspannte Arbeitsatmosphre mit erstklassigen Herausforderungen genieen.Aufgabendie Entwicklung mageschneiderter Lsungen, um das Unternehmen weiterhin lebhaft im Markt zu haltenim Team ein wichtiger Bestandteil, um effektive Optimierungen und optimale Konzepte zu analysierendas Binden von externe API mithilfe von entwickelten Services und SchnittstellenQualifikationkenntnisse in den Bereichen vorteilhaft:xUnit FrameworkWinForms .NET Framework 4AngularGherkin-Specflow Framework Visual Studio Code fundierte Kenntnisse mit RESTful APIs, Unit- und Integrationstests sowie ASP.Net Core erwnschtgute bis optimale Fhigkeiten in .net6 und C# und VisualStudio .NET und MS SQL gute Deutschkenntnisse (ab C1) und Englischkenntnisse in Wort und SchriftBenefitsflexible und entspannte Arbeitszeiten (Remote mglich)ein hervorragendes und zukunftsorientiertes UnternehmenEin Team mit fantastischer Motivation und Mglichkeit auf SelbstgestaltungFahrradleasing & FirmenfitnessGnstiger Tarif und spannende Rabatte fr interne Produkte und Nutzungeffiziente Weiterbildungsmglichkeitenattraktives GehaltspaketAltersvorsorgeHilfestellung bei WohnungssucheDB Deutschland-TicketHabe ich deine absolute Aufmerksamkeit und habe dein Interesse geweckt?Dann herzlich willkommen in der Welt der Chancen und der unerwarteten Mglichkeiten. Es gibt immer eine mageschneiderte Mglichkeit fr dich. Du musst dich nur trauen!Melde dich bei mir fr detaillierte Infos, um den weiteren Prozess anzugehen.Mohammad Al JouboriConsultant IT RecruitingFestnetz: +49 211 24958 274Mobil: +49 151 72455 437Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/intercon-solutions-gmbh-it-engineering-experts\/net-entwickler-mit-leib-und-seele-bremen-351564","tags":["Remote","Software Development"],"job_types":[],"location":"Bremen","created_at":1702864195000},{"slug":"it support manager all genders teilzeit munich ","company_name":"Parkdepot","title":"IT Support Manager (all genders) - Teilzeit","description":"Your new roleBist du bereit, uns auf einem spannenden Roadtrip zu begleiten? Wir sind ein aufstrebendes Startup und haben uns zum Ziel gesetzt, das Parkraummanagement auf den Kopf zu stellen. Mit unserer innovativen Technologie sind wir bereit, die Mobilitt zu transformieren und neue Wege zu erffnen.Stell dir vor, du fungierst als IT Support unserer Mitarbeitenden fr ein Produkt, das die Art und Weise, wie Parkpltze verwaltet werden, revolutioniert. Damit hast du einen bedeutsamen Einfluss auf die Zukunft der urbanen Mobilitt. Mit deinem Interesse im IT Support strkst du unsere Position als Marktfhrer, whrend du als Werkstudent IT Management (all genders) gemeinsam mit unserem Team neue Erfolge erzielst.  What to expectIT-Support: Du untersttzt unsere Mitarbeitenden in der Verwaltung der Systeme und Endgerte, bei IT Problemen, sowie beim technischen Setup von Live oder Streaming-EventsOnboarding: Du bist Teil des People & Culture Teams und kmmerst dich in enger Abstimmung mit unseren People Partner:innen um das IT Onboarding neuer Kolleg:innen und bietest ihnen eine unvergessliche Onboarding ExperienceInstallation und Wartung: Du installierst und wartest unsere interne Standardsoftware\/-hardwareIT Security: Du bist untersttzt bei unseren internen Cyber- Security ProjektProzessoptimierung: Du optimierst interne Ablufe, indem du neue sowie effiziente Wege entdeckst und diese implementierstProjekte: Je nach aktuellen Anforderungen und persnlichen Talenten und Interessen legen wir gemeinsam deine Aufgaben und Projekte festInspire us byDein Background: Du befindest dich in einem Studium in (Wirtschafts-) Informatik, Mathematik oder einen vergleichbaren StudiengangDeine Erfahrung: Du hast idealerweise bereits erste praktische Erfahrungen im IT-Umfeld, zum Beispiel durch ein Praktikum oder eine Werkstudententtigkeit gesammeltIT-Guru: Du zeichnest dich durch deine IT-Affinitt sowie durch dein hohes Interesse an technischen Lsungen ausDeine Strken: Du besitzt ein hohes Ma an Zuverlssigkeit, Verantwortungsbewusstsein und SelbststndigkeitKommunikationstalent: Du hast hervorragende Kommunikationsfhigkeiten auf EnglischStandort: Du arbeitest on-site mit unserem Team in MnchenWhat we offer youFlexibilitt: Mit unserem flexiblem Arbeitsmodell kannst du deinen Arbeitsrhythmus individuell anpassen.Workation: Arbeite an inspirierenden Orten whrend deiner Workation fr frische Impulse.Sicherheit: Deine Arbeitsplatzsicherheit wird durch unser profitables Geschftsmodell gewhrleistet.Erfolgsbeteiligung: Profitiere von unserem Virtual Stock Option Plan (VSOP) und werde am Erfolg von Parkdepot beteiligt.Messbare Ziele: Mit unseren OKRs ist dein Einfluss auf unseren Produkt- und Unternehmenserfolg direkt messbar.Events: Feiere gemeinsame unsere Erfolge bei unseren legendren Teamevents und OKR-Partys.Verpflegung: Frischer Kaffee aus unserer Siebtrgermaschine rund um die Uhr fr deine Energie und Produktivitt. Entdecke die Vielfalt von Bella&Bona, unserer Online-Cafeteria, bediene dich an unserem Obstkorb oder frhstcke an der Mslibar.Gesundheit: Wir untersttzen deine Gesundheit und Fitness mit EGYM, um dich aktiv zu halten.Development: Nutze unsere Sprachkurse oder Inhouse-Kurse, um neue Fhigkeiten zu erlernen.Dresscode: Kleide dich so, wie du dich am wohlsten fhlst.Innovation through diversityUnabhngig von deinem Hintergrund, deiner Herkunft, deiner Geschlechtsidentitt oder deinen individuellen Voraussetzungen ist es deine Persnlichkeit, die uns interessiert. Deshalb schaffen wir eine Kultur des Miteinanders und des Respekts, in der jedes Teammitglied ein Mitspracherecht hat, sich persnlich weiterentwickeln kann und wertgeschtzt fhlt.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parkdepot\/it-support-manager-all-genders-teilzeit-munich-341348","tags":["Software Development"],"job_types":["berufseinstieg"],"location":"Munich","created_at":1702864195000},{"slug":"werkstudent all genders it support management munich ","company_name":"Parkdepot","title":"Werkstudent (all genders) IT Support Management","description":"Your new roleBist du bereit, uns auf einem spannenden Roadtrip zu begleiten? Wir sind ein aufstrebendes Startup und haben uns zum Ziel gesetzt, das Parkraummanagement auf den Kopf zu stellen. Mit unserer innovativen Technologie sind wir bereit, die Mobilitt zu transformieren und neue Wege zu erffnen.Stell dir vor, du fungierst als IT Support unserer Mitarbeitenden fr ein Produkt, das die Art und Weise, wie Parkpltze verwaltet werden, revolutioniert. Damit hast du einen bedeutsamen Einfluss auf die Zukunft der urbanen Mobilitt. Mit deinem Interesse im IT Support strkst du unsere Position als Marktfhrer, whrend du als Werkstudent IT Management (all genders) gemeinsam mit unserem Team neue Erfolge erzielst.  What to expectIT-Support: Du untersttzt unsere Mitarbeitenden in der Verwaltung der Systeme und Endgerte, bei IT Problemen, sowie beim technischen Setup von Live oder Streaming-EventsOnboarding: Du bist Teil des People & Culture Teams und kmmerst dich in enger Abstimmung mit unseren People Partner:innen um das IT Onboarding neuer Kolleg:innen und bietest ihnen eine unvergessliche Onboarding ExperienceInstallation und Wartung: Du installierst und wartest unsere interne Standardsoftware\/-hardwareIT Security: Du bist untersttzt bei unseren internen Cyber- Security ProjektProzessoptimierung: Du optimierst interne Ablufe, indem du neue sowie effiziente Wege entdeckst und diese implementierstProjekte: Je nach aktuellen Anforderungen und persnlichen Talenten und Interessen legen wir gemeinsam deine Aufgaben und Projekte festInspire us byDein Background: Du befindest dich in einem Studium in (Wirtschafts-) Informatik, Mathematik oder einen vergleichbaren StudiengangDeine Erfahrung: Du hast idealerweise bereits erste praktische Erfahrungen im IT-Umfeld, zum Beispiel durch ein Praktikum oder eine Werkstudententtigkeit gesammeltIT-Guru: Du zeichnest dich durch deine IT-Affinitt sowie durch dein hohes Interesse an technischen Lsungen ausDeine Strken: Du besitzt ein hohes Ma an Zuverlssigkeit, Verantwortungsbewusstsein und SelbststndigkeitKommunikationstalent: Du hast hervorragende Kommunikationsfhigkeiten auf EnglischStandort: Du arbeitest on-site mit unserem Team in MnchenWhat we offer youFlexibilitt: Mit unserem flexiblem Arbeitsmodell kannst du deinen Arbeitsrhythmus individuell anpassen.Workation: Arbeite an inspirierenden Orten whrend deiner Workation fr frische Impulse.Sicherheit: Deine Arbeitsplatzsicherheit wird durch unser profitables Geschftsmodell gewhrleistet.Erfolgsbeteiligung: Profitiere von unserem Virtual Stock Option Plan (VSOP) und werde am Erfolg von Parkdepot beteiligt.Messbare Ziele: Mit unseren OKRs ist dein Einfluss auf unseren Produkt- und Unternehmenserfolg direkt messbar.Events: Feiere gemeinsame unsere Erfolge bei unseren legendren Teamevents und OKR-Partys.Verpflegung: Frischer Kaffee aus unserer Siebtrgermaschine rund um die Uhr fr deine Energie und Produktivitt. Entdecke die Vielfalt von Bella&Bona, unserer Online-Cafeteria, bediene dich an unserem Obstkorb oder frhstcke an der Mslibar.Gesundheit: Wir untersttzen deine Gesundheit und Fitness mit EGYM, um dich aktiv zu halten.Development: Nutze unsere Sprachkurse oder Inhouse-Kurse, um neue Fhigkeiten zu erlernen.Dresscode: Kleide dich so, wie du dich am wohlsten fhlst.Innovation through diversityUnabhngig von deinem Hintergrund, deiner Herkunft, deiner Geschlechtsidentitt oder deinen individuellen Voraussetzungen ist es deine Persnlichkeit, die uns interessiert. Deshalb schaffen wir eine Kultur des Miteinanders und des Respekts, in der jedes Teammitglied ein Mitspracherecht hat, sich persnlich weiterentwickeln kann und wertgeschtzt fhlt.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parkdepot\/werkstudent-all-genders-it-support-management-munich-352895","tags":["Software Development"],"job_types":["Internship","hilfstätigkeit \/ student"],"location":"Munich","created_at":1702864195000},{"slug":"werkstudent technical operations analytics munich ","company_name":"Parkdepot","title":"Werkstudent (m\/w\/d) Technical Operations Analytics","description":"Your new roleBist du bereit, uns auf einem spannenden Roadtrip zu begleiten? Wir sind ein aufstrebendes Startup und haben uns zum Ziel gesetzt, das Parkraummanagement auf den Kopf zu stellen. Mit unserer innovativen Technologie sind wir bereit, die Mobilitt zu transformieren und neue Wege zu erffnen.  Stell dir vor, du steuerst die Performanceanalyse unseres Systems, die die Art und Weise, wie Parkpltze verwaltet werden, revolutioniert. Damit hast du einen bedeutsamen Einfluss auf die Zukunft der urbanen Mobilitt.  Mit deinem Interesse in der professionellen Performanceanalyse strkst du unsere Position als Marktfhrer, whrend du als Werkstudent (all genders) Technical Operations Analytics gemeinsam mit unserem Team neue Erfolge erzielst.What to expectPerformance-Analyse: Du analysierst gemeinsam mit unserem System Performance Team die Performance unserer Systeme zur Parkraumberwachung und identifizierst Aufflligkeiten im DetailWeiterentwicklung von Prozessen und Tools: Du untersttzt dabei, bestehende Prozesse aktiv zu verbessern. Dafr nutzt du Dashboards und Analysetools und entwickelst diese mit weiterQualittssteigerung: Du untersttzt in der Umsetzung von Manahmen zur Problemlsung bei der Kennzeichenerfassung und verfolgst das Ziel, die Qualitt stndig zu optimieren und Erkenntnisse in neue Parkflchen einzuflieen zu lassenEntwickeln von Software Features: Du hilfst, notwendige Software Features zu definieren und berprfst deren Wirksamkeit nach der Umsetzung durch unser Tech TeamInspire us byDein Background und Erfahrung: Du bist bereits eingeschriebene\/r Student:in im Bereich Informatik, Mechatronik, Elektrotechnik, Maschinenbau, oder einem vergeichbaren StudiengangAmbitioniert: Du mchtest erste Praxiserfahrung sammeln, dein Wissen aktiv einbringen und deine Skills in der technischen Produktentwicklung und in der Datenanalyse vertiefenDeine Verfgbarkeit: Du kannst uns fr circa 20 Stunden pro Woche untersttzen, gerne auch am WochenendeKreativ und Eigenstndig: Selbststndiges Arbeiten und lsungsorientiertes Denken gehren ebenso zu deinen Strken wie gutes rumliches Vorstellungsvermgen und technisches InteresseWhat we offer youFlexibilitt: Mit unserem flexiblem Arbeitsmodell kannst du deinen Arbeitsrhythmus individuell anpassenWorkation: Arbeite an inspirierenden Orten whrend deiner Workation fr frische ImpulseSicherheit: Deine Arbeitsplatzsicherheit wird durch unser profitables Geschftsmodell gewhrleistetMessbare Ziele: Mit unseren OKRs ist dein Einfluss auf unseren Produkt- und Unternehmenserfolg direkt messbar.Events: Feiere gemeinsame unsere Erfolge bei unseren legendren Teamevents und OKR-PartysVerpflegung: Frischer Kaffee aus unserer Siebtrgermaschine rund um die Uhr fr deine Energie und Produktivitt. Entdecke die Vielfalt von Bella&Bona, unserer Online-Cafeteria, bediene dich an unserem Obstkorb oder frhstcke an der MslibarGesundheit: Wir untersttzen deine Gesundheit und Fitness mit EGYM, um dich aktiv zu haltenDevelopment: Nutze unsere Sprachkurse oder Inhouse-Kurse, um neue Fhigkeiten zu erlernenDresscode: Kleide dich so, wie du dich am wohlsten fhlstInnovation through diversityUnabhngig von deinem Hintergrund, deiner Herkunft, deiner Geschlechtsidentitt oder deinen individuellen Voraussetzungen ist es deine Persnlichkeit, die uns interessiert. Deshalb schaffen wir eine Kultur des Miteinanders und des Respekts, in der jedes Teammitglied ein Mitspracherecht hat, sich persnlich weiterentwickeln kann und wertgeschtzt fhlt.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/parkdepot\/werkstudent-technical-operations-analytics-munich-77234","tags":["Project Management"],"job_types":["Teilzeit (unbefristet)","internship","hilfstätigkeit \/ student"],"location":"Munich","created_at":1702864195000},{"slug":"solution architect german speaking leipzig ","company_name":"Cuculus GmbH","title":"Solution Architect (m\/f\/d) - German Speaking","description":"Shape the utilities market of the future with us!Join our team in Leipzig, Erfurt, or Ilmenau, or work remotely in full time as Solution Architect (m\/f\/w).What is the role about?Analyzing complex requirements for effective problem-solving and evaluating technology environments and client specifics.Developing tailored solutions for business needs, formulating solution strategies aligned with business objectives, as well as designing complex architectures and applications.Being responsible for the management of tasks and activities for successful solution implementation and monitoring of technological processes.Collaborating with project managers and supporting project management, as well as communicating with customers\/stakeholders, and providing technical support.Being responsible for monthly representation to discuss the project strategy with team members.Contributing to training sessions, reviewing technical task progress, supporting issue resolution, managing customer communication, and preparing solution architecture for projects.You fit in with us, ifYou hold an apprenticeship\/study in the IT \/ TK environment.You have at least 8 years of experience as a consultant, requirement engineer, or solution architect, ideally in the smart meter or energy market software domain.You have a confident knowledge of English and German.You have a sound technical understanding of complex software solutions.You possess a good understanding of the software development process.You are able to create architecture for complex software solutions like energy monitoring systems including reporting, vending, and billing.Whats in for you?Working in an internationally acting and constantly growing technology company.Flat hierarchies and the chance to really make a difference and see your ideas grow into real projects.A permanent employment contract with fair conditions and flexible working hours and the possibility to work from home - no ifs and buts.A pleasant, informal and open working environment with modern equipment, fresh fruit and drinks for free as well as regular team events and workshops.Other benefits including e.g. day-care allowance, bike leasing and company pension scheme.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/cuculus-gmbh\/solution-architect-german-speaking-leipzig-344311","tags":["Project Management"],"job_types":["professional \/ experienced"],"location":"Leipzig","created_at":1702860543000},{"slug":"social media webdesigner niebull ","company_name":"MSP Nord GmbH","title":"Social Media- \/ Webdesigner","description":"Die MSP Nord GmbH sucht eine(n) kreativen und erfahrenen Mediengestalter-(in) fr Digital und Printmedien, der unser Team in Niebll verstrken mchte. Als Mediengestalter bernehmen Sie die Verantwortung fr die Konzeption, Gestaltung und Umsetzung von ansprechenden Designs sowohl fr digitale als auch gedruckte Medien.Sie bernehmen die Gestaltung sowohl fr betriebsinterne Medien sowie die Durchfhrung von Kundenprojekten im Print- und Onlinebereich.AufgabenGestaltung von Printmedien: Entwicklung und Umsetzung von Layouts fr Broschren, Flyer, Plakate und andere Druckmaterialien.Digitales Design: Erstellung von Grafiken, Illustrationen und visuellen Inhalten fr Websites, Social-Media-Plattformen und andere digitale Kanle.Kreative Konzeption: Zusammenarbeit mit dem Marketingteam, um kreative Konzepte zu entwickeln, die die Unternehmensbotschaft effektiv kommunizieren.Medienproduktion: Vorbereitung von Druckunterlagen, Dateikonvertierungen und Sicherstellung der Druckqualitt.Bildbearbeitung: Professionelle Bearbeitung und Retusche von Bildmaterialien fr verschiedene Medien.QualifikationAusbildung: Abgeschlossene Ausbildung als Mediengestalter oder vergleichbare Qualifikation.Erfahrung: Nachweisbare Berufserfahrung in der Gestaltung von Print- und Digitalmedien.Softwarekenntnisse: Sicherer Umgang mit gngigen Grafikdesign-Tools wie Adobe Creative Suite (InDesign, Photoshop, Illustrator).Kreativitt: Ein Auge fr Designsthetik, Kreativitt in der Konzeptentwicklung und Umsetzung.Kommunikationsfhigkeiten: Fhigkeit zur Zusammenarbeit im Team und Kommunikation mit verschiedenen Abteilungen.BenefitsJobradBonussystemMitgliedschaft FitnessstudioGeregelte ArbeitszeitenDeutschlandTicketWenn Sie leidenschaftlich gerne innovative Designs erstellen, ein Gespr fr sthetik haben und die Herausforderung suchen, Teil eines dynamischen Teams zu sein, freuen wir uns auf Ihre Bewerbung. Senden Sie bitte Ihren Lebenslauf, ein Portfolio mit Arbeitsproben und ein Anschreiben anWir freuen uns darauf, Sie in unserem kreativen MSP Nord Team willkommen zu heien!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/msp-nord-gmbh\/social-media-webdesigner-niebull-220949","tags":["Media","Screen and Web Design"],"job_types":[],"location":"Niebüll","created_at":1702846145000},{"slug":"softwaretester qa engineer ettlingen ","company_name":"ScriptRunner Software GmbH","title":"Softwaretester \/ QA Engineer (m\/w\/d)","description":"Werde Teil des TeamsBei ScriptRunner sind wir stolz darauf mit unserer innovativen Softwarelsung die Welt zu verndern. Mit Leidenschaft, Ausdauer und Spa arbeiten wir im Team von derzeit 25 Mitarbeitern und Mitarbeiterinnen daran, dass unser Produkt erstklassig bleibt und technologisch die Nase vorne hat. Als fhrendes Unternehmen in unserer Branche suchen wir nach einem leidenschaftlichen und erfahrenen Softwaretester!Deine AufgabenKonzeption, Planung und Durchfhrung von automatisierten aber auch manuellen SoftwaretestsEnge Zusammenarbeit in einem agilen EntwicklungsteamErstellung von TestkonzeptenEvaluierung und Dokumentation von TestergebnissenSicherstellung der Softwarequalitt durch Identifizierung, Dokumentation und Verfolgung von Softwarefehlern und MngelnDein BackgroundErfahrung in der Durchfhrung automatisierter Tests fr Softwareanwendungen.Gute Kenntnisse in der Verwendung von Testautomatisierungswerkzeugen und -frameworks (z.B. Pester und Cypress)Solide Kenntnisse in Softwareentwicklung und Programmierung.Verstndnis von agilen Entwicklungsmethoden wie Scrum.Erfahrung mit PowerShell und Microsoft-Infrastrukturen.Hervorragende Problemlsungsfhigkeiten und eine Leidenschaft fr Qualitt.Gute Kommunikationsfhigkeiten und Teamarbeit.Gute EnglischkenntnisseDas erwartete dich bei unsWir haben Spa am gemeinsamen Ausdenken, Ausprobieren, Umsetzen, Optimieren oder Verwerfen und daraus Lernen. Jeder kann Initiative ergreifen, um sich, seine Teammitglieder und ScriptRunner voranzubringen. Bei uns gewinnen die besten Ideen, die dabei helfen die Zukunft mitzugestalten. Alles andere, was sonst noch wichtig ist, wie Homeoffice, flexible Arbeitszeiten, attraktive Vergtung oder erstklassiges Equipment sind fr uns selbstverstndlich.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/scriptrunner-software-gmbh\/softwaretester-qa-engineer-ettlingen-131353","tags":["Automation","Development","Engineering","QA","IT","QA\/Test Engineer","Automation Engineer"],"job_types":[],"location":"Ettlingen","created_at":1702843869000},{"slug":"remote conversion analyst berlin ","company_name":"Peak Ace AG","title":"Conversion Analyst (m\/w\/d)","description":"AufgabenschwerpunkteAls Teil unseres CRO Teams kmmerst du dich um die strategische Planung und Umsetzung von erfolgreichen CRO-Konzepten fr Kund:innen unterschiedlicher Gre, von SMB bis Enterprise Dabei vertiefst du dein spezialisiertes Know-how in den Bereichen heuristische Analyse von Conversion Funneln (Verhaltenskonomie, Konsumpsychologie, Conversion Design) sowie quantitative und qualitative Analyse des Verhaltens von Nutzer:innenDu fhrst eigenstndig umfangreiche Potenzialanalysen fr Optimierungen der Conversion Rate auf Landing Pages und im gesamten Conversion Funnel durchDu entwickelst A\/B-Testkonzepte sowie Roadmaps und setzt diese in Zusammenarbeit mit unseren Conversion Designer:innen und Copywriter:innen umGleichzeitig untersttzt du unsere internen Teams Organic Search, SEA & Paid Social Advertising mit deinem Wissen im CRO ConsultingDu erstellst Auswertungen und automatisierte Reports bzw. Dashboards und leitest daraus konkrete Handlungsempfehlungen fr unsere Kund:innen abDu bist ber aktuelle Entwicklungen und Trends im eigenen Fachbereich auf dem Laufenden und bringst proaktiv eigene Ideen in tgliche Arbeitsablufe und neue Projekte einDie intensive Arbeit und Erweiterung eines professionellen Tool-Stacks rund um A\/B Testing Tools, Heatmap-Tools, Umfragesoftware, Google Analytics & Data Studio, Hubspot, Unbounce etc. rundet deinen Aufgabenbereich abDu begleitest Sales Prozesse und bertst deine aktuellen und zuknftigen Kunden hinsichtlich Conversion Rate-OptimierungDein ProfilIdealerweise besitzt du 2 Jahre praktische Erfahrung als Conversion Optimierer:in und interessierst dich fr die Welt des Online Marketings und der digitalen AnalyseDein Studium, mit Schwerpunkt (Online) Marketing, Psychologie oder Medienwissenschaften mit analytischem Fokus, bzw. gleichwertige Qualifikation hast du erfolgreich abgeschlossenDu besitzt ein sehr gutes Zahlenverstndnis und analytisches Denken sowie Interesse an kognitionspsychologischen Themen und Verhaltenskonomie Du kennst dich mit A\/B Testing Tools (z.B. Optimizely, Google Optimize, VWO, A\/B Tasty) aus und verfgst ber gute Kenntnisse in Google AnalyticsDu berzeugst durch sehr gute Deutsch- und Englischkenntnisse in Wort und SchriftEin hohes Ma an Kommunikationsstrke, Eigeninitiative und Teamfhigkeit, sowie Spa daran, dich in neue Themengebiete einzuarbeiten, rundet dein Profil abWas wir dir bietenFlexibilitt: Whle das Arbeitsmodell, das zu dir passt und arbeite entweder in unserem Berliner Office oder an einem Ort deiner Wahl in Deutschland. Bis zu sechs Wochen im Jahr kannst du auch remote im Ausland arbeiten.Individuelle Entwicklung: Dein persnliches Wachstum ist uns wichtig! Wir gestalten gemeinsam deinen individuellen Entwicklungsplan und besprechen ihn in regelmigen Feedbackmeetings. Peak Ace Academy: Nutze unsere internen und externen Weiterbildungsmglichkeiten, um deine Entwicklungsziele zu erreichen und deinen eigenen Karriereweg zu formen.Work-Life-Balance: Finde deinen idealen Rhythmus mit flexiblen Arbeitszeiten, Teilzeitoptionen und 28 Urlaubstagen im Jahr (Heiligabend und Neujahr sind zustzliche freie Tage).Wohlbefinden: Wir untersttzen dich auch in schwierigen Zeiten. Unser Partner, das Frstenberg Institut, bietet dir und deinen Familienangehrige kompetente Hilfe und Beratung im Bereich Mental Health. Vielfltige Kund:innen: Arbeite mit internationalen Kund:innen aus verschiedenen Branchen an innovativen Kampagnen und bringe deine Ideen ein, um gemeinsam zu wachsen und Digital Marketing neu zu denken. Gemeinsam stark: Werde Teil eines Teams aus einzigartigen und leidenschaftlichen Digital-Marketing-Expert:innen. Zusammen arbeitet ihr an herausfordernden Projekten, knnt euch austauschen und voneinander lernen.An die Zukunft denken: Peak Ace bezuschusst deinen Sparbeitrag zur betrieblichen Altersvorsorge mit zustzlichen 20 %.Office-Leben: In unserem Berliner Office findest du alles, was du zum Arbeiten brauchst  erstklassige technische Ausstattung, Obst, Getrnke, ein kostenfreier und von unserem Kchenteam zubereiteter Lunch und viel Platz fr die Zusammenarbeit mit deinen Kolleg:innen.Fhlst du dich angesprochen? Dann freuen wir uns ber die Zusendung Deiner aussagekrftigen Bewerbungsunterlagen (Anschreiben, Lebenslauf, relevante Zeugnisse, Gehaltswunsch, nchstmglicher Eintrittstermin; formatiert im PDF Format) ber unser Online-Bewerbungsformular.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/peak-ace-ag\/remote-conversion-analyst-berlin-148970","tags":["Remote","KPIs","Performance Marketing","Online Marketing","Online Marketing Manager","Performance Marketing Manager"],"job_types":[],"location":"Berlin","created_at":1702843869000},{"slug":"junior e mail content marketing manager all genders berlin ","company_name":"Digital Career Institute GmbH","title":"Junior E-Mail & Content Marketing Manager (all genders)","description":"Hey Digital Native - Lust auf einen coolen Job?Wen wir suchen:Einen Marketing Rockstar, der nicht blo E-Mails verschickt, sondern epische Geschichten erzhlt, die unsere Zielgruppe in Deinen Bann ziehen.Dein Spielplatz? Die digitale Welt der Weiterbildung - in der Du mit Worten jonglierst und jeden Klick zu einem Abenteuer machst.Was wir bieten:Eine Kultur, die Kreativitt frdert und Innovation belohnt. Ein Team, voller Marketing-Gurus die genauso ideenreich sind wie Du. Einen Platz im Rampenlicht, indem Dein Input nicht nur gehrt, sondern auch gefeiert wird.Ganz vieles also - aber vor allem einen bedeutsamen Purpose hinter Deiner Arbeit!Deine ToDos:E-Mail Marketing:Konzipiere, erstelle und versende spannende E-Mail-Kampagnen zur Reaktivierung und Qualifizierung von Leads.Help where its needed - untersttze den E-Mail Customer Support.Content Erstellung:Entwickle kreativen Content, der nicht nur informiert, sondern unsere Zielgruppe fesselt!Zusammen mit der weltbesten Marketing-Crew, erstellst Du fundierte Konzepte, Strategien und Inhalte, die unsere Konkurrenz vor Neid erblassen lassen.Du stellst sicher, dass wir eine konsistente Markenbotschaft in allen unseren Marketingmaterialien vermitteln.Analyse und Reporting:Du hast ein Auge frs Wesentliche - berwache, analysiere und reporte Deine KPIs - welche Handlungsempfehlungen schlgst Du vor?Du kennst Dich aus mit CRM-Tools: Verantworte Deinen Spielbereich und pflege unsere Datenbank.Auf Nummer Sicher gehen - fhre A\/B-Tests zur Optimierung von E-Mail-Performances durch.,Deine SkillsMust haves:Ein Studium oder eine Ausbildung im Bereich Marketing, Kommunikation, Wirtschaft oder in vergleichbaren Richtungen.Sehr gute Deutsch- und Englischkenntnisse (min. C1).Du berzeugst uns mit:Technischem Know-How: Die geheimen Knste von E-Mail-Marketing-Tools (bevorzugt Hubspot) und Content-Erstellung sind eine Deiner leichtesten bungen.Deinem Interesse an den digitalen Trends von heute und morgen, und daran, es gerne in Deine Arbeit einflieen zu lassen.Unsere Teilnehmer:innen kommen aus ber 125+ Nationen: Dein brillantes Gespr fr Kulturen, Worte und Story-Telling ist ein dickes Plus.,Deine BenefitsFreiraum, was Deine Kreativitt angeht - jede Idee ist willkommen!Ideen-Entwicklung unter Palmen? Klar! Nutze die Gelegenheit auf 2x Workation im europischen Ausland.Power Dich aus bei einem der Kurse von unserem Partner Urban Sports oderbe Achtsamkeit mit einer Meditation von Nilo Health - unserem Partner fr mentale Gesundheit.Komm regelmig zu unseren Events und feier Dich, dein Team und die gesamte Company fr die Lessons learned & Erfolge!Haben wir Dich berzeugt?Dann schick uns Deine kreativste Bewerbung und zeig uns, dass Du der Marketing Rockstar bist, nach dem wir suchen!Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/digital-career-institute-gmbh\/junior-e-mail-content-marketing-manager-all-genders-berlin-471139","tags":["Customer Support","Hubspot","E-Mail Marketing","IT","KPIs","CRM","Content Marketing","Marketing"],"job_types":[],"location":"Berlin","created_at":1702843869000},{"slug":"pflichtpraktikum recruiting ab januar  teilzeitpraktikum fur  monate moglich all genders cologne ","company_name":"PMI Growth Group","title":"Pflichtpraktikum Recruiting, ab Januar 2024, Teilzeitpraktikum für 3 Monate möglich - all genders","description":"Du bist auf der Suche nach einem Pflichtpraktikum, indem es auch eine:n Psycholog:in als Nachweis fr Dein Praktikum gibt? Wir suchen ab Januar 2024 Verstrkung fr unser Recruiting Team!AufgabenErstellung von Leadlisten mit potenziellen Kandidat:innen Anpassung von individuellen Anschreiben & A\/B-Testing unterschiedlicher Formate Recruiting-as-a-Service fr unsere Kund:innen Anschreiben von potenziellen Kandidat:innen via LinkedIn & Xing Erstgesprche fhren & dokumentieren Auswertungen & Tracking der Rcklaufquoten & Erfolgsquoten unseres Recruiting-TeamsQualifikationDu studierst aktuell an einer Hochschule & bist auf der Suche nach einem WerkstudentenjobDu bist sehr organisiert, gewissenhaft & detailorientiert Du liebst es mehrere Blle zu jonglieren Du denkst mit & auch drei Schritte weiter Du hast Lust auf ein dynamisches Start-up UmfeldBenefitseine steile Lernkurve, weil Du bei uns einfach mal machen kannst - Deine Fhrungskraft ist immer fr Dich da, kann Dir direktes Feedback geben, aber vor allem kannst Du eigene Ideen mit einbringenjunges, motiviertes & engagiertes Team, die den old school HR-Bereich von einem Non-Profit zu einem profitablen Bereich transformieren wollenregelmige & einzigartige Teamevents & -abende flexible Arbeitszeiten & nach Absprache kannst Du auch mal fokussiert im Homeoffice arbeitenFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/pmi-growth-group\/pflichtpraktikum-recruiting-ab-januar-2024-teilzeitpraktikum-fur-3-monate-moglich-all-genders-cologne-222784","tags":["Recruitment and Selection"],"job_types":["Internship"],"location":"Cologne","created_at":1702842544000},{"slug":"referent der unternehmensentwicklung ab sofort in teil vollzeit hamburg ","company_name":"TauRes Gesellschaft für Investmentberatung mbH","title":"Referent der Unternehmensentwicklung (m\/w\/d) - ab sofort in Teil-\/Vollzeit","description":"AufgabenSie bernehmen die Untersttzung bei bergreifenden Projekten im Rahmen der Unternehmensentwicklung.Sie wirken bei der Entwicklung von Konzepten und Lsungsanstzen mit.Die operative Betreuung des Projektmanagementportfolios inklusive des Aufbau eines fundierten Projektmanagementwissenspool gehrt ebenso zu Ihrem Ttigkeitsbereich.Sie recherchieren zu Arbeitsweisen und Methoden (z.B. agile Arbeitsweisen, OKR etc.) und erstellen Konzepte.Des Weiteren bernehmen Sie die organisatorische Untersttzung von Workshops zu Prozessaufnahmen in den Fachabteilungen.Auch die operative Begleitung und Identifizierung von Markttrends und Wettbewerberpositionierungen gehrt zu Ihren Aufgaben.AnforderungenSie verfgen ber eine abgeschlossene kaufmnnische Berufsausbildung, eine qualifizierte Weiterbildung oder ein abgeschlossenes Studium.Sie bringen idealerweise auch bereits Erfahrungen im agilen Projektmanagement mit.Sie verfgen ber ein ausgeprgtes Organisationstalent und Netzwerkfhigkeiten.Teamfhigkeit, eine hohe Eigeninitiative und lsungsorientiertes Arbeiten zhlt ebenfalls zu Ihren Strken.Gute kommunikative Fhigkeiten und ein sicherer Schreibstil zeichnen Sie aus.Sie sind sicher im Umgang mit MS-Office, insbesondere Word und Excel.Was wir bietenEin positives und motiviertes Team, das Sie mit offenen Armen empfngt und etwas bewegen will.Eine einzigartige und offene Unternehmenskultur, in der Mitgestaltung nicht nur ermglicht, sondern auch gefrdert wird.Eine spannende und abwechslungsreiche Ttigkeit in einem bestndigen und erfolgreichen Wachstumsunternehmen.Eine tolle Arbeitsatmosphre, in der wir uns gegenseitig untersttzen und Ideen von allen Mitarbeitenden zhlen.Echte Vereinbarkeit von Familie und Beruf  Mobiles Arbeiten, flexible Arbeitszeiten und ein unbefristetes Arbeitsverhltnis sorgen fr eine gesunde Balance in einer modernen Arbeitswelt.Hervorragende Weiterbildungs- und Aufstiegsmglichkeiten.Die komplette bernahme des Deutschlandtickets sowie zahlreiche andere Benefits wie zum Beispiel JobRad, vergnstigte Mitgliedschaften, ergonomische Arbeitspltze, Mitarbeiterangebote.KontaktTauRes Gesellschaft fr Investmentberatung mbHTimo ArndtLeiter PersonalAmsinckstrae 4020097 Hamburg  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/taures-gesellschaft-fur-investmentberatung-mbh\/referent-der-unternehmensentwicklung-ab-sofort-in-teil-vollzeit-hamburg-397363","tags":["Project Management"],"job_types":["berufseinstieg"],"location":"Hamburg","created_at":1702842544000},{"slug":"personalsachbearbeiter gummersbach ","company_name":"einundfünfzig ejo GmbH","title":"Personalsachbearbeiter (m\/w\/d)","description":"Wir suchen ein Personalsachbearbeiter bzw. Sachbearbeiter\/in als Brokauffrau im Bro fr unser Personal in Vollzeit mit Erfahrungen als Kauffrau fr Bromanagement aber auch Quereinsteiger.AufgabenZu Ihren Aufgaben gehren:SV Sofort Melde- und BescheinigungswesenPersonalrecrutingMitarbeiter eintragen im Bewacherregister gem. 34a der GewOErstellen von MitarbeiterausweisenDienstkleidung verwalten und verteilenErstellung von Vertragswesen PersonalKommunikation mit Behrden und DrittenBroorganisatorische TtigkeitenQualifikationFolgende Qualifikationen wnschen wir uns:Freundlichkeit, Teamfhigkeit, Zuverlssigkeit und Vertrauenswrdigkeitabgeschlossene kaufmnnische Berufsausbildungmehrjhrige BerufserfahrungGrundkenntnisse im Bereich der Sozialversicherung und Lohnsteuerselbststndige und dienstleistungsorientierte Arbeitsweisesehr gute PC Kenntnisse, vor allem in MS-OfficeBranchenerfahrung von groem VorteilBenefitsArt der Stelle: Vollzeit, TeilzeitArbeitsstunden: 40 pro WocheArbeitszeiten: Montag bis Freitagbei Teilzeit: ca. 20 Std., Arbeitszeit nach AbspracheWir bieten:Betriebliche WeiterbildungKostenlose GetrnkeMitarbeiter-RabattPreisnachlsse auf Produkte\/Dienstleistungen des UnternehmensZusatzzahlungGesundheitsprmieWir freuen uns auf Ihre vollstndige Bewerbung und Ihren mglichen Eintrittstermin, per E-Mail an Telefonisch steht Ihnen gerne Herr Yaqoub unter 0171-1661111 zur Verfgung.   Art der Stelle: Vollzeit, Berufsausbildung  Arbeitsort: GummersbachLeistungen: Betriebliche Weiterbildung Kostenlose Getrnke Mitarbeiter-Rabatt Preisnachlsse auf Produkte\/Dienstleistungen des Unternehmens Berufserfahrung: Microsoft Office: 3 Jahre (Wnschenswert)Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/einundfunfzig-ejo-gmbh\/personalsachbearbeiter-gummersbach-145912","tags":["Recruitment and Selection"],"job_types":["berufserfahren"],"location":"Gummersbach","created_at":1702835344000},{"slug":"senior sales talent acquisition manager berlin ","company_name":"Digital Career Institute GmbH","title":"Senior Sales Talent Acquisition Manager (m\/w\/d)","description":"Die Lieblings-Phrase von Chatbots: Mit groem Interesse habe ich Ihre Stellenanzeige gelesenUnd welche ist Deine?Du kennst die Theorie und beherrschst die Praxis.Dir ist bewusst, dass die Suche und Identifikation nach den fachlich und persnlich passenden neuen KollegInnen eine anspruchsvolle und vielseitige Aufgabe ist.Du bist auf der Suche nach einer Herausforderung, bei der du mit Deinem Engagement aktiv bei dem Unternehmenswachstum beitragen kannst?Dann geht es heute um Dich - denn wir suchen zum nchstmglichen Zeitpunkt zur Untersttzung unseres Recruiting-Teams einen Senior Sales Talent Acquisition Manager (w\/m\/d) in Berlin oder Hamburg.Deine ToDosDu bernimmst eigenverantwortlich den gesamten Recruiting-Prozess mit Fokus auf unsere Sales-Positionen und stehst unseren Hiring Managern beratend zur Seite.Bei Bedarf bist Du in der Lage, dich schnell in andere Stellenprofile einzulesen und den Recruiting-Prozess zu bernehmen.Du beherrschst das ABC im Recruiting, hast Spa an Active Sourcing und die Verwendung von neuen technischen Mglichkeiten.Kreativitt im Recruiting wird bei uns gro geschrieben - Du entwickelst neue Strategien und setzt diese in Absprache mit deinem Teamlead um.,Deine Skills                                Must-HaveDu bringst mehrjhrige Berufserfahrung im Bereich Sales Recruiting mit.Berufserfahrung in einem schnelllebigen Umfeld, idealerweise in einem Startup.Deine Arbeitsweise lsst sich mit drei Worten beschreiben: lsungsorientiert, pragmatisch und hands-on.Durch Dein organisiertes und strukturiertes Vorgehen, bist Du in der Lage, mehrere Projekte parallel zu verantworten und hast die KPIs im Blick.Nice-to-haveIdealerweise hast Du eine Ausbildung oder Studium mit Schwerpunkt Personal \/ HR abgeschlossen.Du besitzt einen ausgeprgten Dienstleistungsgedanken.Flieende Deutsch- und Englischkenntnisse.,Deine BenefitsHybrides Arbeitsmodell und Workation innerhalb der EU nach Absprache.Ein tolles Team, dass sich gegenseitig bei den Herausforderungen untersttzt.Regelmige Workshops, Events und Partys.Die Chance, einen krisensicheren Job mit Purpose und Weiterentwicklungschancen zu haben.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/digital-career-institute-gmbh\/senior-sales-talent-acquisition-manager-berlin-488502","tags":["Talent Acquisition","Sourcing","Human Resources Manager","Recruiter"],"job_types":[],"location":"Berlin","created_at":1702833071000},{"slug":"remote mitarbeiter in finance berlin ","company_name":"Vertama GmbH","title":"Mitarbeiter\/in Finance","description":"Die Vertama GmbH ist ein in Berlin ansssiger IT- und Plattformspezialist, der branchenspezifische digitale Produkte zur schnellen und einfachen Datenerfassung entwickelt. Unsere Plattform bietet alle Mglichkeiten einer WebAppEngine, die analoge Workflows in digitale Prozesse verwandelt und alle Services rund um die B2B- und B2C-Kommunikation beschleunigt. Noch sind wir in unser Aufbauphase doch haben wir jetzt schon mit ber 40 Krankenhusern einen soliden Kundenstamm, aber wir wachsen und suchen Sie als Verstrkung im Bereich Finance (m\/w\/d). Mit dem High-Tech Grnderfonds haben wir neben anderen Partnern einen strategischen und sehr soliden Investor an Bord, der uns erlaubt, jetzt schneller zuwachsen. Als Festanstellung in Vollzeit oder TeilzeitIhre Aufgaben bei uns:\tSie betreuen unsere Kunden und Partner in allen zahlungsrelevanten Angelegenheiten und verwalten und berwachen Debitorenkonten fr einen definierten Kundenkreis.\tDie Erfassung und berwachung von Zahlungseingngen, die Bearbeitung von Zahlungsdifferenzen, das Mahnwesen und die Kontrolle von nderungen der Kundenstammdaten gehren zu Ihren tglichen Aufgaben.\tSie klren offene Posten, kontrollieren Lastschrifteinzge sowie Inkassobergaben und bernehmen auch die Buchung von Reisekosten und Eingangsrechnungen.\tSie wirken bei Abstimmungen, Monats-, Quartals- und Jahresabschlssen mit.\tAls Mitglied unseres Finance Teams arbeiten Sie nicht nur mit internationalen Schnittstellen und externen Partnern zusammen. Sie haben die Mglichkeit, sich bei Projekten einzubringen, die weitere Optimierung unserer Prozesse zu untersttzen und sich damit weiterzuentwickeln.\tSie untersttzen uns bei unseren Reporting-Aufgaben gegenber unseren Shareholdern\tSie untersttzen in allgemeinen kaufmnnischen administrativen Ttigkeiten________________________________________Das bringen Sie mit\tSie haben eine erfolgreich abgeschlossene kaufmnnische Berufsausbildung.\tSie konnten bereits Berufserfahrungen im Bereich Buchhaltung sammeln.\tSie sind sicher im Umgang mit MS Office und DATEV.\tSie haben ausgezeichnete Deutschkenntnisse in Wort und Schrift und knnen auch auf Englisch kommunizieren\tSie bringen eine selbstndige, zuverlssige und strukturierte Arbeitsweise, Geduld sowie Teamfhigkeit mit.\tMit Ihrem analytischem Denken sorgen Sie fr Ordnung und Struktur in Ihrem Bereich.Das erwartet Sie bei uns\teine vielseitige Ttigkeit mit hoher Eigenverantwortung, eine kooperative Arbeitsatmosphre in einem eingespielten Team in einem spannenden Start-up\tEine offene Unternehmenskultur mit flachen Hierarchien\teine angemessene Vergtung sowie flexible Arbeitszeitmodelle und familienfreundliche Arbeitsbedingungen\tEin dynamisches erfolgs- und zukunftsorientiertes Arbeitsumfeld an einem modernen Arbeitsplatz mit einer sehr gute Anbindung an den ffentlichen NahverkehrFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/vertama-gmbh\/remote-mitarbeiter-in-finance-berlin-409153","tags":["Remote","DATEV","Accounting","Finance Manager","Accountant"],"job_types":[],"location":"Berlin","created_at":1702833071000},{"slug":"talent success manager berlin ","company_name":"Empion","title":"Talent Success Manager (m\/w\/d)","description":"Wir bei Empion automatisieren Headhunting. Unsere Vision ist es, allen Talenten ein individuelles Recruiting Erlebnis zu ermglichen. Mit unserem KI-gesteuerter Robo-Advisor automatisiert Empion die Jobsuche und legt den Fokus dabei nicht nur aus Skills, sondern auch auf Persnlichkeit und Prferenzen.Unser TeamDu bist ein essentieller Teil unseres dynamischen, vielfltigen und zukunftsorientierten Teams mit einem Bro im Herzen von Berlin - mit der berhmtesten Nachbarin Deutschland! Als Teil unseres Talent Success Teams hast du die Mglichkeit, Talenten dabei zu helfen, ihren kulturell passenden Arbeitgeber und Traumjob zu finden. Dabei setzen wir uns fr ein faires, sicheres und inklusives Arbeitsumfeld ein.Bei Empion setzen wir uns fr ein faires, sicheres und integratives Arbeitsumfeld ein, das Vielfalt schtzt und ein ausgewogenes Geschlechterverhltnis frdert.Deine Aufgaben: Du identifizierst potenzielle Talente und gehst kreativ auf sie zu, um sie fr unsere spannenden Positionen zu begeistern. Dabei nutzt du eine vielfltige Mischung von Kanlen wie LinkedIn, Xing, Indeed und Social-Media-Plattformen. Du begleitest verschiedene Prozesse, erstellst Kennzahlen und bernimmst eigenstndige Projekte. Du baust einen Talentpool qualifizierter Kandidat:innen auf und pflegst langfristige Beziehungen. Du fhrst initiale kulturelle Interviews mit interessierten Kandidat:innen und baust kontinuierlich unsere Talent Pipeline aus. Du arbeitest eng mit unseren Partnerunternehmen zusammen und pflegst langfristige Beziehungen. Du holst aktiv Feedback von Kandidat:innen im Bewerbungsprozess sowie von Partnerunternehmen ein. Du bist fr verschiedene Stellen in verschiedenen Branchen verantwortlich.Dein Profil: Du besitzt erste Kenntnisse\/Interesse der neuesten Sourcing-Techniken, -Trends und -Tools und hast Freude daran, neue Sourcing-Anstze und -kanle zu entwickeln und umzusetzen. Du hast bereits Erfahrung\/Interesse mit LinkedIn, Xing sowie CV-Datenbanken, Jobbrsen und Social-Media-Kanlen und sie gehren zu deinem tglichen Geschft. Du bist zielstrebig und teamorientiert und kannst effektiv und einfhlsam mit Kandidat:innen, Kolleg:innen und Partnerunternehmen kommunizieren. Du zeichnest dich durch Agilitt, Flexibilitt, Kreativitt und die Fhigkeit aus, dich schnell neuen Herausforderungen und Gegebenheiten anzupassen. Du verfgst ber flieende Deutsch- und sehr gute Englischkenntnisse in Wort und Schrift.Was wir bieten: Umfeld: Eine familire, authentische und internationale Atmosphre in einem motivierten und freundlichen Team. Startup: Schnelllebiges, stark wachsendes Unternehmen mit groer Vision. Flexibilitt: Die Mglichkeit eines hybriden Arbeitsmodells. Standort: Ein Bro im Herzen von Berlin (Museuminseln) mit gesunden Snacks, Obst und Getrnken und einer sehr berhmten Nachbarin. Vielfalt: Ein diverses Team (in Bezug auf Geschlecht, Nationalitt, Alter, Sprachen)  Englisch als Unternehmenssprache. Socializing: Regelmige Teamevents und alle zwei Wochen \"Thirsty Thursdays\" bei uns im Bro. Spa: Teamevents fr zustzlichen Spa.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/empion\/talent-success-manager-berlin-190129","tags":["Interviews","Social Media","Sourcing","Human Resources Manager","Recruiter"],"job_types":[],"location":"Berlin","created_at":1702833071000},{"slug":"remote senior devops engineer giessen ","company_name":"Schunk Group","title":"Senior DevOps Engineer (m\/w\/d)","description":"You (m\/w\/d) build it, you run it, gestalte die Zukunft des digitalen Zeitalters aktiv mit!Wir von der iDA haben es uns auf die Fahne geschrieben, die Arbeitswelt Stck fr Stck zu optimieren, zu modifizieren und natrlich auch zu digitalisieren.WIE WIR DAS MACHEN?Zum einen, indem wir Open-Source-Lsungen einsetzen, zum anderen, indem wir Moira benutzen. Moira ist unsere hauseigene Software, die vornehmlich als Middleware fungiert und genau dort ansetzt, wo es ntig ist: Bei der Datenverarbeitung. Mit Moira knnen Daten funktionalisiert und gewinnbringend genutzt oder aufbereitet und zugnglich gemacht werden. Einsatzmglichkeiten gibt es so viele wie Herausforderungen.WO WIR DAS MACHEN?Bei produzierenden Unternehmen genauso wie bei Dienstleistern. Die Flexibilitt von Moira macht uns zu Allroundern und berall dort, wo eine digitale Infrastruktur besteht, knnen wir auch agieren. Und falls keine existiert, dann helfen wir sie zu etablieren.WER DAS MACHT?Wir. Wir sind ein crossfunktionales Team, das aus Generalisten und Spezialisten, Quereinsteigern und Nerds, Innovativen und Kreativen besteht. Wir wachsen mit unseren Aufgaben und lernen jeden Tag dazu.DEINE ROLLE: Design \/ Bereitstellung \/ Pflege und Wartung von funktionierenden Softwareplattformen Weiterentwicklung und Verbesserung der Produkte Dokumentation von Fehlerbehebung Administration mit Hyperscalern Betrieb von containerisierten AnwendungenDEIN PROFIL: Ein abgeschlossenes Studium der *-Informatik oder Vergleichbares Nachweisbare, mehrjhrige Erfahrung in Konzeption, Aufbau, berwachung und Betrieb von IT-Systemarchitekturen Nachweisbare Erfahrung in Administration mit Hyperscalern (idealerweise Azure) Orchestrierung und Betrieb von containerisierten Anwendungen Application Monitoring Linux-Kenntnisse und Erfahrung mit Virtualisierung Interesse an neuen Technologien Teamfhigkeit und Hands-on MentalittDER TECH STACK: Sprache: Java \/ C# \/ C++ \/ Rust \/ Go Backend: Java Frontend: React Weiteres \/ Tools: Docker \/ Kubernetes \/ GitOps \/ Azure DevOps \/ CI\/CD Infrastructure-as-Code: Terraform \/ SALT \/ Puppet \/ AnsibleDEINE BENEFITS: Kaffee, Tee und eine groe Auswahl an Kaltgetrnken Groartiges Betriebsklima und die Mglichkeit alle Offices zu nutzen Startup Spirit und Konzern Sicherheit Flexible Arbeitszeit und Home-Office-Regelung Weiterbildungsmglichkeiten Betriebliche Altersvorsorge 30 Tage UrlaubWir konnten Dein Interesse wecken? Dann freuen uns auf Deinen CV im online Bewerbungsformular.Find more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/schunk-group\/remote-senior-devops-engineer-giessen-102288","tags":["Remote","Jenkins","Docker","Java","Azure","Cloud computing","Kubernetes","DevOps"],"job_types":[],"location":"Giessen","created_at":1702833071000},{"slug":"beraterin schwerpunkt vermogensanlage iv brandenburg ","company_name":"Sparda-Bank Berlin","title":"Berater*in Schwerpunkt Vermögensanlage (w\/m\/div)","description":"Die Sparda-Bank Berlin gehrt ihren Mitgliedern und keinen Aktionren. Mit mehr als 400.000 Mitgliedern sind wir eine der grten Genossenschaftsbanken in Deutschland. Das schafft Sicherheit und Vertrauen.Fr unseren Markt Berlin\/Potsdam, ausgehend vom Standort in 14776 Brandenburg an der Havel (Steinstrae 63), suchen wir dich alsBerater*in Schwerpunkt Vermgensanlage (w\/m\/div)Anstellungsart: Vollzeit, unbefristet, ab sofort zu besetzenDas erwartet dich:Aktive anlass- und bedarfsorientierte, kanalbergreifende Privatkundenberatung zu Produkten und Dienstleistungen der Bank insbesondere in der VermgensanlageUmsetzung verschiedener Vertriebsaktivitten, insbesondere qualifizierte Terminvereinbarungen fr Bestands- und Neukund*innen im OutboundIdentifizierung von Potenzialen und qualifizierte berleitung zu den entsprechenden Berater*innen sowie den VerbundpartnernDurchfhrung einer bedarfsorientierten Privatkundenberatung im Sinne der genossenschaftlichen Beratung sowie Verkauf von kanalbergreifenden Produkten und DienstleistungenErgebnisorientierter Produktabschluss innerhalb der standardisierter Produktpalette mittels kanalbergreifender Prozessstreckenbernahme von standardisierten operativen Geschftsvorfllen im TagesgeschftEinhaltung von Service- und Beratungsstandardsbernahme von Projekt- und SonderaufgabenDas begeistert uns an dir:Du verfgst ber eine abgeschlossene Bankausbildung bzw. eine vergleichbare Qualifikation.Des Weiteren erwarten wir eine mehrjhrige Berufserfahrung im Vertriebsbereich einer Bank sowie nachweisbare nachhaltige Vertriebserfolge.Du verfgst ber gute Kenntnisse der standardisierten Produktpalette insbesondere im Wertpapier- und Vorsorgebereich.Fundiertes Produkt- und Prozesswissen setzen wir voraus.Eine Affinitt fr direktabschlussfhige Vertriebs- und Produktionsstrecken setzen wir voraus.Wir bieten dir:Ein unbefristetes Arbeitsverhltnis in einer Bank, die anders ist.30 Urlaubstage pro Jahr,sowie frei an den Bankfeiertagen (24. und 31.12.) eines jeden Jahres, zzgl. verschiedener Anlsse fr Sonder- und Zusatzurlaub.Eine attraktive tarifliche Vergtung(13 Gehlter) inkl. Nebenleistungen wie vermgenswirksame Leistungen (40  mtl.\/Vollzeit), betriebliche Altersversorgung, Langzeitkonten.Vollzeit entspricht bei uns einer 39 Stunden\/Woche.An deinem Geburtstag reduziert sich deine Arbeitszeit auf 5 Stunden, damit ausreichend Zeit zum Feiern bleibt.Die Mglichkeit zum mobilen Arbeiten (ortsungebunden z.B. von zu Hause; ca. 60-80% bzw. 3-4 Tage die Woche), sowie die Mglichkeit zum Arbeiten in unseren modernen Standorten.Umfangreiche IT-Ausstattung (inkl. Peripherie).Eine kontininuierliche Weiterentwicklung der eigenen fachlichen und persnlichen Fhigkeiten (z.B. Sparda Stipendium = Frderung nebenberufliches Studium).Viele Mitarbeiter*innenkonditionen fr ausgewhlte Produkte der Bank und unserer Verbundpartner.Team- und Sportevents, ein betriebliches Gesundheitsmanagement sowie weitere Vorteile z.B. unsere BenefitBox.Mit unserer Unterschrift unter die Charta der Vielfalt machen wir uns fr eine vorurteilsfreie Arbeitskultur stark. Bei uns hat jegliche Form der Diskriminierung keinen Platz; Vielfalt ist willkommen und gewnscht.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sparda-bank-berlin\/beraterin-schwerpunkt-vermogensanlage-iv-brandenburg-391637","tags":["Banking Industry","Account Manager"],"job_types":[],"location":"Brandenburg","created_at":1702833071000},{"slug":"beraterin schwerpunkt finanzierung iv berlin ","company_name":"Sparda-Bank Berlin","title":"Berater*in Schwerpunkt Finanzierung (w\/m\/div)","description":"Die Sparda-Bank Berlin gehrt ihren Mitgliedern und keinen Aktionren. Mit mehr als 400.000 Mitgliedern sind wir eine der grten Genossenschaftsbanken in Deutschland. Das schafft Sicherheit und Vertrauen.Fr unseren Markt Berlin\/Potsdam, ausgehend vom Standort in 12163 Berlin (Schlostrae 97), suchen wir dich alsBerater*in Schwerpunkt Finanzierung (w\/m\/div)Anstellungsart: Vollzeit, unbefristet, ab sofort zu besetzenDas erwartet dich:Aktive anlass- und bedarfsorientierte, kanalbergreifende Privatkundenberatung zu Produkten und Dienstleistungeninsbesondere im privaten Finanzierungsbereich (Privat-, Baufinanzierungs- und Modernisierungsdarlehen)Umsetzung verschiedener Vertriebsaktivitten, insbesondere qualifizierte Terminvereinbarungenfr Bestands- und Neukund*innen im OutboundIdentifizierung von Potenzialen und qualifizierte berleitung zu den entsprechenden Berater*innen sowie denVerbundpartnernDurchfhrung einer bedarfsorientierten Privatkundenberatung im Sinne der genossenschaftlichen Beratungsowie Verkauf von kanalbergreifenden Produkten und DienstleistungenErgebnisorientierter Produktabschluss innerhalb der standardisierten Produktpalette mittels kanalbergreifenderProzessstreckenbernahme von standardisierten operativen Geschftsvorfllen im TagesgeschftEinhaltung von Service- und Beratungsstandardsbernahme von Projekt- und SonderaufgabenDas begeistert uns an dir:Du verfgst ber eine abgeschlossene Bankausbildung bzw. eine vergleichbare Qualifikation.Des Weiteren erwarten wir eine mehrjhrige Berufserfahrung im Vertriebsbereich einer Bank sowie nachweisbarenachhaltige Vertriebserfolge.Du verfgst ber gute Kenntnisse im privaten Finanzierungsgeschft insbesondere im Privat-, Baufinanzierungs-und Modernisierungsdarlehen.Fundiertes Produkt- und Prozesswissen setzen wir voraus.Eine Affinitt fr direktabschlussfhige Vertriebs- und Produktionsstrecken setzen wir voraus.Wir bieten dir:Ein unbefristetes Arbeitsverhltnis in einer Bank, die anders ist.30 Urlaubstage pro Jahr, sowie frei an den Bankfeiertagen (24. und 31.12.) eines jeden Jahres, zzgl. verschiedener Anlsse fr Sonder- und Zusatzurlaub.Eine attraktive tarifliche Vergtung (13 Gehlter) inkl. Nebenleistungen wie vermgenswirksame Leistungen (40  mtl.\/Vollzeit), betriebliche Altersversorgung, Langzeitkonten.Vollzeit entspricht bei uns einer 39 Stunden\/Woche.An deinem Geburtstag reduziert sich deine Arbeitszeit auf 5 Stunden, damit ausreichend Zeit zum Feiern bleibt.Die Mglichkeit zum mobilen Arbeiten (ortsungebunden z.B. von zu Hause; ca. 60-80% bzw. 3-4 Tage die Woche), sowie die Mglichkeit zum Arbeiten in unseren modernen Standorten, sowie die Mglichkeit zum Arbeiten in unseren nagelneuen und hochmodernen Standorten in Berlin.Umfangreiche IT-Ausstattung (inkl. Peripherie).Eine kontininuierliche Weiterentwicklung der eigenen fachlichen und persnlichen Fhigkeiten (z.B. Sparda Stipendium = Frderung nebenberufliches Studium).Viele Mitarbeiter*innenkonditionen fr ausgewhlte Produkte der Bank und unserer Verbundpartner.Team- und Sportevents, ein betriebliches Gesundheitsmanagement sowie weitere Vorteile z.B. unsere BenefitBox.Mit unserer Unterschrift unter die Charta der Vielfalt machen wir uns fr eine vorurteilsfreieArbeitskulturstark. Bei uns hat jegliche Form der Diskriminierung keinen Platz; Vielfalt ist willkommen und gewnscht.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sparda-bank-berlin\/beraterin-schwerpunkt-finanzierung-iv-berlin-413473","tags":["Banking Industry","Account Manager","Sales Manager"],"job_types":[],"location":"Berlin","created_at":1702833071000},{"slug":"remote junior devops berlin ","company_name":"JLink temp experts GmbH","title":"Junior DevOps (m\/f\/d)","description":"What are your Responsibilities:Monitoring applications and infrastructure alerts and reacting quickly.Monitoring SLO alerts and Error Budgets for the applications.Participate and manage Incident Response Flow for the applications.Identifying and implementing automation opportunities to ensure success.Closing open support tickets by adhering to SLAs.Co-ordinate with various stakeholders to carry out blameless postmortems.What qualifies you for this role:Hands on experience on Linux Platforms.Knowledge on technology stack that includes Kubernetes, Docker, PostgresSQL,Grafana, Prometheus, Gitlab, Terraform, Jira, Confluence and more.Work experience in IT operations or production support model.Knowledge on any scripting language Python, Bash Scripting, Go or Perl.Team player, flexible and ready to work in (Incentive-Based) 24x7 support model.What can you expect:Enjoy working in energetic and inclusive environment where you explore, learn and contribute.Be part of Operations Team which works very closely with talented and experiences Site Reliability Engineers.Agile working in self-organised teams (Scrum, Kanban)Intensive Knowledge exchange with experienced colleagues.Working on platforms that includes Kubernetes OpenShift, Docker, PostgresSQL,Grafana, Prometheus, ElasticSearch, Gitlab, Jira, Terraform and more.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/jlink-temp-experts-gmbh\/remote-junior-devops-berlin-379257","tags":["Remote","Perl","Scripting Language","ElasticSearch","Confluence","Kanban","Bash","Automation"],"job_types":[],"location":"Berlin","created_at":1702833071000},{"slug":"full stack developer tubingen ","company_name":"DeepScenario GmbH","title":"Full-Stack Developer","description":"DeepScenario is a deep tech start-up with the vision to bring automated systems safe to the road. The fast-growing start-up provides highly accurate real-world traffic data to accelerate the development of automated systems. DeepScenarios product helps automotive industry customers to train, test, and validate their self-driving algorithms in challenging scenarios.We are looking for a talented full-stack developer to join our dedicated team of experts. You will help us design and implement a scalable web application enabling our customers to interact with our product.Your ResponsibilitiesImplement APIs to interface with our cloud computing pipeline to ensure fast and frictionless use of our productDesign and build visually appealing front-end applications and maintainable back-end solutionsApply best practices for web development and leverage cutting-edge frameworksInteract with a team of developers, machine learning engineers, and industry expertsYour Qualifications+3 years of practical experience in front- and back-end developmentDeep experience in web development and modern frameworksHands-on experience with AWS, SaaS solutions, and serverless applicationsTeam player with passion to work in an intercultural environmentHigh degree of autonomy and excellent problem-solving skillsYour BenefitsBe part of an investor-backed company with a dedicated team of expertsTake one of the most important roles in a deep tech start-upPossibility to work in Stuttgart or remoteGreat team spirit in an agile environmentGet a highly attractive compensation packageInterested? Contact Us!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/deepscenario-gmbh\/full-stack-developer-tubingen-294872","tags":["JavaScript Developer","Front-end Developer"],"job_types":[],"location":"Tübingen","created_at":1702833071000},{"slug":"head of tech all genders berlin ","company_name":"Digital Career Institute GmbH","title":"Head of Tech (all genders)","description":"Deine Aufgaben als Head of TechnologyStrategische Tech-ThemenEntwicklung, Planung und Aufbau des Tech-Bereichs - im Einklang mit der Unternehmens- und IT-Strategie.Planung und Verantwortung fr die Budgetplanung fr den gesamten Tech-Bereich.Weiterentwicklung der Tech-Umgebung und Business Intelligence (BI)Du bist Entscheidungstrger und verantwortest das Thema Business Intelligence (BI) sowie die AWS \/ Data Warehouse InfrastrukturVerantwortlich fr die Weiterentwicklung und Vernetzung der aktuell genutzten IT-Tools (z.B. Make \/ Integromat)Analyse und Entwicklung von Plattformen, Learning Management Systemen (LMS) und Lehrer-Einsatzplanungen sowie Themen rund um Artificial intelligence (AI)Entwicklung und Umsetzung technologischer Roadmaps und Tech-ArchitekturenAdaption von existierenden Tools in die Organisation (z.B. Technical CRM) sowie Ownership unserer WebseiteMitarbeiterverantwortungDisziplinre und fachliche Fhrung von einem international aufgestellten Team.Ressourcenplanung fr die einzelnen Projekt-Themen.Deine SkillsBerufserfahrungLangjhrige Berufs- und Fhrungserfahrung als CDO, CTO, CIO oder Head of TechErfolgreich abgeschlossenes Hochschulstudium der Fachrichtungen Informationstechnologie, o..Mehrjhrige Erfahrung im Bereich Business Intelligence (BI) und MeisterIn im Umgang mit TableauMethoden Knowhow in Entwicklungs- und ProduktionsprozessenDu bisteine unternehmerisch geprgte Fhrungspersnlichkeit mit Kreativitt und Sinn fr das Machbare und findest pragmatische Lsungen.eine Person mit und Affinitt zu Automatisierung, Digitalisierung und KIdienstleistungsorientiert, besitzt Hands-On-Mentalitt und einen klaren Kommunikationsstil auf allen Hierarchieebenenin der deutschen und englischen Sprache sicher (C1)Nice-to-haveErfahrungen im Branchenumfeld Bildung \/ (IT-)Weiterbildungstrger sind von VorteilErfahrung im Produktmanagement sind wnschenswertDeine BenefitsWir bieten dir 29 Urlaubstage und die Mglichkeit auf Workations innerhalb des europischen Auslands.Ein Rundum-Sorglos-Paket whrend deiner ersten Tage! Du wirst whrend deines Onboardings herzlich willkommen geheien und Schritt fr Schritt in die Welt des DCIs begleitet.Arbeite in einem Unternehmen, in dem Diversitt, Wertschtzung und der gemeinsame Spirit uns unsere Ziele gemeinsam erreichen lsst.Du bist uns wichtig. Deine mentale und krperliche Gesundheit mchten wir deswegen so gut wie es geht frdern. Unsere Partner wie u.a. nilo.health und Urban Sports Club helfen uns dabei.Sei Teil einer wertvollen Mission. Wir bieten Menschen durch Bildung eine Perspektive und verhelfen ihnen dabei, ihr Potenzial zu entdecken.Wir feiern uns! Sei dabei, wenn wir unsere Fortschritte und Erfolge bei Teamevents und Parties ordentlich feiern.ber unsWir beim Digital Career Institute bieten als Tech School seit 2016 verschiedenste Weiterbildungskurse an. Damit haben wir schon zahlreichen Menschen geholfen, einen Neustart zu wagen und in der digitalen Arbeitswelt einen Job zu finden. Aus der ursprnglichen Initiative, neue Zukunftsperspektiven fr Geflchtete zu schaffen, haben wir uns zu einem etablierten Tech-Institute fr Menschen aller Nationalitten und Herknfte entwickelt. Gemeinsam mit einem hoch qualifizierten Team aus ber 250 Mitarbeitenden arbeiten wir alle an einer Mission: Die bestmgliche Ausbildung fr interessierte Menschen zu bieten, um ihnen einen Jobeinstieg in der Digitalbranche zu ermglichen.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/digital-career-institute-gmbh\/head-of-tech-all-genders-berlin-481395","tags":["Business Intelligence","IT","AWS","Artificial Intelligence","Solution Architect","Engineering Manager","Chief Technology Officer"],"job_types":[],"location":"Berlin","created_at":1702833071000},{"slug":"remote full stack entwickler ki friedrichshafen ","company_name":"ai-predict.de","title":"Full-Stack Entwickler KI (m\/w\/d)","description":"Wir entwickeln fr unsere Kunden innovative Lsungen vom Prototypen bis zu in die IT-Landschaft integrierten Anwendungen. Insbesondere in den Bereichen Rezepturen in der Spezialchemie setzen wir KI-setups ein, um hochkomplexe Problemstellungen umsetzbar zu lsen.Wir erleben gerade eine faszinierende Wachstumsphase von Grndung bis zu ersten Projekten. Was jetzt noch fehlt ist ein talentierter Softwareentwickler KI (m\/w\/d), der mit Knowhow, Leidenschaft und Kreativitt mitwirkt, ai-predict als technologiefhrende Company mitzuentwickeln.Deine AufgabenDu entwickelst als Fullstackentwickler unsere MachineLearning Pipeline fr Rezepturen und Energie weiterDu entwickelst die Architektur der MachineLearning Pipeline weiterDu nimmst Kundenanforderungen auf und setzt diese im Team in der Machine Learning Pipeline um.Du entwickelst umsetzbare Lsungen  auch mit dem Kunden- und entwickelst diese weiter.Du hast Interesse an Forschungsprojekten.Dein ProfilAbgeschlossenes Hochschulstudium im Bereich Informatik, Mathematik, Statistik oder PhysikMindestens 2 Jahre Berufserfahrung in der SoftwareentwicklungBerufserfahrung in der agilen Softwareentwicklung und SoftwarearchitekturGute bis sehr gute Kenntnisse und Erfahrungen in Python, TypescriptGute bis sehr gute Kenntnisse und Erfahrungen Webtechnologie Angular, Angular Material UI, ExpressJS,Erfahrung in der ProjektarbeitSehr gute Deutsch- und EnglischkenntnisseUnsere LeistungenKreative und lebendige Arbeitsatmosphre und einen sonnigen Arbeitsplatz am Bodensee oder im HomeofficeVerantwortungsvolle und herausfordernde Aufgaben mit Kundenkontakt und die Mglichkeit sich individuell weiterzuentwickelnEin dynamisches Team mit flachen HierarchienFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ai-predictde\/remote-full-stack-entwickler-ki-friedrichshafen-316389","tags":["Remote","Python Developer","Data Engineer","JavaScript Developer"],"job_types":[],"location":"Friedrichshafen","created_at":1702833071000},{"slug":"remote java engineering lead berlin ","company_name":"Labforward","title":"Java Engineering Lead  (m\/f\/d)","description":"Your missionLead our Java Engineering TeamRequired tech stackJavaJavaScript and\/or TypeScriptDelivering containerized applicationsCloud infrastructure for one major provider eg: AWS, Azure, Google CloudOne CI tool - CircleCI, Jenkins, Travis, etcOne relational database - MySQL, Postgres, etcOne modern frontend framework - React, Angular, Aurelia, etc One build tool - Gradle, Maven, etcExperience with all below are preferred, but not required:KubernetesElasticsearchRedisMinIOApplication SecurityKey challenges for this role - Are you up for it?Efficiently onboard to an established team and take over leadership role supporting our Java software productsLead future development effort in our Labfolder electronic lab notebook (ELN)Guide the team through the transition process from some remaining portions of legacy front-end and back-end code towards modern and maintainable implementationsSupport our cloud and on-premises customersYour profileYou have completed Bachelor or Master degree in STEM (preferably in CS)You are an effective Manager as well as an open, honest, and respectful communicator who can confidently lead and grow the teamYou are a pragmatic problem-solver, goal-focused and results-orientedYou are excited to work in an international environment - expected advanced level of EnglishJob experienceAt least 5 years of technical experience with at least 2 years of experience in team managementLanguage proficiencyEnglish: Fluent to business fluent (C1)What we offerWorking for a dynamic company in the heart of laboratory innovation initiatives with a diverse and international team.If youre from abroad, we support your relocation to Germany with support of a specialized agency.Office, home office or hybrid: Depending on the role and requirements, we offer flexible work models.Tailored onboarding, training and career development: We help you get up to speed in your new role quickly and support your growth.Modern work equipment (Apple laptops etc.), so that you are well prepared for your work.28 days of annual leave and flexible schedule with core working hours from 10 to 4pm.Contribution to public transportation in Berlin or bike-sharing.Company Pension Plan.Regular team & company events as well as learning and development activities.Location: Berlin, Alt-Treptow district, close to Treptower Park stationWorking hours: Full time (40h\/week)Salary: 65-75k\/yearWhy Labforward?The Labforward team is a dynamic, multidisciplinary and international group of professionals dedicated to transforming the landscape of scientific research and laboratory management. Comprising experts in fields ranging from software development and data science to life sciences and engineering, the Labforward team is united by a shared passion for innovation and a deep commitment to advancing scientific discovery as well as chemical and pharmaceutical development.Our Mission, Vision and products matter - the solutions we develop assist laboratory teams, streamlining their planning, execution and documentation, thereby clearing the path for groundbreaking discoveries, innovative drug development and eco-friendly chemicals. We create the laboratory of the future together, as a team but also together with our customers and partners.Our Employees matter - Labforward fosters an environment of learning, allowing you to grow into your role. With flexible hours, remote working policies and career development we aim to provide the best possible working environment for our employees to thrive.Our Culture matters - we are a growing international and diverse company: our team is supportive, agile and inclusive.Find Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/labforward\/remote-java-engineering-lead-berlin-472874","tags":["Remote","Team Management","Gradle","Data Science","Azure","Maven","Leadership","ElasticSearch"],"job_types":[],"location":"Berlin","created_at":1702833071000},{"slug":"key account manager vertriebsmitarbeiter aussendienst neu isenburg ","company_name":"Chip 1 Exchange","title":"Key Account Manager (m\/w\/d) \/ Vertriebsmitarbeiter Außendienst (m\/w\/d)","description":"Dedicated to Progress  Willkommen bei Chip 1Wir sind die Chip 1 Exchange GmbH & Co. KG aus Neu-Isenburg. Wir wissen, dass eine Menge zwischen guten Ideen und progressivem Handeln liegt. Seit unserer Grndung im Jahr 2001 haben wir unsere unternehmerische Vision deshalb kontinuierlich weiterentwickelt und sind mittlerweile die Experten in der globalen Distribution von elektronischen Bauelementen. Mikrochips, Transistoren, LEDs und vieles mehr  unsere weltweiten Kundinnen und Kunden setzen auf die zuverlssige Versorgung mit unserer erstklassigen Technik.Entscheidend fr unseren Erfolg ist unsere Kontinuitt und das Commitment unserer ber 300 berragenden Mitarbeitenden.Wir wollen wachsen und suchen daher ab sofort passionierteKey Account Manager (m\/w\/d) \/ Vertriebsmitarbeiter Auendienst (m\/w\/d)Deine MissionDu bist passionierter Vertriebler, gerne unterwegs und stets bestrebt Kundenbedrfnisse zu erkennen, noch bevor sie ausgesprochen werden? Dann ist dies die passende Position fr dich!Du bist fr die Ausweitung unserer regionalen Prsenz verantwortlich. Durch Deine kundenorientierte und proaktive Art bindest Du Kunden langfristig und baust diese mit unserem Lsungs- und Serviceportfolio erfolgreich ausDu erstellst aussagekrftige Aktivittsberichte im zustndigen VerkaufsgebietDu arbeitest kundenspezifische Prsentationen aus und stellst diese vor Du hast Deine Umsatz-, Margen- und Wachstumsziele eigenverantwortlich im Blick Deine Arbeit erfolgt stets in enger Zusammenarbeit mit dem Inside Sales TeamDein Skill-PaketMehrjhrige Berufserfahrung im Auendienst-VertriebProfunde Marktkenntnis der Halbleiter Branche und Erfahrung im Bereich von Kundemanagement-Systemen (CRM)Hohes Ma an Eigenorganisation, ausgeprgte Analysefhigkeit, stark LsungsorientiertHohe Prsentationsfhigkeit und Fhigkeiten im zwischenmenschlichen BereichFlieende Deutsch und Englischkenntnisse in Wort und SchriftUnsere Must-Haves fr dich Team: flache Hierarchien, kurze Informations- und Entscheidungswege, regelmige Teambuilding Events Arbeitsumfeld: abwechslungsreiches Kundennetzwerk sowie eine herausfordernde Ttigkeit, mit groem Gestaltungsspielraum Persnliche Entwicklung: fundierte Einarbeitung und mageschneiderte Weiterbildungskonzepte Weitere Highlights: betriebliche Altersvorsorge, vergnstigte Mitgliedschaft bei EGYM Wellpass sowie firmeninternes Fitnessstudio, betriebliches Gesundheitsmanagement, Mitarbeitervergnstigungen u.v.m.berzeuge dich selbst!Wir erwarten gespannt deine Unterlagen und freuen uns auf einen lebhaften Austausch mit dir. Solltest du Fragen haben, zgere nicht, uns zu kontaktieren.Wir freuen uns auf dich!Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/chip-1-exchange\/key-account-manager-vertriebsmitarbeiter-aussendienst-neu-isenburg-13589","tags":["Account management","Sales Management","communication skills","Account Manager"],"job_types":[],"location":"Neu-Isenburg","created_at":1702833071000},{"slug":"senior full stack entwickler cologne ","company_name":"crossbuilders","title":"(Senior) Full Stack Entwickler (M\/W\/D)","description":"crossbuilders ist ein Company Builder mit Fokus auf Financial Services und Insurance mit Sitz im Klner Rheinauhafen. Wir entwickeln kreative digitale Geschftsmodelle und fhren diese bis in die technische Umsetzung fort. Fr unseren Bereich Solution Engineering suchen wir Dich ab sofort als Untersttzung. Wenn Du Erfahrung in Tech-Themen und Full-Stack Softwareentwicklung hast, freuen wir uns auf Deine Bewerbung!Deine Aufgaben:Entwicklung von Finanzapplikationen und Microservices im Bereich Banken & VersicherungenUntersttzung in agilen Produktentwicklungen in Form von Ideen, Konzepten und FeedbackBetreuung der Deployment-Pipelines und aktiver Austausch mit DevOps-KollegenProfessionelle Umsetzung von Software- und Weiterentwicklung sowie eine Offenheit gegenber anderen Programmiersprachen wie Java oder PythonDein Profil:Du entwickelst leidenschaftlich gerne und hast eine Neugierde fr neue TechnologienDu hast sehr gute Kenntnisse in der (agilen) Softwareentwicklung (JavaScript, Node.js, Typescript), mit automatisiertem Testen sowie mit Continuous Integration\/ Continuous DeliveryDu bringst gute Kenntnisse mit verschiedenen Software- und Systemarchitekturen, vor allem mit verteilten Systemen (Microservices, Self-Contained Systems) und Containertechnologien mitDu hast idealerweise Erfahrung in der Arbeit mit Docker und GitlabDu kommunizierst proaktiv mit Kolleginnen und Kollegen und bist ein Team-PlayerDeine Soft-Skills:Du hast eine strukturierte Vorgehensweise und kannst Ideen klar vermittelnDu lst gerne Probleme und schreckst vor Herausforderungen nicht zurckDu findest kreative Lsungen und bist ideenreichWas wir Dir bieten:Die Mglichkeit, in einem agilen Team an innovativen Lsungen zu arbeitenDeine Fhigkeiten kontinuierlich im Team und durch professionelle Fortbildungen weiterzuentwickelnDie Vorzge von viel Eigenverantwortung, mobilem Arbeiten und flexiblen ArbeitszeitmodellenEine leistungsgerechte Vergtung und weitere Benefits wie deine WunschhardwareFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/crossbuilders\/senior-full-stack-entwickler-cologne-342069","tags":["Docker","Microservices Architecture","Python","Banking Industry","Software architecture","TypeScript","JavaScript Developer","Node.js Developer"],"job_types":[],"location":"Cologne","created_at":1702833071000},{"slug":"junioroperations specialist m f d berlin ","company_name":"F&P Stock Solution GmbH","title":"(Junior)Operations Specialist (m, f, d)","description":"We are looking for a passionate and competent (Junior)Operations Specialist (m, f, d) to join our team. In this operations position you will work closely with our suppliers, buying team, warehouse management and accountingWhat we are offering you:Opportunity to take responsibility and actively shape our processes with your ideasShort decision-making processes and flat hierarchiesTable tennis rounds and regular team eventsFree coffee, tea and waterFlexible working hours, home office possible two days a weekShopping events for employees: discounts (75% off RRP) on our range of shoes, textiles and accessories from brand-name companiesA monthly shopping voucher in the amount of 50Payment of a Deutschlandticket for public tranport, alternatively we pay a subsidy for travel costs should you arrive by car (parking spaces on site)How you contribute to our success story:As an Operations Specialist, you will be an integral part of our Operations Department, providing crucial support in various operational aspects. Your key responsibilities will include:Purchase Order Processing:Efficiently handle the processing of purchase orders, ensuring accuracy and timeliness.Collaborate with suppliers and internal stakeholders to resolve any discrepancies in orders.Data Analysis:Utilize advanced Excel skills to analyze data of offers provided by suppliersProvide insights and recommendations to enhance operational efficiencyProduct Management:Planning & processing own company productsProcess Optimzation:Constantly review our processes and research and implement innovative solutions and tools for department and companyInbound Planning:Work closely with the logistics team to plan and coordinate inbound of purchase ordersOptimize supply chain processes to enhance efficiency and reduce lead timesPayment Handling:Collaborate with the Accounting Department to ensure seamless payment processes.Verify and reconcile invoices, resolving any issues to maintain accurate financial records.You have the following set of expertise:Completed education or studies as well as at least 2 years of professional experience in relevant areasProficient in Microsoft Excel and affinity to numbersStrong analytical and problem-solving skills with acute attention to detailExcellent communication and interpersonal skills to collaborate effectively with internal teams and external partners.Fluency in English is enough, German beneficialPassion for working in a start-up environmentWe are looking forward to your application. CV is only required.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/fp-stock-solution-gmbh\/junioroperations-specialist-m-f-d-berlin-481611","tags":["Business Operations"],"job_types":[],"location":"Berlin","created_at":1702831744000},{"slug":"technischer zeichner bzw technischer systemplaner elektrotechnik cad system eplan elcad hamburg ","company_name":"Regel- und Elektroanlagenbau Dresden GmbH","title":"Technischer Zeichner bzw. Technischer Systemplaner (m\/w\/d) Elektrotechnik CAD- System  EPLAN \/ELCAD","description":"Wir, die Regel- und Elektroanlagenbau Dresden GmbH, sind seit 25Jahren ein mittelstndischer Dienstleistungsbetrieb mit dem Portfolio der  kompletten Leistungen bei der Errichtung von Elektro-, Me-, Steuer- und Regelanlagen. Das Unternehmen verfgt ber 2 Standorte. Am Standort Dresden ist der Hauptsitz mit der Schaltanlagenfertigung und der Montageabteilung angesiedelt und in Hamburg befindet sich das Planungsbro.AufgabenErstellung der Elektrodokumentation (Stromlaufplne, Klemmenplne, Stcklisten Gerteaufbauplne etc.) fr individuelle Schaltanlagen (keine Serienfertigungen) nach Vorlagen der Konstrukteure, mit CAD- System EPLAN P8 2.x  bzw. ELCAD 7.xberarbeiten von AS-Built Dokumentationen, sowie bernahme von Rotnderungen in vorhandene Zeichnungendas Aufgabengebiet umfasst  hierbei sowohl Modernisierungen \/ Erweiterungen von bestehenden Anlagen, als auch Neuanlagenleichte SekretariatsttigkeitQualifikationabgeschlossene Berufsausbildung als Technischer Zeichner bzw. Technischer Systemplaner Elektrotechnikgute Kenntnisse in EPLAN P8 2.xKenntnisse in ELCAD 7.x wren vorteilhaftroutinierter Umgang mit den MS Office-Anwendungenteamorientiertes Denken mit Flexibilitt, Einsatzfreude und Belastbarkeit sowie mit einer selbststndigen,   disziplinierten und zuverlssigen Arbeitsweise Englisch- Grundkenntnis sind wnschenswert, aber nicht zwingend notwendigBenefitseine anspruchsvolles und abwechslungsreiches Aufgabengebietein kollegiales und freundliches Betriebsklimaregelmige Fortbildungen, fachlicher Austausch usw.unbefristete Arbeitsstelle mit 13 Monatsgehlter p.a. bei marktorientierter Bezahlung38,5 Wochenstunden mit Gleitzeitmodell30 Tage Jahresurlaubgute Nahverkehrs- und AutobahnanbindungRegel- und Elektroanlagenbau Dresden GmbHEngineering HamburgMichael Modi \/ Klaus BrockampFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/regel-und-elektroanlagenbau-dresden-gmbh\/technischer-zeichner-bzw-technischer-systemplaner-elektrotechnik-cad-system-eplan-elcad-hamburg-180884","tags":["Engineering"],"job_types":["Vollzeit (unbefristet)"],"location":"Hamburg","created_at":1702831744000},{"slug":"werkstudentin unternehmensaufbau operations berlin ","company_name":"emjul","title":"Werkstudent*in Unternehmensaufbau\/ Operations","description":"Wir suchen eine*n engagierte*n Werkstudent*in, die unser Team bei der Entwicklung und Umsetzung unserer Projekte untersttzt. Als aufstrebende digitale Agentur mit Schwerpunkt auf Fintech, Real Estate und Blockchain bieten wir Dir die Mglichkeit, in einem spannenden und zukunftsorientierten Umfeld ttig zu sein.AufgabenUntersttzung beim UnternehmensaufbauAufstezen der ProzesseAufsetzen digitaler Infrastruktur (MS Office, Hubspot, Mailchimp, ... etc.)Kommunikation mit allen Teammitgliedern, um die Strategie und Prozesse abzustimmenAnalyse von Daten und Erfolgsmessung der verffentlichten InhalteQualifikationDu solltest flieend Deutsch und Englisch sprechen und schreiben knnen.Erfahrung mit digitalen Tools wie MS office, CRM oder hnlichesFhigkeit, sich relativ schnell in digitale Produkte einzuarbeiten Du solltest ein gutes Gespr fr aktuelle Trends und Themen haben.Benefitsberdurchschnittliche BezahlungFlexible ArbeitszeitenWir bieten Ihnen eine herausfordernde und abwechslungsreiche Ttigkeit in einem motivierten Team. Du hast die Mglichkeit, deine Fhigkeiten weiterzuentwickeln und einen mageblichen Beitrag zum Erfolg unseres Unternehmens zu leisten.Wiir uns auf deine Bewerbung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/emjul\/werkstudentin-unternehmensaufbau-operations-berlin-483262","tags":["IT"],"job_types":["Working student","hilfstätigkeit \/ student"],"location":"Berlin","created_at":1702824542000},{"slug":"embedded entwickler karlsruhe automatisierungstechnik ","company_name":"AURELLY TECHNOLOGIES GmbH","title":"Embedded Entwickler (m\/w\/d) Karlsruhe, Automatisierungstechnik","description":"Wir untersttzen unsere Kunden bei der Entwicklung innovativer Technologien in den Branchen, Automotive, Antriebstechnik, Automatisierungstechnik, Prf- und Messtechnik, Maschinenbau, Medizintechnik und Elektronik. Fr den Raum Karlsruhe suchen wir einen Embedded Softwareentwickler (m\/w\/d).AufgabenAnforderungsanalyse, Spezifikation und Design von SoftwarekomponentenAnalyse von zugelieferten Softwarepaketen bezglich vorhandener Funktionalitt, Subset-Bildung und der Portierbarkeit auf ZielsystemeEmbedded Entwicklung fr Simatic Kommunikationsprozessoren in der Programmiersprache Assembler und C Integration der PROFINET I\/O FunktionalittImplementierung und Durchfhrung der Modul- und Integrationstests der Software-KomponentenDurchfhrung von ReviewsZusammenarbeit im multinationalen TeamQualifikationAbgeschlossenes Studium der Elektronik, Elektrotechnik, der Technischen Informatik oder eines vergleichbaren Studienganges (Uni, FH, TU, BA)Fundierte Erfahrungen in der Entwicklung von komplexen Software-Lsungen im Embedded UmfeldSicherer Umgang mit den Programmiersprachen Assembler und C Know-how in der Anwendung von PROFIBUS\/ PROFINET ist von VorteilGute Englischkenntnisse in Wort und SchriftAnalytische und systematische ArbeitsweiseGewohnt in multikulturellen Teams die tglichen Herausforderungen zu meisternBenefitsSpannende Entwicklungsprojekte in einem internationalen UmfeldZusammenarbeit mit fhrenden IndustriekundenModernste EntwicklungsumgebungenProjektgetriebene WeiterbildungWissenserweiterung durch abwechselnde Projektebertarifliches GehaltFahrtkostenzuschussWeihnachts-UrlaubsgeldBetriebliche AltersvorsorgeFirmeneventsSie sind interessiert an dieser Herausforderung? Dann freuen wir uns auf Ihre Bewerbung.Weitere spannende Herausforderungen fr Entwickler finden Sie auch auf unserer Jobseite.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/aurelly-technologies-gmbh\/embedded-entwickler-karlsruhe-automatisierungstechnik-164391","tags":["Software Development"],"job_types":[],"location":"Karlsruhe","created_at":1702824542000},{"slug":"netzwerk security tester karlsruhe automatisierungstechnik ","company_name":"AURELLY TECHNOLOGIES GmbH","title":"Netzwerk Security Tester (m\/w\/d) Karlsruhe, Automatisierungstechnik","description":"Wir untersttzen unsere Kunden bei der Entwicklung innovativer Technologien in den Branchen, Automotive, Antriebstechnik, Automatisierungstechnik, Prf- und Messtechnik, Maschinenbau, Medizintechnik und Elektronik. Fr den Raum Karlsruhe suchen wir einen Netzwerk Security Tester (m\/w\/d).AufgabenAufbau und Durchfhrung von Netzwerktests fr industrielle KommunikationskomponentenErstellung von TestszenarienIdentifizierung von Schwachstellen und Erstellung von ProtokollenAutomatisierung der TestsErstellung der dazu gehrigen Software-ApplikationenProtokollierung der TestsZusammenarbeit mit anderen Teams der EntwicklungsabteilungQualifikationErfolgreich abgeschlossenes Studium der (technischen) Informatik, Informationstechnik oder Elektrotechnik (Uni, FH, BA)Solide Erfahrung in Testtechniken und TestmethodenFundierte Netzwerk-Kenntnisse von Layer-2 bis Layer-4 gem ISO-OSI ModelKenntnisse in Netzwerktechnologien wie TCP\/IP, Routing, Switching und FirewallingErfahrung mit Tools wie Metasploit, Nessus, Nmap oder WiresharkGute Programmiererfahrung mit C#Gute Englischkenntnisse in Wort und SchriftAnalytische und systematische ArbeitsweiseGewohnt in multikulturellen Teams die tglichen Herausforderungen zu meisternBenefitsSpannende Entwicklungsprojekte in einem internationalen UmfeldZusammenarbeit mit fhrenden IndustriekundenModernste EntwicklungsumgebungenProjektgetriebene WeiterbildungWissenserweiterung durch abwechselnde Projektebertarifliches GehaltFahrtkostenzuschussWeihnachts-UrlaubsgeldBetriebliche AltersvorsorgeFirmeneventsSie sind interessiert an dieser Herausforderung? Dann freuen wir uns auf Ihre Bewerbung.Weitere spannende Herausforderungen fr Entwickler finden Sie auch auf unserer Jobseite.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/aurelly-technologies-gmbh\/netzwerk-security-tester-karlsruhe-automatisierungstechnik-424350","tags":["Software Development"],"job_types":[],"location":"Karlsruhe","created_at":1702824542000},{"slug":"praktikant werkstudent data science aachen ","company_name":"Circonomit GmbH","title":"Praktikant \/ Werkstudent Data Science (w\/m\/d)","description":"About Circonomit:Good data for a greener tomorrow, a new perspective on sustainability and finance. Circonomit offers a fresh perspective on sustainability and finance. We empower companies, regardless of size or industry, to efficiently and transparently construct vital environmental data for their products and business processes. Together, we forge a path towards a more sustainable and prosperous future.  Who we are:We are Circonomit, an ambitious team of engineers and business professionals who share a common goal: to comprehensively revolutionize sustainable practices and behaviors in the industry for better environmental and economic decisions worldwide. We are cultivating a pioneering One-Stop-Solution for effortlessly and swiftly creating product and production-related environmental datasets at scale, as easy as playing with Lego bricks. In doing so, we directly address the megatrends of the climate crisis and digitalization. Our aspiration to establish the world's environmental data infrastructure will define the industry standard for collecting and organizing corporate environmental data. What sets us apart in the market is our framework for utilizing real data and seamlessly integrating environmental insights with financial optimizations.To safeguard the planet while fortifying the economic backbone of our society, we empower companies with genuine automation driven by cutting-edge technology.AufgabenAbout the Role:As an intern or working student, you will play an integral role in our development team. This is not just an internship for bystanders; it's a meaningful and value-adding position. We find ourselves at a pivotal moment, experiencing strong growth, solid financial footing, and the ambition to elevate our team to the next level. Join us from the outset and evolve with the teamwe're seeking a long-term relationship.  Circonomit is a young company with exceptional potential to make a real impact. As one of the initial employees in your domain, you'll have the chance to work closely with the entire team, including the founders. Confronting a variety of challenges will allow you to imprint your personal touch on the company. Operating in a cross-functional environment and taking on tasks beyond your core responsibilities is second nature to you, motivating you to achieve peak performance. You are adept at engaging with stakeholders (internal\/external) across all subject areas and contributing your expertise in a highly dynamic environment.QualifikationSome Key-strength you should bring with:Be in love with (the power of) data.Have at least some experience with data-heavy apps and\/or ELT processes.Develop and evolve data models.Help to design and implement AI-powered recommender.Write data pipelines: ingest, transform, and combine information from various sources to power our app.Write web crawlers.Have first expertise with dbt and dvc.Have first expertise with ML tasks, embeddings and semantic search.Have problem-solving skills and ability to work under pressure.High level of commitment to the team, continuous learning and development as well as taking responsibility for your own work.  Some Information you should also know:Circonomit's operating language is both German and English.Circonomit is a remote friendly company, but the real magic happens, when like minded people get together. Being located in or around Berlin would be a plus.The duration or time limit of the position is flexible, but it should be a minimum of 3 months to ensure mutual added value. We are always open to establishing long-term employment relationships.This role reports directly to the CTO\/CPO.The Tackstack we use:Programming should be fun. Circonomit uses modern, cutting-edge technologies:Typescript, PythonReact (Next.js) and SolidJSPostgreSQL and SQLiteHono RPC for end-to-end typesafe APIVitest and Playwright for testingTerraform (cdktf) for provider-agnostic cloud deploymentsAPIs on LLM, GPT AppsAs we are a young company of course, our tech stack is constantly evolving- We are always open to incorporate input from new hires on tools that they are passionate about.BenefitsWhat we offer to you:Belonging and Purpose - be part of the sustainable future and contribute to this important development, we are really passionate and take our values seriously.Development - a steep learning curve, both personally and professionally.Value-driven culture - we are really proud of our open culture.Ownership - Take responsibility and thrive with it.Modern working culture - flexible work hours and trust in your ability to deliver, empowering you to take control of your own personal balance.Remote & Hybrid work approach enabling a good balance between working from home and the office.Competitive and fair compensation package.Technology - State of the art equipment.A multicultural team.Our Principles:At Circonomit, we're committed to navigating our journey guided by a distinct set of principles. We believe in having a clear actionable standard set for daily action a set of guiding stars that illuminate our path forward aligned with our vision and values. These principles aren't just words on paper; they're the essence of how we operate daily. They embody our collective values, define our behaviors, and steer our decision-making processes. They're the unwavering standards that anchor us in our pursuit of excellence. By embracing these principles, we empower each team member to act with confidence and purpose. They serve as our North Star, offering direction, alignment, and a constant reminder of who we are and what we stand for.  React to other peoples messages in group chats at a minimum once daily so everyone knows we are on the same page especially the person that put in the work. Alignment and appreciation is key.Minimize communication overhead, make up your mind before meetings and conversation and if sending over information on any channel give a one sentence note on the rationale behind.Stay humble in discussions. Be aware when a strong opinion or absolutistic statement arises that is often an unvalidated hypothesis. Our only job then is to clearly state the problem and test with the market. In most cases there is neither a right or wrong or black and white. Be proactive and own. Especially in the early days, we require leaders, not followers, taking responsibility on their topics, setting and keeping the bar high.Keep up a healthy effective communication. Everyone is responsible to pause and cut interaction immediately that runs into the wrong direction, both the person that started it and the person that continues. Be on time, always, it's about respect for other people and the team's output. In any case there is any unforeseen delay, we give a written notice as early as we know to be late.Only have intended meetings. Come in with a clear goal\/problem statement, leave with an outcome delivery plan\/solution. If meetings do not add value to your work or you can not add value to the conversation, you are allowed and encouraged to leave.Execute with care and diligence. Keep files clean, check your spelling, document your work, deliver on a standard like if you were speaking in front of 1000 people or selling a book to 1M readers.Neutralize weaknesses. Everyone has them, be always kind to yourself, however do not accept them to affect the team's standard to drop. Use tools to support you, the new digital age has it all, or discuss with the team on how someone with a strength in this field can support you.Present a problem always with a solution draft If hitting a roadblock, take time to clearly state the problem and figure out some possible solution before interacting with the team for help. This is a thing of respect and ownership, others are not meant to fix the problem one is responsible for. Meet the Stellar Minds Behind Our Startup! At the heart of our dynamic startup are two visionaries, Dana and Erik, whose passion and expertise set the tone for our journey. Supported by the incredible talents of Jonas and Adrian, our team is a vibrant blend of diverse skills and shared values.Dana, our spirited co-founder, is a fitness enthusiast with a penchant for yoga and a love for the arts. Her fascination with both mathematics and human relationships adds a unique dimension to our approach, reflecting the harmony of logic and empathy.Erik, the technological maestro of our team, finds joy in the thrill of cycling, the heights of climbing, and the depths of engaging podcasts. His tech-savvy mind is the driving force behind our innovations, shaping the future of our venture.Jonas, a dedicated advocate for food sharing, brings a compassionate touch to our mission. His commitment to sustainability and community resonates in every aspect of our work, fostering a sense of responsibility that goes beyond business.Adrian, our artistic soul, expresses his creativity through the medium of oil paintings. His brushstrokes add color to our workspace, embodying the essence of our startup's imagination and originality.Our startup isn't just a workplace; it's more as high-performance sports-team united by a common purpose. The office exudes warmth, with at least one set of bedding always on standby and cabinets stocked with  100kg of ingredients for communal meals, from hearty lentil dishes to flavorful rice and couscous bowls.And because balance is key, our team ensures that fitness is woven into our daily routine through random push-up challenges and a sixpack bet. This unique blend of passion, creativity, and camaraderie is what sets us apart, fueling our motivation and propelling us towards success. Welcome to the spirited world of our startup!   Please also note:Research indicates that men typically apply to jobs when they meet about 60% of the criteria, whereas women and other members of marginalized groups often apply only if they fulfill every requirement. Therefore, if you possess most of the qualifications but don't meet every single point on the job description, we encourage you to reach out. We'd love to have a conversation and explore whether you could be an excellent fit for the role.  We look forward to hearing from you.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/circonomit-gmbh\/praktikant-werkstudent-data-science-aachen-133428","tags":["Data Scientist"],"job_types":["Working student","berufseinstieg"],"location":"Aachen","created_at":1702820945000},{"slug":"praktikant werkstudent software development aachen ","company_name":"Circonomit GmbH","title":"Praktikant \/ Werkstudent Software Development (w\/m\/d)","description":"About Circonomit:Good data for a greener tomorrow, a new perspective on sustainability and finance. Circonomit offers a fresh perspective on sustainability and finance. We empower companies, regardless of size or industry, to efficiently and transparently construct vital environmental data for their products and business processes. Together, we forge a path towards a more sustainable and prosperous future.  Who we are:We are Circonomit, an ambitious team of engineers and business professionals who share a common goal: to comprehensively revolutionize sustainable practices and behaviors in the industry for better environmental and economic decisions worldwide. We are cultivating a pioneering One-Stop-Solution for effortlessly and swiftly creating product and production-related environmental datasets at scale, as easy as playing with Lego bricks. In doing so, we directly address the megatrends of the climate crisis and digitalization. Our aspiration to establish the world's environmental data infrastructure will define the industry standard for collecting and organizing corporate environmental data. What sets us apart in the market is our framework for utilizing real data and seamlessly integrating environmental insights with financial optimizations.To safeguard the planet while fortifying the economic backbone of our society, we empower companies with genuine automation driven by cutting-edge technology.AufgabenAbout the Role:As an intern or working student, you will play an integral role in our development team. This is not just an internship for bystanders; it's a meaningful and value-adding position. We find ourselves at a pivotal moment, experiencing strong growth, solid financial footing, and the ambition to elevate our team to the next level. Join us from the outset and evolve with the teamwe're seeking a long-term relationship.  Circonomit is a young company with exceptional potential to make a real impact. As one of the initial employees in your domain, you'll have the chance to work closely with the entire team, including the founders. Confronting a variety of challenges will allow you to imprint your personal touch on the company. Operating in a cross-functional environment and taking on tasks beyond your core responsibilities is second nature to you, motivating you to achieve peak performance. You are adept at engaging with stakeholders (internal\/external) across all subject areas and contributing your expertise in a highly dynamic environment.QualifikationSome Key-strength you should bring with:Ideally some proven experience as a developer.Ideally experience in development of SaaS solutions in the B2B environment.Comfortable speaking with customers clearly to understand requirements.Experience with programming language, data processing and frameworks (see our Tech-Stack below) with solid understanding of databases since this is one crucial part of our product solution.Experience with large, enterprise-grade applications.High level of commitment to the team, continuous learning and development as well as taking responsibility for your own work.  Some Information you should also know:Circonomit's operating language is both German and English.Circonomit is a remote friendly company, but the real magic happens, when like minded people get together. Being located in or around Berlin would be a plus.The duration or time limit of the position is flexible, but it should be a minimum of 3 months to ensure mutual added value. We are always open to establishing long-term employment relationships.This role reports directly to the CTO\/CPO.  The Tackstack we use:Programming should be fun. Circonomit uses modern, cutting-edge technologies:Typescript, PythonReact (Next.js) and SolidJSPostgreSQL and SQLiteHono RPC for end-to-end typesafe APIVitest and Playwright for testingTerraform (cdktf) for provider-agnostic cloud deploymentsAPIs on LLM, GPT Apps  As we are a young company of course, our tech stack is constantly evolving-  We are always open to incorporate input from new hires on tools that they are passionate about.BenefitsWhat we offer to you:Belonging and Purpose - be part of the sustainable future and contribute to this important development, we are really passionate and take our values seriously.Development - a steep learning curve, both personally and professionally.Value-driven culture - we are really proud of our open culture.Ownership - Take responsibility and thrive with it.Modern working culture - flexible work hours and trust in your ability to deliver, empowering you to take control of your own personal balance.Remote & Hybrid work approach enabling a good balance between working from home and the office.Competitive and fair compensation package.Technology - State of the art equipment.A multicultural team.Our Principles:At Circonomit, we're committed to navigating our journey guided by a distinct set of principles. We believe in having a clear actionable standard set for daily action a set of guiding stars that illuminate our path forward aligned with our vision and values. These principles aren't just words on paper; they're the essence of how we operate daily. They embody our collective values, define our behaviors, and steer our decision-making processes. They're the unwavering standards that anchor us in our pursuit of excellence. By embracing these principles, we empower each team member to act with confidence and purpose. They serve as our North Star, offering direction, alignment, and a constant reminder of who we are and what we stand for.  React to other peoples messages in group chats at a minimum once daily so everyone knows we are on the same page especially the person that put in the work. Alignment and appreciation is key.Minimize communication overhead, make up your mind before meetings and conversation and if sending over information on any channel give a one sentence note on the rationale behind.Stay humble in discussions. Be aware when a strong opinion or absolutistic statement arises that is often an unvalidated hypothesis. Our only job then is to clearly state the problem and test with the market. In most cases there is neither a right or wrong or black and white. Be proactive and own. Especially in the early days, we require leaders, not followers, taking responsibility on their topics, setting and keeping the bar high.Keep up a healthy effective communication. Everyone is responsible to pause and cut interaction immediately that runs into the wrong direction, both the person that started it and the person that continues. Be on time, always, it's about respect for other people and the team's output. In any case there is any unforeseen delay, we give a written notice as early as we know to be late.Only have intended meetings. Come in with a clear goal\/problem statement, leave with an outcome delivery plan\/solution. If meetings do not add value to your work or you can not add value to the conversation, you are allowed and encouraged to leave.Execute with care and diligence. Keep files clean, check your spelling, document your work, deliver on a standard like if you were speaking in front of 1000 people or selling a book to 1M readers.Neutralize weaknesses. Everyone has them, be always kind to yourself, however do not accept them to affect the team's standard to drop. Use tools to support you, the new digital age has it all, or discuss with the team on how someone with a strength in this field can support you.Present a problem always with a solution draft If hitting a roadblock, take time to clearly state the problem and figure out some possible solution before interacting with the team for help. This is a thing of respect and ownership, others are not meant to fix the problem one is responsible for. Meet the Stellar Minds Behind Our Startup! At the heart of our dynamic startup are two visionaries, Dana and Erik, whose passion and expertise set the tone for our journey. Supported by the incredible talents of Jonas and Adrian, our team is a vibrant blend of diverse skills and shared values.Dana, our spirited co-founder, is a fitness enthusiast with a penchant for yoga and a love for the arts. Her fascination with both mathematics and human relationships adds a unique dimension to our approach, reflecting the harmony of logic and empathy.Erik, the technological maestro of our team, finds joy in the thrill of cycling, the heights of climbing, and the depths of engaging podcasts. His tech-savvy mind is the driving force behind our innovations, shaping the future of our venture.Jonas, a dedicated advocate for food sharing, brings a compassionate touch to our mission. His commitment to sustainability and community resonates in every aspect of our work, fostering a sense of responsibility that goes beyond business.Adrian, our artistic soul, expresses his creativity through the medium of oil paintings. His brushstrokes add color to our workspace, embodying the essence of our startup's imagination and originality.Our startup isn't just a workplace; it's more as high-performance sports-team united by a common purpose. The office exudes warmth, with at least one set of bedding always on standby and cabinets stocked with  100kg of ingredients for communal meals, from hearty lentil dishes to flavorful rice and couscous bowls.And because balance is key, our team ensures that fitness is woven into our daily routine through random push-up challenges and a sixpack bet. This unique blend of passion, creativity, and camaraderie is what sets us apart, fueling our motivation and propelling us towards success. Welcome to the spirited world of our startup!   Please also note:Research indicates that men typically apply to jobs when they meet about 60% of the criteria, whereas women and other members of marginalized groups often apply only if they fulfill every requirement. Therefore, if you possess most of the qualifications but don't meet every single point on the job description, we encourage you to reach out. We'd love to have a conversation and explore whether you could be an excellent fit for the role.  We look forward to hearing from you.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/circonomit-gmbh\/praktikant-werkstudent-software-development-aachen-373535","tags":["Software Development"],"job_types":["Working student","berufseinstieg"],"location":"Aachen","created_at":1702820945000},{"slug":"it systemadministrator in niebull ","company_name":"MSP Nord GmbH","title":"IT-Systemadministrator (m\/w\/d) in Niebüll","description":"Seit nun 20 Jahren sind wir auf Sylt als IT-Dienstleister ttig und derzeit zu einem kleinen Team von 6 Kollegen gewachsen. Wir planen in den kommenden Monaten unsere Services weiter auszubauen und bentigen daher dringend die Untersttzung von motivierten Kollegen die Lust haben uns bei diesem Vorhaben zu begleiten.Wir bieten eine breite Palette an Services, die ebenso vielseitig ist wie unsere Kunden Klientel hier auf Sylt.Beratung und Wartung gehrt ebenso zu unseren Aufgaben, wie die Inbetriebnahme komplexer Netzwerkumgebungen. Neben grtenteils Unternehmenskunden gehren auch viele Objekte von Zweitwohnungsbesitzern zu unserer langjhrigen Kundschaft.AufgabenAdministration und Weiterentwicklung von Windows-NetzwerkenFernwartung bei unseren Kunden mit Wartungsvertrag.Auslieferung und Konfiguration von Hard- und Software beim KundenSoftware-Verteilung und Patch-ManagementBenutzer- und Berechtigungsverwaltung (Microsoft Active Directory)Virtualisierung (VMware ESXi)Reparatur und RecoveryauftrgeQualifikationErfolgreicher Abschluss als Fachinformatiker fr Systemintegration        oder vergleichbarBreite Kenntnisse in Microsoft-Windows-UmgebungenInteresse an der Einarbeitung in neue Themen und ProdukteGute Deutsch-Kenntnisse in Wort und SchriftSystematisches, zielorientiertes und selbststndiges ArbeitenBenefitsBonussystemFitness-StudioDeutschland-TicketJobrad4-Tage Woche mglichWIR BIETEN:Attraktive Position in einem erfolgreichen DienstleistungsunternehmenEine langfristige Zusammenarbeit und einen sicheren ArbeitsplatzFlache Hierarchien und kurze EntscheidungswegeEine partnerschaftliche Arbeitsatmosphre in einem motivierten TeamBONUS SYSTEM | 4 Tage Woche mglich Freuen Sie sich auf einen attraktiven, unbefristeten Arbeitsplatz in Niebll, nahe der Nordseeinsel Sylt.Nette Kollegen und weitere Benefits warten auf Sie.Fr telefonische Vorabinformationen stehen wir Ihnen gerne zur Verfgung.Aussagekrftige Bewerbungsunterlagen inkl. Gehaltsvorstellung und frhestem Eintrittstermin mailen Sie uns bitte als PDF an m.schlueter(at)msp-nord.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/msp-nord-gmbh\/it-systemadministrator-in-niebull-76075","tags":["IT"],"job_types":[],"location":"Niebüll","created_at":1702820945000},{"slug":"regulatory affairs specialist international freiburg im breisgau ","company_name":"Kopani Consulting GmbH","title":"Regulatory Affairs Specialist (m\/w\/x) International","description":"Unser Kunde ist ein global agierendes, mittelstndisches Familienunternehmen der Medizintechnik mit Sitz in Freiburg. Das Unternehmen geniet einen exzellenten Ruf fr seine innovativen Technologien und hochwertigen Produkte. Aufgrund seines bestndigen Wachstums suchen wir einen Regulatory Affairs Specialist (m\/w\/x) International.AufgabenErstellung und Bearbeitung internationaler Zulassungsdossiers fr MedizinprodukteDurchfhrung von internationalen Registrierungen fr Medizinprodukte aller Klassifizierungen, in Zusammenarbeit mit lokalen VertretungenBetreuung und Pflege bestehender ZulassungenPflege einer ProduktzulassungsdatenbankAnsprechpartner fr die Lnder im ZustndigkeitsbereichVorbereitung von Dokumenten fr Beglaubigung und LegalisationIdentifikation der regulatorischen Anforderungen fr weltweite ZulassungenAnalyse und Bewertung von regulatorischen nderungen und Entwicklungen im Zusammenhang mit den betreuten LndernUntersttzung bei der Umsetzung regulatorischer Anforderungen ber die gesamte ProzessketteQualifikationWissenschaftliches oder technisches Studium oder BerufsausbildungErfahrung im Bereich aktive Medizintechnik und Regulatory AffairsSehr gute Kommunikationsfhigkeit und Freude am internationalen AustauschSehr gute Englisch- und Deutschkenntnisse (mind. C1) in Wort und SchriftKenntnisse im Umgang mit ERP-Systemen (SAP) von VorteilBenefitsEin individuelles Einarbeitungsprogramm mit jhrlichem Budget fr WeiterbildungenFlexible Arbeitszeiten und die Mglichkeit, bis zu 60% im Homeoffice zu arbeitenDurch das kontinuierliche Wachstum des Unternehmens stehen Ihnen langfristige Entwicklungsmglichkeiten und ein zukunftssicherer Arbeitsplatz zur VerfgungKostenlose Yoga- und EnglischkurseFlache Hierarchien, ein attraktives Gehalt und eine gelebte Open-Door-Policy tragen zu einer angenehmen Arbeitsatmosphre beiKopani Consulting ist eine Personalberatung mit ber zehn Jahren Erfahrung in der Rekrutierung und Beratung von Spezialisten und Fhrungskrften aus der Pharmaindustrie und Medizintechnikbranche. Aufgrund dieser Erfahrung knnen wir Fachexperten und Kunden individuell und diskret untersttzen. Schicken Sie uns bitte Ihre aussagekrftigen Bewerbungsunterlagen inkl. Gehaltswunsch und frhestmglichen Starttermin an Justus Windwehr.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/kopani-consulting-gmbh\/regulatory-affairs-specialist-international-freiburg-im-breisgau-202327","tags":["Engineering"],"job_types":["berufserfahren"],"location":"Freiburg im Breisgau","created_at":1702817345000},{"slug":"2500eur telefonischer kundenberater zahnzusatzversicherung hamburg ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Telefonischer Kundenberater m\/w\/d  Zahnzusatzversicherung","description":"Zur Untersttzung des Kundenmangement-Teams im Bereich Zahnzusatzversicherung werden Call Center Agent, Telefonische Kundenbetreuer m\/w\/d im Kundenservice in Hamburg gesucht.Als Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d erwartet Sie:AufgabenBeratung von Bestands- und Neukunden zum Thema Zahnzusatzversicherungen per Telefon und E-Mail (keine Kaltakquise)Erstellung von individuellen Angeboten fr den Zahnzusatz-BereichErfassung und Pflege von Kundendaten sowie Verantwortung von AntrgenSchnittstellenfunktion zwischen Kunden und VersicherungsgesellschaftenUntersttzung bei der permanenten Weiterentwicklung des VergleichsangebotsQualifikationKaufmnnische Ausbildung (z.B. Brokaufmann\/-kauffrau oder Versicherungsfachmann-\/frau) oder auch gerne VersicherungsquereinsteigerErsteErfahrung in der KundenberatungHohe Kundenorientierung sowie sicheres und freundliches Auftreten am TelefonEigenverantwortliche, gewissenhafte und strukturierte ArbeitsweiseHands-on-Mentalitt und Umsetzungsstrke mit DetailorientierungBegeisterung fr digitale GeschftsmodelleBenefitsunbefristeter ArbeitsvertragArbeitszeiten von Montag bis Freitag zwischen 8-20 UhrGehalt 30-32 kIntensive und individuelle EinarbeitungFachgerechte Qualifikation im KrankenversicherungsbereichEigenverantwortliches Arbeiten in einem dynamischen ArbeitsumfeldZentraler Standort mit ausgezeichneter Verkehrsanbindung und Blick auf die AlsterZuschuss zur HVV ProfiCardIndividuelle Entwicklungs- und WeiterbildungsmglichkeitenFreundschaftliches Arbeitsumfeld mit Duz-Kultur,gemeinsamen Mittagspausen und vielen TeameventsHaben wir Ihr Interesse geweckt? Dann freuen wir uns auf Ihre Bewerbung. Gerne knnen sie sich per Mail oder WhatsApp bewerben.Bei Fragen steht Ihnen Ivonne Wresch gerne zur Verfgung.0152\/33605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-180595","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702813742000},{"slug":"2500eur telefonischer kundenberater zahnzusatzversicherung hamburg ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Telefonischer Kundenberater m\/w\/d  Zahnzusatzversicherung","description":"Zur Untersttzung des Kundenmangement-Teams im Bereich Zahnzusatzversicherung werden Call Center Agent, Telefonische Kundenbetreuer m\/w\/d im Kundenservice in Hamburg gesucht.Als Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d erwartet Sie:AufgabenBeratung von Bestands- und Neukunden zum Thema Zahnzusatzversicherungen per Telefon und E-Mail (keine Kaltakquise)Erstellung von individuellen Angeboten fr den Zahnzusatz-BereichErfassung und Pflege von Kundendaten sowie Verantwortung von AntrgenSchnittstellenfunktion zwischen Kunden und VersicherungsgesellschaftenUntersttzung bei der permanenten Weiterentwicklung des VergleichsangebotsQualifikationKaufmnnische Ausbildung (z.B. Brokaufmann\/-kauffrau oder Versicherungsfachmann-\/frau) oder auch gerne VersicherungsquereinsteigerErsteErfahrung in der KundenberatungHohe Kundenorientierung sowie sicheres und freundliches Auftreten am TelefonEigenverantwortliche, gewissenhafte und strukturierte ArbeitsweiseHands-on-Mentalitt und Umsetzungsstrke mit DetailorientierungBegeisterung fr digitale GeschftsmodelleBenefitsunbefristeter ArbeitsvertragArbeitszeiten von Montag bis Freitag zwischen 8-20 UhrGehalt 30-32 kIntensive und individuelle EinarbeitungFachgerechte Qualifikation im KrankenversicherungsbereichEigenverantwortliches Arbeiten in einem dynamischen ArbeitsumfeldZentraler Standort mit ausgezeichneter Verkehrsanbindung und Blick auf die AlsterZuschuss zur HVV ProfiCardIndividuelle Entwicklungs- und WeiterbildungsmglichkeitenFreundschaftliches Arbeitsumfeld mit Duz-Kultur,gemeinsamen Mittagspausen und vielen TeameventsHaben wir Ihr Interesse geweckt? Dann freuen wir uns auf Ihre Bewerbung. Gerne knnen sie sich per Mail oder WhatsApp bewerben.Bei Fragen steht Ihnen Ivonne Wresch gerne zur Verfgung.0152\/33605774Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-telefonischer-kundenberater-zahnzusatzversicherung-hamburg-135784","tags":["Customer Service"],"job_types":[],"location":"Hamburg","created_at":1702813742000},{"slug":"telefonischer kundenbetreuer 2pro woche home office schichtzulagen ab  uhr munster ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"Telefonischer Kundenbetreuer m\/w\/d 2*pro Woche Home Office Schichtzulagen ab 18 Uhr","description":"Wollen Sie als Kundenbetreuer m\/w\/d fr ein Hotelvergleichsportal arbeiten?Als Kundenberater m\/w\/d erwartet Sie:AufgabenSie betreuen die Kunden bei Fragen und Problemen am Telefon oder per Mail und kmmern sich dabei professionell und freundlich um eine schnelle und zufriedenstellende LsungSie sind verantwortlich fr die fachliche Prfung und Bewertung von KundenanliegenSie stellen die zgige Abwicklung und den Abschluss der Kundenanfragen in enger Zusammenarbeit mit den nationalen und internationalen Partnern sicherSie haben stets ein offenes Ohr fr die Kunden und schaffen es, bei Rckfragen zu Buchungen  per Telefon und E-Mail  kulante Lsungen zur Zufriedenheit der Kunden zu findenGemeinsam mit dem Team wirken Sie an der internen Qualittssicherung mit, um eine fehlerfreie Bearbeitung sicherzustellenZur Weiterentwicklung der internen Prozesse, arbeiten Sie eng mit den Experten zusammenQualifikationBerufserfahrung im Dialogmarketing, in der Touristik \/ Hotelbranche (z.B. Reservierungsabteilung) oder im telefonischen KundenkontaktIdealerweise bringen Sie eine abgeschlossene Ausbildung im kaufmnnischen oder touristischen Bereich mitIn Beratungsgesprchen mit den Kunden zeichnen Sie sich durch ein freundliches, serises und lsungsorientiertes Auftreten aus  Sie bringt so schnell nichts aus der RuheSie sind ein echter Teamplayer (m\/w\/d), haben Spa am gemeinsamen Erfolg und bringen eigene Ideen einSchriftlich und mndlich berzeugen Sie mit verhandlungssicheren Deutschkenntnissen sowie mit sicheren EnglischkenntnissenVersierter Umgang mit den gngigen PC- und InternetanwendungenZeitliche Flexibilitt Randarbeitszeiten zwischen 8 und 22 Uhr abzudecken (Frh-\/Mittel-\/Sptschicht) sowie Bereitschaft zur Arbeit an Wochenenden und Feiertagen (5-Tage-Woche)Benefitsunbefristeter Arbeitsvertrag, eine attraktive Vergtung fr Wochenend-, Feiertags- und Sptschichten sowie jhrliche Prmien fr besondere Erfolge. Die bernahme von Verantwortung wird zustzlich honoriert (z.B. Wochenend-Schichtleitung). Eine bezuschusste betriebliche Altersvorsorge und viele weitere Vergnstigungen gibt es obendrauf.Der Schichtplan wird, unter der Bercksichtigung von Wnschen, mind. vier Wochen im Voraus erstellt. Gerarbeitet wird 3 Tage die Woche gemeinsam im Office  an den brigen 2 Tagen ist mobiles Arbeiten mglich (Home Office).Einen Laptop fr mobiles Arbeiten, zwei Bildschirme oder individuelles Equipment wie eine ergonomische Maus oder Noise-Cancelling-Kopfhrer? Kein Problem!Individuelle Frderung durch Fortbildungen sowie regelmige Feedbackgesprche. Durch ein starkes und nachhaltiges Wachstum werden langfristige Perspektiven in der Fach- und Fhrungslaufbahn geboten.Zentraler Standort direkt am Stadthafen. Dank Zuschuss zum Job-\/Deutschlandticket und Fahrrad-\/ eBike-Leasing kommen Sie klimaneutral und gnstig ins Bro.Kostenlose Getrnke, Msli und frisches Obst sorgen fr Energie. Mehrmals wchentlich gibt es ein kostenloses, abwechslungsreiches Mittagessen.Attraktives Sportprogramm durch einen Personaltrainer: Halten Sie sich fit durch Yoga, Rckenfit, Bootcamp-Training oder auch zwischendurch in der Bewegten Pause.Es herrscht ein kollegiales und freundschaftliches Umfeld. Bei regelmigen Office Partys, Teamevents und Sommer- und Weihnachtsfeier feiern wir zusammen.Haben wir ihr Interesse geweckt? Dann freuen wir uns auf ihre Bewerbung. Gerne auch per Whats App 015233605774Ivonne Wresch steht Ihnen gerne bei Fragen zur Verfgung. 01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/telefonischer-kundenbetreuer-2pro-woche-home-office-schichtzulagen-ab-18-uhr-munster-175780","tags":["Customer Service"],"job_types":[],"location":"Münster","created_at":1702813742000},{"slug":" 2800eur provision sales agent telefonischer kundenberater berlin ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2800€ + Provision Sales Agent\/Telefonischer Kundenberater m\/w\/d","description":"Mchten Sie fr ein internationales Unternehmen arbeiten, das einer der marktfhrenden unabhngigen Dienstleister im Bereich von Tankkartenlsungen in Deutschland ist?Gesucht werden Telefonische Kundenberater, Sales Agent, Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d im Outbound, Kundenservice.Das Team in Berlin wird erweitert und Sie knnen als Telefonischer Kundenberater (m\/w\/d) fr den Vertriebsinnendienst ttig sein.Als Telefonische Kundenberater, Sales Agent, Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d erwartet Sie:AufgabenKundenberatung  Inbound- und Outbound- Telefonie (B2B)Angebotserstellung und BearbeitungBestandskundenbetreuung (B2B)E-Mail- und Faxbearbeitung QualifikationFhigkeit im Team zu arbeitenFreundliches AuftretenErfahrung im Vertrieb  idealerweise im TelefonvertriebLoyalittEffiziente, schnelle ArbeitsweiseKenntnisse bei PC-Anwendungen und Office-Programmenverhandlungssichere DeutschkenntnisseBenefitsFixgehalt (verhandelbar, mind. 2300 - 2800 ) plus ungedeckelten Bonus (im Schnitt 300-500 im ersten Quartal), bei Erreichung von Quartalszielen steigt das Grundgehalt und die BonuszahlungenAngenehmes Bro in 10117 Berlin (Nhe S-Bahnhof Friedrichstrae)Arbeitszeiten von Montag bis Donnerstag 08:30  16:45 Uhr am Freitag bis 15 Uhr (37,5 Stunden)Entwicklungsmglichkeiten in einem internationalen KonzernBewerbungHaben wir Ihr Interesse geweckt? Wir freuen uns auf Ihre Bewerbungsunterlagen. Gerne per Mail oder per WhatsApp.Ivonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2800eur-provision-sales-agent-telefonischer-kundenberater-berlin-429383","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702813742000},{"slug":"2500eur mitarbeiter terminierung berlin ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Mitarbeiter m\/w\/d Terminierung","description":"Mchten Sie fr ein internationales Unternehmen arbeiten, das einer der marktfhrenden unabhngigen Dienstleister im Bereich von Tankkartenlsungen in Deutschland ist?Gesucht werden Telefonische Kundenberater, Call Center Agent, Telefonischer Kundenbetreuer m\/w\/d im Bereich Bestandskunden.Als Telefonische Kundenbetreuer, Call Center Agent, Telefonischer Kundenberater m\/w\/d erwartet Sie:AufgabenKundenzufriedenheitsbefragungBedarfsermittlungTerminierung fr das Sales TeamQualittsmanagementErweiterung des eigenen Portfolios durch Kundenbindung und KundenempfehlungenQualifikationIdealerweise bereits erste oder mehrjhrige Erfahrung in der Bestandskundenbetreuung und in der TelefonieKommunikationsstrke, Begeisterungs- und Teamfhigkeitgute Selbstorganisationgute MS-Office-KenntnisseVerhandlungssichere DeutschkenntnisseBenefits2500 (verhandelbar)Angenehmes Bro in 10117 Berlin (Nhe S-Bahnhof Friedrichstrae)Arbeitszeiten von Montag bis Donnerstag 08:30  16:45 Uhr am Freitag bis 15 Uhr (37,5 Stunden)Entwicklungsmglichkeiten in einem internationalen KonzernBewerbungHaben wir Ihr Interesse geweckt? Wir freuen uns auf Ihre Bewerbungsunterlagen. Gerne per Mail oder per WhatsApp.Ivonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-mitarbeiter-terminierung-berlin-217588","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702813742000},{"slug":" 2600eur 500eur bonus telefonische kundenbetreuer berlin ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2300-2600€ + 500€ Bonus Telefonische Kundenbetreuer m\/w\/d","description":"Mchte Sie fr ein internationales Unternehmen arbeiten, das zu den marktfhrenden unabhngigen Dienstleistern im Bereich von Tankkartenlsungen in Deutschland gehrt?Das Team in Berlin wird erweitert und gesucht werden Kundenbetreuer\/Sachbearbeiter m\/w\/d im Inbound.AufgabenKundenbetreuungAngebotserstellung und BearbeitungFallabschlieende Bearbeitung aller KundenanfragenE-Mail- und FaxbearbeitungSchnittstelle zu anderen AbteilungenQualifikationFhigkeit im Team zu arbeitenFreundliches AuftretenAngenehme StimmeDeutschkenntnisse in Wort und Schrift auf muttersprachlichem NiveauEffiziente, schnelle ArbeitsweiseSpa am TelefonierenMS-Office Kenntnisse insbesondere Exvelgute Englischkenntnisse fr die interne KommunikationBenefits2300  2600  brutto (verhandelbar  Berufserfahrung) zzgl. 500 BonusAngenehmes BroNhe FriedrichstraeArbeitszeiten von Mo-Do 08:30  17 Uhr, Freitag bis 15 Uhr  Vollzeit 37,5 StundenEntwicklungsmglichkeiten in einem internationalen KonzernBewerbung:Wir freuen uns auf Ihre Bewerbung per Mail oder WhatsAppIvonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2300-2600eur-500eur-bonus-telefonische-kundenbetreuer-berlin-184745","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702813742000},{"slug":"2500eur call center agent mo fr  stunden berlin ","company_name":"W&W Human Resources -  Ivonne Wresch -","title":"2500€ Call Center Agent m\/w\/d Mo-Fr 37,5 Stunden","description":"Mchten Sie fr ein internationales Unternehmen arbeiten, das einer der marktfhrenden unabhngigen Dienstleister im Bereich von Tankkartenlsungen in Deutschland ist?Das Team in Berlin wird erweitert und gesucht werden Call Center Agent, Sachbearbeiter, Telefonische Kundenberater m\/w\/d im - Kundenservice - kein Call Center.Als Call Center Agent, Sachbearbeiter, Telefonische Kundenbetreuer m\/w\/d erwartet Sie:AufgabenAccount MangementKundenbetreuungKundenberatungKundenrckgewinnungAngebotserstellung und BearbeitungFallabschlieende Bearbeitung aller KundenanfragenQualifikationFhigkeit im Team zu arbeitenFreundliches AuftretenAngenehme StimmeDeutschkenntnisse in Wort und Schrift auf muttersprachlichem NiveauEffiziente, schnelle ArbeitsweiseKenntnisse bei PC-Anwendungen und Office-ProgrammenSpa am TelefonierenBenefits2500  - 3000 Angenehmes Bro  Nhe FriedrichstraeArbeitszeiten von Mo-Do 08:30  17 Uhr, Freitag bis 15 Uhr  Vollzeit 37,5 StundenEntwicklungsmglichkeiten in einem internationalen KonzernBewerbung:Wir freuen uns auf Ihre Bewerbung per Mail oder WhatsAppIvonne WreschW & W Human Resources01523\/3605774Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/ww-human-resources-ivonne-wresch\/2500eur-call-center-agent-mo-fr-375-stunden-berlin-107845","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702813742000},{"slug":"junior produktmanager marking neu isenburg ","company_name":"HoPa Talents","title":"Junior Produktmanager (m\/w\/d) Marking","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenProduktspezialist gegenber unseren KundenTechnischer Support fr unsere Kunden und internen VertriebsteamsDurchfhrung von AnwendungstestsOrganisation und Durchfhrung von TrainingsveranstaltungenUntersttzung bei Produkteinfhrungen und InbetriebnahmeQualifikationEin staatlich geprfter Techniker, ein abgeschlossenes Studium oder vergleichbarSicherer Umgang mit MS-OfficeErfahrungen im Bereich ElektrotechnikSehr gute Deutsch- und EnglischkenntnisseHohe technische AffinittBenefitsAb dem ersten Tag bist du ein fester Bestandteil des Teams mit eigenen Aufgaben. Du wirst von deinen Kollegen in den Arbeitsalltag eingefhrt und an die Hand genommenIn unserer internen ACADEMY nutzen wir die Strken unserer Mitarbeiter, um uns in der tglichen Arbeit zu verbessern und ber Abteilungsgrenzen hinaus Zusammenarbeit zu frdern. Dazu gehrt u.a. richtiges Telefonieren, IT-Trainings und auch KommunikationscoachingsDu bestimmst das Tempo: Befrderungen sind halbjhrlich mglich, es kann sehr schnell gehen und nach 3-4 Jahren hast du schon die Chance auf erste FhrungsverantwortungWir besetzen unsere Fhrungskrfte aus den eigenen Reihen. Somit hast du deine Karriere in der eigenen Hand. Dabei geht unser Geschftsfhrer als bestes Beispiel voran. Er erinnert sich heute noch an die Zeit als Junior Sales Manager mit Sensorkoffer in Tokio zurckDich erwarten ein unbefristeter Arbeitsvertrag mit 30 Tagen Urlaub pro Jahr und Sonderurlaub fr auergewhnliche Lebensereignisse Bei uns gibt es ein transparentes Gehaltssystem, damit uns jederzeit klar ist wo die Reise hingeht. Die Hhe der jhrlichen Gehaltssteigerung bestimmst du durch deine eigene LeistungWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Ihr HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/junior-produktmanager-marking-neu-isenburg-169499","tags":["Engineering"],"job_types":[],"location":"Neu-Isenburg","created_at":1702810143000},{"slug":"software tester stockelsdorf ","company_name":"HoPa Talents","title":"Software Tester (m\/w\/d)","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenDurchfhrung von manuellen und automatisierten Softwaretests im C# - UmfeldErstellung von Testspezifikationen, Testplnen und TestfllenSicherstellen einer hohen Code Qualitt durch die Analyse der Testergebnisse und anschlieende Optimierung der LsungenDurchfhrung einer entwicklungsbegleitenden Qualittssicherung und Dokumentation Weiterentwicklung und Optimierung der Test-Tools und -ProzesseUntersttzung beim Review von AnforderungenEnge Kommunikation und Zusammenarbeit mit dem Product Owner und den Entwickler*innenQualifikationErfolgreich abgeschlossene Ausbildung zum Fachinformatiker (m\/w\/d), abgeschlossenes Studium der (Wirtschafts-)Informatik o. .Mehrjhrige Berufserfahrung als Software TesterIdealerweise gute Kenntnisse in C# und erste ProgrammiererfahrungenZertifizierung ISTQB Foundation LevelSehr gute Kenntnisse in MS OfficeHohes Engagement, Teamfhigkeit und Kommunikationsvermgen sowie Technikaffinitt und eine genaue ArbeitsweiseQualittsbewusstsein und logisches DenkvermgenSehr gute Deutsch und gute Englischkenntnisse in Wort und SchriftBenefitsPerspektivenvielfalt durch eine groe Vielzahl an Branchen und KundenEin internationales und kollegiales ArbeitsumfeldFlexibles Arbeitsmodell  Optimale Vereinbarkeit von Privatleben und BerufIndividuelle Weiterbildung sowie vierteljhrliche Feedback- und EntwicklungsgesprcheVerschiedene Laufbahnmodelle (Fach-, Experten- und\/oder Fhrungslaufbahn) passend zu Ihren individuellen Strken und Ambitionenbergesetzliche Zuschsse zur betrieblichen Altersvorsorge sowie Corporate Benefits Plattform mit exklusiven Mitarbeiterrabatten fr zahlreiche ShopsFr Ihre Gesundheit: ergonomische Arbeitspltze, aktive Pause whrend der Arbeitszeit, wechselnde Angebote durch die betriebliche Gesundheitsfrderung, verschiedene FirmensportgruppenWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/software-tester-stockelsdorf-463178","tags":["IT"],"job_types":[],"location":"Stockelsdorf","created_at":1702810143000},{"slug":"softwareentwickler anwendungsentwickler stockelsdorf ","company_name":"HoPa Talents","title":"Softwareentwickler \/ Anwendungsentwickler (m\/w\/d)","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenUnsere Software bernimmt alles von der Bildaufnahme und Datenerfassung bis zur vollautomatischen Auswertung und Datenspeicherung auf unseren ServersystemenWeiterentwicklung der Produkte in unserem Software-kosystemUmsetzung kundenspezifischer Softwaremodule und -anpassungenEinbindung in die Prozesse der Konzeption, Entwicklung und der Inbetriebnahme beim KundenIntegration von Hardwarekomponenten (z.B. zur Bilderfassung oder Rntgensteuerung)Schnittstelle zum Kunden, anderen Abteilungen und externen DienstleisternQualifikationAbgeschlossene Ausbildung als Fachinformatiker fr Anwendungsentwicklung oder ein abgeschlossenes Studium im Bereich Informatik, Softwareentwicklung oder eine hnliche Ausbildung mit mind. 3 Jahren Berufserfahrung im beschriebenen AufgabenbereichSehr gute Programmierkenntnisse in C#\/WPFKenntnisse in Xamarin (Plattformbergreifende App-Entwicklung) wnschenswertKenntnisse im Bereich Webentwicklung, Webserver wnschenswertSystematische, strukturierte und lsungsorientierte Denk- und Arbeitsweise sowie eine ausgeprgte Team- und KommunikationsfhigkeitHohes Qualittsbewusstsein gepaart mit Innovationsfreude und KreativittSehr gute Deutsch- und gute EnglischkenntnisseBenefitsPerspektivenvielfalt durch eine groe Vielzahl an Branchen und KundenEin internationales und kollegiales ArbeitsumfeldFlexibles Arbeitsmodell  Optimale Vereinbarkeit von Privatleben und BerufIndividuelle Weiterbildung sowie vierteljhrliche Feedback- und EntwicklungsgesprcheVerschiedene Laufbahnmodelle (Fach-, Experten- und\/oder Fhrungslaufbahn) passend zu Ihren individuellen Strken und Ambitionenbergesetzliche Zuschsse zur betrieblichen Altersvorsorge sowie Corporate Benefits Plattform mit exklusiven Mitarbeiterrabatten fr zahlreiche ShopsFr Ihre Gesundheit: ergonomische Arbeitspltze, aktive Pause whrend der Arbeitszeit, wechselnde Angebote durch die betriebliche Gesundheitsfrderung, verschiedene FirmensportgruppenWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Ihr HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/softwareentwickler-anwendungsentwickler-stockelsdorf-303085","tags":["IT"],"job_types":[],"location":"Stockelsdorf","created_at":1702810143000},{"slug":"service engineer hamelin ","company_name":"HoPa Talents","title":"SERVICE ENGINEER (M\/W\/D)","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenInbetriebnahme, Strungsbeseitigung und Grundberholung von GetriebenSelbstndige und eigenverantwortliche Inbetriebnahme von Getrieben (Neubau- und Servicegetrieben) einschlielich entsprechender Dokumentation.Strungsbeseitigung und GrundberholungSelbstndige FehlersucheAnalyse und Bewertung von Getriebestrungen, Entwicklung eines entsprechenden Manahmenkonzeptes, Einleitung entsprechender AktivittenDurchfhrung der Demontage, Remontage, Reparatur, Grundberholung vor Ortberprfung von Teilen auf Beschdigungen und WiederverwendbarkeitDisposition und berwachung von Fremdwerksttten und beigestellten Helfern und Hilfsmitteln (Krne\/Hebezeuge, Anschlagmittel usw.)Erstellen eines qualifizierten MontageberichtesQualifikationabgeschlossene mindestens 3-jhrige fachbezogene Ausbildung als Industriemechaniker und eine zustzlich auf den Betrieb bezogene WeiterbildungBerufserfahrung in der GetriebemontageKenntnisse in Elektrotechnik und SteuerungenMS-Office-Kenntnissegute Englischkenntnisse in Wort und Schriftallgemeine Schiffbau- bzw. Schiffsbetriebskenntnisse sind von Vorteil uneingeschrnkte Flug- und TropentauglichkeitBenefits35h Woche Tarifvertrag Vermgenswirksame Leistungen Betriebliche Altersvorsorge Kantine Betriebs-Kita Sport- und FitnessangeboteWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/service-engineer-hamelin-271113","tags":["Engineering"],"job_types":[],"location":"Hamelin","created_at":1702810143000},{"slug":"servicetechniker sonderanlagenbau stockelsdorf ","company_name":"HoPa Talents","title":"Servicetechniker (m\/w\/d) Sonderanlagenbau","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenInstallation industrieller Rntgenanlagen bei unseren KundenWartung und Instandhaltung industrieller Rntgenanlagen bei unseren KundenRetrofit bei bestehenden Rntgenanlagen unserer KundenDurchfhrung von Kundenschulungen und AbnahmenTelefonische Kundenbetreuung im FehlerfallInbetriebnahmen im WerkStrahlenschutzmessungen im Werk sowie vor Ort bei unseren KundenInternationale ReisettigkeitSelbstndige Vor- und Nachbereitung von ServiceeinstzenQualifikationAusbildung als Elektroniker\/in -Betriebstechnik, Elektroinstallateur\/in, Mechatroniker\/in odervergleichbarMehrjhrige Berufserfahrung im Service mit internationaler ReisettigkeitErfahrung im Sonderanlagenbau wnschenswertSehr gute elektrische Kenntnisse und mechanische GrundkenntnisseSiemens TIA Portal und Starter Kenntnisse wnschenswertMS Office (MS Word, MS Excel, MS Outlook)Verhandlungssicheres Auftreten, Kommunikationsstrke sowie eine ausgeprgte Kunden-und ServiceorientierungVerantwortungsbewusste und selbstndige ArbeitsweiseSehr gute Deutsch- und gute EnglischkenntnisseBenefitsPerspektivenvielfalt durch eine groe Vielzahl an Branchen und KundenEin internationales und kollegiales ArbeitsumfeldIndividuelle Weiterbildung sowie vierteljhrliche Feedback- und EntwicklungsgesprcheVerschiedene Laufbahnmodelle (Fach-, Experten- und\/oder Fhrungslaufbahn) passend zu Ihren individuellen Strken und Ambitionenbergesetzliche Zuschsse zur betrieblichen Altersvorsorge sowie Corporate BenefitsPlattform mit exklusiven Mitarbeiterrabatten fr zahlreiche ShopsFr Ihre Gesundheit: ergonomische Arbeitspltze, aktive Pause whrend der Arbeitszeit,wechselnde Angebote durch die betriebliche Gesundheitsfrderung, verschiedene FirmensportgruppenWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Ihr HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/servicetechniker-sonderanlagenbau-stockelsdorf-48867","tags":["Remote","Engineering"],"job_types":[],"location":"Stockelsdorf","created_at":1702810143000},{"slug":"technischer produkttrainer nuremberg ","company_name":"HoPa Talents","title":"Technischer Produkttrainer (m\/w\/d)","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenTechnischer Hauptansprechpartner fr KundenSchnittstelle zwischen Kunden, Vertrieb und TechnikteamInbetriebnahme, Einweisung und Schulung der Hard- und Software beim KundenErarbeitung von Applikationslsungen und Evaluierung von OptimierungspotenzialApplikationslsungen mit dem 3D-Messscanner erarbeiten und diese sowohl intern alsauch gegenber Kunden prsentieren und vermittelnErstellung von Schulungsunterlagen fr interne und externe KundentrainingsQualifikationAbgeschlossenes technisches Studium, Ausbildung oder Weiterbildung zum staatlichgeprften Techniker (m\/w\/d)PKW-FhrerscheinDir gefllt ein Mix aus Broarbeit und Reisettigkeit (ca. 50 Prozent)Sehr gute Deutsch- und EnglischkenntnisseDu bist begeistert von technischen Produkten und interessiert an wirtschaftlichenZusammenhngenBenefitsab dem ersten Tag fester Bestandteil des TeamsWeiterbildungsmglichkeiten in der internen Academyvielseitige Entwicklungs- und Befrderungeschancen Frhugskrfte werden aus den eigenen Reigen besetzttransparentes Gehaltssystem regelmige Bonuszahlungen unbefristeter Arbeitsvertrag und 30 Tage Urlaub attraktiver Firmenwagen mit Tankkarte auch zur privaten NutzungWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Ihr HoPa Talents TeamFind more English Speaking Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/technischer-produkttrainer-nuremberg-480107","tags":["Remote","Engineering"],"job_types":[],"location":"Nuremberg","created_at":1702810143000},{"slug":"inbetriebnahme servicetechniker mit fachrichtung maschinenbau im bereich sondermaschinenbau fur die draht und kabelindustrie dusseldorf ","company_name":"HoPa Talents","title":"Inbetriebnahme- \/ Servicetechniker (m\/w\/d) mit Fachrichtung Maschinenbau im Bereich Sondermaschinenbau für die Draht- und Kabelindustrie","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenInstallation, Funktionsprfung sowie Endabnahme von Draht- und Kabelpro-duktionsanlagen am PrffeldDurchfhrung bzw. Koordination der Anlagenaufstellung und -inbetriebnahmesowie technische Kundenabnahme im In- und AuslandMitwirkung bei der Verbesserung und Weiterentwicklung der Anlagen in enger Zusammenarbeit mit den KonstruktionsabteilungenEinweisung des Bedien- und WartungspersonalsDurchfhrung von Anlageninspektionen, Reparaturen und ServicearbeitenQualifikationAbgeschlossene Ausbildung zum Industriemechaniker (m\/w\/d) oder vergleich-bar mit Weiterbildung zum Industriemeister \/ Maschinenbautechniker (m\/w\/d) bzw. eine hnliche Berufsausbildung mit mehrjhriger Berufserfahrung Kenntnisse im Sondermaschinenbau fr die Draht- und Kabelindustrie von VorteilHohe Bereitschaft zum Auendienst weltweit und zu flexibler ArbeitszeitgestaltungGute Englischkenntnisse in Wort und SchriftKommunikations- und TeamfhigkeitBenefitsAttraktive Verdienstmglichkeiten durch Sonderleistungen im AuendienstIndividuelle Einarbeitung fr die bevorstehenden Aufgaben mitanschlieendem Freiraum fr eigene InitiativenKontinuierliche Aus- und Weiterbildung unserer Mitarbeiterinnen und MitarbeiterEine niedrige Mitarbeiterfluktuation aufgrund unseres positiven undmotivierenden Arbeitsklimas Familienunternehmen und Traditionsbetrieb mit InnovationsgeistStetig hohe Investitionen in die Entwicklung neuer, innovativer Produkte sowie in Maschinen, Organisationsmittel und Einrichtungen zur EffizienzsteigerungSehr gute Arbeitsbedingungen in einem Arbeitsumfeld, das sich technologischauf dem neuesten Stand befindetWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Ihr HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":true,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/inbetriebnahme-servicetechniker-mit-fachrichtung-maschinenbau-im-bereich-sondermaschinenbau-fur-die-draht-und-kabelindustrie-dusseldorf-313687","tags":["Remote","Engineering"],"job_types":[],"location":"Düsseldorf","created_at":1702810143000},{"slug":"projektleiter stockelsdorf ","company_name":"HoPa Talents","title":"Projektleiter (m\/w\/d)","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenProjektleitung von industriellen RntgensystemenSchnittstellenfunktion zwischen technischen und kaufmnnischen Abteilungen Zentrale Ansprechperson fr unsere internationalen Kunden und internationalen HandelsvertreterKoordination der Projekte in allen BelangenErstellen von Projektplnen und Abwicklung von Auftrgenberwachung von Budget- und ZeitplnenBeobachtung und Beurteilung von Projektrisiken sowie Einleitung von Manahmen Steuerung und Koordination des Projektteams in Abstimmung mit den AbteilungsleitungenDurchfhrung, Moderation und Dokumentation der ProjektmeetingsQualifikationErfolgreich abgeschlossenes technisches Studium oder Weiterbildung zum TechnikerBerufserfahrung im Projektgeschft und ein breites technisches Grundverstndnis Kenntnisse im Projektmanagement im Maschinen- oder Anlagenbau sind von VorteilIdealerweise Erfahrung im Sonderanlagenbau Organisationstalent und Flexibilitt, Belastbarkeit auch in herausfordernden SituationenBetriebswirtschaftliches Denken, Verantwortungs- und Qualittsbewusstsein Eigenverantwortliches, selbststndiges und lsungsorientiertes Arbeiten Selbstbewusste Persnlichkeit mit berzeugungskraft und hervorragenden kommunikativen FhigkeitenRoutinierter Umgang mit dem MS Office-PaketVerhandlungssichere Deutsch- und EnglischkenntnisseBenefitsPerspektivenvielfalt durch eine groe Vielzahl an Branchen und KundenEin internationales und kollegiales ArbeitsumfeldFlexibles Arbeitsmodell  Optimale Vereinbarkeit von Privatleben und BerufIndividuelle Weiterbildung sowie vierteljhrliche Feedback- und EntwicklungsgesprcheVerschiedene Laufbahnmodelle (Fach-, Experten- und\/oder Fhrungslaufbahn) passend zu Ihren individuellen Strken und Ambitionenbergesetzliche Zuschsse zur betrieblichen Altersvorsorge sowie Corporate Benefits Plattform mit exklusiven Mitarbeiterrabatten fr zahlreiche ShopsFr Ihre Gesundheit: ergonomische Arbeitspltze, aktive Pause whrend der Arbeitszeit, wechselnde Angebote durch die betriebliche Gesundheitsfrderung, verschiedene FirmensportgruppenWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Ihr HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/projektleiter-stockelsdorf-476914","tags":["Engineering"],"job_types":[],"location":"Stockelsdorf","created_at":1702810143000},{"slug":"kfz mechaniker kfz mechatroniker grossbeeren ","company_name":"HoPa Talents","title":"KFZ-Mechaniker \/ KFZ-Mechatroniker (m\/w\/d)","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenWartung, Instandsetzung und Reparatur herstellerunabhngiger Nutzfahrzeuge sowie deren Aufbauten inkl. Schwei- und RichtarbeitenFehlerdiagnose mit modernen Diagnosegerten an verschiedenen mechanischen, elektronischen, hydraulischen und pneumatischen SystemenMontage von Fahrzeugteilen und bliche Ttigkeiten in der WerkstattQualifikationAusbildung zum KFZ-Mechaniker, -Mechatroniker, -Schlosser oder Metallbauer (vorzugsweise mit Schwerpunkt Nutz- und landwirtschaftliche Fahrzeuge) oder eine vergleichbare Qualifikation mit Berufserfahrung  Quereinsteiger sind willkommenErste Erfahrung mit Nutzfahrzeugen (LKW, Trucks, Trailer) wnschenswertHandwerkliches Geschick und technisches GrundverstndnisEine ordentliche Portion gesunder Humor :)BenefitsUnbefristeter Arbeitsvertrag nach der ProbezeitVerdienst: Attraktives Gehaltspaket30 Tage Urlaub im JahrBezuschusste betriebliche AltersvorsorgeEmpfehlungsprmie von bis zu 3.000 EuroGeregelte Arbeitszeiten je 8 Stunden am TagKeine Samstagsarbeit (standortabhngig)Zukunftssicherer ArbeitsplatzSehr gute ArbeitsatmosphreInterne WeiterbildungsangeboteWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Ihr HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechaniker-kfz-mechatroniker-grossbeeren-182060","tags":["Engineering"],"job_types":[],"location":"Grossbeeren","created_at":1702810143000},{"slug":"kfz mechaniker kfz mechatroniker langenau ","company_name":"HoPa Talents","title":"KFZ-Mechaniker \/ KFZ-Mechatroniker (m\/w\/d)","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenWartung, Instandsetzung und Reparatur herstellerunabhngiger Nutzfahrzeuge sowie deren Aufbauten inkl. Schwei- und RichtarbeitenFehlerdiagnose mit modernen Diagnosegerten an verschiedenen mechanischen, elektronischen, hydraulischen und pneumatischen SystemenMontage von Fahrzeugteilen und bliche Ttigkeiten in der WerkstattQualifikationAusbildung zum KFZ-Mechaniker, -Mechatroniker, -Schlosser oder Metallbauer (vorzugsweise mit Schwerpunkt Nutz- und landwirtschaftliche Fahrzeuge) oder eine vergleichbare Qualifikation mit Berufserfahrung  Quereinsteiger sind willkommenErste Erfahrung mit Nutzfahrzeugen (LKW, Trucks, Trailer) wnschenswertHandwerkliches Geschick und technisches GrundverstndnisEine ordentliche Portion gesunder Humor :)BenefitsUnbefristeter Arbeitsvertrag nach der ProbezeitVerdienst: Attraktives Gehaltspaket30 Tage Urlaub im JahrBezuschusste betriebliche AltersvorsorgeEmpfehlungsprmie von bis zu 3.000 EuroGeregelte Arbeitszeiten je 8 Stunden am TagKeine Samstagsarbeit (standortabhngig)Zukunftssicherer ArbeitsplatzSehr gute ArbeitsatmosphreInterne WeiterbildungsangeboteWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Ihr HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechaniker-kfz-mechatroniker-langenau-186492","tags":["Engineering"],"job_types":[],"location":"Langenau","created_at":1702810143000},{"slug":"kfz mechaniker kfz mechatroniker landsberg ","company_name":"HoPa Talents","title":"KFZ-Mechaniker \/ KFZ-Mechatroniker (m\/w\/d)","description":"Das Hamburger Unternehmen HoPa Talents GmbH\" ist mit seinem Team der Experte fr eine erstklassige Personalvermittlung von Fach- und Fhrungskrften.Durch seine cleveren Strategien eines genialen Masterplans sowie eines exklusiven Coaching-Konzeptes garantiert er, fr jede:n Arbeitnehmer:in und Arbeitgeber:in das Maximum herauszuholen.HoPa Talents verbindet Unternehmen und Talente und bietet innovative Lsungen, die optimal und individuell auf die jeweiligen Anforderungen angepasst sind.AufgabenWartung, Instandsetzung und Reparatur herstellerunabhngiger Nutzfahrzeuge sowie deren Aufbauten inkl. Schwei- und RichtarbeitenFehlerdiagnose mit modernen Diagnosegerten an verschiedenen mechanischen, elektronischen, hydraulischen und pneumatischen SystemenMontage von Fahrzeugteilen und bliche Ttigkeiten in der WerkstattQualifikationAusbildung zum KFZ-Mechaniker, -Mechatroniker, -Schlosser oder Metallbauer (vorzugsweise mit Schwerpunkt Nutz- und landwirtschaftliche Fahrzeuge) oder eine vergleichbare Qualifikation mit Berufserfahrung  Quereinsteiger sind willkommenErste Erfahrung mit Nutzfahrzeugen (LKW, Trucks, Trailer) wnschenswertHandwerkliches Geschick und technisches GrundverstndnisEine ordentliche Portion gesunder Humor :)BenefitsUnbefristeter Arbeitsvertrag nach der ProbezeitVerdienst: Attraktives Gehaltspaket30 Tage Urlaub im JahrBezuschusste betriebliche AltersvorsorgeEmpfehlungsprmie von bis zu 3.000 EuroGeregelte Arbeitszeiten je 8 Stunden am Tag Keine Samstagsarbeit (standortabhngig)Zukunftssicherer ArbeitsplatzSehr gute ArbeitsatmosphreInterne WeiterbildungsangeboteWir bringen die Besten zu den Besten! - Bewerben Sie sich jetzt.Bei Fragen steht Ihnen Herr Michel Deistler unter der Telefonnummer: 01575 242 91 09 gerne zur Verfgung.Wir freuen uns auf Sie und Ihre Bewerbung.Ihr HoPa Talents TeamFind Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/hopa-talents\/kfz-mechaniker-kfz-mechatroniker-landsberg-336730","tags":["Engineering"],"job_types":[],"location":"Landsberg","created_at":1702810143000},{"slug":"event manager in vollzeit teilzeit homeoffice kiel ","company_name":"buchner consulting gmbh","title":"Event-Manager\/in (m\/w\/d) Vollzeit \/ Teilzeit - Homeoffice","description":"Gemeinsam schaffst Du mit Deinem Team die Grundlagen fr ein Fortbildungsangebot, um persnliche und berufliche Weiterentwicklung fr erfolgreiche Therapeuten zu garantieren. Das Praxis Know-How gebt ihr gemeinsam auf Online sowie Live-Veranstaltungen (Messen\/Kongressen) weiter.   Neugierig?Dann lies jetzt unbedingt weiter, denn wir suchen Dich als Event-Manger\/in (m\/w\/d) mit zeitnaher Fhrungsverantwortung im Event-Team zum nchstmglichen Zeitpunkt in Vollzeit oder Teilzeit ab 30 Std. in Kiel!AufgabenOption auf zeitnahe Teamfhrung als Teamleiter:in nach EinarbeitungPlanung von Veranstaltungsterminen  Kundenkommunikation  Budgetplanung & -monitoringKoordination der ProgrammentwicklungAnlegen der Veranstaltungen in den einzelnen SystemenVeranstaltungsbetreuungRekrutierung und Betreuung der Referent, Dozenten und BeraterEnge Kommunikation und Abstimmung mit anderen TeamsVerhandlung externer Dienstleistungen (Hotel, Spedition, Online-Anbieter etc.)QualifikationIdealerweise hast Du bereits Erfahrung sammeln knnen im Veranstaltungsbereich, gerne auch aus der HotellerieDu verfgst ber eine Sicherheit in der Koordination von Veranstaltungsablufen Kleine Reisebereitschaft fr Prsenzveranstaltungen, Konferenzen und Messen Eigenstndige und lsungsorientierte ArbeitsweiseTechnisches GrundverstndnisBenefitsHier die ersten Highlights bei uns: flexible Arbeitszeiten & Homeoffice im Wechselein cooles Office mit ausreichend Parkmglichkeiten direkt an der Kieler Frdebetriebliche Krankenzusatzversicherung & betriebliche AltersvorsorgeNutzung von Personal Training (arbeitgeberfinanziert)Hunde sind im Bro herzlich willkommen30 Tage Urlaub im JahrIndividuelles Firmenrad zum LeasingNsse, Obst und Getrnke stehen uns allen zur VerfgungZustzlich mtl. 150 netto Inflationsausgleich bis Dezember 2024Und vieles mehr!WARUM BUCHNER?Du arbeitest in einem groartigen Team, das Dich jederzeit untersttzt. Wir leben Werte und kmmern uns umeinander. Du bekommst einen krisensicheren Arbeitsplatz und ein modernes Arbeitsumfeld. Gerne feiern wir gemeinsam unsere Erfolge, und natrlich gibts bei uns diverse Benefits, z. B. betriebliche Altersvorsorge und Gesundheitsfrderung. Und um richtig anzugeben: Wir haben echt die schnsten Rume in ganz Kiel direkt an der Frde mit dem wunderbarsten Ausblick! Bewirb Dich jetzt bei uns und werden ein Teil des Teams!Fragen?Stelle Deine Fragen an das Mitarbeitermanagement-Team unter 0431 \/ 72000-470.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/buchner-consulting-gmbh\/event-manager-in-vollzeit-teilzeit-homeoffice-kiel-68033","tags":["Management","Team Leader"],"job_types":["berufseinstieg"],"location":"Kiel","created_at":1702810143000},{"slug":"werkstudent business operations berlin ","company_name":"Sirius Music Communications GmbH","title":"Werkstudent Business Operations (f\/m\/x)","description":" Was ist SIRIUSUnsere Mission ist es die #1 Global Music School zu werden und das Lernen eines Instruments fr jeden Menschen weltweit zugnglich zu machen. Wir finden die perfekte Lehrkraft fr jeden Schler weltweit. Unsere einzigartige Technologie, mageschneidert fr 1-on-1 Onlinemusikunterricht, verbindet Lehrer und Schler digital fr hochwertigen Musikunterricht. Was erwartet Dich?Wir sind ein Team aus leidenschaftlichen Musikern, Entrepreneurs und Technologie-Enthusiasten. Unser Ziel ist es, die Art und Weise wie wir Musik lernen & machen neu zu erfinden. Wir sind ein ehrgeizig, kreativ und vielfltig und suchen nach Gleichgesinnten, die uns bei unserer Mission untersttzen, die #1 Global Music School aufzubauen. Startzeitpunkt: sofort!AufgabenManagement des Onboardingprozesses, Identifizierung von Verbesserungsmglichkeiten und deren UmsetzungSetup eines Forecast-Modells zur KapazittsplanungOnboarden neuer Musiklehrer*innen und Schler*innen auf der SIRIUS PlattformBearbeitung eingehender Bewerbungen und Durchfhren von KennenlerngesprchenManagement der Musiklehrer*innen Community, Untersttzung bei eingehenden Kundenanfragen via E-Mail, Telefon, WhatsApp von MusiklehrernQualifikationDu bist derzeit an einer Universitt eingeschriebenDu verfgst ber ausgeprgte organisatorische Fhigkeiten und bist in der Lage, angemessen und effektiv Prioritten zu setzenDu hast ein analytisches Vorgehen und hast Spa Strukturen & Prozesse aufzusetzen und den Bereich eigenverantwortlich weiterzuentwickelnDu bist kommunikationsfreudig und flieend in Deutsch in Wort und SchriftDu hast Interesse fr Musik und begeisterst Dich fr das ThemaDu bist auf der Suche nach einem dynamischen Umfeld und einer herausfordernden TtigkeitDu hast Kapazitt mindestens 15 Stunden pro WocheBenefitsViel Verantwortung zu bernehmen und den Weg eines Early-Stage-Startups mitzugestaltenEine spannende Startup-Atmosphre mit hochmotivierten Kollege*innen und einem traumhaften Bro Mitten in KreuzbergHybride Arbeitskultur und die Mglichkeit remote zu arbeitenUmfangreiche WeiterbildungsmglichkeitenRegelmige Teamevents und Konzertbesuche (z.B. Berliner Philharmoniker) sowie kostenlose Getrnke, Snacks und Frhstck unter der WocheWenn Du Lust hast mit uns die #1 Global Music School zu bauen, dann lass uns reden! Wir freuen uns auf Deine Bewerbung. Die Stelle passt nicht genau, aber Du willst gerne mit uns zusammenarbeiten? Dann melde Dich einfach bei uns und wir schauen, was wir fr Dich tun knnen. Es ist schwer gute Leute zu finden und wir freuen uns daher ber jede Bewerbung.Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/sirius-music-communications-gmbh\/werkstudent-business-operations-berlin-242623","tags":["Business Operations"],"job_types":["Working student","hilfstätigkeit \/ student"],"location":"Berlin","created_at":1702810143000},{"slug":"customer service high end kitchen utensils berlin ","company_name":"Workstation Customer Care","title":"Customer Service High End Kitchen Utensils (m\/f\/d)","description":"Our customer sells branded everyday products (such as juicers, coffee machines or contact grills) as well as the matching accessories: e.g. Glasses, carafes or flavors. The latest trends can be found here first. Our customer is characterized by an excellent delivery service. To support the extensive and demanding customer base, we are looking for you (m\/f\/d) to enlarge the existing customer support team.Your job in this customer service role:Purchase order managementAdvise customers on costs, alternatives and discountsAssistance in the operation of the devices, if something should not workHelp with the operation of the online shopCustomer master data maintenance (e.g., address, bank details)active approach of promotions and special pricesFor this customer support job you bring along:routine in dealing with customer inquiriesService and goal-oriented actionideally multitasking capable, but at least stress resistantteam player, self-motivating and responsibletemporal flexibilityfluent in DanishWir freuen uns Sie kennenzulernen!  Find more English Speaking Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/customer-service-high-end-kitchen-utensils-berlin-365228","tags":["Customer Service"],"job_types":[],"location":"Berlin","created_at":1702799343000},{"slug":"buchhaltungsservice tlw von zu hause berlin ","company_name":"Workstation Customer Care","title":"Buchhaltungsservice tlw. von zu Hause - m\/w\/d","description":"Unser Auftraggeber ist ein europaweit ttiger Finanzdienstleister, der die Rechnungserstellung und Zahlungsverbuchung fr vielfltige Unternehmen aus verschiedenen Branchen bernimmt. Fr die Betreuung dieser Kunden in der Nutzung der angebotenen Software suchen wir tatkrftige Untersttzung (m\/w\/d) - sowohl in der Datenerfassung und -auswertung als auch in der Betreuung der Nutzer.Typische Aufgaben, die Sie bernehmen:Erstellung von Listen, z.B. offene PostenSetzen von MahnsperrenErzeugen von Kulanzgutschriften \/ RcklastschriftsbearbeitungKontenfhrung, Zuordnung zum KontenplanZahlungszuordnung und AusbuchungenHierzu bringen Sie mit:kaufmnnisches VerstndnisErfahrung im Umgang mit modernen Anwendungssystemenprofessionelles ArbeitenBereitschaft, Wissen zu teilen und kontinuierlich zu lernenOffenheit fr sich ndernde RahmenbedingungenSelbstndige Arbeitsweise mit minimaler BrokratieWir freuen uns Sie kennenzulernen!  Find Jobs in Germany on Arbeitnow","remote":false,"url":"https:\/\/www.arbeitnow.com\/jobs\/companies\/workstation-customer-care\/buchhaltungsservice-tlw-von-zu-hause-berlin-109647","tags":["Finance"],"job_types":[],"location":"Berlin","created_at":1702799343000}]